{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:3:5:22",
        "titles": {
          "ar": "باب أَدَبِ الْمُصَدِّقِ",
          "en": "Chapter 22 – Discipline of the charity (Zakāt) collector"
        }
      }
    ],
    "index": 792,
    "local_index": 22,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:3:5:23",
        "titles": {
          "ar": "باب زَكَاةِ مَالِ الْيَتِيمِ",
          "en": "Chapter 23 – Zakāt on the wealth of the orphans"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:3:5:21",
        "titles": {
          "ar": "باب صَدَقَةِ الْغَنَمِ",
          "en": "Chapter 21 – Charity (Zakāt) of the sheep"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:22",
    "titles": {
      "ar": "باب أَدَبِ الْمُصَدِّقِ",
      "en": "Chapter 22 – Discipline of the charity (Zakāt) collector"
    },
    "verse_count": 8,
    "verse_start_index": 5831,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/73)"
        ],
        "index": 5832,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ بُرَيْدِ بْنِ مُعَاوِيَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ بَعَثَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) مُصَدِّقاً مِنَ الْكُوفَةِ إِلَى بَادِيَتِهَا فَقَالَ لَهُ يَا عَبْدَ اللَّهِ انْطَلِقْ وَ عَلَيْكَ بِتَقْوَى اللَّهِ وَحْدَهُ لَا شَرِيكَ لَهُ وَ لَا تُؤْثِرَنَّ دُنْيَاكَ عَلَى آخِرَتِكَ وَ كُنْ حَافِظاً لِمَا ائْتَمَنْتُكَ عَلَيْهِ رَاعِياً لِحَقِّ اللَّهِ فِيهِ حَتَّى تَأْتِيَ نَادِيَ بَنِي فُلَانٍ",
          "فَإِذَا قَدِمْتَ فَانْزِلْ بِمَائِهِمْ مِنْ غَيْرِ أَنْ تُخَالِطَ أَبْيَاتَهُمْ ثُمَّ امْضِ إِلَيْهِمْ بِسَكِينَةٍ وَ وَقَارٍ حَتَّى تَقُومَ بَيْنَهُمْ وَ تُسَلِّمَ عَلَيْهِمْ ثُمَّ قُلْ لَهُمْ يَا عِبَادَ اللَّهِ أَرْسَلَنِي إِلَيْكُمْ وَلِيُّ اللَّهِ لآِخُذَ مِنْكُمْ حَقَّ اللَّهِ فِي أَمْوَالِكُمْ فَهَلْ لِلَّهِ فِي أَمْوَالِكُمْ مِنْ حَقٍّ فَتُؤَدُّونَ إِلَى وَلِيِّهِ",
          "فَإِنْ قَالَ لَكَ قَائِلٌ لَا فَلَا تُرَاجِعْهُ وَ إِنْ أَنْعَمَ لَكَ مِنْهُمْ مُنْعِمٌ فَانْطَلِقْ مَعَهُ مِنْ غَيْرِ أَنْ تُخِيفَهُ أَوْ تَعِدَهُ إِلَّا خَيْراً فَإِذَا أَتَيْتَ مَالَهُ فَلَا تَدْخُلْهُ إِلَّا بِإِذْنِهِ فَإِنَّ أَكْثَرَهُ لَهُ فَقُلْ يَا عَبْدَ اللَّهِ أَ تَأْذَنُ لِي فِي دُخُولِ مَالِكَ فَإِنْ أَذِنَ لَكَ فَلَا تَدْخُلْهُ دُخُولَ مُتَسَلِّطٍ عَلَيْهِ فِيهِ وَ لَا عُنْفٍ بِهِ",
          "فَاصْدَعِ الْمَالَ صَدْعَيْنِ ثُمَّ خَيِّرْهُ أَيَّ الصَّدْعَيْنِ شَاءَ فَأَيَّهُمَا اخْتَارَ فَلَا تَعْرِضْ لَهُ ثُمَّ اصْدَعِ الْبَاقِيَ صَدْعَيْنِ ثُمَّ خَيِّرْهُ فَأَيَّهُمَا اخْتَارَ فَلَا تَعْرِضْ لَهُ وَ لَا تَزَالُ كَذَلِكَ حَتَّى يَبْقَى مَا فِيهِ وَفَاءٌ لِحَقِّ اللَّهِ تَبَارَكَ وَ تَعَالَى مِنْ مَالِهِ فَإِذَا بَقِيَ ذَلِكَ فَاقْبِضْ حَقَّ اللَّهِ مِنْهُ وَ إِنِ اسْتَقَالَكَ فَأَقِلْهُ",
          "ثُمَّ اخْلِطْهَا وَ اصْنَعْ مِثْلَ الَّذِي صَنَعْتَ أَوَّلًا حَتَّى تَأْخُذَ حَقَّ اللَّهِ فِي مَالِهِ فَإِذَا قَبَضْتَهُ فَلَا تُوَكِّلْ بِهِ إِلَّا نَاصِحاً شَفِيقاً أَمِيناً حَفِيظاً غَيْرَ مُعْنِفٍ لِشَيْ‏ءٍ مِنْهَا ثُمَّ احْدُرْ كُلَّ مَا اجْتَمَعَ عِنْدَكَ مِنْ كُلِّ نَادٍ إِلَيْنَا نُصَيِّرْهُ حَيْثُ أَمَرَ اللَّهُ عَزَّ وَ جَلَّ",
          "فَإِذَا انْحَدَرَ بِهَا رَسُولُكَ فَأَوْعِزْ إِلَيْهِ أَنْ لَا يَحُولَ بَيْنَ نَاقَةٍ وَ بَيْنَ فَصِيلِهَا وَ لَا يُفَرِّقَ بَيْنَهُمَا وَ لَا يَمْصُرَنَّ لَبَنَهَا فَيُضِرَّ ذَلِكَ بِفَصِيلِهَا وَ لَا يَجْهَدَ بِهَا رُكُوباً وَ لْيَعْدِلْ بَيْنَهُنَّ فِي ذَلِكَ وَ لْيُورِدْهُنَّ كُلَّ مَاءٍ يَمُرُّ بِهِ وَ لَا يَعْدِلْ بِهِنَّ عَنْ نَبْتِ الْأَرْضِ إِلَى جَوَادِّ الطَّرِيقِ فِي السَّاعَةِ الَّتِي فِيهَا تُرِيحُ وَ تَغْبُقُ وَ لْيَرْفُقْ بِهِنَّ جُهْدَهُ حَتَّى يَأْتِيَنَا بِإِذْنِ اللَّهِ سِحَاحاً سِمَاناً غَيْرَ مُتْعَبَاتٍ وَ لَا مُجْهَدَاتٍ",
          "فَيُقْسَمْنَ بِإِذْنِ اللَّهِ عَلَى كِتَابِ اللَّهِ وَ سُنَّةِ نَبِيِّهِ ( صلى الله عليه وآله ) عَلَى أَوْلِيَاءِ اللَّهِ فَإِنَّ ذَلِكَ أَعْظَمُ لِأَجْرِكَ وَ أَقْرَبُ لِرُشْدِكَ يَنْظُرُ اللَّهُ إِلَيْهَا وَ إِلَيْكَ وَ إِلَى جُهْدِكَ وَ نَصِيحَتِكَ لِمَنْ بَعَثَكَ وَ بُعِثْتَ فِي حَاجَتِهِ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ مَا يَنْظُرُ اللَّهُ إِلَى وَلِيٍّ لَهُ يَجْهَدُ نَفْسَهُ بِالطَّاعَةِ وَ النَّصِيحَةِ لَهُ وَ لِإِمَامِهِ إِلَّا كَانَ مَعَنَا فِي الرَّفِيقِ الْأَعْلَى ",
          "قَالَ ثُمَّ بَكَى أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ قَالَ يَا بُرَيْدُ لَا وَ اللَّهِ مَا بَقِيَتْ لِلَّهِ حُرْمَةٌ إِلَّا انْتُهِكَتْ وَ لَا عُمِلَ بِكِتَابِ اللَّهِ وَ لَا سُنَّةِ نَبِيِّهِ فِي هَذَا الْعَالَمِ وَ لَا أُقِيمَ فِي هَذَا الْخَلْقِ حَدٌّ مُنْذُ قَبَضَ اللَّهُ أَمِيرَ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ وَ سَلَامُهُ عَلَيْهِ وَ لَا عُمِلَ بِشَيْ‏ءٍ مِنَ الْحَقِّ إِلَى يَوْمِ النَّاسِ هَذَا",
          "ثُمَّ قَالَ أَمَا وَ اللَّهِ لَا تَذْهَبُ الْأَيَّامُ وَ اللَّيَالِي حَتَّى يُحْيِيَ اللَّهُ الْمَوْتَى وَ يُمِيتَ الْأَحْيَاءَ وَ يَرُدَّ اللَّهُ الْحَقَّ إِلَى أَهْلِهِ وَ يُقِيمَ دِينَهُ الَّذِي ارْتَضَاهُ لِنَفْسِهِ وَ نَبِيِّهِ فَأَبْشِرُوا ثُمَّ أَبْشِرُوا ثُمَّ أَبْشِرُوا فَوَ اللَّهِ مَا الْحَقُّ إِلَّا فِي أَيْدِيكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Bureyd Bin Muawiya who said, ",
            "‘I heard Abu Abullah<sup>asws</sup> saying: ‘Amir Al-Momineen<sup>asws</sup> sent a <span class=\"iTxt\">Zakāt</span> collector from Al-Kufa to its valleys, and said to him: ‘O servant of Allah<sup>azwj</sup>! Go, and upon you be the fear of Allah<sup>azwj</sup> Alone, there being no associates for Him<sup>azwj</sup>, and do not be preferring your world upon your Hereafter, and be protective to what you are entrusted upon it as a shepherd of the Right of Allah<sup>azwj</sup>, until you come over to the society of the clan of so and so. ",
            "So when you set foot there, descend in their waters and do not mix in with their houses. Then go with tranquility and dignity until you are standing between them, and greet upon them. Then say to them, ‘O servants of Allah<sup>azwj</sup>! A Guardian<sup>asws</sup> of Allah<sup>azwj</sup> has sent me in order to take from you a Right of Allah<sup>azwj</sup> among your wealth. So, is there for Allah<sup>azwj</sup> a Right in your wealth to pay it to His<sup>azwj</sup> Guardian<sup>asws</sup>?’ ",
            "So if a spokesperson were say to you, ‘No’, then do not return him (ask him again); but if one of them says yes to you, so go with him from without having frightened him, or promising him except for goodness. So when you come to his wealth, do not enter it except by his permission, for most of it is for him. Then say, ‘O servant of Allah<sup>azwj</sup>! Do you permit me regarding entering into your wealth?’ So if he was to permit you, do not enter it like the entering of the one dominant upon it, nor be arrogant with it. ",
            "Split the wealth into two parts, then give him the choice whichever of the two parts he so likes. So whichever of the two he chooses, so do not object to him. Then split the remaining part into two parts, then give him the choice, so whichever of the two he chooses, do not object to it. And do not cease doing like that until there remain what can fulfil the Right of Allah<sup>azwj</sup> Blessed and High, from his wealth. So when that remains, take possession of the Right of Allah<sup>azwj</sup> from him, and if he were to ask for a reduction, reduce it. ",
            "Then mix it and do similar to that which you had done firstly until you take the Right of Allah<sup>azwj</sup> in his wealth. So when you take possession of it, do not allocate it except for a good adviser, kind, trustworthy, protective, without arrogance, from anything from it. Then bring over everything what is gathered with you, from every society, to us<sup>asws</sup>, so we<sup>asws</sup> can give it where Allah<sup>azwj</sup> Mighty and Majestic has Commanded for. ",
            "So when your messenger comes with it, advise him that he should neither impede between a she-camel and her young, nor effect a separation between the two, nor overdo her milking for that would be harmful with her young ones, not be excessive in riding her, and be equitable between these regarding that; and let them be watered at every watering place he passes by with them, and not isolate them from the vegetation of the earth to the middle of the road during the timings during which they should be resting and grazing; and let him be kind with them in his effort until he brings them over to us<sup>asws</sup> by the Permission of Allah<sup>azwj</sup>, healthy, fat, without tiredness or being over-worked.",
            "Thus, these would be distributed by the Permission of Allah<sup>azwj</sup> upon the Book of Allah<sup>azwj</sup> and the Sunnah of His<sup>azwj</sup> Prophet<sup>saww</sup> upon the friends of Allah<sup>azwj</sup>. Thus, that would be great for your Recompense and closer for your righteous guidance. Allah<sup>azwj</sup> is Looking at them and at you and to your efforts, and your advice to the one<sup>asws</sup> who sent you and you sent, regarding his<sup>asws</sup> need, for Rasool-Allah<sup>saww</sup> said: ‘Allah<sup>azwj</sup> does not Look at a friend of His<sup>azwj</sup> who strives with his self with the obedience and the correct advice for himself and for his Imam<sup>asws</sup>, except that he would be with us<sup>saww</sup> among the lofty friends’.",
            "He (the narrator) said: ‘Then Abu Abdullah<sup>asws</sup> wept, then said: ‘O Bureyd! No, by Allah<sup>azwj</sup>! There does not remain (today) any sanctity for the Sake of Allah<sup>azwj</sup> except that it is contravened, nor is there a deed being done by the Book of Allah<sup>azwj</sup> or a Sunnah of His<sup>azwj</sup> Prophet<sup>saww</sup> in this world, nor a Limit is being established among these people since the passing away of Amir Al-Momineen<sup>asws</sup>, nor has anything been done from the Truth by these people until this day’.",
            "Then he<sup>asws</sup> said: ‘But, by Allah<sup>azwj</sup>, The days and the night will not go away until Allah<sup>azwj</sup> Revives the dead and Causes the living ones to die, and Allah<sup>azwj</sup> Returns the Truth to its People<sup>asws</sup>, and Establishes His<sup>azw</sup> Religion which He<sup>azwj</sup> is Pleased with for Himself<sup>azwj</sup> and His<sup>azwj</sup> Prophet<sup>saww</sup>. Therefore, receive glad tidings, then receive glad tidings, then receive glad tidings, for by Allah<sup>azwj</sup>, there is no Truth except (what will come) in your hands’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Burayd ibn Mu‘awiyah who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘’Amir al-Mu’minin, ‘Alayhi al-Salam, gave the following disciplinary instructions to a zakat collector. He (the Imam) then sent him to the suburbs of the city of al-Kufah. “O servant of Allah, set out for this task: but you must be pious before Allah who is one and has no partner. You must not give preference to your worldly matters over the matters of the next life. You must be protective of what I have entrusted you with and pay proper attention to the rights of Allah. When you arrive in the community of so and so tribe, disembark at the place, which is the source of their water. Do not mingle among their houses. Thereafter go in a dignified and honorable manner to meet them until you stand among them and say to them the expression of greeting, then say to them, ‘O servants of Allah, the person who possesses Divine Authority has sent me to ask you to pay the rights of Allah which are due on your wealth and I collect them. Is there anything of the rights of Allah due on your wealth that you must pay to the person who possesses Divine Authority?’ If anyone says, ‘No, (there is not anything due on my wealth).’ You must not ask him again. If anyone among them answered you positively, then follow him without frightening him or promising him anything but good. When you reach the location of his wealth, do not enter that place without his permission; he owns most of the wealth. Then say to him, ‘O servant of Allah, do you allow me to enter the location of your wealth?’ If he allows you, then do not enter in a dominant or rough manner. Make two sections of the wealth, then allow him to choose one section and do not interfere with the section that he chooses. Thereafter make the remaining section into two sections and again allow him to choose whichever section he chooses. You must not interfere with his choice. Continue this process until you arrive at the remaining section that is the portion of zakat, the right of Allah, the most Holy, the most High. Take possession of the portion that is the right of Allah in his wealth. If he asks you to cancel the process, you should do so. Mix and start the process all over again until you can take possession of the right of Allah from his wealth. When you take possession, then do not mishandle it. You must remain helpful, kind, trustworthy and protective of the property you have received. You must not handle anything thereof roughly. Thereafter, dispatch promptly your collection of every community to us and we will handle it according to the commandments of Allah, the Most Majestic, the Most Glorious. If you dispatch it through a messenger, advise him not to block or separate a camel from her young, and do not over-milk the camel to harm her young. He must not tire the camel by riding excessively. He must follow rules of justice toward them. He must allow them to drink from every source of water on the way. In the hours, which are for their grazing and rest, he must not drive them on the plain road. He must be kind and caring to them so they can reach us, by the permission of Allah in good health and condition, not tired or overworked. We then, by the permission of Allah, distribute them according to the book of Allah and the Sunnah of the Messenger of Allah among the friends of Allah. Following these instructions will allow you to have greater reward and it is closer to the dictate of your reason. Allah looks upon you and these properties, and upon your hard work, good advice to your commander who has commissioned you for the task. The Messenger of Allah has said, ‘Whoever, for the sake of Allah, pays attention to his guardian, works hard obediently and gives good advice to him (guardian) and to his Imam, in the company of the high position, he will join our company.”” He (narrator) has said, ‘Abu ‘Abd Allah, ‘Alayhi al-Salam, wept and said, “O Burayd, by Allah, all respectable matters of Allah have already been disregarded. The book of Allah and the Sunnah of the Messenger of Allah are not followed in this world any more. Nothing of the laws of justice is maintained in this world after the passing away of Amir al-Mu’minin, ‘Alayhi al- Salam. Nothing of the laws of truth has ever since been followed.” He then said, “I swear by Allah, days and night will not end until Allah will give life to the dead, cause the living to die, return the truth to the people of truth, and establish His religion which He has chosen for Himself and for His prophet. It is glad news for you. It indeed is glad news for you. Without any doubt, it is glad news for you. I swear by Allah, Truth does not exist anywhere in any place except in your hands.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/73)"
        ],
        "index": 5833,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:2",
        "text": [
          "حَمَّادُ بْنُ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ أَ يَجْمَعُ النَّاسَ الْمُصَدِّقُ أَمْ يَأْتِيهِمْ عَلَى مَنَاهِلِهِمْ قَالَ لَا بَلْ يَأْتِيهِمْ عَلَى مَنَاهِلِهِمْ فَيُصَدِّقُهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked, ‘Should the <span class=\"iTxt\">Zakāt</span> collector gather the people or should he go to them to their watering places?’ He<sup>asws</sup> said: ‘No, but he should go to them to their watering places, so he would collect their charity (<span class=\"iTxt\">Zakāt</span>)’."
          ],
          "en.sarwar": [
            "2. Hammad ibn ‘Isa has narrated from Hariz from Muhammad ibn Muslim who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, was asked, ‘Does Zakat collector call people in one place or he comes to where people are? He (the Imam) said, ‘No, he comes to their places and collects their charity (Zakat).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/73)"
        ],
        "index": 5834,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ جَعْفَرٍ عَنْ أَبِيهِ عَنْ عَلِيٍّ ( عليه السلام ) أَنَّهُ قَالَ لَا تُبَاعُ الصَّدَقَةُ حَتَّى تُعْقَلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup>, from Ali<sup>asws</sup> having said: ‘The charity (<span class=\"iTxt\">Zakāt</span>) would not be sold until it is decided upon (for distribution)’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya from Ghiyath ibn Ibrahim who has said the following: “Ja‘far (abu ‘Abd Allah), ‘Alayhi al-Salam, has narrated from his father from Ali, ‘Alayhi al-Salam, who has said, ‘Charity (Zakat) is not sold before it is received (collected).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/74)"
        ],
        "index": 5835,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ عَنْ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) قَالَ كَانَ عَلِيٌّ ( صلوات الله عليه ) إِذَا بَعَثَ مُصَدِّقَهُ قَالَ لَهُ إِذَا أَتَيْتَ عَلَى رَبِّ الْمَالِ فَقُلْ لَهُ تَصَدَّقْ رَحِمَكَ اللَّهُ مِمَّا أَعْطَاكَ اللَّهُ فَإِنْ وَلَّى عَنْكَ فَلَا تُرَاجِعْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companiond, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Yahya, from Giyas Bin Ibrahim, ",
            "(It has been narrated) from Ja’far<sup>asws</sup>, from his<sup>asws</sup> father<sup>asws</sup> having said: ‘It was so that whenever Ali<sup>asws</sup> sent a <span class=\"iTxt\">Zakāt</span> collector, he<sup>asws</sup> said to him: ‘When you go over to a lord of the wealth, so say to him, ‘Give charity (<span class=\"iTxt\">Zakāt</span>), may Allah<sup>azwj</sup> have Mercy on you, from what Allah<sup>azwj</sup> has Given to you’. But, if he turn around from you (refuses), so do not return (ask again)’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Yahya from Ghiyath ibn Ibrahim who has said the following: “Ja‘far, (abu ‘Abd Allah), ‘Alayhi al-Salam, has narrated from his father who has that when Ali, ‘Alayhi al-Salam, would send a Zakat collector for his task and say to him, ‘When you go to Zakat payer, say to him, “Give charity, may Allah grant you blessings, out of what Allah has granted you.” If he turns away from you, then you must not go to him again.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/74)"
        ],
        "index": 5836,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ مُحَمَّدِ بْنِ خَالِدٍ أَنَّهُ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الصَّدَقَةِ فَقَالَ إِنَّ ذَلِكَ لَا يُقْبَلُ مِنْكَ فَقَالَ إِنِّي أُحَمِّلُ ذَلِكَ فِي مَالِي فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مُرْ مُصَدِّقَكَ أَنْ لَا يَحْشُرَ مِنْ مَاءٍ إِلَى مَاءٍ وَ لَا يَجْمَعَ بَيْنَ الْمُتَفَرِّقِ وَ لَا يُفَرِّقَ بَيْنَ الْمُجْتَمِعِ وَ إِذَا دَخَلَ الْمَالَ فَلْيَقْسِمِ الْغَنَمَ نِصْفَيْنِ ثُمَّ يُخَيِّرُ صَاحِبَهَا أَيَّ الْقِسْمَيْنِ شَاءَ فَإِذَا اخْتَارَ فَلْيَدْفَعْهُ إِلَيْهِ ",
          "فَإِنْ تَتَبَّعَتْ نَفْسُ صَاحِبِ الْغَنَمِ مِنَ النِّصْفِ الْآخَرِ مِنْهَا شَاةً أَوْ شَاتَيْنِ أَوْ ثَلَاثاً فَلْيَدْفَعْهَا إِلَيْهِ ثُمَّ لْيَأْخُذْ صَدَقَتَهُ فَإِذَا أَخْرَجَهَا فَلْيَقْسِمْهَا فِيمَنْ يُرِيدُ فَإِذَا قَامَتْ عَلَى ثَمَنٍ فَإِنْ أَرَادَهَا صَاحِبُهَا فَهُوَ أَحَقُّ بِهَا وَ إِنْ لَمْ يُرِدْهَا فَلْيَبِعْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Hajjaj, ",
            "(It has been narrated) from Muhammad Bin Khalid having asked Abu Abdullah<sup>asws</sup> about the charity (<span class=\"iTxt\">Zakāt</span>), so he<sup>asws</sup> said: ‘That is not acceptable from you’. So he said, ‘I do carry that in my wealth’. So Abu Abdullah<sup>asws</sup> said to him: ‘Instruct a <span class=\"iTxt\">Zakāt</span> collector that he should not assemble from water to the water (watering place), nor gather between the separate ones, nor separate between the gathered ones. And whenever he enters the wealth, so let him divide the sheep into two halves (groups), then its owner should choose which of the two groups he so likes to. So when he has chosen, so let him hand over (that group) to him. ",
            "But if the owner of the sheep would prefer to have a sheep, or two sheep, or three from the other half, so let him hand these over to him. Then let him take its charity (<span class=\"iTxt\">Zakāt</span>). So when he extracts it, so let him divide it among the one he (the owner) intends to. So when it is evaluated upon a price, and if its owner wants it (the price), so he is more rightful with it, and if he does not want it, so let him (<span class=\"iTxt\">Zakāt</span> collector) sell it’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj from Muhammad ibn Khalid who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about charity (Zakat). He (the Imam) said, ‘It is not accepted from you.’ He (the narrator) then said, ‘I take it from my own assets.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said to him, ‘Instruct your Zakat collector not to move from house to house, bring together what is apart and separate what is together. When he approaches people’s assets he should make the sheep stand in two groups, then allow the owner to choose one of the two groups and allow him to have what he chooses. If the owner desires to have one, two or three sheep from the other group, allow him to have it. Thereafter receive his charity (Zakat). When charity (Zakat) is received, distribute it among those whom he (the owner of assets) wants. If something in exchange for the items received as Zakat is offered, then Zakat payer has the priority over others to have it, but if he does not want, it then can be sold (to others).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/74)"
        ],
        "index": 5837,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنْ أَخِيهِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَمَّنْ يَلِي صَدَقَةَ الْعُشْرِ عَلَى مَنْ لَا بَأْسَ بِهِ فَقَالَ إِنْ كَانَ ثِقَةً فَمُرْهُ يَضَعُهَا فِي مَوَاضِعِهَا وَ إِنْ لَمْ يَكُنْ ثِقَةً فَخُذْهَا مِنْهُ وَ ضَعْهَا فِي مَوَاضِعِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Ali Bin Yaqteen, from his brother Al Husayn, from Ali Bin Yaqteen who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the one who gives out the charity (<span class=\"iTxt\">Zakāt</span>) of the tenth (10%) upon the one there is no problem with. So he<sup>asws</sup> said: ‘If he was reliable, so instruct him to place it in its (appropriate) place, and if he does not happen to be reliable, so seize it from him and place in its (appropriate) place’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali ibn Yaqtin from his brother Al-Husayn from Ali ibn Yaqtin who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about Zakat which is of the rate of one out of ten and one who distributes it among those who are not harmful. He (the Imam) said, ‘If he is trustworthy, instruct him to deliver it where it should be delivered; but if you cannot trust him, then take it from him and deliver where it should be delivered.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/74)"
        ],
        "index": 5838,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مُحَمَّدِ بْنِ مُقَرِّنِ بْنِ عَبْدِ اللَّهِ بْنِ زَمْعَةَ بْنِ سُبَيْعٍ عَنْ أَبِيهِ عَنْ جَدِّهِ عَنْ جَدِّ أَبِيهِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( صلوات الله عليه ) كَتَبَ لَهُ فِي كِتَابِهِ الَّذِي كَتَبَ لَهُ بِخَطِّهِ حِينَ بَعَثَهُ عَلَى الصَّدَقَاتِ مَنْ بَلَغَتْ عِنْدَهُ مِنَ الْإِبِلِ صَدَقَةُ الْجَذَعَةِ وَ لَيْسَتْ عِنْدَهُ جَذَعَةٌ وَ عِنْدَهُ حِقَّةٌ فَإِنَّهُ تُقْبَلُ مِنْهُ الْحِقَّةُ وَ يَجْعَلُ مَعَهَا شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَماً ",
          "وَ مَنْ بَلَغَتْ عِنْدَهُ صَدَقَةُ الْحِقَّةِ وَ لَيْسَتْ عِنْدَهُ حِقَّةٌ وَ عِنْدَهُ جَذَعَةٌ فَإِنَّهُ تُقْبَلُ مِنْهُ الْجَذَعَةُ وَ يُعْطِيهِ الْمُصَدِّقُ شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَماً",
          "وَ مَنْ بَلَغَتْ صَدَقَتُهُ حِقَّةً وَ لَيْسَتْ عِنْدَهُ حِقَّةٌ وَ عِنْدَهُ ابْنَةُ لَبُونٍ فَإِنَّهُ يُقْبَلُ مِنْهُ ابْنَةُ لَبُونٍ وَ يُعْطِي مَعَهَا شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَماً",
          "وَ مَنْ بَلَغَتْ صَدَقَتُهُ ابْنَةَ لَبُونٍ وَ لَيْسَتْ عِنْدَهُ ابْنَةُ لَبُونٍ وَ عِنْدَهُ حِقَّةٌ فَإِنَّهُ تُقْبَلُ مِنْهُ الْحِقَّةُ وَ يُعْطِيهِ الْمُصَدِّقُ شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَماً وَ مَنْ بَلَغَتْ صَدَقَتُهُ ابْنَةَ لَبُونٍ وَ لَيْسَتْ عِنْدَهُ ابْنَةُ لَبُونٍ وَ عِنْدَهُ ابْنَةُ مَخَاضٍ فَإِنَّهُ تُقْبَلُ مِنْهُ ابْنَةُ مَخَاضٍ وَ يُعْطِي مَعَهَا شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَماً",
          "وَ مَنْ بَلَغَتْ صَدَقَتُهُ ابْنَةَ مَخَاضٍ وَ لَيْسَتْ عِنْدَهُ ابْنَةُ مَخَاضٍ وَ عِنْدَهُ ابْنَةُ لَبُونٍ فَإِنَّهُ تُقْبَلُ مِنْهُ ابْنَةُ لَبُونٍ وَ يُعْطِيهِ الْمُصَدِّقُ شَاتَيْنِ أَوْ عِشْرِينَ دِرْهَماً ",
          "وَ مَنْ لَمْ يَكُنْ عِنْدَهُ ابْنَةُ مَخَاضٍ عَلَى وَجْهِهَا وَ عِنْدَهُ ابْنُ لَبُونٍ ذَكَرٌ فَإِنَّهُ تُقْبَلُ مِنْهُ ابْنُ لَبُونٍ وَ لَيْسَ مَعَهُ شَيْ‏ءٌ ",
          "وَ مَنْ لَمْ يَكُنْ مَعَهُ شَيْ‏ءٌ إِلَّا أَرْبَعَةٌ مِنَ الْإِبِلِ وَ لَيْسَ لَهُ مَالٌ غَيْرُهَا فَلَيْسَ فِيهَا شَيْ‏ءٌ إِلَّا أَنْ يَشَاءَ رَبُّهَا فَإِذَا بَلَغَ مَالُهُ خَمْساً مِنَ الْإِبِلِ فَفِيهَا شَاةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Muhammad Bin Isa, from Yunus, from Muhammad Bin Muqarrin Bin Abdullah Bin Zama’a Bin Subay, from his father, from his grandfather, from the grandfather of his father that, ",
            "‘Amir Al-Momineen<sup>asws</sup> wrote to him in a letter of his<sup>asws</sup> which he<sup>asws</sup> wrote to him in his<sup>asws</sup> own handwriting, when he<sup>asws</sup> sent him (as a collector) upon the charities (<span class=\"iTxt\">Zakāt</span>): ‘The one in whose possession of the camels, the charity (<span class=\"iTxt\">Zakāt</span>) reaches the one four year old female camel, and there is no four year old female camel in his possession, and in his possession is a three year old female camel, so the three year old female camel would be accepted from him, and two sheep would be made to be along with it, or twenty Dirhams.",
            "The one with whom the charity (<span class=\"iTxt\">Zakāt</span>) reaches the three year old female camel, and there is no three year old female camel with him, and with him is a four year old female camel, so the four year old female camel would be accepted from him, and the <span class=\"iTxt\">Zakāt</span> collector would give him two sheep or twenty Dirhams. ",
            "And the one whose charity (<span class=\"iTxt\">Zakāt</span>) reaches a three year old female camel, and in his possession is a two year old female milking camel, so the two year old milking female camel would be accepted from him, and he would give along with it, two sheep or twenty Dirhams. And the one whose charity (<span class=\"iTxt\">Zakāt</span>) reaches a two year old female milking camel, and there is no two year old female milking camel with him, and with him is a three year old female camel, so the three year old female camel would be accepted from, and the <span class=\"iTxt\">Zakāt</span> collector would give him two sheep or twenty Dirhams.",
            "And the one whose charity (<span class=\"iTxt\">Zakāt</span>) reaches a two year old female milking camel, and there is no two year old female milking camel with him, and there is a three year old female camel with him, so the three year old camel would be accepted from him, and the <span class=\"iTxt\">Zakāt</span> collector would give him two sheep or twenty Dirhams. And the one whose charity reaches a two year old female milking camel, and there is no two year old female milking camel with him, and with him is a one year old female camel, so the one year old female camel would be accepted from him, and he would give two sheep or twenty Dirhams along with it.",
            "The one whose charity (<span class=\"iTxt\">Zakāt</span>) reaches a one year old female camel, and there is no one year old female camel with him, and with him is a two year old female milking camel, so the two year old female milking camel would be accepted from him, and the <span class=\"iTxt\">Zakāt</span> collector would give him two sheep or twenty Dirhams. ",
            "And the one who does not happen to have a one year old female camel upon its aspect, and with him is a two year old male camel, so the two year old male camel would be accepted from him, and there is nothing (else to give) along with it. ",
            "And the who does not happen to have anything with him except for four camels, and there is no wealth for him apart from it, so there is nothing regarding it, except if its lord so desires. So when his wealth reaches five from the camels, so there would be a sheep regarding it’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from Muhammad ibn ‘Isa from Yunus from Muhammad ibn Muqarrin ibn ‘Abd Allah ibn Zam‘ah ibn Subay‘ from his father from his grandfather from grandfather of his father who has said the following: “’Amir al-Mu’minin, ‘Alayhi al-Salam, wrote to him in the letter that he wrote to him with his own hand writing when he sent him to receive charity (Zakat). Those who owe Jadha’ah as Zakat for camels but do not have Jadha‘ah but have Hiqqah, it is accepted from them, but they must give two sheep along with it or twenty dirham. Those who owe one Hiqqah as Zakat but do not have it, but have Jadha’ah, it is accepted from them and Zakat collector gives them two sheep or twenty dirham. Those who owe Hiqqah as Zakat but do not have Hiqqah but have Ibnata Labun, it is accepted from them with two sheep or twenty dirham. Those who owe Ibnata Labun as Zakat but do not have it, but they have Hiqqah, it is accepted from them and Zakat collector gives them two sheep or twenty dirham. Those who owe Ibnata Labun as Zakat but do not have it but they have Ibnata Makhad, it is accepted from them along with two sheep or twenty dirham. Those who owe Ibnata Makhad as Zakat but do not have it but they have Ibnata Labun, it is accepted from them and Zakat collector gives them two sheep or twenty dirham. Those who do not have Ibnata Makhad as it is but they have a male Ibnata Labun it is accepted from them without anything extra. Those who do not have anything other than four camels and have no other assets, there is not anything on them unless the owner desires (otherwise). If one’s asset is five camels, then its Zakat is one sheep.’” (Ahadith 2-7 are best explained in the form of fatwa.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/75)"
        ],
        "index": 5839,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:22:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ أَحْمَدَ بْنِ مَعْمَرٍ قَالَ أَخْبَرَنِي أَبُو الْحَسَنِ الْعُرَنِيُّ قَالَ حَدَّثَنِي إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ عَنْ مُهَاجِرٍ عَنْ رَجُلٍ مِنْ ثَقِيفٍ قَالَ اسْتَعْمَلَنِي عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) عَلَى بَانِقْيَا وَ سَوَادٍ مِنْ سَوَادِ الْكُوفَةِ فَقَالَ لِي وَ النَّاسُ حُضُورٌ انْظُرْ خَرَاجَكَ فَجِدَّ فِيهِ وَ لَا تَتْرُكْ مِنْهُ دِرْهَماً فَإِذَا أَرَدْتَ أَنْ تَتَوَجَّهَ إِلَى عَمَلِكَ فَمُرَّ بِي ",
          "قَالَ فَأَتَيْتُهُ فَقَالَ لِي إِنَّ الَّذِي سَمِعْتَ مِنِّي خُدْعَةٌ إِيَّاكَ أَنْ تَضْرِبَ مُسْلِماً أَوْ يَهُودِيّاً أَوْ نَصْرَانِيّاً فِي دِرْهَمِ خَرَاجٍ أَوْ تَبِيعَ دَابَّةَ عَمَلٍ فِي دِرْهَمٍ فَإِنَّمَا أُمِرْنَا أَنْ نَأْخُذَ مِنْهُمُ الْعَفْوَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companins, from Sahl Bin Ziyad, from Ali Bin Asbaat, from Ahmad Bin Ma’mar who said, ‘Abu Al Hassan al Urny informed me saying, ‘Ismail Bin Ibrahim narrated to me, from Muhajir, from a man from Saqeyf who said, ",
            "‘Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> utilised me (as a <span class=\"iTxt\">Zakāt</span> collector) upon Baniqiya, and an outskirt from the outskirts of Al-Kufa, and he<sup>asws</sup> said to me, and the people were present: ‘Look after your taxes (collected), and be careful regarding it, and do not neglect even one Dirham from it. So when you want to divert yourself towards your work, so pass by me<sup>asws</sup>’. ",
            "He (the narrator) said, ‘So I went over to him<sup>asws</sup>, and he<sup>asws</sup> said to me: ‘That which you heard from me<sup>asws</sup> were principles. Beware of striking a Muslim, or a Jew, or a Christian regarding a Dirham of tax, or pursuing a working animal regarding a Dirham. But rather, we<sup>asws</sup> order that we<sup>asws</sup> should observe tolerance for them’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn al-Asbat from Ahmad ibn Mu’ammar who has said that narrated to me abu al-Hassan al-‘Uraniy from Isma’il ibn Ibrahim from Muhajir from a man from Thaqif who has said the following: “Ali ibn abu Talib, ‘Alayhi al-Salam, commissioned me as collector of zakat (charity) for Ban Qiya (al-Qadisiyah today) and suburbs of al-Kufah. In the presence of people he said to me, Take good care of taxes and do not disregard even one dirham.’ However, see me before you leave for your work.’ He (the narrator) has said, ‘I went to see him and he said to me, “Whatever you heard me say to you was for protective measures only. Never ever beat up a Muslim, a Jew, or a Christian taxpayer for a dirham of tax or buy an animal for work for a dirham. We only receive taxes in ease.’”” (The following chapters are best explained by fatwa.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:22",
  "kind": "verse_list"
}