{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:3:5:23",
        "titles": {
          "ar": "باب زَكَاةِ مَالِ الْيَتِيمِ",
          "en": "Chapter 23 – Zakāt on the wealth of the orphans"
        }
      }
    ],
    "index": 793,
    "local_index": 23,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:23",
    "titles": {
      "ar": "باب زَكَاةِ مَالِ الْيَتِيمِ",
      "en": "Chapter 23 – Zakāt on the wealth of the orphans"
    },
    "verse_count": 8,
    "verse_start_index": 5839,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/75)"
        ],
        "index": 5840,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مَالِ الْيَتِيمِ عَلَيْهِ زَكَاةٌ فَقَالَ إِذَا كَانَ مَوْضُوعاً فَلَيْسَ عَلَيْهِ زَكَاةٌ وَ إِذَا عَمِلْتَ بِهِ فَأَنْتَ لَهُ ضَامِنٌ وَ الرِّبْحُ لِلْيَتِيمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the wealth of the orphans, ‘Is there <span class=\"iTxt\">Zakāt</span> upon it?’ So he<sup>asws</sup> said: ‘When it is a deposit, so there is no <span class=\"iTxt\">Zakāt</span> upon it, but when it is worked with, so you would be responsible (guarantor) for it, and the profit would be for the orphan’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from ibn abu ‘Umayr from Hammad ibn ‘Uthman from al-Halabiy who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about the assets of the orphans if there is Zakat on it. He (the Imam) said, ‘If it (asset) is not active (not used in business) Zakat is not due on it. If you use it in business, then you are responsible for it and its profit belongs to the orphan.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/75)"
        ],
        "index": 5841,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:2",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْعُطَارِدِ الْخَيَّاطِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَالُ الْيَتِيمِ يَكُونُ عِنْدِي فَأَتَّجِرُ بِهِ فَقَالَ إِذَا حَرَّكْتَهُ فَعَلَيْكَ زَكَاتُهُ قَالَ قُلْتُ فَإِنِّي أُحَرِّكُهُ ثَمَانِيَةَ أَشْهُرٍ وَ أَدَعُهُ أَرْبَعَةَ أَشْهُرٍ قَالَ عَلَيْكَ زَكَاتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan and Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, altogether fromSafwan Bin Yahya, from Is’haq Bin Ammar, from Abu Al Utarid Al Khayyat who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The wealth of the orphans happens to be in my possession. So, can I trade with it?’ So he<sup>asws</sup> said: ‘You move it and upon you would be its <span class=\"iTxt\">Zakāt</span>’. I said, ‘Supposing if I was to move it for eight months, and leave it for four months?’ He<sup>asws</sup> said: ‘Upon you would be its <span class=\"iTxt\">Zakāt</span>’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan and Ahmad ibn Idris from Muhammad ibn ‘Abd al-Jabbar all from Safwan ibn Yahya from Ishaq ibn ‘Ammar from abu al-‘Attar al-Khayyat who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the assets of orphans which are with me and I use it in business. He (the Imam) said, ‘If you move it, its Zakat is up on you.’ I then said, ‘I move it for eight months and leave it for four months.’ He (the Imam) said, ‘Zakat due on it is on you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور بسنديه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/75)"
        ],
        "index": 5842,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) هَلْ عَلَى مَالِ الْيَتِيمِ زَكَاةٌ قَالَ لَا إِلَّا أَنْ يُتَّجَرَ بِهِ أَوْ يُعْمَلَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is there <span class=\"iTxt\">Zakāt</span> upon the wealth of the orphans?’ He<sup>asws</sup> said: ‘No, unless if one were to trade with it, or work with it’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, if there is Zakat on orphan’s assets. He (the Imam) said, ‘No, Zakat is not due unless it is used in business or is made to work.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/76)"
        ],
        "index": 5843,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:4",
        "text": [
          "حَمَّادُ بْنُ عِيسَى عَنْ حَرِيزٍ عَنْ أَبِي بَصِيرٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَيْسَ عَلَى مَالِ الْيَتِيمِ زَكَاةٌ وَ إِنْ بَلَغَ الْيَتِيمُ فَلَيْسَ عَلَيْهِ لِمَا مَضَى زَكَاةٌ وَ لَا عَلَيْهِ فِيمَا بَقِيَ حَتَّى يُدْرِكَ فَإِذَا أَدْرَكَ فَإِنَّمَا عَلَيْهِ زَكَاةٌ وَاحِدَةٌ ثُمَّ كَانَ عَلَيْهِ مِثْلُ مَا عَلَى غَيْرِهِ مِنَ النَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad Bin Isa, from Hareyz, from Abu Baseer who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There is no <span class=\"iTxt\">Zakāt</span> upon the wealth of the orphans, and even if the orphan reaches adulthood, there would be nothing upon him, due to the <span class=\"iTxt\">Zakāt</span> of the past, and there would be nothing upon him regarding what remains until he becomes aware (adult). So when he does become aware (adult). So rather there would be one (year’s) <span class=\"iTxt\">Zakāt</span> upon him. Then, upon him, would be similar to what is upon others from the people’."
          ],
          "en.sarwar": [
            "4. Hammad ibn ‘Isa has narrated from Hariz from abu Basir who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Zakat is not due on orphans’ assets even when they become adults; they are not liable for Zakat of the previous years or of the remaining time, but when they become adults, they are required to pay Zakat. They are held responsible as others are held responsible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/76)"
        ],
        "index": 5844,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:5",
        "text": [
          "حَمَّادُ بْنُ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ أَنَّهُمَا قَالَا لَيْسَ عَلَى مَالِ الْيَتِيمِ فِي الدِّينِ وَ الْمَالِ الصَّامِتِ شَيْ‏ءٌ فَأَمَّا الْغَلَّاتُ فَعَلَيْهَا الصَّدَقَةُ وَاجِبَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad Bin Isa, from Hareyz, from Zurara and Muhammad Bin Muslim, both having said, ",
            "‘There is nothing upon the wealth of the orphans regarding the debts and the silent wealth (immovable asset). But, as for the produce, so upon it is the Obligatory charity (<span class=\"iTxt\">Zakāt</span>)’."
          ],
          "en.sarwar": [
            "5. Hammad ibn ‘Isa has narrated from Hariz from Zurarah and Muhammad ibn Muslim who has said the following: “Zakat is not due on loans people owe to orphans’ as well as on the orphans immoveable assets; however, it is obligatory to pay Zakat for the orphans’ grains.’” "
          ]
        }
      },
      {
        "index": 5845,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ سَعِيدٍ السَّمَّانِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَيْسَ فِي مَالِ الْيَتِيمِ زَكَاةٌ إِلَّا أَنْ يُتَّجَرَ بِهِ فَإِنِ اتُّجِرَ بِهِ فَالرِّبْحُ لِلْيَتِيمِ فَإِنْ وُضِعَ فَعَلَى الَّذِي يَتَّجِرُ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from Saeed Al Samman who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘There is no <span class=\"iTxt\">Zakāt</span> regarding the wealth of the orphans except if one were to trade with it. So if it is traded with, then the profits would be for the orphan. But if there is a loss, so it would be upon the one who traded with it’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ’Isma‘il ibn Marrar from Yunus from Sa‘id al-Samman who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘Zakat is not due on the assets of orphans unless it is used in business, in which case the profit belongs to the orphans’ and if it (using it in business) is assigned to someone, then Zakat is upon the one who uses it in business.’” "
          ]
        }
      },
      {
        "index": 5846,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:7",
        "text": [
          "أَحْمَدُ بْنُ إِدْرِيسَ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ أَرْسَلْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ لِي إِخْوَةً صِغَاراً فَمَتَى تَجِبُ عَلَى أَمْوَالِهِمُ الزَّكَاةُ قَالَ إِذَا وَجَبَتْ عَلَيْهِمُ الصَّلَاةُ وَجَبَتِ الزَّكَاةُ قُلْتُ فَمَا لَمْ تَجِبْ عَلَيْهِمُ الصَّلَاةُ قَالَ إِذَا اتُّجِرَ بِهِ فَزَكِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Idrees, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Yunus Bin Yaqoub who said, ",
            "‘I sent a message to Abu Abdullah<sup>asws</sup> that there are young brothers for me, so when would the <span class=\"iTxt\">Zakāt</span> be Obligated upon their wealth?’ He<sup>asws</sup> said: ‘When the <span class=\"iTxt\">Salāt</span> is Obligated upon them, the <span class=\"iTxt\">Zakāt</span> would (also) be Obligated’. I said, ‘So what about the ones whom the <span class=\"iTxt\">Salāt</span> is not Obligated upon?’ He<sup>asws</sup> said: ‘When you trade with it, so purify it (pay <span class=\"iTxt\">Zakāt</span>)’."
          ],
          "en.sarwar": [
            "7. Ahmad ibn Idris has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Yunus ibn Ya‘qub who has said the following: “I once sent (a letter) to abu ‘Abd Allah, ‘Alayhi al-Salam, to find out when Zakat becomes obligatory for the assets of my small brothers. He (the Imam) said, ‘When Salah (prayer) becomes obligatory up on them, Zakat also become obligatory; however, in the case of those of them on whom Salah (prayer) is not obligatory but their asset is used in business, you must pay Zakat for such assets.’” "
          ]
        }
      },
      {
        "index": 5847,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:23:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ الْقَاسِمِ بْنِ الْفُضَيْلِ قَالَ كَتَبْتُ إِلَى أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) أَسْأَلُهُ عَنِ الْوَصِيِّ أَ يُزَكِّي زَكَاةَ الْفِطْرَةِ عَنِ الْيَتَامَى إِذَا كَانَ لَهُمْ مَالٌ قَالَ فَكَتَبَ ( عليه السلام ) لَا زَكَاةَ عَلَى يَتِيمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Al Qasim Bin Al Fuzayl who said, ",
            "‘I wrote to Abu Al-Hassan Al-Reza<sup>asws</sup> asking him<sup>asws</sup> about the trustee, ‘Would he pay the <span class=\"iTxt\">Zakāt</span> of Al-Fitra on behalf of the orphans who happened to have had some wealth?’ So he<sup>asws</sup> wrote: ‘There is no <span class=\"iTxt\">Zakāt</span> upon the orphans’ (when an orphan reaches the age of offering <span class=\"iTxt\">Salāt</span> he is not an orphan but achieves the status of an adult)."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Muhammad ibn al-Qasim ibn al-Fudayl who has said the following: “I once wrote to abu al-Hassan, al-Rida’, ‘Alayhi al-Salam, and asked about the executor of the will if it is obligatory on him to pay Zakat of al-Fitrah for the orphans if they have assets. He (the Imam) wrote to me, ‘Zakat is not due on orphans.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:23",
  "kind": "verse_list"
}