{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 5"}, "path": "/books/al-kafi:3:5", "titles": {"ar": "كِتَابُ الزَّكَاةِ", "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "}}, {"indexed_titles": {"en": "Chapter 29"}, "path": "/books/al-kafi:3:5:29", "titles": {"ar": "باب قَضَاءِ الزَّكَاةِ عَنِ الْمَيِّتِ", "en": "Chapter 29 – Fulfilment of the Zakāt on behalf of the deceased"}}], "index": 799, "local_index": 29, "part_type": "Chapter", "path": "/books/al-kafi:3:5:29", "titles": {"ar": "باب قَضَاءِ الزَّكَاةِ عَنِ الْمَيِّتِ", "en": "Chapter 29 – Fulfilment of the Zakāt on behalf of the deceased"}, "verse_count": 5, "verse_start_index": 5871, "verses": [{"index": 5872, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:5:29:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبَّادِ بْنِ صُهَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ فَرَّطَ فِي إِخْرَاجِ زَكَاتِهِ فِي حَيَاتِهِ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ حَسَبَ جَمِيعَ مَا كَانَ فَرَّطَ فِيهِ مِمَّا لَزِمَهُ مِنَ الزَّكَاةِ ثُمَّ أَوْصَى بِهِ أَنْ يُخْرَجَ ذَلِكَ فَيُدْفَعَ إِلَى مَنْ يَجِبُ لَهُ قَالَ جَائِزٌ يُخْرَجُ ذَلِكَ مِنْ جَمِيعِ الْمَالِ إِنَّمَا هُوَ بِمَنْزِلَةِ دَيْنٍ لَوْ كَانَ عَلَيْهِ لَيْسَ لِلْوَرَثَةِ شَيْ‏ءٌ حَتَّى يُؤَدُّوا مَا أَوْصَى بِهِ مِنَ الزَّكَاةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Abbad Bin Suheyb, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who omitted the extraction of his <span class=\"iTxt\">Zakāt</span> during his lifetime. So when the death presented itself to him, he counted the entirety of what he had omitted from what been Imposed upon him from the <span class=\"iTxt\">Zakāt</span>, then bequeathed that it be extracted and handed over to the one it is Obligated upon (to be handed over to)’. He<sup>asws</sup> said: ‘Allowed. That would be extracted from the entirety of the wealth. But rather, it would be at the status of a debt, had it been upon him. There would not be anything for the inheritors until what he had bequeathed with from the <span class=\"iTxt\">Zakāt</span>, is paid over’."}]}, {"index": 5873, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:5:29:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) رَجُلٌ لَمْ يُزَكِّ مَالَهُ فَأَخْرَجَ زَكَاتَهُ عِنْدَ مَوْتِهِ فَأَدَّاهَا كَانَ ذَلِكَ يُجْزِئُ عَنْهُ قَالَ نَعَمْ قُلْتُ فَإِنْ أَوْصَى بِوَصِيَّةٍ مِنْ ثُلُثِهِ وَ لَمْ يَكُنْ زَكَّى أَ يُجْزِئُ عَنْهُ مِنْ زَكَاتِهِ قَالَ نَعَمْ يُحْسَبُ لَهُ زَكَاةٌ وَ لَا تَكُونُ لَهُ نَافِلَةٌ وَ عَلَيْهِ فَرِيضَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara who said, \n‘I said to Abu Ja’far<sup>asws</sup>, ‘A man did not pay <span class=\"iTxt\">Zakāt</span> of his wealth, so his <span class=\"iTxt\">Zakāt</span> was extracted during his death. So, would the payment of what suffice him from it?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Supposing he were to bequeath with a bequest from his third, and <span class=\"iTxt\">Zakāt</span> had not been paid on it, would it suffice him from his <span class=\"iTxt\">Zakāt</span>?’ He<sup>asws</sup> said: ‘Yes. <span class=\"iTxt\">Zakāt</span> would be reckoned for him, and no optional <span class=\"iTxt\">Salāt</span> would happen to be upon him, and upon him would be the Obligatory (<span class=\"iTxt\">Salāt</span>)’."}]}, {"index": 5874, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:5:29:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ شُعَيْبٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ عَلَى أَخِي زَكَاةً كَثِيرَةً فَأَقْضِيهَا أَوْ أُؤَدِّيهَا عَنْهُ فَقَالَ لِي وَ كَيْفَ لَكَ بِذَلِكَ قُلْتُ أَحْتَاطُ قَالَ نَعَمْ إِذاً تُفَرِّجَ عَنْهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Shuayb who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘There is a lot of <span class=\"iTxt\">Zakāt</span> upon my brother. So, can I fulfil it or pay it on his behalf?’ So he<sup>asws</sup> said to me: ‘And how is it for you with that?’ I said, ‘Precaution’. He<sup>asws</sup> said: ‘Yes, then you relieve if from him’."}]}, {"index": 5875, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:5:29:4", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قُلْتُ لَهُ رَجُلٌ يَمُوتُ وَ عَلَيْهِ خَمْسُ مِائَةِ دِرْهَمٍ مِنَ الزَّكَاةِ وَ عَلَيْهِ حَجَّةُ الْإِسْلَامِ وَ تَرَكَ ثَلَاثَمِائَةِ دِرْهَمٍ فَأَوْصَى بِحَجَّةِ الْإِسْلَامِ وَ أَنْ يُقْضَى عَنْهُ دَيْنُ الزَّكَاةِ قَالَ يُحَجُّ عَنْهُ مِنْ أَقْرَبِ مَا يَكُونُ وَ يُخْرَجُ الْبَقِيَّةُ فِي الزَّكَاةِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Ammar who said, \n‘I said to him<sup>asws</sup>, ‘A man is dying and upon him is five hundred Dirhams of <span class=\"iTxt\">Zakāt</span>, and upon him is the (performance) of Hajj of Al-Islam, and leaves three hundred Dirhams. So he bequeaths with (the performance of) the Hajj of Al-Islam, and that the debt of <span class=\"iTxt\">Zakāt</span> to be fulfilled from him’. He<sup>asws</sup> said: ‘Hajj would be performed on his behalf from the nearest of what can happen to be, and the remainder would be extracted regarding the <span class=\"iTxt\">Zakāt</span>’."}]}, {"index": 5876, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:5:29:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) رَجُلٌ مَاتَ وَ عَلَيْهِ زَكَاةٌ وَ أَوْصَى أَنْ تُقْضَى عَنْهُ الزَّكَاةُ وَ وُلْدُهُ مَحَاوِيجُ إِنْ دَفَعُوهَا أَضَرَّ ذَلِكَ بِهِمْ ضَرَراً شَدِيداً فَقَالَ يُخْرِجُونَهَا فَيَعُودُونَ بِهَا عَلَى أَنْفُسِهِمْ وَ يُخْرِجُونَ مِنْهَا شَيْئاً فَيُدْفَعُ إِلَى غَيْرِهِمْ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ali Bin Yaqteen who said, \n‘I said to Abu Al-Hassan<sup>asws</sup> the 1<sup>st</sup>, ‘A man dies, and upon him is the <span class=\"iTxt\">Zakāt</span>, and he bequeaths that the Zakāt be fulfilled from him, and his children are destitute. If it were to be handed over, that would be extremely harmful to them’. So he<sup>asws</sup> said: ‘It would be extracted and paid over upon themselves, and they (in turn) would take something out from it and hand it over to others’."}]}]}, "index": "al-kafi:3:5:29", "kind": "verse_list"}