{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:3:5:35",
        "titles": {
          "ar": "باب الزَّكَاةِ تُبْعَثُ مِنْ بَلَدٍ إِلَى بَلَدٍ أَوْ تُدْفَعُ إِلَى مَنْ يَقْسِمُهَا فَتَضِيعُ",
          "en": "Chapter 35 – The Zakāt being sent from a city to a city, or is handed over to someone to distribute it, so it gets wasted"
        }
      }
    ],
    "index": 805,
    "local_index": 35,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:35",
    "titles": {
      "ar": "باب الزَّكَاةِ تُبْعَثُ مِنْ بَلَدٍ إِلَى بَلَدٍ أَوْ تُدْفَعُ إِلَى مَنْ يَقْسِمُهَا فَتَضِيعُ",
      "en": "Chapter 35 – The Zakāt being sent from a city to a city, or is handed over to someone to distribute it, so it gets wasted"
    },
    "verse_count": 11,
    "verse_start_index": 5901,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/100)"
        ],
        "index": 5902,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ بَعَثَ بِزَكَاةِ مَالِهِ لِتُقْسَمَ فَضَاعَتْ هَلْ عَلَيْهِ ضَمَانُهَا حَتَّى تُقْسَمَ فَقَالَ إِذَا وَجَدَ لَهَا مَوْضِعاً فَلَمْ يَدْفَعْهَا فَهُوَ لَهَا ضَامِنٌ حَتَّى يَدْفَعَهَا وَ إِنْ لَمْ يَجِدْ لَهَا مَنْ يَدْفَعُهَا إِلَيْهِ فَبَعَثَ بِهَا إِلَى أَهْلِهَا فَلَيْسَ عَلَيْهِ ضَمَانٌ لِأَنَّهَا قَدْ خَرَجَتْ مِنْ يَدِهِ ",
          "وَ كَذَلِكَ الْوَصِيُّ الَّذِي يُوصَى إِلَيْهِ يَكُونُ ضَامِناً لِمَا دُفِعَ إِلَيْهِ إِذَا وَجَدَ رَبَّهُ الَّذِي أُمِرَ بِدَفْعِهِ إِلَيْهِ فَإِنْ لَمْ يَجِدْ فَلَيْسَ عَلَيْهِ ضَمَانٌ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from hammad Bin Isa, from Hareyz, from Zurara, from Muhammad Bin Muslim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man sent the <span class=\"iTxt\">Zakāt</span> of his wealth to be distributed, but it was wasted. It is responsibility upon him until it gets distributed?’ So he<sup>asws</sup> said: ‘When he found an appropriate place for it, but did not hand it over, so he would be responsible for it until it is handed over; but if he did not find for it the one whom he could hand it over to, so he sent it to its deserving ones, then the responsibility is not upon him, because it went out from his hand.",
            "And similar to that is the trustee to whom it is entrusted, would happen to be responsible for whatever is handed over to him when he finds the one whom its owner had instructed him to hand it over to. But if he does not find, then there is no responsibility upon him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Zurarah from Muhammad ibn Muslim who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about a man who sends his Zakat for distribution but it is lost. Is he held responsible until it is distributed? He (the Imam) said, ‘If he had found a proper beneficiary and did not pay, he is held responsible until he pays it; but if he did not find proper beneficiary thus, sent it for distribution, he is not held responsible because it was out of his hand. So also is the case of the executor of a will who is held responsible for what is given to him when he finds the one to whom he was told to deliver and if he does not find, it is not his responsibility.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/101)"
        ],
        "index": 5903,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:2",
        "text": [
          "حَمَّادُ بْنُ عِيسَى عَنْ حَرِيزٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا أَخْرَجَ الرَّجُلُ الزَّكَاةَ مِنْ مَالِهِ ثُمَّ سَمَّاهَا لِقَوْمٍ فَضَاعَتْ أَوْ أَرْسَلَ بِهَا إِلَيْهِمْ فَضَاعَتْ فَلَا شَيْ‏ءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hammad Bin Isa, from Hareyz, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the man extracts the <span class=\"iTxt\">Zakāt</span> from his wealth, then specifies it for a particular group of people, but it gets wasted, or he sends with it/him to them, but it gets wasted, so there is nothing upon him’."
          ],
          "en.sarwar": [
            "2. Hammad ibn ‘Isa has narrated from Hariz from abu Basir who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If one takes out his Zakat and assigns it to be paid to a people but it is lost, or he sends it to them and it is lost, he is not held responsible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/101)"
        ],
        "index": 5904,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:3",
        "text": [
          "حَرِيزٌ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ إِذَا أَخْرَجَهَا مِنْ مَالِهِ فَذَهَبَتْ وَ لَمْ يُسَمِّهَا لِأَحَدٍ فَقَدْ بَرِئَ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Hareyz, from Ubeyd Bin Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When he extracts it (<span class=\"iTxt\">Zakāt</span>) from his wealth, so it gets wasted, and he had not specified it for anyone, so he is not accountable for it’."
          ],
          "en.sarwar": [
            "3. Hariz has narrated from ‘Ubayd ibn Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one takes away Zakat from his assets but does not name the beneficiary and it is lost, he is free from his obligation.’” "
          ]
        }
      },
      {
        "index": 5905,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:4",
        "text": [
          "حَرِيزٌ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ بَعَثَ إِلَيْهِ أَخٌ لَهُ زَكَاتَهُ لِيَقْسِمَهَا فَضَاعَتْ فَقَالَ لَيْسَ عَلَى الرَّسُولِ وَ لَا عَلَى الْمُؤَدِّي ضَمَانٌ قُلْتُ فَإِنَّهُ لَمْ يَجِدْ لَهَا أَهْلًا فَفَسَدَتْ وَ تَغَيَّرَتْ أَ يَضْمَنُهَا قَالَ لَا وَ لَكِنْ إِنْ عَرَفَ لَهَا أَهْلًا فَعَطِبَتْ أَوْ فَسَدَتْ فَهُوَ لَهَا ضَامِنٌ حَتَّى يُخْرِجَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Hareyz, from Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man whose brother sent his <span class=\"iTxt\">Zakāt</span> to him to distribute it, but it got wasted. So he<sup>asws</sup> said: ‘It is not upon the messenger, nor upon the payer, any responsibility’. I said, ‘So if he does not find a deserving one for it, and it gets spoilt, and altered, would he be responsible?’ He<sup>asws</sup> said: ‘No, but if he recognised a deserving one for it, so it got damaged, or spoilt, so he would be responsible for it until he extracts it’."
          ],
          "en.sarwar": [
            "4. Hariz has narrated from Zurarah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man whose brother sends his Zakat to distribute among beneficiaries but it is lost. He (the Imam) said, ‘The messenger is not responsible as well as the payer.’ I then asked, ‘If he does not find the beneficiary and it is spoiled or changed, is he responsible?’ He (the Imam) said, ‘No, he is not responsible. However, if he knows a beneficiary for it and it is destroyed or damaged, then he is responsible until he pays it off.’” "
          ]
        }
      },
      {
        "index": 5906,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ بُكَيْرِ بْنِ أَعْيَنَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الرَّجُلِ يَبْعَثُ بِزَكَاتِهِ فَتُسْرَقُ أَوْ تَضِيعُ قَالَ لَيْسَ عَلَيْهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Jameel Bin Salih, from Bukeyr Bin Ayn who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the man who sends his <span class=\"iTxt\">Zakāt</span>, but it gets stolen, or wasted. He<sup>asws</sup> said: ‘There is nothing upon him’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Jamil ibn Salih from Bukayr ibn ’A‘yan who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about a man who sends his Zakat but it is stolen or destroyed. He (the Imam) said, ‘He does not owe anything.’” "
          ]
        }
      },
      {
        "index": 5907,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَمَّنْ أَخْبَرَهُ عَنْ دُرُسْتَ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ قَالَ فِي الزَّكَاةِ يَبْعَثُ بِهَا الرَّجُلُ إِلَى بَلَدٍ غَيْرِ بَلَدِهِ قَالَ لَا بَأْسَ أَنْ يَبْعَثَ الثُّلُثَ أَوِ الرُّبُعَ شَكَّ أَبُو أَحْمَدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from the one who informed him, from Dorost, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the <span class=\"iTxt\">Zakāt</span> being sent by the man to a city other than his own city: ‘There is no problem if he were to send the third’, ‘Or a quarter’. The doubt is from Abu Ahmad (the narrator)’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from the one who reported to him from Durust from a man who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who sends his Zakat from one town to another town. He (the Imam) said, ‘It is not harmful to send one-third or one-fourth (uncertainty is from narrator).”’ "
          ]
        }
      },
      {
        "index": 5908,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:7",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ الْحَكَمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُعْطَى الزَّكَاةَ يَقْسِمُهَا أَ لَهُ أَنْ يُخْرِجَ الشَّيْ‏ءَ مِنْهَا مِنَ الْبَلْدَةِ الَّتِي هُوَ فِيهَا إِلَى غَيْرِهَا قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, and Ali Bin Ibrahim, from his father, altogether from Ibn Abu Umeyr, from Hisham Bin Al Hakam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who gives the <span class=\"iTxt\">Zakāt</span> to be distributed. Is it for him that he takes something from it from the city which he is in to other than it?’ He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from and Ali ibn Ibrahim has narrated from his father all from ibn abu ‘Umayr from Hisham ibn Hakam who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who gives Zakat for distribution, if he can take a certain amount to another place? He (the Imam) said, ‘It is not harmful.” "
          ]
        }
      },
      {
        "index": 5909,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ عَنْ عَبْدِ الْكَرِيمِ بْنِ عُتْبَةَ الْهَاشِمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقْسِمُ صَدَقَةَ أَهْلِ الْبَوَادِي فِي أَهْلِ الْبَوَادِي وَ صَدَقَةَ أَهْلِ الْحَضَرِ فِي أَهْلِ الْحَضَرِ وَ لَا يَقْسِمُهَا بَيْنَهُمْ بِالسَّوِيَّةِ إِنَّمَا يَقْسِمُهَا عَلَى قَدْرِ مَا يَحْضُرُهُ مِنْهُمْ وَ مَا يَرَى لَيْسَ فِي ذَلِكَ شَيْ‏ءٌ مُوَقَّتٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Zurara, from Abdul Kareem Bin Utba Al Hashimy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> used to distribute charity (<span class=\"iTxt\">Zakāt</span>) of the people of the valleys, among the people of the valleys, and the charity (<span class=\"iTxt\">Zakāt</span>) of the people of the town, among the people of the town, and he<sup>saww</sup> did not distribute between them with the equality. But rather, he<sup>saww</sup> distributed it upon those who were present from them, and he<sup>saww</sup> did not see anything fixed in that’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Zurarah from ‘Abd al-Karim ibn ‘Utbah af-Hashimiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah would distribute Zakat of the Bedouins among the Bedouins and Zakat of the town dwellers among the town dwellers. He would not distribute it among them in equal amounts, instead he would distribute it among those present without considering anything definite about it.’” "
          ]
        }
      },
      {
        "index": 5910,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:9",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ وُهَيْبِ بْنِ حَفْصٍ قَالَ كُنَّا مَعَ أَبِي بَصِيرٍ فَأَتَاهُ عَمْرُو بْنُ إِلْيَاسَ فَقَالَ لَهُ يَا أَبَا مُحَمَّدٍ إِنَّ أَخِي بِحَلَبَ بَعَثَ إِلَيَّ بِمَالٍ مِنَ الزَّكَاةِ أَقْسِمُهُ بِالْكُوفَةِ فَقُطِعَ عَلَيْهِ الطَّرِيقُ فَهَلْ عِنْدَكَ فِيهِ رِوَايَةٌ فَقَالَ نَعَمْ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ هَذِهِ الْمَسْأَلَةِ وَ لَمْ أَظُنَّ أَنَّ أَحَداً يَسْأَلُنِي عَنْهَا أَبَداً فَقُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ الرَّجُلُ يَبْعَثُ بِزَكَاتِهِ مِنْ أَرْضٍ إِلَى أَرْضٍ فَيُقْطَعُ عَلَيْهِ الطَّرِيقُ فَقَالَ قَدْ أَجْزَأَتْ عَنْهُ وَ لَوْ كُنْتُ أَنَا لَأَعَدْتُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Wuheyb Bin Hafs who said, ",
            "‘We were with Abu Baseer, and Amro Bin Ilyas came over to him, and he said to him, ‘O Abu Muhammad! My brother in Halab sent over to me wealth from the <span class=\"iTxt\">Zakāt</span> for me to distribute it in Al-Kufa. But the road was cut off from it (by bandits). So is there a report (Hadeeth) with regards to it with you?’ So he said, ‘Yes. I did ask Abu Ja’far<sup>asws</sup> this question, and I did not think anyone would ask me about it, ever. So I said to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! The man sends his <span class=\"iTxt\">Zakāt</span> from a land to a land, but the road is cut off upon it (by bandits)’. So he<sup>asws</sup> said: ‘It has sufficed him from it, and had it been me<sup>asws</sup>, I<sup>asws</sup> would have paid it (again)’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali from Wuhayb ibn Hafs who has said the following: “Once we were with abu Basir when ‘Amr ibn ’Ilyas came to him and said, ‘O abu Muhammad, my brother from Halab has sent to me a certain amount of goods of Zakat so I distribute in al-Kufah, but it was looted on the way. Do you have any Hadith about it?’ He said, ‘Yes, I once asked abu Ja‘far, ‘Alayhi al-Salam, about this issue and I did not think anyone would ever ask me about it. I said to abu Ja‘far, ‘Alayhi al-Salam, I pray to Allah to keep my soul in service for your cause, a man sends his Zakat from one land to another land and it is looted on the way. He (the Imam) said, ‘It is sufficient (as payment for Zakat) but if it was up to me I would pay it again.’” "
          ]
        }
      },
      {
        "index": 5911,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:10",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا تَحِلُّ صَدَقَةُ الْمُهَاجِرِينَ لِلْأَعْرَابِ وَ لَا صَدَقَةُ الْأَعْرَابِ لِلْمُهَاجِرِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdullah Bin Muskan, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It is not Permissible, a charity (<span class=\"iTxt\">Zakāt</span>) of the Emigrant for the Bedouins, nor a charity (<span class=\"iTxt\">Zakāt</span>) of the Bedouins for the Emigrants’."
          ],
          "en.sarwar": [
            "10. Abu Ali al-Ash’ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Abd Allah ibn Muskan from al- Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Zakat of immigrants (converts to piety and religion) is not lawful for Arabs and the charity (Zakat) of Arabs is not lawful for immigrants.’” "
          ]
        }
      },
      {
        "index": 5912,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:35:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ يَحْيَى بْنِ عِمْرَانَ عَنِ ابْنِ مُسْكَانَ عَنْ ضُرَيْسٍ قَالَ سَأَلَ الْمَدَائِنِيُّ أَبَا جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ لَنَا زَكَاةً نُخْرِجُهَا مِنْ أَمْوَالِنَا فَفِي مَنْ نَضَعُهَا فَقَالَ فِي أَهْلِ وَلَايَتِكَ فَقَالَ إِنِّي فِي بِلَادٍ لَيْسَ فِيهَا أَحَدٌ مِنْ أَوْلِيَائِكَ فَقَالَ ابْعَثْ بِهَا إِلَى بَلَدِهِمْ تُدْفَعُ إِلَيْهِمْ وَ لَا تَدْفَعْهَا إِلَى قَوْمٍ إِنْ دَعَوْتَهُمْ غَداً إِلَى أَمْرِكَ لَمْ يُجِيبُوكَ وَ كَانَ وَ اللَّهِ الذَّبْحُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Yahya Bin Imran, from Ibn Muskan, from Zureys who said, ",
            "‘Al-Madainy asked Abu Ja’far<sup>asws</sup>, ‘For use there is <span class=\"iTxt\">Zakāt</span> we extract from our wealth. So among whom should we be placing it?’ So he<sup>asws</sup> said: ‘Among your people of the Wilayah’. So he<sup>asws</sup> said: ‘For the time being there is no one in the city from those in your<sup>asws</sup> Wilayah’. So he<sup>asws</sup> said: ‘Send with it to their cities to be handed over to them, and do not hand it over to a group of people such that, tomorrow if you were to invite them to your matter, they would not be responding to you, and by Allah<sup>azwj</sup>, they would be slaughtered (by Al-Qaim<sup>asws</sup>)’."
          ],
          "en.sarwar": [
            "11. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Yahya ibn ‘Imran from ibn Muskan from Durays who has said the following: “Once al-Mada’iniy asked abu Ja‘far, ‘Alayhi al-Salam, and said, ‘There is Zakat on our assets. To whom should we pay it? He (the Imam) said, ‘Pay it to the people of your Wilayah, people who believe in (the Divine Authority of ’A’immah).’ He said, ‘There is no one of your followers.’ He (the Imam) said, ‘Send it to where they are found. Do not give it to a people who will not accept your call if you will call them tomorrow. This by Allah is slaughter, (an expression of concern about enemies of ’A’immah).” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:35",
  "kind": "verse_list"
}