{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:3:5:37",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلُ إِذَا</span> وَصَلَتْ إِلَيْهِ الزَّكَاةُ فَهِيَ كَسَبِيلِ مَالِهِ يَفْعَلُ بِهَا مَا يَشَاءُ",
          "en": "Chapter 37 – The man, when the Zakāt arrives to him, so it is like the way (part) of his wealth. He can do with it whatever he so desires to"
        }
      }
    ],
    "index": 807,
    "local_index": 37,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 38"
        },
        "path": "/books/al-kafi:3:5:38",
        "titles": {
          "ar": "باب الرَّجُلِ يَحُجُّ مِنَ الزَّكَاةِ أَوْ يُعْتِقُ",
          "en": "Chapter 38 – The man performs Hajj from the Zakāt, or liberates (a slave)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:3:5:36",
        "titles": {
          "ar": "باب الرَّجُلِ يُدْفَعُ إِلَيْهِ الشَّيْ‏ءُ يُفَرِّقُهُ وَ هُوَ مُحْتَاجٌ إِلَيْهِ يَأْخُذُ لِنَفْسِهِ",
          "en": "Chapter 36 – The man, something is handed over to him, he separates it and he is needy to it, taking it for himself"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:37",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب الرَّجُلُ إِذَا</span> وَصَلَتْ إِلَيْهِ الزَّكَاةُ فَهِيَ كَسَبِيلِ مَالِهِ يَفْعَلُ بِهَا مَا يَشَاءُ",
      "en": "Chapter 37 – The man, when the Zakāt arrives to him, so it is like the way (part) of his wealth. He can do with it whatever he so desires to"
    },
    "verse_count": 3,
    "verse_start_index": 5915,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/102)"
        ],
        "index": 5916,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/305",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:37:1",
        "text": [
          " إِذَا أَخَذَ الرَّجُلُ الزَّكَاةَ فَهِيَ كَمَالِهِ يَصْنَعُ بِهَا مَا يَشَاءُ قَالَ وَ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ لِلْفُقَرَاءِ فِي أَمْوَالِ الْأَغْنِيَاءِ فَرِيضَةً لَا يُحْمَدُونَ إِلَّا بِأَدَائِهَا وَ هِيَ الزَّكَاةُ فَإِذَا هِيَ وَصَلَتْ إِلَى الْفَقِيرِ فَهِيَ بِمَنْزِلَةِ مَالِهِ يَصْنَعُ بِهَا مَا يَشَاءُ ",
          "فَقُلْتُ يَتَزَوَّجُ بِهَا وَ يَحُجُّ مِنْهَا قَالَ نَعَمْ هِيَ مَالُهُ قُلْتُ فَهَلْ يُؤْجَرُ الْفَقِيرُ إِذَا حَجَّ مِنَ الزَّكَاةِ كَمَا يُؤْجَرُ الْغَنِيُّ صَاحِبُ الْمَالِ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man takes the <span class=\"iTxt\">Zakāt</span>, so it would be like his own wealth. He can do with it whatever he so desires to. Allah<sup>azwj</sup> Mighty and Majestic Imposed for the poor in the wealth of the rich such an Imposition that they would not be praiseworthy except by paying it, and it is the <span class=\"iTxt\">Zakāt</span>. So when it arrive to the poor, so it would be at the status of his own wealth. He can do with it whatever he so desires to’. ",
            "So I said, ‘He can get married with it and perform Hajj with it?’ I said, ‘So would the poor one be Recompensed when he performs a Hajj from the <span class=\"iTxt\">Zakāt</span> (monies) just as the rich one, the owner of the wealth would be Recompensed?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘When a person receives Zakat it is like his own property and one can use it as one likes.’ He (the Imam) then said, ‘Allah, most Majestic, most Glorious, has made a share in the wealth of the wealthy people obligatory for the needy. The affluent people are not appreciated until they pay it. That share is Zakat. Once it (Zakat) reaches in the hands of the needy, it then becomes like his own property and he uses it as he likes for marriage or Hajj. Yes, it is his property.’ I then asked, ‘Can a needy person who performs Hajj from Zakat receive the reward for Hajj as the wealthy person receives?’ He (the Imam) said, ‘Yes, the needy receive the same amount of reward.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/103)"
        ],
        "index": 5917,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/266",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:37:2",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ شَيْخاً مِنْ أَصْحَابِنَا يُقَالُ لَهُ عُمَرُ سَأَلَ عِيسَى بْنَ أَعْيَنَ وَ هُوَ مُحْتَاجٌ فَقَالَ لَهُ عِيسَى بْنُ أَعْيَنَ أَمَا إِنَّ عِنْدِي مِنَ الزَّكَاةِ وَ لَكِنْ لَا أُعْطِيكَ مِنْهَا فَقَالَ لَهُ وَ لِمَ فَقَالَ لِأَنِّي رَأَيْتُكَ اشْتَرَيْتَ لَحْماً وَ تَمْراً فَقَالَ إِنَّمَا رَبِحْتُ دِرْهَماً فَاشْتَرَيْتُ بِدَانِقَيْنِ لَحْماً وَ بِدَانِقَيْنِ تَمْراً ثُمَّ وَ رَجَعْتُ بِدَانِقَيْنِ لِحَاجَةٍ ",
          "قَالَ فَوَضَعَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَدَهُ عَلَى جَبْهَتِهِ سَاعَةً ثُمَّ رَفَعَ رَأْسَهُ ثُمَّ قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى نَظَرَ فِي أَمْوَالِ الْأَغْنِيَاءِ ثُمَّ نَظَرَ فِي الْفُقَرَاءِ فَجَعَلَ فِي أَمْوَالِ الْأَغْنِيَاءِ مَا يَكْتَفُونَ بِهِ وَ لَوْ لَمْ يَكْفِهِمْ لَزَادَهُمْ بَلْ يُعْطِيهِ مَا يَأْكُلُ وَ يَشْرَبُ وَ يَكْتَسِي وَ يَتَزَوَّجُ وَ يَتَصَدَّقُ وَ يَحُجُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Aasim Bin Humeyd, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘An old man from our companions called Umar asked Isa Bin Ayn, and he was needy. So Isa Bin Ayn said to him, ‘I have some <span class=\"iTxt\">Zakāt</span> with me, but I cannot give you from it’. So he said to him, ‘And why not?’ So he said, ‘Because I saw you buying meat and dates’. So he said, ‘But rather, I profited by a Dirham, so I bought meat with two coins, and dates with two coins, then I return with two coins for a need’. ",
            "He (the narrator) said, ‘So Abu Abdullah<sup>asws</sup> placed his<sup>asws</sup> hand upon his forehead for a while, then raised his<sup>asws</sup> head, then said: ‘Allah<sup>azwj</sup> Blessed and High Looked at the wealth of the rich, then Looked at the poor, and He<sup>azwj</sup> Made to be in the wealth of the rich that which they would be sufficing with, and had that not been sufficient for them, He<sup>azwj</sup> would have Increased (the rate of <span class=\"iTxt\">Zakāt</span>) for them. But he should give him what he can eat, and drink, and dress, and get married, and give charity, and perform Hajj’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa’id from al-Nadr ibn Suwayd from ‘Asem ibn Humayd from abu Basir who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that among our people there is a shaykh, called ‘Umar. He asked ‘Isa ibn ’A‘yan for help because he is needy. ‘Isa ibn ’A‘yan said to him, ‘There is Zakat with me, but I cannot give to you.’ He asked for reason. ‘Isa replied, ‘I saw you buying meat and dates.’ He said, ‘I had earned one dirham. With two daniq, I bought meat and with two daniq, I bought dates and I returned with two daniq for some other things that I needed.’ Abu ‘Abd Allah, ‘Alayhi al- Salam, placed his hand on his forehead for a while, then raised his head then said, ‘Allah, most Blessed, most High, looked at the wealth of the wealthy, then He looked at the poor people. He then assigned a share for the needy in the wealth of the wealthy, which will be sufficient for their needs. Had it (Zakat) not been sufficient (for the needs of the needy) He would have increased it. They (needy) must receive from Zakat what is sufficient for them to eat, drink, dress, marry, give charity and perform Hajj.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/103)"
        ],
        "index": 5918,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:37:3",
        "text": [
          " سَأَلَ رَجُلٌ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا جَالِسٌ فَقَالَ إِنِّي أُعْطَى مِنَ الزَّكَاةِ فَأَجْمَعُهُ حَتَّى أَحُجَّ بِهِ قَالَ نَعَمْ يَأْجُرُ اللَّهُ مَنْ يُعْطِيكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man asked Abu Abdullah<sup>asws</sup> and I was seated, so he said, ‘I have been given from the <span class=\"iTxt\">Zakāt</span>. So, can I gather it until I can perform Hajj with it?’ He<sup>asws</sup> said: ‘Yes. May Allah<sup>azwj</sup> Recompense the one who gave you’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has said the following: “Once, a man asked abu ‘Abd Allah, ‘Alayhi al-Salam, when I was sitting, ‘I receive Zakat. Can I save it so I perform Hajj therewith? He (the Imam) said, ‘Yes, you can do so and Allah gives reward to one who gives you Zakat.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:37",
  "kind": "verse_list"
}