{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:3:5:45",
        "titles": {
          "ar": "باب الْحَصَادِ وَ الْجَدَادِ",
          "en": "Chapter 45 – The harvest and the replanting"
        }
      }
    ],
    "index": 815,
    "local_index": 45,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:3:5:46",
        "titles": {
          "ar": "باب صَدَقَةِ أَهْلِ الْجِزْيَةِ",
          "en": "Chapter 46 – Charity (Zakāt) of the taxpayers"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:3:5:44",
        "titles": {
          "ar": "باب مَنْ تَحِلُّ لَهُ الزَّكَاةُ فَيَمْتَنِعُ مِنْ أَخْذِهَا",
          "en": "Chapter 44 – The one for whom the Zakāt is Obligated but he refuses from taking it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:45",
    "titles": {
      "ar": "باب الْحَصَادِ وَ الْجَدَادِ",
      "en": "Chapter 45 – The harvest and the replanting"
    },
    "verse_count": 6,
    "verse_start_index": 5949,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/119)"
        ],
        "index": 5950,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2786",
              "text": "مُعَاوِيَةَ بْنِ شُرَيْحٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ شُرَيْحٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:45:1",
        "relations": {
          "Mentions": [
            "/books/quran:6:142",
            "/books/quran:6:141"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِي الزَّرْعِ حَقَّانِ حَقٌّ تُؤْخَذُ بِهِ وَ حَقٌّ تُعْطِيهِ قُلْتُ وَ مَا الَّذِي أُوخَذُ بِهِ وَ مَا الَّذِي أُعْطِيهِ قَالَ أَمَّا الَّذِي تُؤْخَذُ بِهِ فَالْعُشُرُ وَ نِصْفُ الْعُشُرِ وَ أَمَّا الَّذِي تُعْطِيهِ فَقَوْلُ اللَّهِ عَزَّ وَ جَلَّ وَ آتُوا حَقَّهُ يَوْمَ حَصادِهِ يَعْنِي مِنْ حَصْدِكَ الشَّيْ‏ءَ بَعْدَ الشَّيْ‏ءِ ",
          "وَ لَا أَعْلَمُهُ إِلَّا قَالَ الضِّغْثَ ثُمَّ الضِّغْثَ حَتَّى يَفْرُغَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Shurayh who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Regarding the plantation there are two rights to be seized with, and a right to be given’. I said, ‘And what is that which is seized with and that is that which is given?’ He<sup>asws</sup> said: ‘As for that which is seized with, so it is the tenth and half of the tenth (being the <span class=\"iTxt\">Zakāt</span>), and as for that which is given, so these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h141\">[6:141]</a> and give the due of it on the day of its harvest</span> – Meaning your reaping the thing after the thing’. ",
            "(He the narrator said), ‘And I do not know except that he<sup>asws</sup> said: ‘The bale after the bale until he is free’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn Shurayh who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, say, ‘On plantation there are two rights. One is that for which one is held responsible and the other is that which one must give. I then asked, ‘What is the right for which I am held responsible and what is that which I must give?’ He (the Imam) said, ‘The one for which you are held responsible is one out of ten or one out of twenty and the one which you must give is because of the words of Allah, most Majestic, most Glorious, ‘On the day of harvest give his right. . . .’ <a href=\"/#/books/quran:6#h142\">[6:142]</a> meaning your harvesting something after something. 5 I think he said, ‘bale after bale until the end.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/120)"
        ],
        "index": 5951,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ وَ مُحَمَّدِ بْنِ مُسْلِمٍ وَ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:45:2",
        "relations": {
          "Mentions": [
            "/books/quran:6:142",
            "/books/quran:6:141"
          ]
        },
        "text": [
          " اللَّهِ عَزَّ وَ جَلَّ وَ آتُوا حَقَّهُ يَوْمَ حَصادِهِ فَقَالُوا جَمِيعاً قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) هَذَا مِنَ الصَّدَقَةِ يُعْطِي الْمِسْكِينَ الْقَبْضَةَ بَعْدَ الْقَبْضَةِ وَ مِنَ الْجَدَادِ الْحَفْنَةَ بَعْدَ الْحَفْنَةِ حَتَّى يَفْرُغَ وَ يُعْطِي الْحَارِسَ أَجْراً مَعْلُوماً وَ يَتْرُكُ مِنَ النَّخْلِ مِعَى فَأْرَةٍ وَ أُمَّ جُعْرُورٍ وَ يُتْرَكُ لِلْحَارِسِ يَكُونُ فِي الْحَائِطِ الْعَذْقُ وَ الْعَذْقَانِ وَ الثَّلَاثَةُ لِحِفْظِهِ إِيَّاهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa from Hareyz, from Zurara, and Muhammad Bin Muslim, and Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h141\">[6:141]</a> and give the due of it on the day of its harvest</span>, and they all (narrators) said, ‘Abu Ja’far<sup>asws</sup> said: ‘This is from the charity (<span class=\"iTxt\">Zakāt</span>) given to the poor, the bunch after the bunch, and the handful after the handful until he is free, and he gives to the guard a known recompense, and he leaves from the palm tree Mi’a Farat or Umm Jarour (two types) and he would leave for the guard what happens to be in the wall, the bunch and the two bunches, and the three, for him having guarded it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Zurarah, Muhammad ibn Muslim and abu Basir who has said the following: “About the words of Allah, most Majestic, most Glorious, ‘Give His right on the day of its harvest . . .,’ <a href=\"/#/books/quran:6#h142\">[6:142]</a> all of them have said that abu Ja‘far, ‘Alayhi al-Salam, has stated this Hadith. ‘It is of charity (Zakat) that which is given to the destitute, a bunch after bunch and from fruits handful after handful until all fruits are picked up from trees. The guard has a definite right, which is left for him of the trees. Palm trees like Mi‘afarah and ‘Umm Ja‘rur are left alone. One, two or three trees are left for the guard because of his guarding.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/120)"
        ],
        "index": 5952,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/246",
              "text": "عَبْدِ اللَّهِ بْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:45:3",
        "relations": {
          "Mentions": [
            "/books/quran:6:141"
          ]
        },
        "text": [
          " لَا تَصْرِمْ بِاللَّيْلِ وَ لَا تَحْصُدْ بِاللَّيْلِ وَ لَا تُضَحِّ بِاللَّيْلِ وَ لَا تَبْذُرْ بِاللَّيْلِ فَإِنَّكَ إِنْ تَفْعَلْ لَمْ يَأْتِكَ الْقَانِعُ وَ الْمُعْتَرُّ فَقُلْتُ مَا الْقَانِعُ وَ الْمُعْتَرُّ قَالَ الْقَانِعُ الَّذِي يَقْنَعُ بِمَا أَعْطَيْتَهُ وَ الْمُعْتَرُّ الَّذِي يَمُرُّ بِكَ فَيَسْأَلُكَ وَ إِنْ حَصَدْتَ بِاللَّيْلِ لَمْ يَأْتِكَ السُّؤَّالُ وَ هُوَ قَوْلُ اللَّهِ تَعَالَى آتُوا حَقَّهُ يَوْمَ حَصادِهِ عِنْدَ الْحَصَادِ يَعْنِي الْقَبْضَةَ بَعْدَ الْقَبْضَةِ إِذَا حَصَدْتَهُ وَ إِذَا خَرَجَ فَالْحَفْنَةَ بَعْدَ الْحَفْنَةِ وَ كَذَلِكَ عِنْدَ الصِّرَامِ وَ كَذَلِكَ عِنْدَ الْبَذْرِ وَ لَا تَبْذُرْ بِاللَّيْلِ لِأَنَّكَ تُعْطِي مِنَ الْبَذْرِ كَمَا تُعْطِي مِنَ الْحَصَادِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Abdullah Bin Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Neither pick (fruits) at night, nor harvest at night, nor slaughter (sacrificial animal) at night, nor sow at night, for if you were to do so, the contented one and the beggar would not come to you’. So I said, ‘What is the contented one and the beggar?’ He<sup>asws</sup> said: ‘The contented one is the one who is contented with whatever he is given, and the beggar is the one who would pass by you, so he would ask you; and if you were to harvest at night, he would not come asking; and these are the Words of Allah<sup>azwj</sup> the Exalted <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h141\">[6:141]</a> and give the due of it on the day of its harvest</span> – Meaning the bunch after the bunch when it is harvested; and when it comes out, so the handful after the handful; and similar to that is during the picking (of fruits), similar to that during the sowing. And do not sow at night because you would give from the sowing just as you would give from the harvest’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali al-Washsha’ from ‘Abd Allah ibn Muskan from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Do not harvest or pick-up fruits during the night, do not offer sacrifice during the night, and do not sow seeds during the night. If you did so there will be no al-Qani‘ or al-Mu‘tar (those who ask only once and those who ask many times).’ I then asked, ‘What is al-Qani‘ and al-Mu‘tar?’ He (the Imam) said, ‘Al-Qani‘ is one who is satisfied when you give him and al-Mu‘tar is one who passes by and asks you. If you harvest during the night the one asking will not come. This is mentioned in the words of Allah, most, High. “Give His right on the day of its harvest,” at the time of harvest, bunch by bunch when you harvest, and when it is out give a handful after handful so also at the time of cutting and at the time of sowing the seed give from seed just as you give from the harvest.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/121)"
        ],
        "index": 5953,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1090",
              "text": "أَبِي مَرْيَمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي قَوْلِ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانٍ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي قَوْلِ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:45:4",
        "relations": {
          "Mentions": [
            "/books/quran:6:142",
            "/books/quran:6:141"
          ]
        },
        "text": [
          " اللَّهِ عَزَّ وَ جَلَّ وَ آتُوا حَقَّهُ يَوْمَ حَصادِهِ قَالَ تُعْطِي الْمِسْكِينَ يَوْمَ حَصَادِكَ الضِّغْثَ ثُمَّ إِذَا وَقَعَ فِي الْبَيْدَرِ ثُمَّ إِذَا وَقَعَ فِي الصَّاعِ الْعُشْرُ وَ نِصْفُ الْعُشْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Abu Maryam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h141\">[6:141]</a> and give the due of it on the day of its harvest</span>. He<sup>asws</sup> said: ‘You should give to the poor on the day of your harvest, the bale. Then when it falls in the threshing floor, then when it falls during the harvest, it is the tenth and half the tenth (as <span class=\"iTxt\">Zakāt</span>)’."
          ],
          "en.sarwar": [
            "4. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali from Aban from abu Maryam who has said the following: “About the words of Allah, most Majestic, most Glorious, ‘. . . give His right on the day of harvest . . .,’ <a href=\"/#/books/quran:6#h142\">[6:142]</a> abu ‘Abd Allah, ‘Alayhi al-Salam, has said this. ‘It requires one to give on the day of harvest in bunches, then during threshing, then when it is measured in Sa‘, it (charity (Zakat)) is one out of ten or one out of twenty.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/121)"
        ],
        "index": 5954,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/45",
              "text": "عَلِيِّ بْنِ حَدِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/296",
              "text": "مُرَازِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2637",
              "text": "مُصَادِفٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ حَدِيدٍ عَنْ مُرَازِمٍ عَنْ مُصَادِفٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:45:5",
        "text": [
          " كُنْتُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي أَرْضٍ لَهُ وَ هُمْ يَصْرِمُونَ فَجَاءَ سَائِلٌ يَسْأَلُ فَقُلْتُ اللَّهُ يَرْزُقُكَ فَقَالَ ( عليه السلام ) مَهْ لَيْسَ ذَلِكَ لَكُمْ حَتَّى تُعْطُوا ثَلَاثَةً فَإِذَا أَعْطَيْتُمْ ثَلَاثَةً فَإِنْ أَعْطَيْتُمْ فَلَكُمْ وَ إِنْ أَمْسَكْتُمْ فَلَكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Hadeed, from Murazim, from Musadif who said, ",
            "‘I was with Abu Abdullah<sup>asws</sup> in a land of his<sup>asws</sup>, and they (workers) were picking. So a beggar came over and begged. So I said, ‘May Allah<sup>azwj</sup> Grace you’. So he<sup>asws</sup> said: ‘Shh! That is not for you (to say) until you have given to three (beggars). So when you have given to three (beggars), then if you were to give, so it is for you to do so, and if you withhold, so it would be for you to do so’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated Ahmad ibn Muhammad from Ali ibn Hadid from Murazim from Musadif who has said the following: “I once was with abu ‘Abd Allah, ‘Alayhi al-Salam, on his land where they were harvesting and someone asking for help came. I said, ‘Allah gives you.’ He (the Imam) said, ‘Wait. You cannot say that until you give him three times. When you give him three times thereafter if you give, it is for you, and if you stop giving him is also for you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/122)"
        ],
        "index": 5955,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/361",
              "text": "ابْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ أَبِي نَصْرٍ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:45:6",
        "relations": {
          "Mentions": [
            "/books/quran:6:141"
          ]
        },
        "text": [
          " سَأَلْتُهُ عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ آتُوا حَقَّهُ يَوْمَ حَصادِهِ وَ لا تُسْرِفُوا قَالَ كَانَ أَبِي ( عليه السلام ) يَقُولُ مِنَ الْإِسْرَافِ فِي الْحَصَادِ وَ الْجَدَادِ أَنْ يَصَّدَّقَ الرَّجُلُ بِكَفَّيْهِ جَمِيعاً وَ كَانَ أَبِي إِذَا حَضَرَ شَيْئاً مِنْ هَذَا فَرَأَى أَحَداً مِنْ غِلْمَانِهِ يَتَصَدَّقُ بِكَفَّيْهِ صَاحَ بِهِ أَعْطِ بِيَدٍ وَاحِدَةٍ الْقَبْضَةَ بَعْدَ الْقَبْضَةِ وَ الضِّغْثَ بَعْدَ الضِّغْثِ مِنَ السُّنْبُلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Abu Nasr, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h141\">[6:141]</a> and give the due of it on the day of its harvest and do not act extravagantly</span>. He<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> was saying: ‘From the extravagance during the harvest and replanting is that the man gives in charity with both his palms’, and it was so that whenever my<sup>asws</sup> father<sup>asws</sup> was presented something from this, and he<sup>asws</sup> saw one of his slaves giving charity with both his hands, would shout at him, ‘Give with one hand, the handful after the handful, the bale after the bale!’, from the ears of corn’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn abu Nasr who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the words of Allah, most Majestic, most Glorious, ‘. . . give His right on the day of harvest and do not be wasteful ... 5 <a href=\"/#/books/quran:6#h141\">[6:141]</a>. He (the Imam) said, ‘My father would say that wastefulness in harvest and picking up fruits is giving the beggars with both hands. When people asking for help would come and if my father had seen the slaves give them charity with both hands, he called them and told them to give with one hand a handful after handful and a bunch after bunch of the ears of wheat.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:45",
  "kind": "verse_list"
}