{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 46"
        },
        "path": "/books/al-kafi:3:5:46",
        "titles": {
          "ar": "باب صَدَقَةِ أَهْلِ الْجِزْيَةِ",
          "en": "Chapter 46 – Charity (Zakāt) of the taxpayers"
        }
      }
    ],
    "index": 816,
    "local_index": 46,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 47"
        },
        "path": "/books/al-kafi:3:5:47",
        "titles": {
          "ar": "باب نَادِرٌ",
          "en": "Chapter 47 – Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:3:5:45",
        "titles": {
          "ar": "باب الْحَصَادِ وَ الْجَدَادِ",
          "en": "Chapter 45 – The harvest and the replanting"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:46",
    "titles": {
      "ar": "باب صَدَقَةِ أَهْلِ الْجِزْيَةِ",
      "en": "Chapter 46 – Charity (Zakāt) of the taxpayers"
    },
    "verse_count": 7,
    "verse_start_index": 5955,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/122)"
        ],
        "index": 5956,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:46:1",
        "relations": {
          "Mentions": [
            "/books/quran:9:29"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا حَدُّ الْجِزْيَةِ عَلَى أَهْلِ الْكِتَابِ وَ هَلْ عَلَيْهِمْ فِي ذَلِكَ شَيْ‏ءٌ مُوَظَّفٌ لَا يَنْبَغِي أَنْ يَجُوزُوا إِلَى غَيْرِهِ فَقَالَ ذَاكَ إِلَى الْإِمَامِ أَنْ يَأْخُذَ مِنْ كُلِّ إِنْسَانٍ مِنْهُمْ مَا شَاءَ عَلَى قَدْرِ مَالِهِ بِمَا يُطِيقُ ",
          "إِنَّمَا هُمْ قَوْمٌ فَدَوْا أَنْفُسَهُمْ مِنْ أَنْ يُسْتَعْبَدُوا أَوْ يُقْتَلُوا فَالْجِزْيَةُ تُؤْخَذُ مِنْهُمْ عَلَى قَدْرِ مَا يُطِيقُونَ لَهُ أَنْ يَأْخُذَهُمْ بِهِ حَتَّى يُسْلِمُوا فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى قَالَ حَتَّى يُعْطُوا الْجِزْيَةَ عَنْ يَدٍ وَ هُمْ صاغِرُونَ وَ كَيْفَ يَكُونُ صَاغِراً وَ هُوَ لَا يَكْتَرِثُ لِمَا يُؤْخَذُ مِنْهُ حَتَّى يَجِدَ ذُلًّا لِمَا أُخِذَ مِنْهُ فَيَأْلَمَ لِذَلِكَ فَيُسْلِمَ",
          "قَالَ وَ قَالَ ابْنُ مُسْلِمٍ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَ رَأَيْتَ مَا يَأْخُذُ هَؤُلَاءِ مِنْ هَذَا الْخُمُسِ مِنْ أَرْضِ الْجِزْيَةِ وَ يَأْخُذُ مِنَ الدَّهَاقِينِ جِزْيَةَ رُءُوسِهِمْ أَ مَا عَلَيْهِمْ فِي ذَلِكَ شَيْ‏ءٌ مُوَظَّفٌ فَقَالَ كَانَ عَلَيْهِمْ مَا أَجَازُوا عَلَى أَنْفُسِهِمْ وَ لَيْسَ لِلْإِمَامِ أَكْثَرُ مِنَ الْجِزْيَةِ إِنْ شَاءَ الْإِمَامُ وَضَعَ ذَلِكَ عَلَى رُءُوسِهِمْ وَ لَيْسَ عَلَى أَمْوَالِهِمْ شَيْ‏ءٌ وَ إِنْ شَاءَ فَعَلَى أَمْوَالِهِمْ وَ لَيْسَ عَلَى رُءُوسِهِمْ شَيْ‏ءٌ ",
          "فَقُلْتُ فَهَذَا الْخُمُسُ فَقَالَ إِنَّمَا هَذَا شَيْ‏ءٌ كَانَ صَالَحَهُمْ عَلَيْهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Zurara who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is the limit of the tax upon the People of the Book, and is there anything upon them regarding that which is fixed, not befitting for it to be exceeded to something else?’ So he<sup>asws</sup> said: ‘That (determination) is up to the Imam<sup>asws</sup> if he were to take from every person from them whatever he<sup>asws</sup> so desires to in accordance with his wealth with what he can endure, until he becomes a Muslim. ",
            "But rather they are a people who expiate themselves from being enslaves or fighting (in a war), therefore the tax would be taken from them upon a measurement of what they would be enduring to it, and they would be seized with it until they do become Muslims, for Allah<sup>azwj</sup> Blessed and High Said <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h29\">[9:29]</a> until they pay the tax and they are belittled</span>. And how would he happen to be belittled if he does not care to what is taken from him (due to its low rate) until he finds humiliation to what is taken from him, so he would be hurt by that, so he would become a Muslim’. ",
            "He (the narrator) said, ‘And Ibn Muslim said, ‘I said to Abu Abdullah<sup>asws</sup>, ‘What is your view of what they (government) are taking from this fifth from a land as the taxation, and it is taken from farmer a taxation per head, is there anything fixed upon them with regards to that?’ So he<sup>asws</sup> said: ‘It was upon them what they had allowed upon their own selves, and it not for the Imam<sup>asws</sup>, more from the taxation. If the Imam<sup>asws</sup> so desires to, he<sup>asws</sup> can place that (tax) upon their heads (flat rate), and there would not be anything upon their wealth, and if he<sup>asws</sup> so desires to, so upon their wealth, and there would be nothing upon their heads (flat rate)’. ",
            "So I said, ‘So this if the fifth (Khums)’. So he<sup>asws</sup> said: ‘But rather, this is something which Rasool-Allah<sup>saww</sup> reconciled upon them’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Zurarah who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about al-Jizyah (taxes paid by a non-Muslim taxpayer) of the people of the book. Is there anything definite, which does not change? He (the Imam) said, ‘It is up to the Imam. He may receive from every one of them what he decides which they can afford in proportion to their assets. They have been spared their lives and from being exiled by their agreement to pay taxes; so al-Jizyah is received from them in proportion of their assets to the limit that they can afford to pay until they become Muslims. Allah, most Blessed, most High, has said, ‘. . . until they pay al-Jizyah with their hands with humbleness. How can they be humble if what they pay is negligible to them? Such payment must make them feel humiliated so that they accept Islam? Ibn Muslim has said that I asked abu ‘Abd Allah, ‘Alayhi al-Salam, about what they (rulers) receive as one-fifth from land of al-Jizyah, from the farmers per head. Is there anything in definite amounts?’ He (the Imam) said, ‘It was just that much which they had agreed to pay. Imam has no other choice but to receive al-Jizyah. He (the Imam) can assign it per head and not their assets or vice versa? I then asked, ‘What is the rule about this al-Khums (one-fifth)?’ He (the Imam) said, ‘This is how the Messenger of Allah had settled with them.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/122)"
        ],
        "index": 5957,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:46:2",
        "text": [
          "حَرِيزٌ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُهُ عَنْ أَهْلِ الذِّمَّةِ مَا ذَا عَلَيْهِمْ مِمَّا يَحْقُنُونَ بِهِ دِمَاءَهُمْ وَ أَمْوَالَهُمْ قَالَ الْخَرَاجُ فَإِنْ أُخِذَ مِنْ رُءُوسِهِمُ الْجِزْيَةُ فَلَا سَبِيلَ عَلَى أَرْضِهِمْ وَ إِنْ أُخِذَ مِنْ أَرْضِهِمْ فَلَا سَبِيلَ عَلَى رُءُوسِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked him<sup>asws</sup> about the ones under the responsible (Ahl Al-Zimma), ‘What is that which is upon them from what they are saving their blood and their wealth with?’ He<sup>asws</sup> said: ‘The tribute, So if the tax is taken from their heads, so there is no way upon their land, but if it is taken from their lands, so there is no way upon their heads’."
          ],
          "en.sarwar": [
            "2. Hariz has narrated from Muhammad ibn Muslim who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of non-Muslim taxpayers as to how much must they pay for the protection of their lives and properties. He (the Imam) said, ‘It is al- Kharaj. If they pay al-Jizyah per head, then there is not anything on their land and if it is taken from their land, then there is not anything on them to pay per head?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/122)"
        ],
        "index": 5958,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:46:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى جَمِيعاً عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَرَتِ السُّنَّةُ أَنْ لَا تُؤْخَذَ الْجِزْيَةُ مِنَ الْمَعْتُوهِ وَ لَا مِنَ الْمَغْلُوبِ عَلَى عَقْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, altogether, from Abdullah Bin Al Mugheira, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Sunnah flowed that the taxation would not be taken from the insane and the one overcome upon his mind’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Yahya all from ‘Abd Allah ibn al-Mughirah from Talhah ibn Zayd who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is an established Sunnah that al-Jizyah is not received from those with physical or mental conditions?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/122)"
        ],
        "index": 5959,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:46:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ أَبِي يَحْيَى الْوَاسِطِيِّ عَنْ بَعْضِ أَصْحَابِنَا قَالَ سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمَجُوسِ أَ كَانَ لَهُمْ نَبِيٌّ فَقَالَ نَعَمْ أَ مَا بَلَغَكَ كِتَابُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَى أَهْلِ مَكَّةَ أَنْ أَسْلِمُوا وَ إِلَّا نَابَذْتُكُمْ بِحَرْبٍ فَكَتَبُوا إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَنْ خُذْ مِنَّا الْجِزْيَةَ وَ دَعْنَا عَلَى عِبَادَةِ الْأَوْثَانِ فَكَتَبَ إِلَيْهِمُ النَّبِيُّ ( صلى الله عليه وآله ) أَنِّي لَسْتُ آخُذُ الْجِزْيَةَ إِلَّا مِنْ أَهْلِ الْكِتَابِ ",
          "فَكَتَبُوا إِلَيْهِ يُرِيدُونَ بِذَلِكَ تَكْذِيبَهُ زَعَمْتَ أَنَّكَ لَا تَأْخُذُ الْجِزْيَةَ إِلَّا مِنْ أَهْلِ الْكِتَابِ ثُمَّ أَخَذْتَ الْجِزْيَةَ مِنْ مَجُوسِ هَجَرَ فَكَتَبَ إِلَيْهِمُ النَّبِيُّ ( صلى الله عليه وآله ) أَنَّ الْمَجُوسَ كَانَ لَهُمْ نَبِيٌّ فَقَتَلُوهُ وَ كِتَابٌ أَحْرَقُوهُ أَتَاهُمْ نَبِيُّهُمْ بِكِتَابِهِمْ فِي اثْنَيْ عَشَرَ أَلْفَ جِلْدِ ثَوْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Abu Yahya Al Wasity, from one of our companions who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the Magians, ‘Was there a Prophet<sup>as</sup> for them?’ So he<sup>asws</sup> said: ‘Yes. Has it not reached you a letter of Rasool-Allah<sup>saww</sup> to the people of Makkah: ‘Either you become Muslims or else we shall initiate a war against you’. So they wrote to Rasool-Allah<sup>saww</sup>, ‘If you<sup>saww</sup> could take the tax from us and leave us upon the worship of the idols’. So the Prophet<sup>saww</sup> wrote to them: ‘The taxation is not to be taken except from the People of the Book’. ",
            "So they wrote to him, intending by that to belie him<sup>saww</sup>, ‘You<sup>saww</sup> are alleging that you<sup>saww</sup> do not take the taxation from except from the People of the Book, then you<sup>saww</sup> take the tax from the Magians who emigrated’. So the Prophet<sup>saww</sup> wrote to them: ‘It was so that the Magians had a Prophet<sup>as</sup> for them, but they killed him<sup>as</sup>, and (they had) a Book which they burnt. Their Prophet<sup>saww</sup> came to them with their Book in twelve thousand skins of bulls’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from abu Yahya al-Wasitiy from certain persons of our people who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the case of Zoroastrians if they had a prophet. He (the Imam) said, ‘Yes, they had a prophet. Have you not heard about the letter of the Messenger of Allah to the people of Makkah? He asked them to accept Islam, otherwise, war is declared against you. They wrote back to the Messenger of Allah asking him to receive al-Jizyah and leave them to worship their idols. The Holy prophet wrote to them, ‘I receive al-Jizyah only from the people of the book? They then wrote to him (the Messenger of Allah) to rebut him, ‘You think that you do not receive al-Jizyah except from the people of the book and then receive al-Jizyah from Majus (Zoroastrians) who have migrated? The Holy prophet wrote to them, ‘Majus had a prophet but they killed him. They had a book, which they burnt. Their prophet brought them a book on twelve thousand skins of bull? "
          ]
        }
      },
      {
        "index": 5960,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:46:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ صَدَقَاتِ أَهْلِ الْجِزْيَةِ وَ مَا يُؤْخَذُ مِنْهُمْ مِنْ ثَمَنِ خُمُورِهِمْ وَ لَحْمِ خَنَازِيرِهِمْ وَ مَيِّتِهِمْ قَالَ عَلَيْهِمُ الْجِزْيَةُ فِي أَمْوَالِهِمْ يُؤْخَذُ مِنْهُمْ مِنْ ثَمَنِ لَحْمِ الْخِنْزِيرِ أَوْ خَمْرٍ وَ كُلُّ مَا أُخِذُوا مِنْهُمْ مِنْ ذَلِكَ فَوِزْرُ ذَلِكَ عَلَيْهِمْ وَ ثَمَنُهُ لِلْمُسْلِمِينَ حَلَالٌ يَأْخُذُونَهُ فِي جِزْيَتِهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about charities (<span class=\"iTxt\">Zakāt</span> payable) by the people of the taxation (Non-Muslim taxpayers), and what would be taken from them from the price of their wines and their flesh of swine, and their carcasses’. He<sup>asws</sup> said: ‘Upon them is the taxation in their wealth taken from them from the price of the flesh of the swine, or wine, and everything what would be taken from them from that, so the burden of that would be upon them, and its price would be for the Muslims as Permissible, it being taken from their taxes’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim who has said the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about the case of al-Jizyah of taxpayers and what is received from them from their wine or flesh of pigs and dead animals. He (the Imam) said, ‘They must pay al-Jizyah which is due on their assets from the flesh of pigs and the value of their wine. Whatever is received from them, its sin is upon them, and its value is lawful for the Muslims which they receive as al-Jizyah.’ ” "
          ]
        }
      },
      {
        "index": 5961,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:46:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَرْضَ الْجِزْيَةِ لَا تُرْفَعُ عَنْهَا الْجِزْيَةُ وَ إِنَّمَا الْجِزْيَةُ عَطَاءُ الْمُهَاجِرِينَ وَ الصَّدَقَةُ لِأَهْلِهَا الَّذِينَ سَمَّى اللَّهُ فِي كِتَابِهِ وَ لَيْسَ لَهُمْ مِنَ الْجِزْيَةِ شَيْ‏ءٌ ",
          "ثُمَّ قَالَ مَا أَوْسَعَ اللَّهُ الْعَدْلَ ثُمَّ قَالَ إِنَّ النَّاسَ يَسْتَغْنُونَ إِذَا عُدِلَ بَيْنَهُمْ وَ تُنْزِلُ السَّمَاءُ رِزْقَهَا وَ تُخْرِجُ الْأَرْضُ بَرَكَتَهَا بِإِذْنِ اللَّهِ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Ibn Abu Yafour, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The taxable land, the taxation would not be lifted from it, and rather, the taxation would be given to the emigrants, and the charities (<span class=\"iTxt\">Zakāt</span>) would be for its deserving ones whom Allah<sup>azwj</sup> has Specified in His<sup>azwj</sup> Book, and there would be nothing from the taxation for them’.",
            "Then he<sup>asws</sup> said: ‘How Capacious is Allah<sup>azwj</sup>’s Justice!’ Then he<sup>asws</sup> said: ‘The people would be enriched when there would be justice between them, and the sky would send down its sustenance and the earth would bring forth its Blessings by the Permission of Allah<sup>azwj</sup> the Exalted’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from ibn abu Ya‘fur who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘al-Jizyah is not terminated (abolished) from lands subject to al-Jizyah. Al-Jizyah is a gift for the immigrants and charity (Zakat) is for its deserving beneficiaries whom Allah has named in His book. They do not have any share in al-Jizyah.’ He (the Imam) then said, ‘How vast is Allah’s justice!’ He (the Imam) then said, ‘People will become rich if justice is practiced among them, the skies send their sustenance and the earth will produce its blessings by the permission of Allah, most High.’” "
          ]
        }
      },
      {
        "index": 5962,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:46:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي أَهْلِ الْجِزْيَةِ يُؤْخَذُ مِنْ أَمْوَالِهِمْ وَ مَوَاشِيهِمْ شَيْ‏ءٌ سِوَى الْجِزْيَةِ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abu Ayoub, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the people of the taxation (taxpayers), ‘Would anything be taken from their wealth and their livelihoods besides the taxation?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Muhammad ibn Muslim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of people who pay al-Jizyah, if there is al-Jizyah on their assets and animal farms. He (the Imam) said, ‘No, al-Jizyah is not due on them as such.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:46",
  "kind": "verse_list"
}