{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 5"
        },
        "path": "/books/al-kafi:3:5",
        "titles": {
          "ar": "كِتَابُ الزَّكَاةِ",
          "en": "<a id=\"_Toc452651345\"></a>THE BOOK OF ZAKĀT "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:3:5:7",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب أَقَلِّ مَا يَجِبُ</span> فِيهِ الزَّكَاةُ مِنَ الْحَرْثِ",
          "en": "Chapter 7 – The least of what Obligates the Zakāt regarding it, from the farm"
        }
      }
    ],
    "index": 777,
    "local_index": 7,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:5:7",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب أَقَلِّ مَا يَجِبُ</span> فِيهِ الزَّكَاةُ مِنَ الْحَرْثِ",
      "en": "Chapter 7 – The least of what Obligates the Zakāt regarding it, from the farm"
    },
    "verse_count": 7,
    "verse_start_index": 5747,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/25)"
        ],
        "index": 5748,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:7:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ الزَّكَاةِ فِي الزَّبِيبِ وَ التَّمْرِ فَقَالَ فِي كُلِّ خَمْسَةِ أَوْسَاقٍ وَسْقٌ وَ الْوَسْقُ سِتُّونَ صَاعاً وَ الزَّكَاةُ فِيهِمَا سَوَاءٌ فَأَمَّا الطَّعَامُ فَالْعُشُرُ فِيمَا سَقَتِ السَّمَاءُ وَ أَمَّا مَا سُقِيَ بِالْغَرْبِ وَ الدَّوَالِي فَإِنَّمَا عَلَيْهِ نِصْفُ الْعُشْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked about the <span class=\"iTxt\">Zakāt</span> regarding the raisins and the dates, so he<sup>asws</sup> said: ‘With regards to every five Owsaaq, one Wasaq (20%), and the Wasaq is of sixty Sa’as (unit of weight), and the <span class=\"iTxt\">Zakāt</span> regarding these two is the same. But, as for the food, so it is the tenth, in what is irrigated by the sky (rain), and as for what is irrigated by the (human) energy and the buckets, so rather, upon it would be half the tenth (5%)’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash’ariy has narrated from Ahmad ibn Muhammad from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about Zakat on raisins and dates. He (the Imam) said, ‘On every five awsaq (a certain measurement) there is one wasq. One wasq is sixty Sa‘. The amount of Zakat on both items is of the same amount. Of food items what is watered by rain from the sky Zakat is one out of ten, but if it is watered with use of energy and buckets Zakat on it is one of twenty.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/26)"
        ],
        "index": 5749,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:7:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنْ صَفْوَانَ بْنِ يَحْيَى وَ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَا ذَكَرْنَا لَهُ الْكُوفَةَ وَ مَا وُضِعَ عَلَيْهَا مِنَ الْخَرَاجِ وَ مَا سَارَ فِيهَا أَهْلُ بَيْتِهِ فَقَالَ مَنْ أَسْلَمَ طَوْعاً تُرِكَتْ أَرْضُهُ فِي يَدِهِ وَ أُخِذَ مِنْهُ الْعُشْرُ مِمَّا سَقَتِ السَّمَاءُ وَ الْأَنْهَارُ وَ نِصْفُ الْعُشْرِ مِمَّا كَانَ بِالرِّشَاءِ فِيمَا عَمَرُوهُ مِنْهَا وَ مَا لَمْ يَعْمُرُوهُ مِنْهَا أَخَذَهُ الْإِمَامُ فَقَبَّلَهُ مِمَّنْ يَعْمُرُهُ وَ كَانَ لِلْمُسْلِمِينَ وَ عَلَى الْمُتَقَبِّلِينَ فِي حِصَصِهِمُ الْعُشْرُ وَ نِصْفُ الْعُشْرِ وَ لَيْسَ فِي أَقَلَّ مِنْ خَمْسَةِ أَوْسَاقٍ شَيْ‏ءٌ مِنَ الزَّكَاةِ",
          "وَ مَا أُخِذَ بِالسَّيْفِ فَذَلِكَ إِلَى الْإِمَامِ يُقَبِّلُهُ بِالَّذِي يَرَى كَمَا صَنَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِخَيْبَرَ قَبَّلَ سَوَادَهَا وَ بَيَاضَهَا يَعْنِي أَرْضَهَا وَ نَخْلَهَا وَ النَّاسُ يَقُولُونَ لَا يَصْلُحُ قَبَالَةُ الْأَرْضِ وَ النَّخْلِ وَ قَدْ قَبَّلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) خَيْبَرَ وَ عَلَى الْمُتَقَبِّلِينَ سِوَى قَبَالَةِ الْأَرْضِ الْعُشْرُ وَ نِصْفُ الْعُشْرِ فِي حِصَصِهِمْ ",
          "وَ قَالَ إِنَّ أَهْلَ الطَّائِفِ أَسْلَمُوا وَ جَعَلُوا عَلَيْهِمُ الْعُشْرَ وَ نِصْفَ الْعُشْرِ وَ إِنَّ أَهْلَ مَكَّةَ دَخَلَهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنْوَةً فَكَانُوا أُسَرَاءَ فِي يَدِهِ فَأَعْتَقَهُمْ وَ قَالَ اذْهَبُوا فَأَنْتُمُ الطُّلَقَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad in Muhammad Bin Isa, from Ali Bin Ahmad Bin Asheym, from Safwan Bin Yahya and Ahmad Bin Muhammad Bin Abu Nasr who both said, ",
            "‘We mentioned Al-Kufa to him<sup>asws</sup> and what taxation had been placed upon it, and what his<sup>asws</sup> family members had gone to. So he<sup>asws</sup> said: ‘The one who became a Muslim voluntarily, his land was left to be in his hands, and the tenth is taken from him from what is irrigated by the sky and the rivers, and half of the tenth (5%) is taken from what was (irrigated by) the sprinkling in what they had revived from it; and whatever they did not revive from it, the Imam<sup>asws</sup> would take it and contract it with the ones who do revive it. And it was so for the Muslims and upon the vendors in their shares, the tenth and half the tenth, and there was no <span class=\"iTxt\">Zakāt</span> regarding less than five Owsaqs.",
            "And whatever is taken by the sword, so that is up to the Imam<sup>asws</sup>. He<sup>asws</sup> would contract it with one whom he<sup>asws</sup> sees fit to, just as Rasool-Allah<sup>saww</sup> had done with Khyber. He<sup>saww</sup> contracted its black and its white, meaning its land and its palm trees, and the people were saying, ‘It is not correct to contract the land and the palm trees’; and Rasool-Allah<sup>saww</sup> had contracted Khyber, and upon the contractees, besides the contract of the land, was the tenth and half the tenth in their shares.",
            "And he<sup>asws</sup> said: ‘The people of Al-Taif became Muslims, and the one-tenth and half of the one-tenth was made to be upon them, the people of Makkah, Rasool-Allah<sup>saww</sup> entered it forcibly. Thus, they were captives in his<sup>saww</sup> hands, but he<sup>asws</sup> freed them and said: ‘Go, for you are all free!’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn Ahmad ibn ‘Ushaym from Safwan ibn Yahya and Ahmad ibn Muhammad from ibn abu Nasr who has said the following: “Once we spoke to him (the Imam) about al-Kufah and of taxes levied and where his family has moved. He (the Imam) said, ‘Those who willingly accepted Islam their land was left in their hands. One out of ten is received from them for what is watered from the sky and canals. There is one out of twenty for what is watered by means of drawing water of what they have revived. What is not revived is under the authority of Imam who contracts with those who revive it. The share of the Muslims on the contractors is one out of ten or one out of twenty and Zakat is not due on what is less than twenty Awsaq. Whatever land is taken by the sword (Armed forces), it belong to the Imam who contracts it with whomever he deems proper, just as the Messenger of Allah did with the land of Khaybar and its black and white, its land and gardens. People would say land and palm trees are not proper for contract. The Messenger of Allah contracted the land of Khaybar and the contractors were to pay one out of ten or one out of twenty.’ He (the Imam) said, ‘People of Ta’if accepted Islam and they were to pay one out of ten or one out of twenty. There is the case of people of Makkah, where the Messenger of Allah entered by force, who became his captives, he set them free. Saying, “Go, you are set free.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/27)"
        ],
        "index": 5750,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:7:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فِي الصَّدَقَةِ فِيمَا سَقَتِ السَّمَاءُ وَ الْأَنْهَارُ إِذَا كَانَ سَيْحاً أَوْ كَانَ بَعْلًا الْعُشْرُ وَ مَا سَقَتِ السَّوَانِي وَ الدَّوَالِي أَوْ سُقِيَ بِالْغَرْبِ فَنِصْفُ الْعُشْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, altogether from Ibn Abu Umeyr, from Hammad, from Halby who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Regarding the charity in what the sky and the rivers irrigate when it was arid or it was un-watered, is the one-tenth, and whatever is irrigated by the scoops and the buckets, or irrigated by the human energy, so it is half of the one-tenth’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa all from ibn abu ‘Umayr from Hammad from al-Halabiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Zakat on what is watered by canals or rain from the sky, is one out of ten and on what is watered by means of scoops and buckets and what trickles thereby is one out of twenty.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/27)"
        ],
        "index": 5751,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:7:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ أَبِي بَصِيرٍ وَ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُمَا قَالَا لَهُ هَذِهِ الْأَرْضُ الَّتِي يُزَارِعُ أَهْلُهَا مَا تَرَى فِيهَا فَقَالَ كُلُّ أَرْضٍ دَفَعَهَا إِلَيْكَ السُّلْطَانُ فَمَا حَرَثْتَهُ فِيهَا فَعَلَيْكَ فِيمَا أَخْرَجَ اللَّهُ مِنْهَا الَّذِي قَاطَعَكَ عَلَيْهِ وَ لَيْسَ عَلَى جَمِيعِ مَا أَخْرَجَ اللَّهُ مِنْهَا الْعُشْرُ إِنَّمَا عَلَيْكَ الْعُشْرُ فِيمَا يَحْصُلُ فِي يَدِكَ بَعْدَ مُقَاسَمَتِهِ لَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Biin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Abu Baseer and Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, they both having said to him<sup>asws</sup>, ‘This land which its owners tend to plough, what do you see with regards to it?’ So he<sup>asws</sup> said: ‘Every land which the Sultan (ruling authority) hands over to you (under a farming contract), so whatever you cultivate in it, so upon you would be (to pay) regarding what Allah<sup>azwj</sup> Brings forth from it (harvest), that which has been your piece of land, and it is not upon the entirety of what Allah<sup>azwj</sup> Brings forth from it, the one-tenth, but rather, upon you is the one-tenth in what arrives in your hands after the distribution (of your share) to you’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from abu Basir and Muhammad ibn Muslim who has said the following: “The two of them asked abu Ja’far, ‘Alayhi al-Salam, about the land cultivated by the people. He (the Imam) said, ‘If you contract such land from government then out of what Allah makes it grow, comes your share according to the terms of the contract. One out of ten is not payable from its gross harvest. One out of ten is due on your net dividend.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (16/28)"
        ],
        "index": 5752,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:7:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْبَرْقِيِّ عَنْ سَعْدِ بْنِ سَعْدٍ الْأَشْعَرِيِّ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ أَقَلِّ مَا يَجِبُ فِيهِ الزَّكَاةُ مِنَ الْبُرِّ وَ الشَّعِيرِ وَ التَّمْرِ وَ الزَّبِيبِ فَقَالَ خَمْسَةُ أَوْسَاقٍ بِوَسْقِ النَّبِيِّ ( صلى الله عليه وآله ) فَقُلْتُ كَمِ الْوَسْقُ قَالَ سِتُّونَ صَاعاً قُلْتُ فَهَلْ عَلَى الْعِنَبِ زَكَاةٌ أَوْ إِنَّمَا تَجِبُ عَلَيْهِ إِذَا صَيَّرَهُ زَبِيباً قَالَ نَعَمْ إِذَا خَرَصَهُ أَخْرَجَ زَكَاتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Barqy, from Sa’ad Bin Sa’ad Al Ashary who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the least what would Obligated the <span class=\"iTxt\">Zakāt</span>, from the wheat, and the barley, and the dates, and the raisins. So he<sup>asws</sup> said: ‘Five Owsaaq by the Wasaq of the Prophet<sup>saww</sup>’. So I said, ‘How much is the Wasaq?’ He<sup>asws</sup> said: ‘Sixty Sa’as’. I said, ‘So is there <span class=\"iTxt\">Zakāt</span> upon the grapes, or rather it would be Obligated upon it when it does become a raisin’. He<sup>asws</sup> said: ‘Yes, when it is estimated, its <span class=\"iTxt\">Zakāt</span> would be taken out’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad from al-Barqiy from Sa‘d ibn Sa‘d al-Ash’ariy who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the minimum Zakat due on wheat, barley, dates and raisins. He (the Imam) said, ‘It is one wasaq out of five Awsaq of wasq of the Holy prophet.’ I then asked, ‘How much is wasaq?’ He (the Imam) said, ‘It is sixty Sa‘.’ I then asked, ‘Is there Zakat on grapes or that there is Zakat on it only when it is turned into raisins. He (the Imam) said, ‘Yes, when he estimates it then pays its Zakat.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/28)"
        ],
        "index": 5753,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:7:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ شُرَيْحٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِيمَا سَقَتِ السَّمَاءُ وَ الْأَنْهَارُ أَوْ كَانَ بَعْلًا الْعُشْرُ وَ أَمَّا مَا سَقَتِ السَّوَانِي وَ الدَّوَالِي فَنِصْفُ العُشْرِ فَقُلْتُ لَهُ فَالْأَرْضُ تَكُونُ عِنْدَنَا تُسْقَى بِالدَّوَالِي ثُمَّ يَزِيدُ الْمَاءُ فَتُسْقَى سَيْحاً فَقَالَ وَ إِنَّ ذَا لَيَكُونُ عِنْدَكُمْ كَذَلِكَ قُلْتُ نَعَمْ قَالَ النِّصْفُ وَ النِّصْفُ نِصْفٌ بِنِصْفِ الْعُشْرِ وَ نِصْفٌ بِالْعُشْرِ ",
          "فَقُلْتُ الْأَرْضُ تُسْقَى بِالدَّوَالِي ثُمَّ يَزِيدُ الْمَاءُ فَتُسْقَى السَّقْيَةَ وَ السَّقْيَتَيْنِ سَيْحاً قَالَ وَ فِي كَمْ تُسْقَى السَّقْيَةَ وَ السَّقْيَتَيْنِ سَيْحاً قُلْتُ فِي ثَلَاثِينَ لَيْلَةً أَوْ أَرْبَعِينَ لَيْلَةً وَ قَدْ مَضَتْ قَبْلَ ذَلِكَ فِي الْأَرْضِ سِتَّةَ أَشْهُرٍ سَبْعَةَ أَشْهُرٍ قَالَ نِصْفُ الْعُشْرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muawiya Bin Shurayh, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘With regards to whatever is irrigated by the sky and the rivers, or if it was un-watered, is the one-tenth (10%), and as for what the scooping and the buckets irrigate, so it is half of the one-tenth (5%)’. So I said to him<sup>asws</sup>, ‘But the land which happens to be with us, we irrigate by the buckets, then the water increases, so the rivers irrigate it’. So he<sup>asws</sup> said: ‘And is that what is happening with you, like that?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘The half and the half. Half being with half of the one-tenth, and half being with the one-tenth’.",
            "So I said, ‘The land irrigated by the buckets, then the water increases, so it gets irrigated by the irrigation, and the two irrigations by the canal’ He<sup>asws</sup> said: ‘And in how much is the irrigation, of the one irrigation and the two irrigations of the canal?’ I said, ‘In thirty nights, or forty nights, and it has passed before that in the land, six months, seven months’. He<sup>asws</sup> said: ‘Half of the one-tenth’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Mu‘awiyah ibn Shurayh who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘Zakat is one out of ten on what is watered from canals or rain from the sky and it is one out of twenty on what is watered by means of scoops and buckets. I then said that we have a certain piece of land, which is watered, by means of buckets, then water increases and it then is watered from canals. He (the Imam) asked, ‘Is it how it is with you?’ I replied, ‘Yes, that is how it is.’ He (the Imam) said, ‘It then is half and half. Zakat on one half is one out of ten and on the other half it is one out of twenty.’ I then said, ‘There is a piece of land which is watered by means of buckets and then water increases, it then is watered once or twice from canals.’ He (the Imam) asked, ‘Within what time once or twice watering takes place?’ I replied, ‘It happens within thirty or forty nights and before it a period of six or seven months has passed. He (the Imam) said, ‘It (Zakat) is one out of twenty.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (6/29)"
        ],
        "index": 5754,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:5:7:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ التَّمْرِ وَ الزَّبِيبِ مَا أَقَلُّ مَا تَجِبُ فِيهِ الزَّكَاةُ فَقَالَ خَمْسَةُ أَوْسَاقٍ وَ يُتْرَكُ مِعَى فَأْرَةٍ وَ أُمُّ جُعْرُورٍ لَا يُزَكَّيَانِ وَ إِنْ كَثُرَا وَ يُتْرَكُ لِلْحَارِسِ الْعَذْقُ وَ الْعَذْقَانِ وَ الْحَارِسُ يَكُونُ فِي النَّخْلِ يَنْظُرُهُ فَيُتْرَكُ ذَلِكَ لِعِيَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the dates and the raisins, what is the least what would Obligate the <span class=\"iTxt\">Zakāt</span> with regards to it?’ So he<sup>asws</sup> said: ‘Five Owsaaqs, and the Faratin and Umm Jarour (two types) would be left out, not purified (<span class=\"iTxt\">Zakāt</span> not paid), and even if these were numerous; and the bunch and the two bunches would be left for the guard who happens to be among the palm trees watching out, so it would be left for his dependents’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about dates and raisins and the minimum amount on which Zakat is due. He (the Imam) said, ‘It is five Awsaq. Zakat is not due on Mi‘afarah and ‘Umm al-Ja’rur (two undesirable kinds of dates) even if it is of a large quantity. One or two tree is left for the guard who looks after them and he leaves it for his family.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:5:7",
  "kind": "verse_list"
}