{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:7:2:10",
        "titles": {
          "ar": "بَابُ الْعِلَّةِ فِي أَنَّ السِّهَامَ لَا تَكُونُ أَكْثَرَ مِنْ سِتَّةٍ وَ هُوَ مِنْ كَلَامِ يُونُس‏",
          "en": "9. The Reason Why Ordained Shares are not more than Six"
        }
      }
    ],
    "index": 2036,
    "local_index": 10,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:10",
    "titles": {
      "ar": "بَابُ الْعِلَّةِ فِي أَنَّ السِّهَامَ لَا تَكُونُ أَكْثَرَ مِنْ سِتَّةٍ وَ هُوَ مِنْ كَلَامِ يُونُس‏",
      "en": "9. The Reason Why Ordained Shares are not more than Six"
    },
    "verse_count": 0,
    "verse_start_index": 13224,
    "verse_translations": [
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح موقوف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/127)"
        ],
        "part_type": "Hadith",
        "text": [
          "1- عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ قَالَ الْعِلَّةُ فِي وَضْعِ السِّهَامِ عَلَى سِتَّةٍ لا أَقَلَّ وَلا أَكْثَرَ لِعِلَّةِ وُجُوهِ أَهْلِ الْمِيرَاثِ لأنَّ الْوُجُوهَ الَّتِي مِنْهَا سِهَامُ الْمَوَارِيثِ سِتَّةُ جِهَاتٍ لِكُلِّ جِهَةٍ سَهْمٌ فَأَوَّلُ جِهَاتِهَا سَهْمُ الْوَلَدِ وَالثَّانِي سَهْمُ الأبِ وَالثَّالِثُ سَهْمُ الأمِّ وَالرَّابِعُ سَهْمُ الْكَلالَةِ كَلالَةِ الأبِ وَالْخَامِسُ سَهْمُ كَلالَةِ الأمِّ وَالسَّادِسُ سَهْمُ الزَّوْجِ وَالزَّوْجَةِ فَخَمْسَةُ أَسْهُمٍ مِنْ هَذِهِ السِّهَامِ السِّتَّةِ سِهَامُ الْقَرَابَاتِ وَالسَّهْمُ السَّادِسُ هُوَ سَهْمُ الزَّوْجِ وَالزَّوْجَةِ مِنْ جِهَةِ الْبَيِّنَةِ وَالشُّهُودِ فَهَذِهِ عِلَّةُ مَجَارِي السِّهَامِ وَإِجْرَائِهَا مِنْ سِتَّةِ أَسْهُمٍ لا يَجُوزُ أَنْ يُزَادَ عَلَيْهَا وَلا يَجُوزُ أَنْ يُنْقَصَ مِنْهَا إِلا عَلَى جِهَةِ الرَّدِّ لأنَّهُ لا حَاجَةَ إِلَى زِيَادَةٍ فِي السِّهَامِ لأنَّ السِّهَامَ قَدِ اسْتَغْرَقَهَا سِهَامُ الْقَرَابَةِ وَلا قَرَابَةَ غَيْرُ مَنْ جَعَلَ اللهُ عَزَّ وَجَلَّ لَهُمْ سَهْماً فَصَارَتْ سِهَامُ الْمَوَارِيثِ مَجْمُوعَةً فِي سِتَّةِ أَسْهُمٍ مَخْرَجَ كُلِّ مِيرَاثٍ مِنْهَا فَإِذَا اجْتَمَعَتِ السِّهَامُ السِّتَّةُ لِلَّذِينَ سَمَّى اللهُ لَهُمْ سَهْماً فَكَانَ لِكُلِّ مُسَمًّى لَهُ سَهْمٌ عَلَى جِهَةِ مَا سُمِّيَ لَهُ فَكَانَ فِي اسْتِغْرَاقِهِ سَهْمَهُ اسْتِغْرَاقٌ لِجَمِيعِ السِّهَامِ لاجْتِمَاعِ جَمِيعِ الْوَرَثَةِ الَّذِينَ يَسْتَحِقُّونَ جَمِيعَ السِّهَامِ السِّتَّةِ وَحُضُورِهِمْ فِي الْوَقْتِ الَّذِي فَرَضَ اللهُ لَهُمْ فِي مِثْلِ ابْنَتَيْنِ وَأَبَوَيْنِ فَكَانَ لِلابْنَتَيْنِ أَرْبَعَةُ أَسْهُمٍ وَكَانَ لِلأبَوَيْنِ سَهْمَانِ فَاسْتَغْرَقُوا السِّهَامَ كُلَّهَا وَلَمْ يَحْتَجْ أَنْ يُزَادَ فِي السِّهَامِ وَلا يُنْقَصَ فِي هَذَا الْمَوْضِعِ إِذْ لا وَارِثَ فِي هَذَا الْوَقْتِ غَيْرُ هَؤُلاءِ مَعَ هَؤُلاءِ وَكَذَلِكَ كُلُّ وَرَثَةٍ يَجْتَمِعُونَ فِي الْمِيرَاثِ فَيَسْتَغْرِقُونَهُ يَتِمُّ سِهَامُهُمْ بِاسْتِغْرَاقِهِمْ تَمَامَ السِّهَامِ وَإِذَا تَمَّتْ سِهَامُهُمْ وَمَوَارِيثُهُمْ لَمْ يَجُزْ أَنْ يَكُونَ هُنَاكَ وَارِثٌ يَرِثُ بَعْدَ اسْتِغْرَاقِ سِهَامِ الْوَرَثَةِ كَمَلا الَّتِي عَلَيْهَا الْمَوَارِيثُ فَإِذَا لَمْ يَحْضُرْ بَعْضُ الْوَرَثَةِ كَانَ مَنْ حَضَرَ مِنَ الْوَرَثَةِ يَأْخُذُ سَهْمَهُ الْمَفْرُوضَ ثُمَّ يَرُدُّ مَا بَقِيَ مِنْ بَقِيَّةِ السِّهَامِ عَلَى سِهَامِ الْوَرَثَةِ الَّذِينَ حَضَرُوا بِقَدْرِهِمْ لأنَّهُ لا وَارِثَ مَعَهُمْ فِي هَذَا الْوَقْتِ غَيْرُهُمْ."
        ],
        "translations": {
          "en.sarwar": [
            "1. (Translator’s Note: This passage is of the words of Yunus, not a Hadith from ’ A’immah ‘Alayhim al- Salam, thus, it is not translated.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:10",
  "kind": "verse_list"
}