{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:7:2:14",
        "titles": {
          "ar": "باب مِيرَاثِ وَلَدِ الْوَلَدِ",
          "en": "Chapter 12 – Inheritance of the child of the child (grandchild)"
        }
      }
    ],
    "index": 2040,
    "local_index": 14,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:7:2:15",
        "titles": {
          "ar": "باب مِيرَاثِ الْأَبَوَيْنِ",
          "en": "Chapter 13 – Inheritance of the parents"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:7:2:13",
        "titles": {
          "ar": "باب مِيرَاثِ الْوَلَدِ",
          "en": "Chapter 11 – Inheritance of the children"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:14",
    "titles": {
      "ar": "باب مِيرَاثِ وَلَدِ الْوَلَدِ",
      "en": "Chapter 12 – Inheritance of the child of the child (grandchild)"
    },
    "verse_count": 4,
    "verse_start_index": 13240,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/134)"
        ],
        "index": 13241,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ سَعْدِ بْنِ أَبِي خَلَفٍ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ بَنَاتُ الِابْنَةِ يَقُمْنَ مَقَامَ الْبِنْتِ إِذَا لَمْ يَكُنْ لِلْمَيِّتِ بَنَاتٌ وَ لَا وَارِثٌ غَيْرُهُنَّ وَ بَنَاتُ الِابْنِ يَقُمْنَ مَقَامَ الِابْنِ إِذَا لَمْ يَكُنْ لِلْمَيِّتِ بَنَاتٌ أَوْلَادٌ وَ لَا وَارِثٌ غَيْرُهُنَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Sa’ad Bin Abu Khalaf, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> the first having said: ‘Daughters of the daughter stand in the place of the daughter when there does not happen to be any daughters for the deceased, and no one else would inherit apart from them; and daughters of the son would stand in place of the son when there does not happen to be any daughter for the deceased, or any son, and no one else would inherit apart from them’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from ibn Mahbub from Sa‘d ibn abu Khalaf who has narrated the following: “Abu al-Hassan, al-Awwal, ‘Alayhi al-Salam, has said, ‘Granddaughters replace their mother if the deceased does not leave behind any daughters and there is no other heir. Daughters of one’s son replace one’s son if the deceased does not leave behind any daughters of children and there are no other heirs besides them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/135)"
        ],
        "index": 13242,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:14:2",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ سُكَيْنٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ ابْنُ الِابْنِ يَقُومُ مَقَامَ أَبِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Sukeyn, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A son of the son would stand in the place of his father’."
          ],
          "en.sarwar": [
            "2. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from Muhammad ibn Sukayn from Ishaq ibn ‘Ammar who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Grandchildren take the place of their father.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/135)"
        ],
        "index": 13243,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:14:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَنَاتُ الِابْنَةِ يَرِثْنَ إِذَا لَمْ تَكُنْ بَنَاتٌ كُنَّ مَكَانَ الْبَنَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Daughters of the daughter would inherit when there does not happen to be daughters, they would be in the place of the daughters’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from ‘Abd al-Rahman ibn al-Hajjaj who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Granddaughters from the daughter’s side take the place of their mother if other daughters of the deceased do not exist.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/135)"
        ],
        "index": 13244,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:14:4",
        "relations": {
          "Mentions": [
            "/books/quran:4:23",
            "/books/quran:4:22"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَنَاتُ الِابْنَةِ يَقُمْنَ مَقَامَ الِابْنَةِ إِذَا لَمْ تَكُنْ لِلْمَيِّتِ بَنَاتٌ وَ لَا وَارِثٌ غَيْرُهُنَّ وَ بَنَاتُ الِابْنِ يَقُمْنَ مَقَامَ الِابْنِ إِذَا لَمْ يَكُنْ لِلْمَيِّتِ وَلَدٌ وَ لَا وَارِثٌ غَيْرُهُنَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazal Bin Shazaan, from Safwaan, from Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The daughters of the daughter stand in the place of the daughter when there does not happen to be daughters for the deceased, and no one else would inherit apart from them; and the daughters of the son would stand in place of the son when there does not happen to be a son for the deceased, and no one else would inherit apart from them’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan Safwan from ‘Abd al-Rahman ibn al-Hajjaj who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Granddaughters from the daughter’s side keep the place of their mother if the deceased does not leave behind other daughters and there is no other heir besides them. Daughters of one’s son take the place of their father if the deceased does not leave behind a son and no one else inherits with them.’ “Al-Fadl has said, ‘Grandsons always keep the place of a deceased’s son; if a son from his seed does not exist [and] with them no one inherits except the parents of the deceased and husband and wife.’ If a deceased leaves behind a grandson and granddaughter from his son the legacy is given to them with the male receiving twice as much as the share of a female. ‘If a deceased leaves behind a grandson from the side of his son and a granddaughter from the side of his daughter the grandson from the side of the son receives two-thirds and the granddaughter from the side of the daughter receives one-third. ‘If a deceased leaves behind a granddaughter from his son and a granddaughter from his daughter, the granddaughter from his son receives two-thirds of the legacy and the granddaughter from his daughter receives one-third of the legacy. The rule in such case is like the rule for sons and daughters from one’s seed, for the children of one’s son is two-thirds and for the children of daughters is one-third. If a deceased leaves behind three sons or daughters of whom certain ones are of the next generation; the legacy in such case belongs to the generation before it. The next generation does not inherit anything because of the closest generation. The same is the case when all of them are daughters and in the next generation there is a boy, then the entire legacy belongs to the generation before, not for the next generation; the generation closer to the deceased is more deserving of the legacy. An example of this is when a deceased leaves behind a grandson from his daughter and a great grandson from the daughter of his son. The legacy in this case belongs to the grandson from his daughter because he is the closest to the deceased. So also is the case if a deceased leaves behind daughter of his daughter and son of the daughter of his son. In this case, the legacy belongs to the daughter of his daughter because she is closest to the deceased. The same is the case when a deceased leaves behind a daughter of his daughter and his great grandson, in which case the entire legacy belongs to the granddaughter; she is of closest generation. The same is the case also if a deceased leaves behind a grandson from his daughter and granddaughter from his daughter, a woman and other relatives. The woman’s share is one-eighth and the remaining is distributed between the granddaughter and grandson from his daughter; for each male twice as much as the share of a female. Thus, the legacy is made into twenty- four shares, one-eighth for the woman, which is three shares, for the granddaughter seven shares and for the grandson from the daughter fourteen shares. ‘If a deceased leaves behind a husband, a granddaughter from his daughter and a grandson from his daughter, the share of the husband is one-fourth and the rest of the legacy belongs to the granddaughter and grandson; each male’s share twice the share of the female which can be taken from four shares. The husband receives one share, the grandson from his daughter receives two shares and the granddaughter from his daughter receives one share. ‘If a deceased leaves behind a son of her daughter, the son of her son and her husband, the husband receives one-fourth and the rest belongs to the son of her daughter and the son of her son. The share of the son of her daughter is the share of his mother, which is one-third. The share of the son of her son is the share of her son, which is two-thirds, and this also can be distributed from four shares. ‘If a deceased leaves behind a husband and a daughter of her daughter the share of the husband is one- fourth and the rest of the legacy belongs to the daughter of her daughter. ‘If a deceased leaves behind a daughter of a daughter and both parents, then the share of parents are two-sixths. The share of a daughter of a daughter is one-half. The one remaining share is given to them as the remaining returned proportionate to their shares. Thus, the remaining is made into five parts of which the parents receive two shares and the daughter of the daughter receives three shares. If a deceased leaves behind a son of a daughter and both parents whose shares are two-sixths and the share of the son of the daughter is one-half which also can be distributed from five shares of which two shares are for the parents and three shares are for the son of the daughter. ‘If a deceased leaves behind a daughter of a son and both parents whose share is two-sixths and the remaining belongs to the daughter of the son, and this can be divided from six shares, of which two shares are for the parents and four shares for the daughter of the son.’ “Al-Fadl has said that one proof of the mistake that people make is in matters of inheritance of the children of daughters. They consider the children of daughters like the children of man from his seed in all rules except in inheritance. In this case they in consensus all say that wife of the son of the daughter is not lawful for a man or the wife of the son of son of a daughter. It is because of the words of Allah, most Majestic, most Glorious . . women lawful for your sons who are from your seed.’ <a href=\"/#/books/quran:4#h23\">[4:23]</a> If in this case the son of the daughter is the son of a man from his seed; why does it not apply in inheritance to the son of the daughter? So also they have said, ‘If a man divorces his wife before going to bed with her; that women is not lawful for the son of his daughter because of the words of Allah, most Majestic, most Glorious, ‘. . .do not marry whom your fathers (ancestors) have married of women.’ <a href=\"/#/books/quran:4#h22\">[4:22]</a> How then has man here become the father of the son of his daughter and he does not become his father in matters of inheritance? So also, they have said, ‘It is unlawful to marry a woman who was married to the son of one’s daughter.’ In the same way, they have said that if one testifies for the father of one’s mother or for the son of a daughter, his testimony and similar testimony is not acceptable in many of their judgments. When they come to the issue of inheritance they say that the son of a daughter is not considered as one’s son and he is not considered his father, because of their following their ancestors who wanted to invalidate al-Hassan and al-Husayn, ‘Alayhi al-Salam, because of their mother but Allah is the supporter. This is what Allah has stated in His book in His words, ‘To everyone We gave guidance and We guided Nuh before and of the offspring of Dawud and Sulayman and Ayyub . . . and Jesus and ‘Ilyas qhow were all pious people.’ (6:84-85) He has called Jesus from the descendents of Adam and Nuh when he is the son of a daughter because Jesus had no father; then why is it that the children of a daughter of a man are not considered as one’s children? Yes, it is true if they want fairness and the truth, only Allah grants good opportunity.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:14",
  "kind": "verse_list"
}