{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:7:2:16",
        "titles": {
          "ar": "باب مِيرَاثِ الْأَبَوَيْنِ مَعَ الْإِخْوَةِ وَ الْأَخَوَاتِ لِأَبٍ وَ الْإِخْوَةِ وَ الْأَخَوَاتِ لِأُمٍّ",
          "en": "Chapter 14 – Inheritance of the two parents with the brothers and sisters of the father, and the brothers and sisters of the mother"
        }
      }
    ],
    "index": 2042,
    "local_index": 16,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:7:2:17",
        "titles": {
          "ar": "باب مِيرَاثِ الْوَلَدِ مَعَ الْأَبَوَيْنِ",
          "en": "Chapter 15 – Inheritance of the son with the two parents"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:7:2:15",
        "titles": {
          "ar": "باب مِيرَاثِ الْأَبَوَيْنِ",
          "en": "Chapter 13 – Inheritance of the parents"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:16",
    "titles": {
      "ar": "باب مِيرَاثِ الْأَبَوَيْنِ مَعَ الْإِخْوَةِ وَ الْأَخَوَاتِ لِأَبٍ وَ الْإِخْوَةِ وَ الْأَخَوَاتِ لِأُمٍّ",
      "en": "Chapter 14 – Inheritance of the two parents with the brothers and sisters of the father, and the brothers and sisters of the mother"
    },
    "verse_count": 7,
    "verse_start_index": 13247,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/139)"
        ],
        "index": 13248,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/227",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ جَمِيعاً عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:16:1",
        "text": [
          " قُلْتُ لِزُرَارَةَ إِنَّ أُنَاساً حَدَّثُونِي عَنْهُ يَعْنِي أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ عَنْ أَبِيهِ ( عليه السلام ) بِأَشْيَاءَ فِي الْفَرَائِضِ فَأَعْرِضُهَا عَلَيْكَ فَمَا كَانَ مِنْهَا بَاطِلًا فَقُلْ هَذَا بَاطِلٌ وَ مَا كَانَ مِنْهَا حَقّاً فَقُلْ هَذَا حَقٌّ وَ لَا تَرْوِهِ وَ اسْكُتْ وَ قُلْتُ لَهُ حَدَّثَنِي رَجُلٌ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي أَبَوَيْنِ وَ إِخْوَةٍ لِأُمٍّ أَنَّهُمْ يَحْجُبُونَ وَ لَا يَرِثُونَ ",
          "فَقَالَ هَذَا وَ اللَّهِ هُوَ الْبَاطِلُ وَ لَكِنِّي سَأُخْبِرُكَ وَ لَا أَرْوِي لَكَ شَيْئاً وَ الَّذِي أَقُولُ لَكَ هُوَ وَ اللَّهِ الْحَقُّ إِنَّ الرَّجُلَ إِذَا تَرَكَ أَبَوَيْهِ فَلِلْأُمِّ الثُّلُثُ وَ لِلْأَبِ الثُّلُثَانِ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ فَإِنْ كَانَ لَهُ إِخْوَةٌ يَعْنِي لِلْمَيِّتِ يَعْنِي إِخْوَةً لِأَبٍ وَ أُمٍّ أَوْ إِخْوَةً لِأَبٍ فَلِأُمِّهِ السُّدُسُ وَ لِلْأَبِ خَمْسَةُ أَسْدَاسٍ وَ إِنَّمَا وُفِّرَ لِلْأَبِ مِنْ أَجْلِ عِيَالِهِ وَ أَمَّا الْإِخْوَةُ لِأُمٍّ لَيْسُوا لِأَبٍ فَإِنَّهُمْ لَا يَحْجُبُونَ الْأُمَّ عَنِ الثُّلُثِ وَ لَا يَرِثُونَ",
          "وَ إِنْ مَاتَ رَجُلٌ وَ تَرَكَ أُمَّهُ وَ إِخْوَةً وَ أَخَوَاتٍ لِأُمٍّ وَ أَبٍ وَ إِخْوَةً وَ أَخَوَاتٍ لِأَبٍ وَ إِخْوَةً وَ أَخَوَاتٍ لِأُمٍّ وَ لَيْسَ الْأَبُ حَيّاً فَإِنَّهُمْ لَا يَرِثُونَ وَ لَا يَحْجُبُونَهَا لِأَنَّهُ لَمْ يُورَثْ كَلَالَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Isa, from Yunus, altogether from Umar Bin Azina who said, ",
            "‘I said to Zurara that people are narrating to me from him<sup>asws</sup>, meaning Abu Abdullah<sup>asws</sup>, and from his<sup>asws</sup> father<sup>asws</sup>, with things regarding the Obligations (legislated shares of inheritance), so I will present these to you. So whatever was false from it, so say that this is false, and whatever was true from these, so say that this is true, and do not report it and remain silent’. And I said to him, ‘A man narrated to me from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding two parents and brothers of the (side of the) mother, and that they are blocked (barred) and will not be inheriting’.",
            "So he said, ‘This, by Allah<sup>azwj</sup>, it is false, but I shall be informing you and I will not be reporting to you anything, and that which I am saying to you, other than, by Allah<sup>azwj</sup>, what is the truth. ",
            "If a (deceased) man, leaves behind two parents, so for the mother is the one-third and for the father is the two-thirds in the Book of Allah<sup>azwj</sup> Mighty and Majestic. So if there were brothers for him, meaning for the deceased, (and the) brothers of the father, and the mother, or a sister of the father. So for his mother is the one-sixth, and for the father is the five-sixth. But rather it is for the father due to his dependents. And as for the brother of the (side of the) mother, not of the father, so they do not block from the mother of her the one-third, nor are they inheriting (anything).",
            "And if the man dies and leaves his mother, and brothers and sisters of the mother and father, and brothers and sisters of the father, and brothers and sisters of the mother, and the father is not alive, so they would not be inheriting, nor would they be barring it, because a ‘<span class=\"iTxt\">Kalala</span>’ (a person who has neither parents nor offspring – 4:176) does not inherit’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn ‘Isa from Yunus all from ‘Umar ibn ’Udhaynah who has narrated the following: “I once said to Zurarah, \"Certain people have narrated to me from him (abu ‘Abd Allah, ‘Alayhi al- Salam ) and from his father, ‘Alayhi al-Salam, about certain things regarding the ordained shares. I like to show them to you so you can tell me which is false and which is right and do not narrate this (what is false) and remain quiet.’ I said, \"A man narrated from one of the two Imam, (abu Ja‘far or abu \"Abd Allah), ‘Alayhim al-Salam, about both parents and brothers from the side of mother that they are barred and do not inherit.’ He said, \"This by Allah is false. I will inform you, do not narrate as such. What I say by Allah is the truth. If a deceased leaves behind his parents, the share of the mother is one-third and the father receives two-thirds according to the book of Allah, most Majestic, most Glorious. If he leaves behind brothers, that is, the deceased has brothers from both parents or brothers from the father’s side, the share of his mother is one-sixth and the share of the father is five-sixths. It is made available to the father because of his dependents. Brothers from the side of the mother, who are not from the father, do not bar the mother from her one-third and they do not inherit. If a man dies and leaves behind his mother and brothers and sisters from both parents and brothers and sisters from the mother’s side and the father is not alive, they do not inherit and do not bar her because Kalalah does not inherit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/140)"
        ],
        "index": 13249,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1659",
              "text": "سَعْدِ بْنِ أَبِي خَلَفٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1986",
              "text": "أَبِي الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سَعْدِ بْنِ أَبِي خَلَفٍ عَنْ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:16:2",
        "text": [
          " إِذَا تَرَكَ الْمَيِّتُ أَخَوَيْنِ فَهُمْ إِخْوَةٌ مَعَ الْمَيِّتِ حَجَبَا الْأُمَّ عَنِ الثُّلُثِ وَ إِنْ كَانَ وَاحِداً لَمْ يَحْجُبِ الْأُمَّ وَ قَالَ إِذَا كُنَّ أَرْبَعَ أَخَوَاتٍ حَجَبْنَ الْأُمَّ عَنِ الثُّلُثِ لِأَنَّهُنَّ بِمَنْزِلَةِ الْأَخَوَيْنِ وَ إِنْ كُنَّ ثَلَاثاً لَمْ يَحْجُبْنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from sa’ad Bin Abu Khalaf, from Abu Al Abbas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the deceased leaves two brothers, so they are brothers with the deceased, they both veil the mother from the third. And if there was one, he would not veil the mother’. And he<sup>asws</sup> said: ‘When there are four sisters, they would block the mother from the third because they are at the statues of the two brothers, and if there were three sisters, they would not be blocking (the mother from the third)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Sa‘d ibn abu Khalaf from abu al-‘Abbas who has narrated the following: “Abu \"Abd Allah, ‘Alayhi al-Salam, has said, \"If a deceased leaves behind two brothers, they are considered more than two brothers of the deceased and they bar the mother from one-third. If there is one brother he does not bar the mother.’ He (the Imam) said, \"If there are four sisters they bar the mother from one-third because they are like two brothers but if there are three sisters they do not bar the mother’s share.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/141)"
        ],
        "index": 13250,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1797",
              "text": "مُحَسِّنِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/271",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5514",
              "text": "فَضْلٍ أَبِي الْعَبَّاسِ الْبَقْبَاقِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ فَضْلٍ أَبِي الْعَبَّاسِ الْبَقْبَاقِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:16:3",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَبَوَيْنِ وَ أُخْتَيْنِ لِأَبٍ وَ أُمٍّ هَلْ يَحْجُبَانِ الْأُمَّ عَنِ الثُّلُثِ قَالَ لَا قَالَ قُلْتُ فَثَلَاثٌ قَالَ لَا قُلْتُ فَأَرْبَعٌ قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Mohsin Bin Ahmad, from Aban Bin Usman, from Fazl Abu Al Abbas Al Baqbaaq, said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the two parents, and two sisters of the father, and a mother; would these two be blocking the mother from the third?’ He<sup>asws</sup> said: ‘No’. I said, ‘So if they are three?’ He<sup>asws</sup> said: ‘No’. I said, ‘So if they are four?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhassin ibn Ahmad from Aban ibn ‘Uthman from Fadl abu al-‘Abbas al-Baqbaq who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of both parents and two sisters from both parents; if they bar the mother from one-third of the legacy. He (the Imam) said, ‘No, they do not do so.’ I then asked, ‘What happens if they are three?’ He (the Imam) said, ‘No, they do not do so.’ I then asked, ‘What happens if they are four?’ He (the Imam) said, ‘Yes, they bar her from one-third.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/141)"
        ],
        "index": 13251,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/179",
              "text": "أَبِي أَيُّوبَ الْخَزَّازِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:16:4",
        "text": [
          " لَا تَحْجُبُ الْأُمَّ مِنَ الثُّلُثِ إِذَا لَمْ يَكُنْ وَلَدٌ إِلَّا أَخَوَانِ أَوْ أَرْبَعُ أَخَوَاتٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abu Ayoub Al Khazaz, from Muhammad Bin Muslim, from",
            "Abu Abdullah<sup>asws</sup> having said: ‘The mother is not from the third if there does not happen to be a son, except for two brothers or four sisters’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash ‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from abu Ayyub al-Khazzaz from Muhammad ibn Muslim who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A mother is not barred from receiving one-third if there is no son except because of two brothers or four sisters.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/141)"
        ],
        "index": 13252,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/480",
              "text": "عَبْدِ اللَّهِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5514",
              "text": "فَضْلٍ أَبِي الْعَبَّاسِ الْبَقْبَاقِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ فَضْلٍ أَبِي الْعَبَّاسِ الْبَقْبَاقِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:16:5",
        "text": [
          " لَا تَحْجُبُ الْأُمَّ عَنِ الثُّلُثِ إِلَّا أَخَوَانِ أَوْ أَرْبَعُ أَخَوَاتٍ لِأَبٍ وَ أُمٍّ أَوْ لِأَبٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazal, from Abdullah Bin Bukeyr, from Fazal Abu Al Abbas Al Baqbaaq, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The mother is not barred from the third except (if there are) two brothers, or four sisters of the father and mother, or of the father’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ‘Abd Allah ibn Bukayr from Fadl abu al-‘Abbas al-Baqbaq who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A mother is not barred from receiving one-third except because of two brothers or four sisters from both parents.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/141)"
        ],
        "index": 13253,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1681",
              "text": "وَ بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/263",
              "text": "ابْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/281",
              "text": "عُبَيْدِ بْنِ زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِإِسْنَادِهِ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:16:6",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ الْإِخْوَةَ مِنَ الْأُمِّ لَا يَحْجُبُونَ الْأُمَّ عَنِ الثُّلُثِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, from Ibn Fazal, from Ibn Bukeyr, from Ubeyd Bin Zurara who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying that the sister of the mother would not be barring the mother from the third’."
          ],
          "en.sarwar": [
            "6. Through the same chain of narrators as that of the previous Hadith the following is narrated from ibn Faddal from ibn Bukayr from ‘Ubayd ibn Zurarah who has narrated the following: “I once heard abu ‘ Abd Allah, ‘Alayhi al-Salam, saying, ’Brothers from the mothers’ side do not bar the mother from one-third of the legacy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/141)"
        ],
        "index": 13254,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/488",
              "text": "عَبْدِ اللَّهِ بْنِ بَحْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/195",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ عَبْدِ اللَّهِ بْنِ بَحْرٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:16:7",
        "relations": {
          "Mentions": [
            "/books/quran:4:11"
          ]
        },
        "text": [
          " قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا زُرَارَةُ مَا تَقُولُ فِي رَجُلٍ تَرَكَ أَبَوَيْهِ وَ إِخْوَتَهُ مِنْ أُمِّهِ قَالَ قُلْتُ السُّدُسُ لِأُمِّهِ وَ مَا بَقِيَ فَلِلْأَبِ فَقَالَ مِنْ أَيْنَ قُلْتَ هَذَا قُلْتُ سَمِعْتُ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فِي كِتَابِهِ فَإِنْ كانَ لَهُ إِخْوَةٌ فَلِأُمِّهِ السُّدُسُ فَقَالَ وَيْحَكَ يَا زُرَارَةُ أُولَئِكَ الْإِخْوَةُ مِنَ الْأَبِ فَإِذَا كَانَ الْإِخْوَةُ مِنَ الْأُمِّ لَمْ يَحْجُبُوا الْأُمَّ عَنِ الثُّلُثِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed, from Abdullah Bin Bahr, from Hareyz, from Zurara who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to me: ‘O Zurara! What are you saying regarding a man who leaves his two parents, and his brothers of his mother?’ I said, ‘A sixth for his mother and whatever remains, so it is for the father’. So he<sup>asws</sup> said: ‘From where did you say this?’ I said, ‘I heard Allah<sup>azwj</sup> Mighty and Majestic Saying in His<sup>azwj</sup> Book <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h11\">[4:11]</a> but if he has brothers, then his mother shall have the sixth</span>’. So he<sup>asws</sup> said: ‘O Zurara! Those are the brothers of the father. So if there were brothers of the father, they would not be barring the mother from the third’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn SaTd from ‘Abd Allah ibn Bahr from Hariz from Zurarah who has narrated the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, once said to me, ’O Zurarah, what do you say about the case of a man who leaves behind his both parents and brothers from his mother’s side?’ He (the narrator) has said that he said, ‘One-sixth is for the mother and the rest is for the father.’ He (the Imam) asked, ’On what basis do you say so?’ I replied, ‘I have heard Allah, most Majestic, most Glorious, saying in His book, ’. . . if there are brothers then one-sixth is for his mother.’ <a href=\"/#/books/quran:4#h11\">[4:11]</a> He (the Imam) said, ’Fie on you O Zurarah, they are brothers from the father’s side. If brothers are from the mother’s side, they do not bar the mother from receiving the one-third.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:16",
  "kind": "verse_list"
}