{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 16"}, "path": "/books/al-kafi:7:2:16", "titles": {"ar": "باب مِيرَاثِ الْوَلَدِ مَعَ الْأَبَوَيْنِ", "en": "Chapter 15 – Inheritance of the son with the two parents"}}], "index": 2033, "local_index": 16, "part_type": "Chapter", "path": "/books/al-kafi:7:2:16", "titles": {"ar": "باب مِيرَاثِ الْوَلَدِ مَعَ الْأَبَوَيْنِ", "en": "Chapter 15 – Inheritance of the son with the two parents"}, "verse_count": 3, "verse_start_index": 13243, "verses": [{"index": 13244, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:16:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ جَمِيعاً عَنْ صَفْوَانَ أَوْ قَالَ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ أَقْرَأَنِي أَبُو جَعْفَرٍ ( عليه السلام ) صَحِيفَةَ كِتَابِ الْفَرَائِضِ الَّتِي هِيَ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام ) بِيَدِهِ فَوَجَدْتُ فِيهَا رَجُلٌ تَرَكَ ابْنَتَهُ وَ أُمَّهُ لِلِابْنَةِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأُمِّ السُّدُسُ سَهْمٌ يُقْسَمُ الْمَالُ عَلَى أَرْبَعَةِ أَسْهُمٍ فَمَا أَصَابَ ثَلَاثَةَ أَسْهُمٍ فَلِلِابْنَةِ وَ مَا أَصَابَ سَهْماً فَهُوَ لِلْأُمِّ \nقَالَ وَ قَرَأْتُ فِيهَا رَجُلٌ تَرَكَ ابْنَتَهُ وَ أَبَاهُ فَلِلِابْنَةِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأَبِ السُّدُسُ سَهْمٌ يُقْسَمُ الْمَالُ عَلَى أَرْبَعَةِ أَسْهُمٍ فَمَا أَصَابَ ثَلَاثَةَ أَسْهُمٍ فَلِلِابْنَةِ وَ مَا أَصَابَ سَهْماً فَلِلْأُمِّ \nقَالَ مُحَمَّدٌ وَ وَجَدْتُ فِيهَا رَجُلٌ تَرَكَ أَبَوَيْهِ وَ ابْنَتَهُ فَلِلِابْنَةِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ [لِكُلِّ وَاحِدٍ مِنْهُمَا سَهْمٌ] يُقْسَمُ الْمَالُ عَلَى خَمْسَةِ أَسْهُمٍ فَمَا أَصَابَ ثَلَاثَةً فَلِلِابْنَةِ وَ مَا أَصَابَ سَهْمَيْنِ فَلِلْأَبَوَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Isa Bin Ubyd, from Yunus Bin Abdul Rahman, altogether from Safwan, or he said, from Umar Bin Azina, from Muhammad Bin Muslim who said, \n‘Abu Ja’far<sup>asws</sup> made me read a book of the Obligations (legislated shares of inheritance) which was dictated by Rasool-Allah<sup>saww</sup>, and in the handwriting of Ali<sup>asws</sup> by his<sup>asws</sup> own hand. So I found therein a man who left his daughter, and his mother. For the daughter is the half, three shares, and for the mother is the six of the share. The wealth would be divided upon four shares. So what comes to three shares, so it is for the daughter, and whatever comes to one share so it is for the mother’.\nHe (the narrator) said, ‘And I read in it, a man who left his daughter and his father. So for the daughter is the half, three shares, and for the father is the sixth. The wealth is divided upon four shares. So whatever comes to three shares, so it is for the daughter, and whatever comes to one share, so it is for the mother’. \nMuhammad (the narrator) said, ‘And I found in it, a man who left his two parents, and a daughter. So for the daughter is the half, three shares, and for the two parents, for each one of the two, is the sixth, (one share for each of the two of them). The wealth is divided upon five shares. So whatever comes three shares, so it is for the daughter, and whatever comes to two shares, so it is for the two parents’."}]}, {"index": 13245, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:2:16:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ وَجَدْتُ فِي صَحِيفَةِ الْفَرَائِضِ رَجُلٌ مَاتَ وَ تَرَكَ ابْنَتَهُ وَ أَبَوَيْهِ فَلِلِابْنَةِ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا سَهْمٌ يُقْسَمُ الْمَالُ عَلَى خَمْسَةِ أَجْزَاءٍ فَمَا أَصَابَ ثَلَاثَةَ أَجْزَاءٍ فَلِلِابْنَةِ وَ مَا أَصَابَ جُزْءَيْنِ فَلِلْأَبَوَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Al-Hassan Bin Mahboub, from Ali Bin Raib, from Zurara who said, \n‘I found in a Parchment of the Obligations (legislated shares of inheritance), a man died and left his daughter, and his two parents, so for the daughter are three shares, and for the two parents, for each one of the two, one share. The wealth is distributed upon fives parts, so whatever comes to three parts, so it is for the daughter, and whatever comes to two parts, so it is for the two parents’."}]}, {"index": 13246, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:2:16:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ جَمِيعاً عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْجَدِّ فَقَالَ مَا أَجِدُ أَحَداً قَالَ فِيهِ إِلَّا بِرَأْيِهِ إِلَّا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قُلْتُ أَصْلَحَكَ اللَّهُ فَمَا قَالَ فِيهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ إِذَا كَانَ غَداً فَالْقَنِي حَتَّى أُقْرِئَكَهُ فِي كِتَابٍ قُلْتُ أَصْلَحَكَ اللَّهُ حَدِّثْنِي فَإِنَّ حَدِيثَكَ أَحَبُّ إِلَيَّ مِنْ أَنْ تُقْرِئَنِيهِ فِي كِتَابٍ فَقَالَ لِيَ الثَّانِيَةَ اسْمَعْ مَا أَقُولُ لَكَ إِذَا كَانَ غَداً فَالْقَنِي حَتَّى أُقْرِئَكَهُ فِي كِتَابٍ\nفَأَتَيْتُهُ مِنَ الْغَدِ بَعْدَ الظُّهْرِ وَ كَانَتْ سَاعَتِيَ الَّتِي كُنْتُ أَخْلُو بِهِ فِيهَا بَيْنَ الظُّهْرِ وَ الْعَصْرِ وَ كُنْتُ أَكْرَهُ أَنْ أَسْأَلَهُ إِلَّا خَالِياً خَشْيَةَ أَنْ يُفْتِيَنِي مِنْ أَجْلِ مَنْ يَحْضُرُهُ بِالتَّقِيَّةِ فَلَمَّا دَخَلْتُ عَلَيْهِ أَقْبَلَ عَلَى ابْنِهِ جَعْفَرٍ ( عليه السلام ) فَقَالَ لَهُ أَقْرِئْ زُرَارَةَ صَحِيفَةَ الْفَرَائِضِ ثُمَّ قَامَ لِيَنَامَ\nفَبَقِيتُ أَنَا وَ جَعْفَرٌ ( عليه السلام ) فِي الْبَيْتِ فَقَامَ فَأَخْرَجَ إِلَيَّ صَحِيفَةً مِثْلَ فَخِذِ الْبَعِيرِ فَقَالَ لَسْتُ أُقْرِئُكَهَا حَتَّى تَجْعَلَ لِي عَلَيْكَ اللَّهَ أَنْ لَا تُحَدِّثَ بِمَا تَقْرَأُ فِيهَا أَحَداً أَبَداً حَتَّى آذَنَ لَكَ وَ لَمْ يَقُلْ حَتَّى يَأْذَنَ لَكَ أَبِي فَقُلْتُ أَصْلَحَكَ اللَّهُ وَ لِمَ تُضَيِّقُ عَلَيَّ وَ لَمْ يَأْمُرْكَ أَبُوكَ بِذَلِكَ فَقَالَ لِي مَا أَنْتَ بِنَاظِرٍ فِيهَا إِلَّا عَلَى مَا قُلْتُ لَكَ فَقُلْتُ فَذَاكَ لَكَ وَ كُنْتُ رَجُلًا عَالِماً بِالْفَرَائِضِ وَ الْوَصَايَا بَصِيراً بِهَا حَاسِباً لَهَا أَلْبَثُ الزَّمَانَ أَطْلُبُ شَيْئاً يُلْقَى عَلَيَّ مِنَ الْفَرَائِضِ وَ الْوَصَايَا لَا أَعْلَمُهُ فَلَا أَقْدِرُ عَلَيْهِ\nفَلَمَّا أَلْقَى إِلَيَّ طَرَفَ الصَّحِيفَةِ إِذَا كِتَابٌ غَلِيظٌ يُعْرَفُ أَنَّهُ مِنْ كُتُبِ الْأَوَّلِينَ فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا خِلَافُ مَا بِأَيْدِي النَّاسِ مِنَ الصِّلَةِ وَ الْأَمْرِ بِالْمَعْرُوفِ الَّذِي لَيْسَ فِيهِ اخْتِلَافٌ وَ إِذَا عَامَّتُهُ كَذَلِكَ فَقَرَأْتُهُ حَتَّى أَتَيْتُ عَلَى آخِرِهِ بِخُبْثِ نَفْسٍ وَ قِلَّةِ تَحَفُّظٍ وَ سَقَامِ رَأْيٍ وَ قُلْتُ وَ أَنَا أَقْرَؤُهُ بَاطِلٌ حَتَّى أَتَيْتُ عَلَى آخِرِهِ ثُمَّ أَدْرَجْتُهَا وَ دَفَعْتُهَا إِلَيْهِ\nفَلَمَّا أَصْبَحْتُ لَقِيتُ أَبَا جَعْفَرٍ ( عليه السلام ) فَقَالَ لِي أَ قَرَأْتَ صَحِيفَةَ الْفَرَائِضِ فَقُلْتُ نَعَمْ فَقَالَ كَيْفَ رَأَيْتَ مَا قَرَأْتَ قَالَ قُلْتُ بَاطِلٌ لَيْسَ بِشَيْ‏ءٍ هُوَ خِلَافُ مَا النَّاسُ عَلَيْهِ قَالَ فَإِنَّ الَّذِي رَأَيْتَ وَ اللَّهِ يَا زُرَارَةُ هُوَ الْحَقُّ الَّذِي رَأَيْتَ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام )  بِيَدِهِ\nفَأَتَانِي الشَّيْطَانُ فَوَسْوَسَ فِي صَدْرِي فَقَالَ وَ مَا يُدْرِيهِ أَنَّهُ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام ) بِيَدِهِ فَقَالَ لِي قَبْلَ أَنْ أَنْطِقَ يَا زُرَارَةُ لَا تَشُكَّنَّ وَدَّ الشَّيْطَانُ وَ اللَّهِ إِنَّكَ شَكَكْتَ وَ كَيْفَ لَا أَدْرِي أَنَّهُ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام ) بِيَدِهِ وَ قَدْ حَدَّثَنِي أَبِي عَنْ جَدِّي أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) حَدَّثَهُ ذَلِكَ \nقَالَ قُلْتُ لَا كَيْفَ جَعَلَنِيَ اللَّهُ فِدَاكَ وَ نَدِمْتُ عَلَى مَا فَاتَنِي مِنَ الْكِتَابِ وَ لَوْ كُنْتُ قَرَأْتُهُ وَ أَنَا أَعْرِفُهُ لَرَجَوْتُ أَنْ لَا يَفُوتَنِي مِنْهُ حَرْفٌ\nقَالَ عُمَرُ بْنُ أُذَيْنَةَ قُلْتُ لِزُرَارَةَ فَإِنَّ أُنَاساً حَدَّثُونِي عَنْهُ وَ عَنْ أَبِيهِ ( عليه السلام ) بِأَشْيَاءَ فِي الْفَرَائِضِ فَأَعْرِضُهَا عَلَيْكَ فَمَا كَانَ مِنْهَا بَاطِلًا فَقُلْ هَذَا بَاطِلٌ وَ مَا كَانَ مِنْهَا حَقّاً فَقُلْ هَذَا حَقٌّ وَ لَا تَرْوِهِ وَ اسْكُتْ فَحَدَّثْتُهُ بِمَا حَدَّثَنِي بِهِ مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الِابْنَةِ وَ الْأَبِ وَ الِابْنَةِ وَ الْأُمِّ وَ الِابْنَةِ وَ الْأَبَوَيْنِ فَقَالَ هُوَ وَ اللَّهِ الْحَقُّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Isa Bin Ubeyd, from Yunus, altogether from Umar Bin Azina, from Zurara who said, \n‘I asked Abu Ja’far<sup>asws</sup> about the grandfather, so he<sup>asws</sup> said: ‘I<sup>asws</sup> did not find anyone who spoke with regards to it except by his own opinions except for Amir Al-Momineen<sup>asws</sup>’. I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! So what did Amir Al-Momineen<sup>asws</sup> say with regards to it?’ He<sup>asws</sup> said: ‘When it is tomorrow, so meet up with me<sup>asws</sup> until I<sup>asws</sup> make you to read it in a book’. I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! Narrate to me, for your<sup>asws</sup> Hadeeth is more beloved to me than you<sup>asws</sup> making me to read it in a book’. So he<sup>asws</sup> said to me for a second time: ‘Listen to what I<sup>asws</sup> am saying to you. When it is tomorrow, so meet up with me<sup>asws</sup>, until I<sup>asws</sup> make you to read it in a book’. \nSo I went over to him<sup>asws</sup> the next day after <span class=\"iTxt\">Al-Zohr</span>, and it was my time which I would be alone with him, in what is between <span class=\"iTxt\">Al-Zohr</span> and <span class=\"iTxt\">Al-Asr</span>, and I disliked that I ask him except when alone with him<sup>asws</sup>, out of fear that he<sup>asws</sup> would issue a verdict to me with the dissimulation due to the ones who would be present (around him<sup>asws</sup>. So when I entered (the room), he<sup>asws</sup> faced towards his<sup>asws</sup> son<sup>asws</sup> Ja’far<sup>asws</sup>, so he<sup>asws</sup> said to him<sup>asws</sup>: ‘Make Zurara read the Parchment of the Obligations (legislated shares of inheritance)’. Then he<sup>asws</sup> arose for a nap.\nSo, there remained myself and Ja’far<sup>asws</sup> in the room. So he<sup>asws</sup> stood up and brought a parchment to me, like the thigh of the camel, so he<sup>asws</sup> said: ‘You do not read it until you make (a promise of) Allah<sup>azwj</sup> to me that you will not narrate with what you read in it to anyone, ever, until I<sup>asws</sup> permit you’ – and he<sup>asws</sup> did not say, ‘Until my<sup>asws</sup> father<sup>asws</sup> permits you’. So I said, ‘May Allah<sup>zwj</sup> Keep you <sup>asws</sup> well! And why are you<sup>asws</sup> restricting me and your<sup>asws</sup> father<sup>asws</sup> did not instruct with that?’ So he<sup>asws</sup> said to me: ‘You will not look in it except upon what I<sup>asws</sup> have said to you’. So I said, ‘So that is for you<sup>asws</sup> (to stipulate)’ – and I was a knowledgeable man with the Obligations (legislated shares of inheritance) and the bequests, having insight into it, and of calculating these. I had waited a long time seeking something cast to me from the Obligations (legislated shares of inheritance) and the bequest which I did not know, and I had no ability over it.\nSo when he<sup>asws</sup> cast towards me a side of the parchment. It was a thick book, so I recognised it that it is from the books of the former ones. So I looked into it, and there was in it opposite to what was in the hands of the people – from the relationships, and the enjoining of the goodness which there is no differing in it, and that the generality of it was like that. So I read it until I came to the end of it, having a bad self (thoughts) and little memorisation (from it), and a sick opinion, and I said (to myself) that I have read falsehood, until I came to the end of it. Then I layered it and handed it over to him<sup>asws</sup>. \nSo when it was the morning, I met up with Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘Did you read the parchment of the Obligations (legislated shares of the inheritance)?’ So I said, ‘Yes’. So he<sup>asws</sup> said: ‘How do you view what you read?’ I said, ‘False. It is not with anything except that it is opposite to what the people are upon’. He<sup>asws</sup> said: ‘So that which you saw, by Allah<sup>azwj</sup>, O Zurara, it is the truth. That which you saw was dictated by Rasool-Allah<sup>saww</sup> and written by Ali<sup>asws</sup> by his<sup>asws</sup> own hand’. \nSo the satan<sup>la</sup> came to me and whispered into my chest, so he<sup>la</sup> said, ‘And what makes you know that it was dictated by Rasool-Allah<sup>saww</sup> and written by Ali<sup>asws</sup> by his<sup>asws</sup> own hand?’ So he<sup>asws</sup> said to me before I spoke: ‘O Zurara! Do not let satan<sup>la</sup> make you doubt. By Allah<sup>azwj</sup>! You doubt, and how can I<sup>asws</sup> not know that it is the dictation of Rasool-Allah<sup>saww</sup> and writing of Ali<sup>sws</sup> by his<sup>asws</sup> own hand, and my<sup>asws</sup> father<sup>sws</sup> narrated to me<sup>asws</sup>, from my<sup>asws</sup> grandfather<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> narrated that!’\n(Zurara) said, ‘I said, ‘No! How (can I doubt)?’ May Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>! And I regret upon what (I did not read) from what you<sup>asws</sup> gave me from the book, and had I read it, and I would have recognised it, and hopefully not a single letter from it would have escaped me’. \nUmar Bin Azina said, ‘I said to Zarara, ‘The people are narrating to me from him<sup>asws</sup> and from his<sup>asws</sup> father<sup>asws</sup> with things regarding the Obligations (legislated shares of inheritance), so I will present them to you. So whatever was false from it, so say, ‘This is false’, and whatever was true from it, so say, ‘This is true’, and do not report it and remain silent. So I narrated to him with what Muhammad Bin Muslim had narrated to me from Abu Ja’far<sup>asws</sup> with regards to the daughter, and the father, and the daughter and the mother, and the daughter and the father. So he (Zarara) said, ‘It is, by Allah<sup>azwj</sup>, the truth’."}]}]}, "index": "al-kafi:7:2:16", "kind": "verse_list"}