{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:7:2:17",
        "titles": {
          "ar": "باب مِيرَاثِ الْوَلَدِ مَعَ الْأَبَوَيْنِ",
          "en": "Chapter 15 – Inheritance of the son with the two parents"
        }
      }
    ],
    "index": 2043,
    "local_index": 17,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:7:2:18",
        "titles": {
          "ar": "باب مِيرَاثِ الْوَلَدِ مَعَ الزَّوْجِ وَ الْمَرْأَةِ وَ الْأَبَوَيْنِ",
          "en": "Chapter 16 – Inheritance of the son with the husband and the wife, and the two parents"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:7:2:16",
        "titles": {
          "ar": "باب مِيرَاثِ الْأَبَوَيْنِ مَعَ الْإِخْوَةِ وَ الْأَخَوَاتِ لِأَبٍ وَ الْإِخْوَةِ وَ الْأَخَوَاتِ لِأُمٍّ",
          "en": "Chapter 14 – Inheritance of the two parents with the brothers and sisters of the father, and the brothers and sisters of the mother"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:17",
    "titles": {
      "ar": "باب مِيرَاثِ الْوَلَدِ مَعَ الْأَبَوَيْنِ",
      "en": "Chapter 15 – Inheritance of the son with the two parents"
    },
    "verse_count": 3,
    "verse_start_index": 13254,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/142)"
        ],
        "index": 13255,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/198",
              "text": "مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/109",
              "text": "يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5515",
              "text": "صَفْوَانَ أَوْ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ جَمِيعاً عَنْ صَفْوَانَ أَوْ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:17:1",
        "text": [
          " عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ أَقْرَأَنِي أَبُو جَعْفَرٍ ( عليه السلام ) صَحِيفَةَ كِتَابِ الْفَرَائِضِ الَّتِي هِيَ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام ) بِيَدِهِ فَوَجَدْتُ فِيهَا رَجُلٌ تَرَكَ ابْنَتَهُ وَ أُمَّهُ لِلِابْنَةِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأُمِّ السُّدُسُ سَهْمٌ يُقْسَمُ الْمَالُ عَلَى أَرْبَعَةِ أَسْهُمٍ فَمَا أَصَابَ ثَلَاثَةَ أَسْهُمٍ فَلِلِابْنَةِ وَ مَا أَصَابَ سَهْماً فَهُوَ لِلْأُمِّ ",
          "قَالَ وَ قَرَأْتُ فِيهَا رَجُلٌ تَرَكَ ابْنَتَهُ وَ أَبَاهُ فَلِلِابْنَةِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأَبِ السُّدُسُ سَهْمٌ يُقْسَمُ الْمَالُ عَلَى أَرْبَعَةِ أَسْهُمٍ فَمَا أَصَابَ ثَلَاثَةَ أَسْهُمٍ فَلِلِابْنَةِ وَ مَا أَصَابَ سَهْماً فَلِلْأُمِّ ",
          "قَالَ مُحَمَّدٌ وَ وَجَدْتُ فِيهَا رَجُلٌ تَرَكَ أَبَوَيْهِ وَ ابْنَتَهُ فَلِلِابْنَةِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا السُّدُسُ [لِكُلِّ وَاحِدٍ مِنْهُمَا سَهْمٌ] يُقْسَمُ الْمَالُ عَلَى خَمْسَةِ أَسْهُمٍ فَمَا أَصَابَ ثَلَاثَةً فَلِلِابْنَةِ وَ مَا أَصَابَ سَهْمَيْنِ فَلِلْأَبَوَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Isa Bin Ubyd, from Yunus Bin Abdul Rahman, altogether from Safwan, or he said, from Umar Bin Azina, from Muhammad Bin Muslim who said, ",
            "‘Abu Ja’far<sup>asws</sup> made me read a book of the Obligations (legislated shares of inheritance) which was dictated by Rasool-Allah<sup>saww</sup>, and in the handwriting of Ali<sup>asws</sup> by his<sup>asws</sup> own hand. So I found therein a man who left his daughter, and his mother. For the daughter is the half, three shares, and for the mother is the six of the share. The wealth would be divided upon four shares. So what comes to three shares, so it is for the daughter, and whatever comes to one share so it is for the mother’.",
            "He (the narrator) said, ‘And I read in it, a man who left his daughter and his father. So for the daughter is the half, three shares, and for the father is the sixth. The wealth is divided upon four shares. So whatever comes to three shares, so it is for the daughter, and whatever comes to one share, so it is for the mother’. ",
            "Muhammad (the narrator) said, ‘And I found in it, a man who left his two parents, and a daughter. So for the daughter is the half, three shares, and for the two parents, for each one of the two, is the sixth, (one share for each of the two of them). The wealth is divided upon five shares. So whatever comes three shares, so it is for the daughter, and whatever comes to two shares, so it is for the two parents’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus ibn ‘Abd al- Rahman all from Safwan or he said from ‘Umar ibn ’Udhaynah from Muhammad ibn Muslim who has narrated the following: “Once abu Ja‘far, ‘Alayhi al-Salam, made me read the page of the book of ordained shares. It was according to the dictation of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and with the handwriting of Ali, ‘Alayhi al-Salam. I found in it this, ’If a deceased leaves behind his daughter and mother, the share of the daughter is one- half or three shares and for the mother one-sixth. The legacy is made in four parts, of which three are for the daughter and one is for the mother/” “He (the narrator) has said, I read in it that, “If a deceased leaves behind his daughter and his father, the share of the daughter is one-half: three shares and the share of the father is one-sixth share. The legacy is made in four parts of which three are for the daughter and one is for the father.’” “Muhammad has said, T found in it that if a deceased leaves behind both parents and his daughter; the share of the daughter is one-half, three shares and the shares of parents are one-sixth for each. Such legacy can be made of five portions of which three are for the daughter and two for the parents.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/143)"
        ],
        "index": 13256,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/214",
              "text": "عَلِيِّ بْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:17:2",
        "text": [
          " وَجَدْتُ فِي صَحِيفَةِ الْفَرَائِضِ رَجُلٌ مَاتَ وَ تَرَكَ ابْنَتَهُ وَ أَبَوَيْهِ فَلِلِابْنَةِ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأَبَوَيْنِ لِكُلِّ وَاحِدٍ مِنْهُمَا سَهْمٌ يُقْسَمُ الْمَالُ عَلَى خَمْسَةِ أَجْزَاءٍ فَمَا أَصَابَ ثَلَاثَةَ أَجْزَاءٍ فَلِلِابْنَةِ وَ مَا أَصَابَ جُزْءَيْنِ فَلِلْأَبَوَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Al-Hassan Bin Mahboub, from Ali Bin Raib, from Zurara who said, ",
            "‘I found in a Parchment of the Obligations (legislated shares of inheritance), a man died and left his daughter, and his two parents, so for the daughter are three shares, and for the two parents, for each one of the two, one share. The wealth is distributed upon fives parts, so whatever comes to three parts, so it is for the daughter, and whatever comes to two parts, so it is for the two parents’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from al-Hassan ibn Mahbub from Ali ibn Ri’ab from Zurarah who has narrated the following: “I found in the book of ordained shares that if a deceased leaves behind his daughter and both parents, the share of the daughter are three shares and the parents each receives one share. The legacy is made in five parts of which three are for the daughter and two for the parents, one share each.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/143)"
        ],
        "index": 13257,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/198",
              "text": "مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/227",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ جَمِيعاً عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:17:3",
        "text": [
          " سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْجَدِّ فَقَالَ مَا أَجِدُ أَحَداً قَالَ فِيهِ إِلَّا بِرَأْيِهِ إِلَّا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قُلْتُ أَصْلَحَكَ اللَّهُ فَمَا قَالَ فِيهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ إِذَا كَانَ غَداً فَالْقَنِي حَتَّى أُقْرِئَكَهُ فِي كِتَابٍ قُلْتُ أَصْلَحَكَ اللَّهُ حَدِّثْنِي فَإِنَّ حَدِيثَكَ أَحَبُّ إِلَيَّ مِنْ أَنْ تُقْرِئَنِيهِ فِي كِتَابٍ فَقَالَ لِيَ الثَّانِيَةَ اسْمَعْ مَا أَقُولُ لَكَ إِذَا كَانَ غَداً فَالْقَنِي حَتَّى أُقْرِئَكَهُ فِي كِتَابٍ",
          "فَأَتَيْتُهُ مِنَ الْغَدِ بَعْدَ الظُّهْرِ وَ كَانَتْ سَاعَتِيَ الَّتِي كُنْتُ أَخْلُو بِهِ فِيهَا بَيْنَ الظُّهْرِ وَ الْعَصْرِ وَ كُنْتُ أَكْرَهُ أَنْ أَسْأَلَهُ إِلَّا خَالِياً خَشْيَةَ أَنْ يُفْتِيَنِي مِنْ أَجْلِ مَنْ يَحْضُرُهُ بِالتَّقِيَّةِ فَلَمَّا دَخَلْتُ عَلَيْهِ أَقْبَلَ عَلَى ابْنِهِ جَعْفَرٍ ( عليه السلام ) فَقَالَ لَهُ أَقْرِئْ زُرَارَةَ صَحِيفَةَ الْفَرَائِضِ ثُمَّ قَامَ لِيَنَامَ",
          "فَبَقِيتُ أَنَا وَ جَعْفَرٌ ( عليه السلام ) فِي الْبَيْتِ فَقَامَ فَأَخْرَجَ إِلَيَّ صَحِيفَةً مِثْلَ فَخِذِ الْبَعِيرِ فَقَالَ لَسْتُ أُقْرِئُكَهَا حَتَّى تَجْعَلَ لِي عَلَيْكَ اللَّهَ أَنْ لَا تُحَدِّثَ بِمَا تَقْرَأُ فِيهَا أَحَداً أَبَداً حَتَّى آذَنَ لَكَ وَ لَمْ يَقُلْ حَتَّى يَأْذَنَ لَكَ أَبِي فَقُلْتُ أَصْلَحَكَ اللَّهُ وَ لِمَ تُضَيِّقُ عَلَيَّ وَ لَمْ يَأْمُرْكَ أَبُوكَ بِذَلِكَ فَقَالَ لِي مَا أَنْتَ بِنَاظِرٍ فِيهَا إِلَّا عَلَى مَا قُلْتُ لَكَ فَقُلْتُ فَذَاكَ لَكَ وَ كُنْتُ رَجُلًا عَالِماً بِالْفَرَائِضِ وَ الْوَصَايَا بَصِيراً بِهَا حَاسِباً لَهَا أَلْبَثُ الزَّمَانَ أَطْلُبُ شَيْئاً يُلْقَى عَلَيَّ مِنَ الْفَرَائِضِ وَ الْوَصَايَا لَا أَعْلَمُهُ فَلَا أَقْدِرُ عَلَيْهِ",
          "فَلَمَّا أَلْقَى إِلَيَّ طَرَفَ الصَّحِيفَةِ إِذَا كِتَابٌ غَلِيظٌ يُعْرَفُ أَنَّهُ مِنْ كُتُبِ الْأَوَّلِينَ فَنَظَرْتُ فِيهَا فَإِذَا فِيهَا خِلَافُ مَا بِأَيْدِي النَّاسِ مِنَ الصِّلَةِ وَ الْأَمْرِ بِالْمَعْرُوفِ الَّذِي لَيْسَ فِيهِ اخْتِلَافٌ وَ إِذَا عَامَّتُهُ كَذَلِكَ فَقَرَأْتُهُ حَتَّى أَتَيْتُ عَلَى آخِرِهِ بِخُبْثِ نَفْسٍ وَ قِلَّةِ تَحَفُّظٍ وَ سَقَامِ رَأْيٍ وَ قُلْتُ وَ أَنَا أَقْرَؤُهُ بَاطِلٌ حَتَّى أَتَيْتُ عَلَى آخِرِهِ ثُمَّ أَدْرَجْتُهَا وَ دَفَعْتُهَا إِلَيْهِ",
          "فَلَمَّا أَصْبَحْتُ لَقِيتُ أَبَا جَعْفَرٍ ( عليه السلام ) فَقَالَ لِي أَ قَرَأْتَ صَحِيفَةَ الْفَرَائِضِ فَقُلْتُ نَعَمْ فَقَالَ كَيْفَ رَأَيْتَ مَا قَرَأْتَ قَالَ قُلْتُ بَاطِلٌ لَيْسَ بِشَيْ‏ءٍ هُوَ خِلَافُ مَا النَّاسُ عَلَيْهِ قَالَ فَإِنَّ الَّذِي رَأَيْتَ وَ اللَّهِ يَا زُرَارَةُ هُوَ الْحَقُّ الَّذِي رَأَيْتَ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام )  بِيَدِهِ",
          "فَأَتَانِي الشَّيْطَانُ فَوَسْوَسَ فِي صَدْرِي فَقَالَ وَ مَا يُدْرِيهِ أَنَّهُ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام ) بِيَدِهِ فَقَالَ لِي قَبْلَ أَنْ أَنْطِقَ يَا زُرَارَةُ لَا تَشُكَّنَّ وَدَّ الشَّيْطَانُ وَ اللَّهِ إِنَّكَ شَكَكْتَ وَ كَيْفَ لَا أَدْرِي أَنَّهُ إِمْلَاءُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ خَطُّ عَلِيٍّ ( عليه السلام ) بِيَدِهِ وَ قَدْ حَدَّثَنِي أَبِي عَنْ جَدِّي أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) حَدَّثَهُ ذَلِكَ ",
          "قَالَ قُلْتُ لَا كَيْفَ جَعَلَنِيَ اللَّهُ فِدَاكَ وَ نَدِمْتُ عَلَى مَا فَاتَنِي مِنَ الْكِتَابِ وَ لَوْ كُنْتُ قَرَأْتُهُ وَ أَنَا أَعْرِفُهُ لَرَجَوْتُ أَنْ لَا يَفُوتَنِي مِنْهُ حَرْفٌ",
          "قَالَ عُمَرُ بْنُ أُذَيْنَةَ قُلْتُ لِزُرَارَةَ فَإِنَّ أُنَاساً حَدَّثُونِي عَنْهُ وَ عَنْ أَبِيهِ ( عليه السلام ) بِأَشْيَاءَ فِي الْفَرَائِضِ فَأَعْرِضُهَا عَلَيْكَ فَمَا كَانَ مِنْهَا بَاطِلًا فَقُلْ هَذَا بَاطِلٌ وَ مَا كَانَ مِنْهَا حَقّاً فَقُلْ هَذَا حَقٌّ وَ لَا تَرْوِهِ وَ اسْكُتْ فَحَدَّثْتُهُ بِمَا حَدَّثَنِي بِهِ مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الِابْنَةِ وَ الْأَبِ وَ الِابْنَةِ وَ الْأُمِّ وَ الِابْنَةِ وَ الْأَبَوَيْنِ فَقَالَ هُوَ وَ اللَّهِ الْحَقُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Isa Bin Ubeyd, from Yunus, altogether from Umar Bin Azina, from Zurara who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the grandfather, so he<sup>asws</sup> said: ‘I<sup>asws</sup> did not find anyone who spoke with regards to it except by his own opinions except for Amir Al-Momineen<sup>asws</sup>’. I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! So what did Amir Al-Momineen<sup>asws</sup> say with regards to it?’ He<sup>asws</sup> said: ‘When it is tomorrow, so meet up with me<sup>asws</sup> until I<sup>asws</sup> make you to read it in a book’. I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! Narrate to me, for your<sup>asws</sup> Hadeeth is more beloved to me than you<sup>asws</sup> making me to read it in a book’. So he<sup>asws</sup> said to me for a second time: ‘Listen to what I<sup>asws</sup> am saying to you. When it is tomorrow, so meet up with me<sup>asws</sup>, until I<sup>asws</sup> make you to read it in a book’. ",
            "So I went over to him<sup>asws</sup> the next day after <span class=\"iTxt\">Al-Zohr</span>, and it was my time which I would be alone with him, in what is between <span class=\"iTxt\">Al-Zohr</span> and <span class=\"iTxt\">Al-Asr</span>, and I disliked that I ask him except when alone with him<sup>asws</sup>, out of fear that he<sup>asws</sup> would issue a verdict to me with the dissimulation due to the ones who would be present (around him<sup>asws</sup>. So when I entered (the room), he<sup>asws</sup> faced towards his<sup>asws</sup> son<sup>asws</sup> Ja’far<sup>asws</sup>, so he<sup>asws</sup> said to him<sup>asws</sup>: ‘Make Zurara read the Parchment of the Obligations (legislated shares of inheritance)’. Then he<sup>asws</sup> arose for a nap.",
            "So, there remained myself and Ja’far<sup>asws</sup> in the room. So he<sup>asws</sup> stood up and brought a parchment to me, like the thigh of the camel, so he<sup>asws</sup> said: ‘You do not read it until you make (a promise of) Allah<sup>azwj</sup> to me that you will not narrate with what you read in it to anyone, ever, until I<sup>asws</sup> permit you’ – and he<sup>asws</sup> did not say, ‘Until my<sup>asws</sup> father<sup>asws</sup> permits you’. So I said, ‘May Allah<sup>zwj</sup> Keep you <sup>asws</sup> well! And why are you<sup>asws</sup> restricting me and your<sup>asws</sup> father<sup>asws</sup> did not instruct with that?’ So he<sup>asws</sup> said to me: ‘You will not look in it except upon what I<sup>asws</sup> have said to you’. So I said, ‘So that is for you<sup>asws</sup> (to stipulate)’ – and I was a knowledgeable man with the Obligations (legislated shares of inheritance) and the bequests, having insight into it, and of calculating these. I had waited a long time seeking something cast to me from the Obligations (legislated shares of inheritance) and the bequest which I did not know, and I had no ability over it.",
            "So when he<sup>asws</sup> cast towards me a side of the parchment. It was a thick book, so I recognised it that it is from the books of the former ones. So I looked into it, and there was in it opposite to what was in the hands of the people – from the relationships, and the enjoining of the goodness which there is no differing in it, and that the generality of it was like that. So I read it until I came to the end of it, having a bad self (thoughts) and little memorisation (from it), and a sick opinion, and I said (to myself) that I have read falsehood, until I came to the end of it. Then I layered it and handed it over to him<sup>asws</sup>. ",
            "So when it was the morning, I met up with Abu Ja’far<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘Did you read the parchment of the Obligations (legislated shares of the inheritance)?’ So I said, ‘Yes’. So he<sup>asws</sup> said: ‘How do you view what you read?’ I said, ‘False. It is not with anything except that it is opposite to what the people are upon’. He<sup>asws</sup> said: ‘So that which you saw, by Allah<sup>azwj</sup>, O Zurara, it is the truth. That which you saw was dictated by Rasool-Allah<sup>saww</sup> and written by Ali<sup>asws</sup> by his<sup>asws</sup> own hand’. ",
            "So the satan<sup>la</sup> came to me and whispered into my chest, so he<sup>la</sup> said, ‘And what makes you know that it was dictated by Rasool-Allah<sup>saww</sup> and written by Ali<sup>asws</sup> by his<sup>asws</sup> own hand?’ So he<sup>asws</sup> said to me before I spoke: ‘O Zurara! Do not let satan<sup>la</sup> make you doubt. By Allah<sup>azwj</sup>! You doubt, and how can I<sup>asws</sup> not know that it is the dictation of Rasool-Allah<sup>saww</sup> and writing of Ali<sup>sws</sup> by his<sup>asws</sup> own hand, and my<sup>asws</sup> father<sup>sws</sup> narrated to me<sup>asws</sup>, from my<sup>asws</sup> grandfather<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> narrated that!’",
            "(Zurara) said, ‘I said, ‘No! How (can I doubt)?’ May Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>! And I regret upon what (I did not read) from what you<sup>asws</sup> gave me from the book, and had I read it, and I would have recognised it, and hopefully not a single letter from it would have escaped me’. ",
            "Umar Bin Azina said, ‘I said to Zarara, ‘The people are narrating to me from him<sup>asws</sup> and from his<sup>asws</sup> father<sup>asws</sup> with things regarding the Obligations (legislated shares of inheritance), so I will present them to you. So whatever was false from it, so say, ‘This is false’, and whatever was true from it, so say, ‘This is true’, and do not report it and remain silent. So I narrated to him with what Muhammad Bin Muslim had narrated to me from Abu Ja’far<sup>asws</sup> with regards to the daughter, and the father, and the daughter and the mother, and the daughter and the father. So he (Zarara) said, ‘It is, by Allah<sup>azwj</sup>, the truth’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus all from ‘Umar ibn ’Udhaynah from Zurarah who has narrated the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the grandfather. He (the Imam) said, ‘I do not find anyone who has spoken about it but that they have spoken out of their opinion except ’ Amir al- Mu’minin, ‘Alayhi al-Salam. I then asked, T pray to Allah to keep you well, what has ’ Amir al- Mu’minin said about it?’ He (the Imam) said, ‘Tomorrow meet me so I can make you read it in a book.’ I then said, ‘I pray to Allah to keep you well, speak to me about it; I like your speaking more than making me read in a book.’ He (the Imam) said again, ‘Listen to what I say. Tomorrow meet me, so I will make you read in a book.’ The next day I went to see him (the Imam) after al-Zuhr (noontime) and it was the hour that I would meet him between al-Zuhr and al-‘Asr (afternoon time) and I did not like to ask him in the presence of people for fear of his answering in taqiyah (caution because of fear). When I met him (the Imam) his son Ja‘far, ‘Alayhi al-Salam, came to me and he (the Imam) said to him, ‘Make Zurarah to read the book of ordained shares.’ He (the Imam) left for his siesta. Ja‘far, ‘Alayhi al-Salam, and I were left in the house. He stood up and brought for me a book (which looked) like the thigh of a camel. He (Ja‘far, ‘Alayhi al-Salam ) said, ‘I will not allow you to read it until you promise before Allah that you will never tell anyone about what you will read in it until I will give permission’, and he did not say, ‘until my father gives you permission.’ I then said, ‘I pray to Allah to keep you well, why do you restrict me when your father has not commanded you to do so?’ He said, ‘You must not look in it on what is other than what I will tell you to read.’ I said, ‘That is up to you.’ I was a knowledgeable man in ordained shares of inheritance and wills and well aware of them and in calculating them. I waited for quite a long time to find something about ordained shares and wills that I did not know and can deal with. When he placed a side of the book before me, it was a thick book and one can notice that it was of the books of earlier generations. I looked in it and I found it to be different from what is commonly accepted among people, such as matters of compensation and urging others to do good things, in which there is not any difference. I found the majority of it like that until the end of it, with a filthy soul, very little memorization and defective opinion; and I said, ‘Do I (need) to read this?’ It is false. I reached its end. I closed it and returned it to him (Ja‘far, ‘Alayhi al-Salam ). The next day I met abu Ja‘far, ‘Alayhi al-Salam, and he asked me, ‘Did you read the book of ordained shares?’ I replied, ‘Yes, I read it.’ He (the Imam) then asked, ‘How did you find what you read?’ He (the narrator) has said that he said, ‘It is false and it does not have any valid effect. It is against what people say and do.’ He (the Imam) said, ‘What you saw O Zurarah, by Allah, is the truth. What you saw is the dictation of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, in the handwriting of Ali, ‘Alayhi al-Salam.’ Satan came to me with temptation in my chest and said, ‘He does not know if it is the dictation of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and the handwriting of Ali, ‘Alayhi al-Salam. He (the Imam) said to me before I spoke, ‘O Zurarah, do not doubt. Satan loved to make you doubt. How it is possible that I remain ignorant of its not being the dictation of the Messenger of Allah and the handwriting of Ali, ‘Alayhi al-Salam, when my father narrated to me from my grandfather ’ Amir al-Mu’minin, ‘Alayhi al- Salam, who narrated to him about it.’ He (the narrator) has said that I said, ‘No, I pray to Allah to keep my soul in service for your cause. I regretted for not reading what I did not read of the book. Had I read it and I had known it I would hope not to miss anything thereof; not even a single letter.’ “‘Umar ibn ’Udhaynah has said, ‘I said to Zurarah that people have spoken to me from him (the Imam) and from his father, ‘Alayhim al-Salam, about certain things on ordained shares. Can I present them before you so you can tell me what is false and what is true and do not narrate so I remain quiet? I narrated to him what Muhammad ibn Muslim had narrated from abu Ja‘far, ‘Alayhi al-Salam, about the daughter and father and about a daughter and both parents. He said that it is true. “Al-Fadl ibn Shadhan about a daughter and father has said, that the daughter receives one-half and the father receives one-sixth and the remaining is returned to them proportionate to their shares. “So also is the case if a deceased leaves behind a daughter and mother. One-half belongs to the daughter, the mother receives one-sixth, and the remaining is returned to them proportionate to their shares. Certain people have said that the remaining belongs to the daughter because she is closer than both parents are. It is a mistake totally; the parents are close by themselves as the children are, but children are not closer than parents are. The correct thing is to return the remaining to all of them proportionate to their shares. They have received their shares and as nearest relatives the remaining asset belongs to them as relatives, thus it is divided among them according to the distribution of Allah, most Majestic, most Glorious, among them. Allah does not cause difference in His rule and His division does not change.’ “If a deceased leaves behind one daughter and both parents then one-half belongs to the daughter and the parents receive one-sixth. The remaining is returned to them proportionate to their shares because Allah, most Majestic, most Glorious, has not returned to one and not to the other one. He has made a share for women just as He has made a share for men. It is equal in this obligation between mother and father. If a deceased leaves behind two daughters and both parents, the share of daughters is two- thirds and parents receive two-sixths. If a deceased leaves behind three daughters or more then the share of parents is two-sixths and the daughters receive two-thirds. If a deceased leaves behind parents and one son and one daughter, the parents receive two-sixths and the remaining is distributed among the son and daughter where the son receives twice as much as the share of the daughter.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:17",
  "kind": "verse_list"
}