{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:7:2:19",
        "titles": {
          "ar": "باب مِيرَاثِ الْأَبَوَيْنِ مَعَ الزَّوْجِ وَ الزَّوْجَةِ",
          "en": "Chapter 17 – Inheritance of the two parents with the husband and the wife"
        }
      }
    ],
    "index": 2045,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:7:2:20",
        "titles": {
          "ar": "باب الْكَلَالَةِ",
          "en": "Chapter 18 – The ‘Kalala’ (a person who has neither parents nor offspring – 4:176)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:7:2:18",
        "titles": {
          "ar": "باب مِيرَاثِ الْوَلَدِ مَعَ الزَّوْجِ وَ الْمَرْأَةِ وَ الْأَبَوَيْنِ",
          "en": "Chapter 16 – Inheritance of the son with the husband and the wife, and the two parents"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:19",
    "titles": {
      "ar": "باب مِيرَاثِ الْأَبَوَيْنِ مَعَ الزَّوْجِ وَ الزَّوْجَةِ",
      "en": "Chapter 17 – Inheritance of the two parents with the husband and the wife"
    },
    "verse_count": 5,
    "verse_start_index": 13260,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/147)"
        ],
        "index": 13261,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:19:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي زَوْجٍ وَ أَبَوَيْنِ قَالَ لِلزَّوْجِ النِّصْفُ وَ لِلْأُمِّ الثُّلُثُ وَ لِلْأَبِ مَا بَقِيَ ",
          "وَ قَالَ فِي امْرَأَةٍ مَعَ أَبَوَيْنِ قَالَ لِلْمَرْأَةِ الرُّبُعُ وَ لِلْأُمِّ الثُّلُثُ وَ مَا بَقِيَ فَلِلْأَبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Mohsin Bin Ahmad, from Aban Bin Usman, from Ismail Al Ju’fy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a husband, and two parents. He<sup>asws</sup> said: ‘For the husband is the half, and for the mother is the one-third, and for the father is what remains’. ",
            "And he<sup>asws</sup> said regarding a woman with two parents: ‘For the woman is the one-quarter, and for the mother is the one-third, and what remains is for the father’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhassin ibn Ahmad from Aban ibn ‘Uthman from ’Isma‘il al-Ju‘fiy who has narrated the following: “About the case of a woman who leaves behind her husband and parents, abu Ja‘far, ‘Alayhi al-Salam, has said, ‘The share of the husband is one-half, the share of mother is one-third and the remaining belongs to the father.’ About the case of a man who leaves behind a wife and both parents, he (the Imam) said, ‘The share of the wife is one-fourth, the share of the mother is one-third and the remaining belongs to the father.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/148)"
        ],
        "index": 13262,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:19:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الرَّحْمَنِ الْجُعْفِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي زَوْجٍ وَ أَبَوَيْنِ قَالَ لِلزَّوْجِ النِّصْفُ وَ لِلْأُمِّ الثُّلُثُ وَ مَا بَقِيَ فَلِلْأَبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Ismail Bin Abdul Rahman Al Ju’fy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a husband and two parents. He<sup>asws</sup> said: ‘For the husband is the half, and for the mother is the third, and what remains is for the father’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj from ’Isma‘il ibn ‘Abd al-Rahman al-Ju‘fiy who has narrated the following: “About the case of a woman who leaves behind her husband and both parents, abu Ja‘far, ‘Alayhi al- Salam, has said, ‘The share of the husband is one-half, the share of mother is one-third and the remaining belongs to the father.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/148)"
        ],
        "index": 13263,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:19:3",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ جَمِيعاً عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ أَنَّ أَبَا جَعْفَرٍ <span class=\"bTxt\">( عليه السلام ) أَقْرَأَهُ صَحِيفَةَ الْفَرَائِضِ الَّتِي أَمْلَاهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ خَطَّ عَلِيٌّ ( عليه السلام )</span> بِيَدِهِ فَقَرَأْتُ فِيهَا امْرَأَةٌ تَرَكَتْ زَوْجَهَا وَ أَبَوَيْهَا فَلِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأُمِّ سَهْمَانِ الثُّلُثُ تَامّاً وَ لِلْأَبِ السُّدُسُ سَهْمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Ibn Abu Umeyr, and Muhammad Bin Isa, from Yunus, altogether from Umar Bin Azina, ",
            "(It has been narrated) from Muhammad Bin Muslim that Abu Ja’far<sup>asws</sup> made him read a parchment of the Obligations (legislated shares of inheritance) which Rasool-Allah<sup>saww</sup> had dictated, and written by Ali<sup>asws</sup> by his<sup>asws</sup> own hand. So he read in it, a woman left her husband and her two parents. So for the husband is the half, being three shares, and for the mother are two shares, being the complete third, and for the father is the sixth share’."
          ],
          "en.sarwar": [
            "3. It is narrated from the narrator of the previous Hadith from his father from ibn abu ‘Umayr and Muhammad ibn ‘Isa from Yunus all from ‘Umar ibn ’Udhaynah from Muhammad ibn Muslim who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, once made me (Muhammad ibn Muslim) to read the book of ordained shares which was dictated by the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, to Ali, ‘Alayhi al-Salam, who wrote it with his own hand. I read in it about the case of a woman who leaves behind her husband and her both parents. In such case for the husband is one-half; three shares, for the mother is two shares, one complete third and one-sixth belongs to the father.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/148)"
        ],
        "index": 13264,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:19:4",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ قُلْتُ لِزُرَارَةَ إِنَّ أُنَاساً قَدْ حَدَّثُونِي عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِأَشْيَاءَ فِي الْفَرَائِضِ فَأَعْرِضُهَا عَلَيْكَ فَمَا كَانَ مِنْهَا بَاطِلًا فَقُلْ هَذَا بَاطِلٌ وَ مَا كَانَ مِنْهَا حَقّاً فَقُلْ هَذَا حَقٌّ وَ لَا تَرْوِيهِ وَ اسْكُتْ فَحَدَّثْتُهُ بِمَا حَدَّثَنِي بِهِ مُحَمَّدُ بْنُ مُسْلِمٍ فِي الزَّوْجِ وَ الْأَبَوَيْنِ قَالَ وَ اللَّهِ هُوَ الْحَقُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Ibn Abu Umeyr, from Umar Bin Azina who said, ",
            "‘I said to Zurara, ‘The people are narrating to me from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> with things regarding the Obligations (legislated shares of inheritance), so I present these to you. So whatever was false from it, so say, ‘This is false’; and whatever was true from it, so say, ‘This is true’, and do not report it and remain silent’. So I narrated to him with what had been narrated to me by Muhammad Bin Muslim regarding the husband and the two parents. He said, ‘By Allah<sup>azwj</sup>, this is true!’"
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah who has narrated the following: “I once said to Zurarah that certain people narrated to me from abu Ja‘far and abu ‘Abd Allah, ‘Alayhim al-Salam, about certain things of ordained shares. I like to show them to you so you can tell me what is right and what is false; and about what is right, say that it is right but do not narrate and remain quiet, and I narrated to him what Muhammad ibn Muslim had narrated to me about husband and both parents. He said, ‘By Allah it is the truth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/148)"
        ],
        "index": 13265,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:19:5",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ رِبَاطٍ عَنْ عَبْدِ اللَّهِ بْنِ وَضَّاحٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ<span class=\"bTxt\"> ( عليه السلام )</span> فِي امْرَأَةٍ تُوُفِّيَتْ وَ تَرَكَتْ زَوْجَهَا وَ أُمَّهَا وَ أَبَاهَا قَالَ هِيَ مِنْ سِتَّةِ أَسْهُمٍ لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْأُمِّ الثُّلُثُ سَهْمَانِ وَ لِلْأَبِ السُّدُسُ سَهْمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ali Bin Al Hassan Bin Rabaat, from Abdullah Bin Wazzah, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a woman who passed away and left her husband, and her mother, and her father. He<sup>asws</sup> said: ‘It is from six shares – for the husband is the half, being three shares, and for the mother is the one-third, being two shares, and for the father is the one-sixth, being one share’."
          ],
          "en.sarwar": [
            "5. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from Ali ibn al-Hassan ibn Ribat from ‘Abd Allah ibn Waddah from abu Basir who has narrated the following: “About the case of a woman who leaves behind her husband, her mother and father, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is distributed from six shares, one-half, three shares for the husband, one-third, two shares for the mother and one-sixth is for the father.’ “Al-Fadl ibn Shadhan in this issue has said, ‘Of the proof that one-third of the legacy is for the mother is that all who oppose us have not said in this case that the mother receives one-sixth. They have said that mother receives one-third of what remains of the legacy. The remaining of the legacy is one-sixth but they do not allow opposing the words of the book, so they have kept the meaning of the words of the book, but they have opposed its law and it is against Allah and His book. The same is the case with the inheritance of a woman with parents. In this case, the share of the woman is one-fourth, the share of mother is one-third complete and the remaining is for the father. Allah, glorious is whose remembrance, has mentioned this ordained share and in the case before it the share of the woman is one-fourth, the share of husband is one-half, the share of mother is one-third and nothing is mentioned for the father. He has only said, ’His parents inherit him and for the mother is one-third.’ (4:11) The remaining belongs to the father, that is, the remaining of the legacy.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:19",
  "kind": "verse_list"
}