{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:7:2:2",
        "titles": {
          "ar": "باب",
          "en": "Chapter 1b"
        }
      }
    ],
    "index": 2028,
    "local_index": 2,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:7:2:3",
        "titles": {
          "ar": "باب أَنَّ الْمِيرَاثَ لِمَنْ سَبَقَ إِلَى سَهْمِ قَرِيبِهِ وَ أَنَّ ذَا السَّهْمِ أَحَقُّ مِمَّنْ لَا سَهْمَ لَهُ",
          "en": "Chapter 2 – The inheritance is for the one who precedes to a share of his near ones, and that the the one with a (legislated) share is more deserving than the one who has no (legislated) share for him"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:7:2:1",
        "titles": {
          "en": "Chapter 1a"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:2",
    "titles": {
      "ar": "باب",
      "en": "Chapter 1b"
    },
    "verse_count": 2,
    "verse_start_index": 13201,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 13202,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:2:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ يَزِيدَ الْكُنَاسِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ ابْنُكَ أَوْلَى بِكَ مِنِ ابْنِ ابْنِكَ وَ ابْنُ ابْنِكَ أَوْلَى بِكَ مِنْ أَخِيكَ قَالَ وَ أَخُوكَ لِأَبِيكَ وَ أُمِّكَ أَوْلَى بِكَ مِنْ أَخِيكَ لِأَبِيكَ قَالَ وَ أَخُوكَ لِأَبِيكَ أَوْلَى بِكَ مِنْ أَخِيكَ لِأُمِّكَ",
          "قَالَ وَ ابْنُ أَخِيكَ لِأَبِيكَ وَ أُمِّكَ أَوْلَى بِكَ مِنِ ابْنِ أَخِيكَ لِأَبِيكَ قَالَ وَ ابْنُ أَخِيكَ مِنْ أَبِيكَ أَوْلَى بِكَ مِنْ عَمِّكَ قَالَ وَ عَمُّكَ أَخُو أَبِيكَ مِنْ أَبِيهِ وَ أُمِّهِ أَوْلَى بِكَ مِنْ عَمِّكَ أَخِي أَبِيكَ مِنْ أَبِيهِ ",
          "قَالَ وَ عَمُّكَ أَخُو أَبِيكَ لِأَبِيهِ أَوْلَى بِكَ مِنْ عَمِّكَ أَخِي أَبِيكَ لِأُمِّهِ قَالَ وَ ابْنُ عَمِّكَ أَخِي أَبِيكَ مِنْ أَبِيهِ وَ أُمِّهِ أَوْلَى بِكَ مِنِ ابْنِ عَمِّكَ أَخِي أَبِيكَ لِأَبِيهِ قَالَ وَ ابْنُ عَمِّكَ أَخِي أَبِيكَ مِنْ أَبِيهِ أَوْلَى بِكَ مِنِ ابْنِ عَمِّكَ أَخِي أَبِيكَ لِأُمِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Sahl Bin Ziyad and Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Ahmad Bin Muhahhad, altogether from Ibn Mahboub, from Hisham Bin Salim, from Yazeed Al Kunasy, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Your son is more entitled with you than the son of your son (grandson); and a son of your son (grandson) is more entitled with you than your brother. And your brother from your father and your mother (full brother) is more entitled with you than your brother from your father (only – half brother). And your brother from your father (paternal half brother) is more entitled with you than your brother from your mother (maternal half brother). ",
            "And a son of your brother from your father and your mother (son of a full brother) is more entitled with you that the son of your brother from your father (only – son of half brother). And a son of your brother from your father (son of half brother) is more entitled with you than your paternal uncle. And your paternal uncle, a brother of your father from your father and your mother is more entitled with you than your paternal uncle, a brother of your father from his father.",
            "And you paternal uncle, a brother of your father, from his father is more entitled with you than your maternal uncle, a brother of your father from his mother. And a son of your paternal uncle, a brother of your father from his father and his mother, is more entitled with you than a son of your paternal uncle, a brother of your father from his father. And a son of your paternal uncle, a brother of your father from his father is more entitled with you than a son of your paternal uncle, a brother of your father, from his mother’."
          ]
        }
      },
      {
        "index": 13203,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:2:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ قَالَ أَخْبَرَنِي ابْنُ بُكَيْرٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> يَقُولُ وَ لِكُلٍّ جَعَلْنا مَوالِيَ مِمَّا تَرَكَ الْوالِدانِ وَ الْأَقْرَبُونَ قَالَ إِنَّمَا عَنَى بِذَلِكَ أُولِي الْأَرْحَامِ فِي الْمَوَارِيثِ وَ لَمْ يَعْنِ أَوْلِيَاءَ النِّعْمَةِ فَأَوْلَاهُمْ بِالْمَيِّتِ أَقْرَبُهُمْ إِلَيْهِ مِنَ الرَّحِمِ الَّتِي تَجُرُّهُ إِلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ibn Mahboub, from Ibn Bakeyr, from Zurara who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘<span class=\"ibTxt\">[4:33] And to everyone We have Appointed heirs of what parents and near relatives leave</span>’. He<sup>asws</sup> said: ‘But rather, it Means by that is the (priority of) entitlement of the womb relationships regarding the inheritances, and it does not mean the guardians of the bounties. Thus, the closest one with the deceased is the nearest one to him from the womb relations which flows towards him’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:2",
  "kind": "verse_list"
}