{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:7:2:21",
        "titles": {
          "ar": "باب مِيرَاثِ الْإِخْوَةِ وَ الْأَخَوَاتِ مَعَ الْوَلَدِ",
          "en": "Chapter 19 – Inheritance of the brothers and the sisters with the children"
        }
      }
    ],
    "index": 2047,
    "local_index": 21,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:7:2:22",
        "titles": {
          "ar": "باب الْجَدِّ",
          "en": "Chapter 20 – The Grandfather"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:7:2:20",
        "titles": {
          "ar": "باب الْكَلَالَةِ",
          "en": "Chapter 18 – The ‘Kalala’ (a person who has neither parents nor offspring – 4:176)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:21",
    "titles": {
      "ar": "باب مِيرَاثِ الْإِخْوَةِ وَ الْأَخَوَاتِ مَعَ الْوَلَدِ",
      "en": "Chapter 19 – Inheritance of the brothers and the sisters with the children"
    },
    "verse_count": 8,
    "verse_start_index": 13268,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/150)"
        ],
        "index": 13269,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1848",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:1",
        "text": [
          " وَقَعَ بَيْنَ رَجُلَيْنِ مِنْ بَنِي عَمِّي مُنَازَعَةٌ فِي مِيرَاثٍ فَأَشَرْتُ عَلَيْهِمَا بِالْكِتَابِ إِلَيْهِ فِي ذَلِكَ لِيَصْدُرَا عَنْ رَأْيِهِ فَكَتَبَا إِلَيْهِ جَمِيعاً جَعَلَنَا اللَّهُ فِدَاكَ مَا تَقُولُ فِي امْرَأَةٍ تَرَكَتْ زَوْجَهَا وَ ابْنَتَهَا لِأَبِيهَا وَ أُمِّهَا وَ قُلْتُ جُعِلْتُ فِدَاكَ إِنْ رَأَيْتَ أَنْ تُجِيبَنَا بِمُرِّ الْحَقِّ ",
          "فَخَرَجَ إِلَيْهِمَا كِتَابٌ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ عَافَانَا اللَّهُ وَ إِيَّاكُمَا أَحْسَنَ عَافِيَةٍ فَهِمْتُ كِتَابَكُمَا ذَكَرْتُمَا أَنَّ امْرَأَةً مَاتَتْ وَ تَرَكَتْ زَوْجَهَا وَ ابْنَتَهَا وَ أُخْتَهَا لِأَبِيهَا وَ أُمِّهَا فَالْفَرِيضَةُ لِلزَّوْجِ الرُّبُعُ وَ مَا بَقِيَ فَلِلِابْنَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Al Hassan Al Ashary who said, ",
            "‘There occurred a dispute among two men from the sons of my uncle regarding inheritance. So I advised them to write a letter to him<sup>asws</sup> with regards to that in order to acquire his<sup>asws</sup> view. ",
            "So they both wrote to him together, ‘May Allah<sup>azwj</sup> Make us to be sacrificed for you<sup>asws</sup>! What are you<sup>asws</sup> saying regarding a woman who left her husband and her daughter of her father and her mother?’ And I said, ‘May I be sacrificed for you<sup>asws</sup>! If you<sup>asws</sup> give your<sup>asws</sup> view, answer us with the bitterness of the truth’. ",
            "So there came out a letter to them both: ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. May Allah<sup>azwj</sup> Grant us<sup>asws</sup> and you good health, with the best of health. I understood your letter wherein you mentioned that a woman died and left her husband, and her daughter, and her sister from her father and her mother. So the Obligation (legislated shares of inheritance) is – for the husband is the one-quarter, and whatever remains is for the daughter’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn al-Hassan al-Ash‘ariy who has narrated the following: “A dispute took place between two men of the sons of my uncle on a legacy. I pointed out for them to write to him (the Imam), ‘Alayhi al-Salam, about it to find out his opinion in the matter. They wrote, ‘We pray to Allah to keep our souls in service for your cause, what do you say about the case of a woman who leaves behind her husband and her daughter from her father and mother?’ I said, ‘I pray to Allah to keep my soul in service for your cause, if you consider it proper answer us with the bitter truth.’ A letter came to them that said, “In the name of Allah, the Beneficent, the Merciful. May Allah grant you and us good health and the best form. I understood your letter in which you have mentioned that a woman has left behind her husband, her daughter and a sister from her both parents. The ordained share of the husband is one-fourth and the rest belongs to the daughter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/150)"
        ],
        "index": 13270,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4415",
              "text": "عَبْدِ اللَّهِ بْنِ مُحْرِزٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُحْرِزٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:2",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلٌ تَرَكَ ابْنَتَهُ وَ أُخْتَهُ لِأَبِيهِ وَ أُمِّهِ فَقَالَ الْمَالُ كُلُّهُ لِلِابْنَةِ وَ لَيْسَ لِلْأُخْتِ مِنَ الْأَبِ وَ الْأُمِّ شَيْ‏ءٌ فَقُلْتُ فَإِنَّا قَدِ احْتَجْنَا إِلَى هَذَا وَ الْمَيِّتُ رَجُلٌ مِنْ هَؤُلَاءِ النَّاسِ وَ أُخْتُهُ مُؤْمِنَةٌ عَارِفَةٌ قَالَ فَخُذِ النِّصْفَ لَهَا خُذُوا مِنْهُمْ كَمَا يَأْخُذُونَ مِنْكُمْ فِي سُنَّتِهِمْ وَ قَضَايَاهُمْ ",
          "قَالَ ابْنُ أُذَيْنَةَ فَذَكَرْتُ ذَلِكَ لِزُرَارَةَ فَقَالَ إِنَّ عَلَى مَا جَاءَ بِهِ ابْنُ مُحْرِزٍ لَنُوراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Abdulah Bin Muhzar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man left his daughter and his sister from his father and his mother’. So he<sup>asws</sup> said: ‘The wealth, all of it is for the daughter and there is nothing for the sister of the father and the mother’. So I said, ‘So we are needy upon this, and the deceased was a man from those people, and his sister was a Believer, understanding’. He<sup>asws</sup> said, ‘So take the half for her. Take from them just as they are taking from you regarding their ways and their judgements’. ",
            "Ibn Azina said, ‘So I mentioned that to Zurara, so he said, ‘Surely what Ibn Muhriz has come with is enlightening’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from ‘Abd Allah ibn Muhriz who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who dies and leaves behind his daughter and his sister from his father and mother. He (the Imam) said, ‘The entire legacy belongs to the daughter and there is nothing for the sister from his father and mother.’ I then said, ‘We need it. The deceased is from those people and his sister is a believing person, well-aware.’ He (the Imam) said, ‘Take one-half from them as they take from you according to their Sunnah and judgments.’ Ibn ’Udhaynah has said, ‘I mentioned it to Zurarah and he said, “What ibn Muhriz has brought is certainly light.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/151)"
        ],
        "index": 13271,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/405",
              "text": "بُكَيْرِ بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ جَمِيعاً عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُكَيْرِ بْنِ أَعْيَنَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:3",
        "relations": {
          "Mentions": [
            "/books/quran:4:12",
            "/books/quran:4:176"
          ]
        },
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) امْرَأَةٌ تَرَكَتْ زَوْجَهَا وَ إِخْوَتَهَا لِأُمِّهَا وَ إِخْوَتَهَا وَ أَخَوَاتِهَا لِأَبِيهَا فَقَالَ لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْإِخْوَةِ مِنَ الْأُمِّ الثُّلُثُ الذَّكَرُ وَ الْأُنْثَى فِيهِ سَوَاءٌ وَ بَقِيَ سَهْمٌ فَهُوَ لِلْإِخْوَةِ وَ الْأَخَوَاتِ مِنَ الْأَبِ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ لِأَنَّ السِّهَامَ لَا تَعُولُ وَ لَا يُنْقَصُ الزَّوْجُ مِنَ النِّصْفِ وَ لَا الْإِخْوَةُ مِنَ الْأُمِّ مِنْ ثُلُثِهِمْ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَإِنْ كانُوا أَكْثَرَ مِنْ ذلِكَ فَهُمْ شُرَكاءُ فِي الثُّلُثِ وَ إِنْ كَانَتْ وَاحِدَةٌ فَلَهَا السُّدُسُ",
          "وَ الَّذِي عَنَى اللَّهُ تَبَارَكَ وَ تَعَالَى فِي قَوْلِهِ وَ إِنْ كانَ رَجُلٌ يُورَثُ كَلالَةً أَوِ امْرَأَةٌ وَ لَهُ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ واحِدٍ مِنْهُمَا السُّدُسُ فَإِنْ كانُوا أَكْثَرَ مِنْ ذلِكَ فَهُمْ شُرَكاءُ فِي الثُّلُثِ إِنَّمَا عَنَى بِذَلِكَ الْإِخْوَةَ وَ الْأَخَوَاتِ مِنَ الْأُمِّ خَاصَّةً وَ قَالَ فِي آخِرِ سُورَةِ النِّسَاءِ يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَ لَهُ أُخْتٌ يَعْنِي أُخْتاً لِأُمٍّ وَ أَبٍ أَوْ أُخْتاً لِأَبٍ فَلَها نِصْفُ ما تَرَكَ وَ هُوَ يَرِثُها إِنْ لَمْ يَكُنْ لَها وَلَدٌ...",
          "وَ إِنْ كانُوا إِخْوَةً رِجالًا وَ نِساءً فَلِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ فَهُمُ الَّذِينَ يُزَادُونَ وَ يُنْقَصُونَ وَ كَذَلِكَ أَوْلَادُهُمُ الَّذِينَ يُزَادُونَ وَ يُنْقَصُونَ وَ لَوْ أَنَّ امْرَأَةً تَرَكَتْ زَوْجَهَا وَ إِخْوَتَهَا لِأُمِّهَا وَ أُخْتَيْهَا لِأَبِيهَا كَانَ لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْإِخْوَةِ مِنْ الْأُمِّ سَهْمَانِ وَ بَقِيَ سَهْمٌ فَهُوَ لِلْأُخْتَيْنِ لِلْأَبِ وَ إِنْ كَانَتْ وَاحِدَةٌ فَهُوَ لَهَا لِأَنَّ الْأُخْتَيْنِ لِأَبٍ لَوْ كَانَتَا أَخَوَيْنِ لِأَبٍ لَمْ يُزَادَا عَلَى مَا بَقِيَ وَ لَوْ كَانَتْ وَاحِدَةٌ أَوْ كَانَ مَكَانَ الْوَاحِدَةِ أَخٌ لَمْ يُزَدْ عَلَى مَا بَقِيَ وَ لَا يُزَادُ أُنْثَى مِنَ الْأَخَوَاتِ وَ لَا مِنَ الْوَلَدِ عَلَى مَا لَوْ كَانَ ذَكَراً لَمْ يُزَدْ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Isa, from Yunus, altogether from Umar Bin Azina, from Bukeyr Bin Ayyn who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A woman left her husband and her brother from her mother, and her brothers and sisters from her father’. So he<sup>asws</sup> said: ‘For her husband is the half, being three shares; and for the brothers from the mother is the third, the males and the females being equal in it; and the remaining share, so it is for the brothers and the sister from the father, for the males being a share like the two females, because in the (legislated) shares, there is no deficiency, and the husband would not be reduced from the half, nor the sisters from the mother from their third, because Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h12\">[4:12]</a> but if they are more than that, they shall be sharers in the third </span>even if it was one, so for her would be a sixth.",
            "And what Allah<sup>azwj</sup> Blessed and High Means by His<sup>azwj</sup> Words, and if there was a man was inherited by a ‘<span class=\"iTxt\">Kalala</span>’ (one who is neither with a child nor a parent), or a woman, and for him is a brother or a sister, so for each one from them is the one-sixth. So if there were to be more than that, so they are participants in the third. But rather, what is Meant by that is the brothers and the sister from the mothers in particular. And He<sup>azwj</sup> Said at the end of <span class=\"iTxt\">Surah Nisa </span>(Chapter 4) <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h176\">[4:176]</a> Say: Allah Gives you a Verdict concerning the person who has neither parents nor offspring</span>. If a person died and there is no a child for him, and for him is a sister, meaning sisters from a father and a mother, or sister from a father, so for her is half of what is left, and he would inherit her if there does not happen to be a child for her.",
            "And if there were brethren, men and women, so for the male would be like of two females. So they are the ones who are increased and decreased, and similar to that is for their child who are increasing and decreasing, and even if a woman were to leaves her husband, and her brothers from her mother, and two sisters from her father, for the husband would be the half, being three shares, and for the brother from the mother, being two shares, and the remaining one share, so it is for the two sisters of the father, even if she was only one, so it is for her, because the two sisters from a father, if they were two brothers, they would not be increased over what remains, even if she was one, or there was in the place of one of her, a brother, he would not be increased over what remains, nor would there be any increase for the female from the sister, nor from the child over what was a male, it would not be increased upon him’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from Zurarah who has narrated the following: “Zurarah has said that al-‘Ammah (non-Shi‘ah) in their rules, decisions and ordained shares say something on consensus which is authoritative and binding upon them. In the case of a deceased who leaves behind his daughter or two daughters and his brother from his father and mother or his sister from his father and mother or his sister from father or his brother from his father, they give one-half to the daughter, two-thirds to the two daughters and the rest of legacy to his brother from his father and mother or his sister from his father or his sister from his father and mother, and not to the relatives from sons of his uncle or children of his brother. They do not give anything to the brothers from the mother. He (the narrator) has said that I said to them this is binding upon you. Allah has mentioned for brothers from the mother that Kalalah (burdensome people) inherit. Why do you not give them with a daughter anything when you give the sister from father, mother, and sister from father the rest of legacy instead of uncle and relatives? Allah, most Majestic, most Glorious, has mentioned them as Kalalah just as He has called brothers from mother as Kalalah. Allah, most Majestic, most Glorious, has said, ‘They ask your fatwa. Say Allah gives you a fatwa about Kalalah.’ Why you have separated them from each other? They say that it is because of Sunnah and consensus of the group. We ask, ‘Is it the Sunnah of Allah and the Sunnah of His messenger or the Sunnah of Satan and his friends?’ They say, ‘It is the Sunnah of so and so.’ We say, ‘You have followed us in two issues and opposed us in two issues. We say, ‘If a deceased leaves behind one of the four then Kalalah of the deceased does not inherit. If he leaves a father or a son, you say, ‘You are right.’ We say, ‘If he leaves behind mother or a daughter.’ You deny it. You have followed us about the daughter. You do not give to brothers from mother anything and you have opposed us about mother. Why do you give one-third to brothers from the mother with the mother when she is living and they inherit because of her right and relation? Brothers and sisters from the father and mother and brothers and sisters from the mother do not inherit with the father (existing); they inherit because of the father, so also brothers and sisters from the mother do not inherit with the mother (esisting). More strange is that you say, ‘Brothers from the mother do not inherit one-third, they bar the mother from one-third and she only receives one-sixth.’ It is due to ignorance and it is untrue. Consensus is falsely made about it. I then said to Zurarah, ‘Do you say it from your own opinion?’ He said, ‘If I say this from my opinion I will be a sinful person. I testify that it is the truth from Allah and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to your cause.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/152)"
        ],
        "index": 13272,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2226",
              "text": "بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ وَ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنْ بُكَيْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:4",
        "relations": {
          "Mentions": [
            "/books/quran:4:12",
            "/books/quran:4:176"
          ]
        },
        "text": [
          " جَاءَ رَجُلٌ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) فَسَأَلَهُ عَنِ امْرَأَةٍ تَرَكَتْ زَوْجَهَا وَ إِخْوَتَهَا لِأُمِّهَا وَ أُخْتَهَا لِأَبِيهَا فَقَالَ لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِلْإِخْوَةِ مِنَ الْأُمِّ الثُّلُثُ سَهْمَانِ وَ لِلْأُخْتِ مِنَ الْأَبِ السُّدُسُ سَهْمٌ ",
          "فَقَالَ لَهُ الرَّجُلُ فَإِنَّ فَرَائِضَ زَيْدٍ وَ فَرَائِضَ الْعَامَّةِ وَ الْقُضَاةِ عَلَى غَيْرِ ذَلِكَ يَا أَبَا جَعْفَرٍ يَقُولُونَ لِلْأُخْتِ مِنَ الْأَبِ ثَلَاثَةُ أَسْهُمٍ تَصِيرُ مِنْ سِتَّةٍ تَعُولُ إِلَى ثَمَانِيَةٍ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) وَ لِمَ قَالُوا ذَلِكَ قَالَ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ لَهُ أُخْتٌ فَلَها نِصْفُ ما تَرَكَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَإِنْ كَانَتِ الْأُخْتُ أَخاً قَالَ فَلَيْسَ لَهُ إِلَّا السُّدُسُ فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) فَمَا لَكُمْ نَقَصْتُمُ الْأَخَ إِنْ كُنْتُمْ تَحْتَجُّونَ لِلْأُخْتِ النِّصْفَ بِأَنَّ اللَّهَ سَمَّى لَهَا النِّصْفَ فَإِنَّ اللَّهَ قَدْ سَمَّى لِلْأَخِ الْكُلَّ وَ الْكُلُّ أَكْثَرُ مِنَ النِّصْفِ لِأَنَّهُ قَالَ عَزَّ وَ جَلَّ فَلَهَا النِّصْفُ وَ قَالَ لِلْأَخِ وَ هُوَ يَرِثُها يَعْنِي جَمِيعَ مَالِهَا إِنْ لَمْ يَكُنْ لَهَا وَلَدٌ فَلَا تُعْطُونَ الَّذِي جَعَلَ اللَّهُ لَهُ الْجَمِيعَ فِي بَعْضِ فَرَائِضِكُمْ شَيْئاً وَ تُعْطُونَ الَّذِي جَعَلَ اللَّهُ لَهُ النِّصْفَ تَامّاً ",
          "فَقَالَ لَهُ الرَّجُلُ أَصْلَحَكَ اللَّهُ فَكَيْفَ نُعْطِي الْأُخْتَ النِّصْفَ وَ لَا نُعْطِي الذَّكَرَ لَوْ كَانَتْ هِيَ ذَكَراً شَيْئاً قَالَ تَقُولُونَ فِي أُمٍّ وَ زَوْجٍ وَ إِخْوَةٍ لِأُمٍّ وَ أُخْتٍ لِأَبٍ يُعْطُونَ الزَّوْجَ النِّصْفَ وَ الْأُمَّ السُّدُسَ وَ الْإِخْوَةَ مِنَ الْأُمِّ الثُّلُثَ وَ الْأُخْتَ مِنَ الْأَبِ النِّصْفَ ثَلَاثَةً فَيَجْعَلُونَهَا مِنْ تِسْعَةٍ وَ هِيَ مِنْ سِتَّةٍ فَتَرْتَفِعُ إِلَى تِسْعَةٍ",
          "قَالَ وَ كَذَلِكَ تَقُولُونَ قَالَ فَإِنْ كَانَتِ الْأُخْتُ ذَكَراً أَخاً لِأَبٍ قَالَ لَيْسَ لَهُ شَيْ‏ءٌ فَقَالَ الرَّجُلُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جَعَلَنِيَ اللَّهُ فِدَاكَ فَمَا تَقُولُ أَنْتَ فَقَالَ لَيْسَ لِلْإِخْوَةِ مِنَ الْأَبِ وَ الْأُمِّ وَ لَا الْإِخْوَةِ مِنَ الْأُمِّ وَ لَا الْإِخْوَةِ مِنَ الْأَبِ مَعَ الْأُمِّ شَيْ‏ءٌ .",
          "قَالَ عُمَرُ بْنُ أُذَيْنَةَ وَ سَمِعْتُهُ مِنْ مُحَمَّدِ بْنِ مُسْلِمٍ يَرْوِيهِ مِثْلَ مَا ذَكَرَ بُكَيْرٌ الْمَعْنَى سَوَاءٌ وَ لَسْتُ أَحْفَظُهُ بِحُرُوفِهِ وَ تَفْصِيلِهِ إِلَّا مَعْنَاهُ قَالَ فَذَكَرْتُ ذَلِكَ لِزُرَارَةَ فَقَالَ صَدَقَا هُوَ وَ اللَّهِ الْحَقُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr and Muhammad Bin Isa, from Yunus, from Umar Bin Azina, from Bukeyr who said, ",
            "‘A man came over to Abu Ja’far<sup>asws</sup>, so he asked him<sup>asws</sup> about a woman who left her husband, and her brothers from her mother, and her sister from her father. So he<sup>asws</sup> said: ‘For the husband is the half, being three shares; and from the brothers of her mother is the one-third, being two shares; and for the sister from the father is a one-sixth, being one share’. ",
            "So the man said to him<sup>asws</sup>, ‘But the Obligations (legislated shares of inheritance) of Zayd, and Obligations of the general Muslims, and the judges, are upon other than that, O Abu Ja’far<sup>asws</sup>! They are saying that for the sister from the father are three shares, coming from six altered to eight’. So Abu Ja’far<sup>asws</sup> said: ‘And do they say this?’ He said, ‘Because Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h176\">[4:176]</a> (if a man dies (and) he has no son) and he has a sister, she shall have half of what he leaves</span>’. So Abu Ja’far<sup>asws</sup> said: ‘So if the sister was a brother?’ He said, ‘So there would be nothing for him except for the sixth’. So Abu Ja’far<sup>asws</sup> said to him: ‘So what is the matter with you all reducing the brother and arguing for the sister for the half, because Allah<sup>azwj</sup> has Named the half being for her. So if Allah<sup>azwj</sup> has Named for a brother the whole, and the whole is more than the half, because the Mighty and Majestic Said for her being the half, and Said for the brother <span class=\"ibTxt\">and he shall be her heir</span>, Meaning of the entirety of her wealth, if <span class=\"ibTxt\">she has no child </span>for her. So you all are not giving anything to those whom Allah<sup>azwj</sup> has Made the entirety of it, in some of your Obligations (legislated shares of inheritance), and you all are giving the complete to those whom Allah<sup>azwj</sup> has Made the half to be for’. ",
            "So the man said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! So how come we give the sister, the half, and we do not give anything to the male, even though she may have been a male?’ He<sup>asws</sup> said: ‘You are saying with regards to a mother, and a husband, and a brother from the mother, and a sister from the father – the husband is given the half, and the mother (is given) the sixth, and the brother from the mother (is given) the third, and the sister from the father (is given) the half three, so you make these from nine (portions), and this is from six, so you raise it to nine’. ",
            "He<sup>asws</sup> said, ‘It is like that which you are saying’. He said: ‘So if the sister was a brother from the father?’ He<sup>asws</sup> said: ‘There would be nothing for him’. So the man said to Abu Ja’far<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Make me to be sacrificed for you<sup>asws</sup>! So what are you<sup>asws</sup> saying?’ So he<sup>asws</sup> said: ‘There is not for the brothers from the father and the mother, nor for the brothers from the mother, nor for the brother from the father, along with the mother, anything’. ",
            "Umar Bin Azina said, ‘And I heard it from Muhammad Bin Muslim narrating it similar to what Bukeyr mentioned, the meaning, only that I did not memorise it by its words and its detail, except for its meaning’. He said, ‘So I mentioned that to Zurara, so he said, ‘True, by Allah<sup>azwj</sup> it is the truth!’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn ‘Isa from Yunus all from ‘Umar ibn ’Udhaynah from Bukayr ibn ‘A’yan who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who has left behind her husband, brothers from her mother and brothers and sisters from her father. He (the Imam) said, ‘The share of husband is one-half, three shares, the share of brothers from her mother is one-third, male and female receive equal shares. The one remaining share belongs to brothers and sisters from the father. Each male receives twice as much as a female; ordained shares do not face deficiency. The share of husband does not reduce from one-half and the share of brothers from her mother, which is one-third, does not reduce. Allah, most Majestic, most Glorious, has said, ‘. . . if they are more than this they share the one-third, if there is one he receives one-sixth.’ <a href=\"/#/books/quran:4#h12\">[4:12]</a> What Allah, most Blessed, most High, has meant by His words, ‘. . . if it is a man inherited by Kalalah (burdensome people) or a woman and has a brother or sister then everyone gets one-sixth and if they are more than this they share the one- third.’ By this Allah has meant brothers and sisters from mother only. Allah in the end of chapter four has said, ‘. . . they ask for a fatwa from you about Kalalah. If a man dies and has no children but has a sister [meaning sister from both parents and sister from the father] she receives one-half of the legacy and he inherits her, if she does not leave children. If they are brothers and sisters, the share of the male is twice as much as the share of female.’ They are the ones whose shares increase and decrease. So also are their children whose shares increase and decrease. If a woman dies and leaves behind her husband and brothers from her mother and two sisters from her father, the share of husband is one- half, three shares, brothers from the mother receive two shares and one remaining share is for the two sisters from her father. If she is one, it is for her like two sisters from her father; if they were brothers from the father, no increase would take place in the remaining. If she was one or in the place of one female, there was a brother no increase would take place in the remaining. There is no increase for sisters or for a child if he was a male.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/153)"
        ],
        "index": 13273,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/362",
              "text": "أَبِي أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/458",
              "text": "عَبْدِ اللَّهِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ وَ أَبِي أَيُّوبَ وَ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:5",
        "relations": {
          "Mentions": [
            "/books/quran:4:12",
            "/books/quran:4:176"
          ]
        },
        "text": [
          " قُلْتُ لَهُ مَا تَقُولُ فِي امْرَأَةٍ مَاتَتْ وَ تَرَكَتْ زَوْجَهَا وَ إِخْوَتَهَا لِأُمِّهَا وَ إِخْوَةً وَ أَخَوَاتٍ لِأَبِيهَا فَقَالَ لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِإِخْوَتِهَا لِأُمِّهَا الثُّلُثُ سَهْمَانِ الذَّكَرُ وَ الْأُنْثَى فِيهِ سَوَاءٌ وَ بَقِيَ سَهْمٌ فَهُوَ لِلْإِخْوَةِ وَ الْأَخَوَاتِ مِنَ الْأَبِ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ لِأَنَّ السِّهَامَ لَا تَعُولُ وَ إِنَّ الزَّوْجَ لَا يُنْقَصُ مِنَ النِّصْفِ وَ لَا الْإِخْوَةَ مِنَ الْأُمِّ مِنْ ثُلُثِهِمْ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَإِنْ كانُوا أَكْثَرَ مِنْ ذلِكَ فَهُمْ شُرَكاءُ فِي الثُّلُثِ وَ إِنْ كَانَ وَاحِداً فَلَهُ السُّدُسُ",
          "وَ إِنَّمَا عَنَى اللَّهُ فِي قَوْلِهِ تَعَالَى وَ إِنْ كانَ رَجُلٌ يُورَثُ كَلالَةً أَوِ امْرَأَةٌ وَ لَهُ أَخٌ أَوْ أُخْتٌ فَلِكُلِّ واحِدٍ مِنْهُمَا السُّدُسُ إِنَّمَا عَنَى بِذَلِكَ الْإِخْوَةَ وَ الْأَخَوَاتِ مِنَ الْأُمِّ خَاصَّةً وَ قَالَ فِي آخِرِ سُورَةِ النِّسَاءِ يَسْتَفْتُونَكَ قُلِ اللَّهُ يُفْتِيكُمْ فِي الْكَلالَةِ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَ لَهُ أُخْتٌ يَعْنِي بِذَلِكَ أُخْتاً لِأَبٍ وَ أُمٍّ أَوْ أُخْتاً لِأَبٍ فَلَها نِصْفُ ما تَرَكَ وَ هُوَ يَرِثُها إِنْ لَمْ يَكُنْ لَها وَلَدٌ ",
          "فَإِنْ كانَتَا اثْنَتَيْنِ فَلَهُمَا الثُّلُثانِ مِمَّا تَرَكَ وَ إِنْ كانُوا إِخْوَةً رِجالًا وَ نِساءً فَلِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ وَ هُمُ الَّذِينَ يُزَادُونَ وَ يُنْقَصُونَ قَالَ وَ لَوْ أَنَّ امْرَأَةً تَرَكَتْ زَوْجَهَا وَ أُخْتَيْهَا لِأُمِّهَا وَ أُخْتَيْهَا لِأَبِيهَا كَانَ لِلزَّوْجِ النِّصْفُ ثَلَاثَةُ أَسْهُمٍ وَ لِأُخْتَيْهَا لِأُمِّهَا الثُّلُثُ سَهْمَانِ وَ لِأُخْتَيْهَا لِأَبِيهَا السُّدُسُ سَهْمٌ وَ إِنْ كَانَتْ وَاحِدَةً فَهُوَ لَهَا لِأَنَّ الْأُخْتَيْنِ مِنَ الْأَبِ لَا يُزَادُونَ عَلَى مَا بَقِيَ وَ لَوْ كَانَ أَخٌ لِأَبٍ لَمْ يُزَدْ عَلَى مَا بَقِيَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Al A’ala Bin Razeyn, and Abu Ayoub, and Abdullah Bin Bukeyr, from Muhammad Bin Muslim, ",
            "(The narrator says), ‘I said to Abu Ja’far<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a woman who died and left her husband, and her brothers from her mother, and brothers and sister from her father?’ So he<sup>asws</sup> said: ‘For the husband is the half, being three shares, and for her brothers from her mother is the one-third, being two shares, and male and the female being equal in it, and the one remaining share, so it is for the brothers and the sister from the father, for the male being the like of a portion of two females, because for the (legislated) shares, there is no deficiency, and that the husband would not be reduced from the half, nor the brothers from the mother, from their third, because Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h12\">[4:12]</a> but if they are more than that, they shall be sharers in the third</span>. And if there was one, so for him would be the one-sixth.  ",
            "And what Allah<sup>azwj</sup> Blessed and High Means by His<sup>azwj</sup> Elevated Words, and if there was a man was inherited by a ‘<span class=\"iTxt\">Kalala</span>’ (one who is neither with a child nor a parent), or a woman, and for him is a brother or a sister, so for each one from them is the one-sixth. But rather, what is Meant by that is the brother and the sister from the mother in particular. And He<sup>azwj</sup> Said at the end of <span class=\"iTxt\">Surah Nisa</span> (Chapter 4) <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h176\">[4:176]</a> Say: Allah Gives you a Verdict concerning the person who has neither parents nor offspring</span>. If a person died and there is no child for him, and for him is a sister, meaning sisters from a father and a mother, or sister from a father, so for her is half of what is left, and he would inherit her if there does not happen to be a child for her.",
            "So if there two, so for the two of them would be two-thirds from what is left, and if there were brethren, men and women, so for the male would be like of two females. So they are the ones who are increased and decreased, and similar to that is for their child who are increasing and decreasing, and even if a woman were to leaves her husband, and her brothers from her mother, and two sisters from her father, for the husband would be the half, being three shares, and for the brother from the mother, being two shares, and the remaining one share, so it is for the two sisters of the father, even if she was only one, so it is for her, because the two sisters from a father, if they were two brothers, they would not be increased over what remains, even if she was one, so it would be for her, because the two sisters from the father would not be increased upon what remains, even if there was a brother of the father, he would not be increased above what remains’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr and Muhammad ibn ‘Isa from Yunus from ‘Umar ibn ’Udhaynah from Bukayr who has narrated the following: “Once a man came to abu Ja‘far, Alayhi al-Salam, and asked about a woman who has died and left behind her husband, brothers from her mother and her sister from her father. He (the Imam) said, ‘The share of the husband is one-half, three shares, brothers from her mother receive one-third, two shares and the sister from her father receives one-sixth which is one share.’ The man said to him (the Imam), ‘The laws of ordained shares of Zayd, the laws of ordained shares of ‘Ammah and judges are different, O abu Ja‘far. They say that the share of the sister from the father is three shares that are reduced from six to eight.’ Abu Ja’far, ‘Alayhi al-Salam, asked, ‘Why do they say so?’ He replied, ‘It is because of the words of Allah, most Majestic, most Glorious, ‘. . . and for him is a sister then her share is one- half of the legacy.’ Abu Ja‘far, then asked, ‘What is the rule if he was one brother instead of one sister?’ He replied, ‘He would have only one-sixth.’ Abu Ja‘far, ‘Alayhi al-Salam, said to him, ‘Why do you reduce the share of the brother if you argue to provide one-half for the sister, because Allah has mentioned one-half for her you must also take notice that Allah has mentioned Kalalah (burdensome people) of brothers more than one-half. Allah has said, ‘. . . her share is one-half.’ He has also said for the brother who inherits her, that is, all of her legacy if she does not have any children. So you do not give anything to the one for whom Allah has given all the legacy in certain laws of your ordained shares but you give complete to one whom Allah has given one-half.’ The man said, ‘I pray to Allah to keep you well, how do we give one-half to the sister and we do not give the male heir if she was a male?’ He (the Imam) said, ‘About a mother, husband, a brother from the mother and a sister from her father they give one-half to the husband. They give one-sixth to the mother, to the brothers from her mother one-third and to the sister from her father One-half of three. You can make nine and it is from six but is raised to nine. He (the Imam) said this is how you say it.’ He (man) said, ‘If she was a male and a brother from her father.’ He (the Imam) said, ‘There is nothing for him.’ The man then asked abu Ja‘far, ‘Alayhi al-Salam, saying ‘I pray to Allah to keep my soul in service for your cause, what do you say?’ He (the Imam) said, ‘There is nothing for brothers from her father and mother, brothers from her mother or brothers from her father with the existence of the mother.’ ‘Umar ibn ’Udhaynah has said, ‘I heard Muhammad ibn Muslim narrate a similar Hadith like that of Bukayr with the same meaning, but I did not memorize its wordings in details, but I memorized its meaning. He has said, ‘I mentioned it to Zurarah who said, “It is true by Allah. They both have spoken the truth.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/153)"
        ],
        "index": 13274,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2226",
              "text": "بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ بُكَيْرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:6",
        "relations": {
          "Mentions": [
            "/books/quran:4:12",
            "/books/quran:4:176"
          ]
        },
        "text": [
          " سَأَلَهُ رَجُلٌ عَنْ أُخْتَيْنِ وَ زَوْجٍ فَقَالَ النِّصْفُ وَ النِّصْفُ فَقَالَ الرَّجُلُ أَصْلَحَكَ اللَّهُ قَدْ سَمَّى اللَّهُ لَهُمَا أَكْثَرَ مِنْ هَذَا لَهُمَا الثُّلُثَانِ فَقَالَ مَا تَقُولُ فِي أَخٍ وَ زَوْجٍ فَقَالَ النِّصْفُ وَ النِّصْفُ فَقَالَ أَ لَيْسَ قَدْ سَمَّى اللَّهُ الْمَالَ فَقَالَ وَ هُوَ يَرِثُها إِنْ لَمْ يَكُنْ لَها وَلَدٌ "
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazal Bin Shazaan, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Bukeyr, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, ‘A man asked him<sup>asws</sup> about two sisters and a husband, so he<sup>asws</sup> said: ‘The half and the half’. So the man said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! Allah<sup>azwj</sup> has Named for them both, more than this. For the two of them is the two-thirds’. So he<sup>asws</sup> said: ‘So what would you say regarding a brother and a husband?’ So he said, ‘The half and the half’. So he<sup>asws</sup> said: ‘Has not Allah<sup>azwj</sup> Named the wealth, so He<sup>azwj</sup> Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h176\">[4:176]</a> and he shall be her heir </span>when there is no child for her?’"
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from ibn Mahbub from al-‘Ala’ ibn Razin and abu Ayyub and ‘Abd Allah ibn Bukayr from Muhammad ibn Muslim who has narrated the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of a woman who has left behind her husband, brothers from her mother and brothers and sisters from her father. He (the Imam) said, ‘The share of the husband is one-half, three shares, the share of brothers from her mother is one-third which is two shares; male and female receive equal shares. The one remaining share belongs to brothers and sisters from the father. Each male receives twice as much as a female; ordained shares do not face deficiency. The share of the husband does not reduce from one-half and the share of brothers from her mother, which is one-third, does not reduce. Allah, most Majestic, most Glorious, has said, ‘. . . if they are more than this they share the one-third, if there is one he receives one-sixth.’ <a href=\"/#/books/quran:4#h12\">[4:12]</a> What Allah, most Blessed, most High, has meant by His words, ‘. . . if it is a man inherited by Kalalah or a woman, and has a brother or sister then for everyone is one-sixth.’ By this Allah has meant brothers and sisters from the mother only. Allah in the end of chapter four has said, ‘. . . they ask for a fatwa from you about Kalalah. If a man dies and has no children but has a sister [meaning sister from mother and father] she receives one-half of the legacy and he inherits her if she does not leave children. If they are brothers, male and female the share of the male is twice as much as the share of the female.’ They are the ones whose shares increase and decrease. So also are their children whose shares increase and decrease. If a woman dies and leaves behind her husband and two sisters from her and two sisters from her father, the share of the husband is one-half, which is three shares, sisters from her mother one- third or two shares and for the sisters from her father one-sixth, one share. If she is one it is for her; two sisters from her father do not receive any increase from the remaining and if he was a brother from father he would not receive any increase from the remaining.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/153)"
        ],
        "index": 13275,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/326",
              "text": "مُوسَى بْنِ بَكْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ مُوسَى بْنِ بَكْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:7",
        "text": [
          " قُلْتُ لِزُرَارَةَ إِنَّ بُكَيْراً حَدَّثَنِي عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّ الْإِخْوَةَ لِلْأَبِ وَ الْأَخَوَاتِ لِلْأَبِ وَ الْأُمِّ يُزَادُونَ وَ يُنْقَصُونَ لِأَنَّهُنَّ لَا يَكُنَّ أَكْثَرَ نَصِيباً مِنَ الْإِخْوَةِ وَ الْأَخَوَاتِ لِلْأَبِ وَ الْأُمِّ لَوْ كَانُوا مَكَانَهُنَّ لِأَنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَ لَهُ أُخْتٌ فَلَها نِصْفُ ما تَرَكَ وَ هُوَ يَرِثُها إِنْ لَمْ يَكُنْ لَها وَلَدٌ يَقُولُ يَرِثُ جَمِيعَ مَالِهَا إِنْ لَمْ يَكُنْ لَهَا وَلَدٌ",
          "فَأَعْطَوْا مَنْ سَمَّى اللَّهُ لَهُ النِّصْفَ كَمَلًا وَ عَمَدُوا فَأَعْطَوُا الَّذِي سَمَّى اللَّهُ لَهُ الْمَالَ كُلَّهُ أَقَلَّ مِنَ النِّصْفِ وَ الْمَرْأَةُ لَا تَكُونُ أَبَداً أَكْثَرَ نَصِيباً مِنْ رَجُلٍ لَوْ كَانَ مَكَانَهَا ",
          "قَالَ فَقَالَ زُرَارَةُ وَ هَذَا قَائِمٌ عِنْدَ أَصْحَابِنَا لَا يَخْتَلِفُونَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali, from Abdullah Bin Al Mugheira, from Musa Bin Bakr who said, ",
            "‘I said to Zurara that Bukeyr narrated to me, from Abu Ja’far<sup>asws</sup> that the brothers of the father, and the sister of the fathers and the mother would be increased and decreased because these would not be more shares that the brother and the sisters of the father and the mother, even though they had been in their places, because Allah<sup>azwj</sup> Mighty and Majestic is Saying that a person dies and there is no child for him, and for him is a sister, so for her is a halve of what is left, and he would be inheriting her, if there does not happen to be a child for her, Saying that he would be inheriting the entirety of her wealth, if there does not happen to be a child for her. ",
            "But they are giving to the one whom Allah<sup>azwj</sup> has Named the half for him, the whole, and resorting to giving to the one for whom Allah<sup>azwj</sup> has Named to be the whole of the wealth, less than the half. And the woman would never ever be with a share more than the man, even though she may be in his place’. ",
            "He (the narrator) said, ‘So Zurara said, ‘And this is established in the presence of our companions, who are not differing with regards to it’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Jamil ibn Darraj from Bukayr who has narrated the following: “A man once asked abu Ja‘far, ‘Alayhi al-Salam, about two sisters and a husband. He (the Imam) said, ‘It is half and half.’ The man then said, ‘I pray to Allah to keep you well, Allah has mentioned their share to be more than that. Their share is two-thirds.’ He then asked, ‘What do you say about a brother and husband?’ He (the Imam) said, ‘It is half and half.’ He asked, ‘Has Allah not given the entire legacy, saying, “. . . and he inherits her if she has no children.”?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/154)"
        ],
        "index": 13276,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/239",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "جَمِيلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/148",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ جَمِيلٍ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:21:8",
        "text": [
          " قُلْتُ لَهُ رَجُلٌ تَرَكَ ابْنَتَهُ وَ أُخْتَهُ لِأَبِيهِ وَ أُمِّهِ فَقَالَ الْمَالُ كُلُّهُ لِابْنَتِهِ "
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Jameel, from Abdullah Bin Muhammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, ‘I said to him<sup>asws</sup>, ‘A man leaves his daughter, and his sister from his father and his mother’. So he<sup>asws</sup> said: ‘The wealth, all of it, is for his daughter’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from Musa ibn Bakr from Ali ibn Sa‘id who has narrated the following: “Zurarah once asked me, ‘What do you say about a man who leaves behind his parents and brothers from his mother?’ I replied, ‘The share of mother is one-sixth and the rest belongs to the father. ‘If there are brothers the share of the mother is one-sixth.’ He said, ‘These brothers are from the father. Brothers from father and mother receive the largest amount. Brothers from mother receive one-third and she receives one-sixth. It is one-sixth because brothers from father and brothers from father and mother bar her. The father spends on them so his share is expanded and the share of the mother is reduced for that reason. Brothers from the mother are not in it. They do not bar their mother from receiving one-third.’ I then asked, ‘Do brothers inherit from the mother anything?’ He said, ‘There is no doubt in it, it is just as I say to you.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/155)"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4422",
              "text": "عَبْدِ اللهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/326",
              "text": "مُوسَى بْنِ بَكْرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللهِ بْنِ الْمُغِيرَةِ عَنْ مُوسَى بْنِ بَكْرٍ قَالَ"
        },
        "part_type": "Hadith",
        "text": [
          " قُلْتُ لِزُرَارَةَ إِنَّ بُكَيْراً حَدَّثَنِي عَنْ أَبِي جَعْفَرٍ (عَلَيْهِ السَّلام) أَنَّ الإخْوَةَ لِلأبِ وَالأخَوَاتِ لِلأبِ وَالأمِّ يُزَادُونَ وَيُنْقَصُونَ لأنَّهُنَّ لا يَكُنَّ أَكْثَرَ نَصِيباً مِنَ الإخْوَةِ وَالأخَوَاتِ لِلأبِ وَالأمِّ لَوْ كَانُوا مَكَانَهُنَّ لأنَّ اللهَ عَزَّ وَجَلَّ يَقُولُ إِنِ امْرُؤٌ هَلَكَ لَيْسَ لَهُ وَلَدٌ وَلَهُ أُخْتٌ فَلَها نِصْفُ ما تَرَكَ وَهُوَ يَرِثُها إِنْ لَمْ يَكُنْ لَها وَلَدٌ يَقُولُ يَرِثُ جَمِيعَ مَالِهَا إِنْ لَمْ يَكُنْ لَهَا وَلَدٌ فَأَعْطَوْا مَنْ سَمَّى اللهُ لَهُ النِّصْفَ كَمَلا وَعَمَدُوا فَأَعْطَوُا الَّذِي سَمَّى اللهُ لَهُ الْمَالَ كُلَّهُ أَقَلَّ مِنَ النِّصْفِ وَالْمَرْأَةُ لا تَكُونُ أَبَداً أَكْثَرَ نَصِيباً مِنْ رَجُلٍ لَوْ كَانَ مَكَانَهَا قَالَ فَقَالَ زُرَارَةُ وَهَذَا قَائِمٌ عِنْدَ أَصْحَابِنَا لإ يَخْتَلِفُونَ فِيهِ."
        ],
        "translations": {
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Flassan ibn Ali from ‘Abd Allah ibn al-Mughirah from Musa ibn Bakr who has narrated the following: “I once said to Zurarah that ibn Bukayr has narrated to me from abu Ja‘far, ‘Alayhi al-Salam, that the shares of brothers from the father and sisters from father and mother increase and decrease. It is because their shares are not greater than the share of brothers and sisters from father and mother if they were in their place. Allah, most Majestic, most Glorious, says, ‘. . . if a man dies who does not leave behind a child and he has a sister, she receives one-half of the legacy and he receives the entire legacy if she does not leave behind any children.’ He says that he receives the entire legacy, which she leaves behind if she does not leave behind a child. Despite this, they give complete to one whose share Allah has mentioned as One-half and they give less than One-half to one whom Allah has given the entire legacy. The share of woman is never more than the share of man if he was in her place. He (the narrator) has said that Zurarah then said, ‘This is applied by our people without any difference.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/156)"
        ],
        "part_type": "Hadith",
        "text": [
          ""
        ],
        "translations": {
          "en.sarwar": [
            "10. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Jamil from ‘Abd Allah ibn Muhammad who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who dies and leaves behind his daughter, his sister from his both parents. He (the Imam) said, ‘The entire legacy belongs to his daughter.’” Al-Fadl has said, ‘Allah, most Majestic, most Glorious, has made a share for the sister if she does not leave behind a child saying, ‘. . . if a man dies and does not leave behind a child and has a sister her share is one-half of the legacy.’ If he leaves behind a child then there is nothing for her. If anyone gives to her, it is opposing Allah and His messenger. The same is the case with the children of children male or female regardless how far below they may be. Brothers and sisters do not inherit with a child and so also is the case with the existence of one or both parents. [Note: The words of al-Fadl continues for the next several pages of the Arabic text and are not translated.] "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:21",
  "kind": "verse_list"
}