{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:7:2:25",
        "titles": {
          "ar": "باب مِيرَاثِ ذَوِي الْأَرْحَامِ",
          "en": "Chapter 23 – Inheritance of the relatives"
        }
      }
    ],
    "index": 2051,
    "local_index": 25,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:25",
    "titles": {
      "ar": "باب مِيرَاثِ ذَوِي الْأَرْحَامِ",
      "en": "Chapter 23 – Inheritance of the relatives"
    },
    "verse_count": 9,
    "verse_start_index": 13310,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/176)"
        ],
        "index": 13311,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ كُلُّهُمْ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ شَيْ‏ءٍ مِنَ الْفَرَائِضِ فَقَالَ لِي أَ لَا أُخْرِجُ لَكَ كِتَابَ عَلِيٍّ ( عليه السلام ) فَقُلْتُ كِتَابُ عَلِيٍّ ( عليه السلام ) لَمْ يُدْرَسْ فَقَالَ يَا أَبَا مُحَمَّدٍ إِنَّ كِتَابَ عَلِيٍّ ( عليه السلام ) لَمْ يُدْرَسْ فَأَخْرَجَهُ فَإِذَا كِتَابٌ جَلِيلٌ وَ إِذَا فِيهِ رَجُلٌ مَاتَ وَ تَرَكَ عَمَّهُ وَ خَالَهُ قَالَ لِلْعَمِّ الثُّلُثَانِ وَ لِلْخَالِ الثُّلُثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad and Ali Bin Ibrahim, from his father and Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, all of them from Al Hassan Bin Mahboub, from Ali Bin Raib, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about something from the Obligations (legislated shares of inheritance), so he<sup>asws</sup> said to me: ‘Shall I<sup>asws</sup> bring out for you a Book of Ali<sup>asws</sup>?’ So I<sup>asws</sup> said, ‘The Book of Ali<sup>asws</sup> is not studied’. So he<sup>asws</sup> said: ‘O Abu Muhammad! The Book of Ali<sup>asws</sup> is not studied?’ So he<sup>asws</sup> brought it out, and it was a splendid Book, and therein was, a man who died and left his paternal uncle and his maternal uncle. He<sup>asws</sup> said: ‘For the paternal uncle is two-thirds and for the maternal uncle is the one-third’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from Muhammad ibn Yahya from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father and Humayd ibn Ziyad from al-Hassan ibn Muhammad all of them from ibn Mahbub from Ali ibn Ri’ab from abu Basir who has narrated the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about certain issues of ordained shares of inheritance. He (the Imam) said, ’Do you like if I show you the book of Ali, ‘Alayhi al-Salam ?’ I said, ‘But the book of Ali, ‘Alayhi al-Salam, is no longer studied.’ He (the Imam) said, ‘O abu Muhammad, how can you say that the book of Ali, ‘Alayhi al-Salam, is no longer studied?’ He (the Imam) brought it out and it was a magnificent book. I saw in it this case, ‘A man dies and leaves behind his paternal and maternal uncles.’ It said, ‘The paternal uncle receives two-thirds and the maternal uncle receives one- third.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/177)"
        ],
        "index": 13312,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْخَالُ وَ الْخَالَةُ يَرِثَانِ إِذَا لَمْ يَكُنْ مَعَهُمَا أَحَدٌ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ وَ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ فِي كِتابِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Ynusu, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The maternal uncle and the maternal aunt both inherit when there does not happen to be anyone with the two of them. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[8:75] and the possessors of relationships are nearer to each other in the Book of Allah</span>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from abu Basir who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘The maternal uncle and maternal aunt inherit if there are no other heirs. Allah, most Majestic, most Glorious, has said, ‘. . . relatives have priorities over other relatives according to the book of Allah.’(33:6)” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/177)"
        ],
        "index": 13313,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:3",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ وُهَيْبٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ الْخَالُ وَ الْخَالَةُ يَرِثَانِ إِذَا لَمْ يَكُنْ مَعَهُمَا أَحَدٌ يَرِثُ غَيْرُهُمَا إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ وَ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ فِي كِتابِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Wuheyb, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘The maternal uncle and the maternal aunt both inherit when there does not happen to be anyone apart from the two of them. Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\">[8:75] and the possessors of relationships are nearer to each other in the Book of Allah</span>’."
          ],
          "en.sarwar": [
            "3. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah, from Wuhayb from abu Basir who has narrated the following: “I once heard abu Ja‘far, ‘Alayhi al-Salam, saying, ‘Maternal uncle and maternal aunt inherit if there are no other heirs with them. Allah, most Majestic, most Glorious, has said, ‘. . . relatives have priorities over other relatives according to the book of Allah.’ (33:6)” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/177)"
        ],
        "index": 13314,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَسِّنِ بْنِ أَحْمَدَ عَنْ أَبَانٍ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي عَمَّةٍ وَ خَالَةٍ قَالَ الثُّلُثُ وَ الثُّلُثَانِ يَعْنِي لِلْعَمَّةِ الثُّلُثَانِ وَ لِلْخَالَةِ الثُّلُثُ .",
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدٍ عَنِ الْمُثَنَّى عَنْ أَبَانٍ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Mohsin Bin Ahmad, from Aban, from Abu Maryam, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a paternal aunt and a maternal aunt. He<sup>asws</sup> said: ‘The one-third and the two thirds – meaning for the paternal aunt is two thirds and for the maternal aunt is the one-third’. ",
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad, from Al Masny, from Aban, from Abu Maryam, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, similar to it’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhsin ibn Ahmad from Aban from abu Maryam who has narrated the following: “About the case of the paternal aunt and maternal aunt, abu Ja’far, ‘Alayhi al-Salam, has said, ‘It is one-third and two-thirds; two-thirds for the paternal aunt and one-third for the maternal aunt.’” Humayd ibn Ziyad, from al-Hassan ibn Muhammad, from al-Muthanna’, from Aban, from abu Maryam, from abu Ja‘far, ‘Alayhi al-Salam, has narrated a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/178)"
        ],
        "index": 13315,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:5",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ عَنْ وُهَيْبٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ تَرَكَ عَمَّتَهُ وَ خَالَتَهُ قَالَ لِلْعَمَّةِ الثُّلُثَانِ وَ لِلْخَالَةِ الثُّلُثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan, from Waheyb, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who left his paternal aunt and his maternal aunt. He<sup>asws</sup> said: ‘For the paternal aunt is the two-thirds and for the maternal aunt is the one-third’."
          ],
          "en.sarwar": [
            "5. Humayd ibn Ziyad has narrated from al-Hassan from Wuhayb from abu Basir who has narrated the following: “About the case of a man who has left behind his paternal aunt and maternal aunt, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The paternal aunt receives two-thirds and the maternal aunt receives one- third.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/178)"
        ],
        "index": 13316,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَمُوتُ وَ يَتْرُكُ خَالَهُ وَ خَالَتَهُ وَ عَمَّهُ وَ عَمَّتَهُ وَ ابْنَهُ وَ ابْنَتَهُ وَ أَخَاهُ وَ أُخْتَهُ فَقَالَ كُلُّ هَؤُلَاءِ يَرِثُونَ وَ يَحُوزُونَ فَإِذَا اجْتَمَعَتِ الْعَمَّةُ وَ الْخَالَةُ فَلِلْعَمَّةِ الثُّلُثَانِ وَ لِلْخَالَةِ الثُّلُثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who died and left his maternal uncle and his maternal aunt, and his paternal uncle and his paternal aunt, and his son, and his daughter, and his brother, and his sister. So he<sup>asws</sup> said: ‘All of them would be inheriting and possessing. So when the paternal aunt and the maternal aunt gather together, so for the paternal aunt is the two thirds, and for the maternal aunt is the one-third’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Muhammad ibn Muslim who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who dies and leaves behind a maternal uncle, maternal aunt, paternal uncle, paternal aunt, his son, his daughter, his brother and sister. He (the Imam) said, ‘All of them inherit and protect. When there are the paternal aunt and maternal uncle, then the paternal aunt receives two-thirds and the maternal uncle receives one-third of the legacy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/178)"
        ],
        "index": 13317,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سَهْلٍ عَنِ الْحُسَيْنِ بْنِ الْحَكَمِ عَنْ أَبِي جَعْفَرٍ الثَّانِي <span class=\"bTxt\">( عليه السلام )</span> فِي رَجُلٍ مَاتَ وَ تَرَكَ خَالَتَيْهِ وَ مَوَالِيَهُ قَالَ أُولُوا الْأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ الْمَالُ بَيْنَ الْخَالَتَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sahl, from Al Husayn Bin Al Hakam, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> regarding a man who died and left his two maternal aunts and his adherents. He<sup>asws</sup> said: ‘<span class=\"ibTxt\">[8:75] and the possessors of relationships are nearer to each other</span> – the wealth is between the two maternal aunts’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Sahf ibn Ziyad from af-Husayn ibn af-Hakam who has narrated the folfowing: “About the case of a man who dies leaving behind his two maternal aunts and relatives, abu Ja’far, ‘Alayhi al-Salam, has said, ‘Relatives have priorities over each other. The legacy belongs to the two maternal aunts.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/178)"
        ],
        "index": 13318,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ دُرُسْتَ بْنِ أَبِي مَنْصُورٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ رَجُلٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ إِنِ امْرُؤٌ هَلَكَ وَ تَرَكَ عَمَّتَهُ وَ خَالَتَهُ فَلِلْعَمَّةِ الثُّلُثَانِ وَ لِلْخَالَةِ الثُّلُثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Dorost Bin Abu Mansour, from Abu Al Magra, from a man, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘A person perished (died) and left his paternal aunt and his maternal aunt, so for the paternal aunt are two-thirds, and for the maternal aunt is the one-third’."
          ],
          "en.sarwar": [
            "8. Afi ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Durust ibn abu Mansur from abu af-Mighra’ from a man who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If a man dies and leaves behind a paternal aunt and maternal aunt, the paternal aunt receives two-thirds and the maternal aunt receives one-third of the legacy.’” Al-Fadl has said that if a deceased leaves behind two paternal uncles, one from both parents and the other from the father, the legacy belongs to the one who is from both parents. If a deceased leaves behind many uncles and aunts, the legacy among them is distributed by giving each male twice the share of a female. If a deceased leaves behind maternal uncles and aunts, the legacy is distributed between both male and female in equal shares. If he leaves behind a maternal uncle from both parents and one from mother’s side only, the legacy belongs to the uncle from both parents, and so is the case about paternal aunt and maternal aunt in this issue. The legacy belongs to the ones who are from both parents and not to the one who is just from the father’s side. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/179)"
        ],
        "index": 13319,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:25:9",
        "text": [
          "وَ قَدْ قَالَ النَّبِيُّ <span class=\"bTxt\">( صلى الله عليه وآله )</span> الْخَالُ وَارِثُ مَنْ لَا وَارِثَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And the Prophet<sup>saww</sup> has said: ‘The maternal uncle is an inheritor of the one who has not (other) inheritor for him’."
          ],
          "en.sarwar": [
            "9. The Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said: ‘A maternal uncle inherits one who has no other heirs.’” [Note: The next several pages of the Arabic text are the words of al-Fadl and are not translated.] "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:25",
  "kind": "verse_list"
}