{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:7:2:29",
        "titles": {
          "ar": "باب اخْتِلَافِ الرَّجُلِ وَ الْمَرْأَةِ فِي مَتَاعِ الْبَيْتِ",
          "en": "Chapter 27 – Differring of the man and the woman regarding the chattels of the house"
        }
      }
    ],
    "index": 2055,
    "local_index": 29,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:7:2:30",
        "titles": {
          "ar": "باب نَادِرٌ",
          "en": "Chapter 28 - Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:7:2:28",
        "titles": {
          "ar": "باب أَنَّ النِّسَاءَ لَا يَرِثْنَ مِنَ الْعَقَارِ شَيْئاً",
          "en": "Chapter 26 – The women do not inherit anything from the real estate"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:29",
    "titles": {
      "ar": "باب اخْتِلَافِ الرَّجُلِ وَ الْمَرْأَةِ فِي مَتَاعِ الْبَيْتِ",
      "en": "Chapter 27 – Differring of the man and the woman regarding the chattels of the house"
    },
    "verse_count": 1,
    "verse_start_index": 13341,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/191)"
        ],
        "index": 13342,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:29:1",
        "text": [
          " سَأَلَنِي هَلْ يَقْضِي ابْنُ أَبِي لَيْلَى بِالْقَضَاءِ ثُمَّ يَرْجِعُ عَنْهُ فَقُلْتُ لَهُ بَلَغَنِي أَنَّهُ قَضَى فِي مَتَاعِ الرَّجُلِ وَ الْمَرْأَةِ إِذْ مَاتَ أَحَدُهُمَا فَادَّعَاهُ وَرَثَةُ الْحَيِّ وَ وَرَثَةُ الْمَيِّتِ أَوْ طَلَّقَهَا الرَّجُلُ فَادَّعَاهُ الرَّجُلُ وَ ادَّعَتْهُ النِّسَاءُ بِأَرْبَعِ قَضِيَّاتٍ",
          "فَقَالَ وَ مَا ذَاكَ فَقُلْتُ أَمَّا أُولَيهُنَّ فَقَضَى فِيهِ بِقَوْلِ إِبْرَاهِيمَ النَّخَعِيِّ كَانَ يَجْعَلُ مَتَاعَ الْمَرْأَةِ الَّتِي لَا يَصْلُحُ لِلرِّجَالِ لِلْمَرْأَةِ وَ مَتَاعَ الرَّجُلِ الَّذِي لَا يَصْلُحُ لِلنِّسَاءِ لِلرَّجُلِ وَ مَا كَانَ لِلرِّجَالِ وَ النِّسَاءِ بَيْنَهُمَا نِصْفَانِ",
          "ثُمَّ بَلَغَنِي أَنَّهُ قَالَ إِنَّهُمَا مُدَّعِيَانِ جَمِيعاً فَالَّذِي بِأَيْدِيهِمَا جَمِيعاً بَيْنَهُمَا نِصْفَانِ ثُمَّ قَالَ الرِّجَالُ صَاحِبُ الْبَيْتِ وَ الْمَرْأَةُ الدَّاخِلَةُ عَلَيْهِ وَ هِيَ الْمُدَّعِيَةُ فَالْمَتَاعُ كُلُّهُ لِلرَّجُلِ إِلَّا مَتَاعَ النِّسَاءِ الَّذِي لَا يَكُونُ لِلرِّجَالِ فَهُوَ لِلْمَرْأَةِ",
          "ثُمَّ قَضَى بَعْدَ ذَلِكَ بِقَضَاءٍ لَوْ لَا أَنِّي شَاهَدْتُهُ لَمْ أَرُدَّهُ عَلَيْهِ مَاتَتِ امْرَأَةٌ مِنَّا وَ لَهَا زَوْجُهَا وَ تَرَكَتْ مَتَاعاً فَرَفَعْتُهُ إِلَيْهِ فَقَالَ اكْتُبُوا الْمَتَاعَ فَلَمَّا قَرَأَهُ قَالَ لِلزَّوْجِ هَذَا يَكُونُ لِلرَّجُلِ وَ الْمَرْأَةِ فَقَدْ جَعَلْنَاهُ لِلْمَرْأَةِ إِلَّا الْمِيزَانَ فَإِنَّهُ مِنْ مَتَاعِ الرَّجُلِ فَهُوَ لَكَ",
          "فَقَالَ لِي فَعَلَى أَيِّ شَيْ‏ءٍ هُوَ الْيَوْمَ قُلْتُ رَجَعَ إِلَى أَنْ قَالَ بِقَوْلِ إِبْرَاهِيمَ النَّخَعِيِّ أَنْ جَعَلَ الْبَيْتَ لِلرَّجُلِ ثُمَّ سَأَلْتُهُ عَنْ ذَلِكَ فَقُلْتُ لَهُ مَا تَقُولُ أَنْتَ فِيهِ فَقَالَ الْقَوْلَ الَّذِي أَخْبَرْتَنِي أَنَّكَ شَهِدْتَهُ وَ إِنْ كَانَ قَدْ رَجَعَ عَنْهُ فَقُلْتُ يَكُونُ الْمَتَاعُ لِلْمَرْأَةِ فَقَالَ أَ رَأَيْتَ إِنْ أَقَامَتْ بَيِّنَةً إِلَى كَمْ كَانَتْ تَحْتَاجُ فَقُلْتُ شَاهِدَيْنِ فَقَالَ لَوْ سَأَلْتَ مَنْ بَيْنَهُمَا يَعْنِي الْجَبَلَيْنِ وَ نَحْنُ يَوْمَئِذٍ بِمَكَّةَ لَأَخْبَرُوكَ أَنَّ الْجَهَازَ وَ الْمَتَاعَ يُهْدَى عَلَانِيَةً مِنْ بَيْتِ الْمَرْأَةِ إِلَى بَيْتِ زَوْجِهَا فَهِيَ الَّتِي جَاءَتْ بِهِ وَ هَذَا الْمُدَّعِي فَإِنْ زَعَمَ أَنَّهُ أَحْدَثَ فِيهِ شَيْئاً فَلْيَأْتِ عَلَيْهِ الْبَيِّنَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazal Bin Shazaan, altogether from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> asked me: ‘Has Ibn Abu Layli ever judged with a judgement, then retracted from it?’ So I said to him<sup>asws</sup>, ‘It has reached me that he judged with regards to the chattels (possessions) of the man and the woman, when one of the two had died, so the inheritors of the alive and the inheritors of the deceased claimed it, or the man divorced her, so the man claimed it and the women claimed it. He judged with four judgements’.",
            "So he<sup>asws</sup> said: ‘And what was that?’ So I said, ‘As for the first one of these, so he judged in it by the worlds of Ibrahim Al-Nakhai’e who had made the possessions of the woman which were not correct for the men, to be for the women, and the chattels of the man which were not correct for the women, to be for the men, and whatever was for the men and the women, (to be divided) between the two of them in two halves. ",
            "Then it reached me that he said, ‘They are both together claimants, so that which is their hands entirely, (to be divided) between the two of them by two halves’. Then he said, ‘The man is the owner of the house, and the woman is the coming upon him as an outsider, and she is the claimant, so the chattels, all of them are for the man except for the chattels of the woman which cannot happen to be for the men, so these are for the woman’. ",
            "Then he judged after that with such a judgement, had I not witnessed it, I would not have referred it to him. A woman from us died, and for her was her husband, and she left chattels. So we raised the matter to him, so he said, ‘Write down the (list of) chattels’. So when he read it, he said to the husband, ‘This which happens to be for the man and the woman, so we make it to be for the woman, except for the scale, for it is from a chattels of the man, so it is for you’. ",
            "So he<sup>asws</sup> said to me: ‘So upon which thing is he on today?’ I said, ‘He has reverted to what was said by the words of Ibrahim Al-Nakhai’e that the house is to be made to be for the man’. Then I asked him<sup>asws</sup> about that, so I said to him<sup>asws</sup>, ‘What are you<sup>asws</sup> saying with regards to it?’ So he<sup>asws</sup> said: ‘The words which you informed me<sup>asws</sup> that you witnessed it, even though he had reverted from it’. So I said, ‘The chattels (possessons) happen to be for the woman?’ So he<sup>asws</sup> said, ‘What is your view that if she had to establish proof, how much would she need to?’ So I said, ‘Two witnesses’. So he<sup>asws</sup> said: ‘If you were to ask the ones between the two mountains, and we are today at Makkah, they would tell you that the baggage and the chattels which were gifted openly from the house of the woman to the house of her husband, so these are which she came with, and if he were to claim, so if he claims that he has renewed any of these, so it is upon him to establish the proof’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from all from ibn abu ‘Umayr from ‘ Abd al-Rahman ibn al-Hajjaj who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once asked me, ‘Does ibn abu Layla 5 reverse his judgments? 5 I replied, ‘I have come to know that he issued a judgment about the assets of man and woman when one of them died and the living heirs claim it as well as the heirs of the dead, or when she is divorced then the men claim it as well as women. It is about four cases. He (the Imam) asked, ‘What are they? 5 I replied, ‘The first is that he issued judgment by the words of Ibrahim al-Nakha‘iy. He (Ibrahim) would give the items that were especially for women to women and those for men to men and whatever was for both men and women, divide between them half-and-half. Then I came to know that he said, “Men are the owner of the house and women are additions on them. She is the plaintiff. All items belong to men except those especially for women which are for women. 55 He then issued a judgment that if I had not experienced it I would not mention. A woman from us died and left behind her husband and assets. I took the case before him. He then asked us to list the goods. When he read it, he then said to the husband, “This is for both man and woman so we give it to the woman, except the balance because it is of the assets of man and it is for you. 55 5 He (the Imam) asked, ‘What is his judgment now? 5 I replied, ‘He has reversed and now he says according to the words of Ibrahim al-Nakha‘iy that the house is for man. 5 I then asked him (the Imam) what he (the Imam) said in the case. He (the Imam) said, ‘It is the case that you experienced and that he then reversed. 5 1 then asked, ‘Do the items belong to the woman? 5 He (the Imam) said, ‘Consider, if she were to present proof; how much proof would she need? 5 1 replied, ‘She needed two witnesses. 5 He (the Imam) said, ‘Were you to ask from between the two mountains - we were in Makkah in those days - they tell you that the items and assets that are given as gifts publicly from the house of the woman to the house of her husband is what she has brought (belongs to her). He is the plaintiff and if he thinks that he has increased anything to it he must present testimony. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:29",
  "kind": "verse_list"
}