{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 29"}, "path": "/books/al-kafi:7:2:29", "titles": {"ar": "باب نَادِرٌ", "en": "Chapter 28 - Miscellaneous"}}], "index": 2046, "local_index": 29, "part_type": "Chapter", "path": "/books/al-kafi:7:2:29", "titles": {"ar": "باب نَادِرٌ", "en": "Chapter 28 - Miscellaneous"}, "verse_count": 1, "verse_start_index": 13331, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 13332, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:29:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ تَزَوَّجَ أَرْبَعَ نِسْوَةٍ فِي عَقْدَةٍ وَاحِدَةٍ أَوْ قَالَ فِي مَجْلِسٍ وَاحِدٍ وَ مُهُورُهُنَّ مُخْتَلِفَةٌ قَالَ جَائِزٌ لَهُ وَ لَهُنَّ قُلْتُ أَ رَأَيْتَ إِنْ هُوَ خَرَجَ إِلَى بَعْضِ الْبُلْدَانِ فَطَلَّقَ وَاحِدَةً مِنَ الْأَرْبَعِ وَ أَشْهَدَ عَلَى طَلَاقِهَا قَوْماً مِنْ أَهْلِ تِلْكَ الْبِلَادِ وَ هُمْ لَا يَعْرِفُونَ الْمَرْأَةَ ثُمَّ تَزَوَّجَ امْرَأَةً مِنْ أَهْلِ تِلْكَ الْبِلَادِ بَعْدَ انْقِضَاءِ عِدَّةِ تِلْكَ الْمُطَلَّقَةِ ثُمَّ مَاتَ بَعْدَ مَا دَخَلَ بِهَا كَيْفَ يُقْسَمُ مِيرَاثُهُ ", "قَالَ إِنْ كَانَ لَهُ وَلَدٌ فَإِنَّ لِلْمَرْأَةِ الَّتِي تَزَوَّجَهَا أَخِيراً مِنْ أَهْلِ تِلْكَ الْبِلَادِ رُبُعَ ثُمُنِ مَا تَرَكَ وَ إِنْ عُرِفَتِ الَّتِي طُلِّقَتْ مِنَ الْأَرْبَعِ بِعَيْنِهَا وَ نَسَبِهَا فَلَا شَيْ‏ءَ لَهَا مِنَ الْمِيرَاثِ وَ عَلَيْهَا الْعِدَّةُ ", "قَالَ وَ يَقْسِمْنَ الثَّلَاثُ نِسْوَةٍ ثَلَاثَةَ أَرْبَاعِ ثُمُنِ مَا تَرَكَ وَ عَلَيْهِنَّ الْعِدَّةُ وَ إِنْ لَمْ تُعْرَفِ الَّتِي طُلِّقَتْ مِنَ الْأَرْبَعِ اقْتَسَمْنَ الْأَرْبَعُ نِسْوَةٍ ثَلَاثَةَ أَرْبَاعِ ثُمُنِ مَا تَرَكَ بَيْنَهُنَّ جَمِيعاً وَ عَلَيْهِنَّ جَمِيعاً الْعِدَّةُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Ibn Raib, from Abu Baseer who said, ", "‘I asked Abu Ja’far<sup>asws</sup> about a man who married four women in one contract, or I said, in one gathering, their dowries being different. He<sup>asws</sup> said: ‘It is allowed for him and for them’. I said, ‘What is your<sup>asws</sup> view if he goes out to one of the cities, so he divorces one of the four, and a group from that city bear witness to his divorce, and they do not know the woman. Then he married a woman from the people of that city, after the passing of the waiting period of that divorced woman. Then he dies after that, after having gone to bed with her. How should his inheritance be distributed?’ ", "He<sup>asws</sup> said: ‘If there were children for him, so the woman whom he married at the end, from the people of that city is a quarter of the eight of what is left (as legacy). And if the woman who had been divorced from the four is recognised by sight and her lineage, so there is nothing for her from the inheritance, and upon her is the waiting period’. ", "He<sup>asws</sup> said: ‘And the three woman would divide the three-fourth of the (remaining) one-eighth of what is left, and upon them is the waiting period. And if the one from the four who had been divorced is not recognised, she would be apportion as the four women’, three-fourth of the one-eighth of what is left, between them all, and upon them all is the waiting period’."]}}]}, "index": "al-kafi:7:2:29", "kind": "verse_list"}