{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:7:2:34",
        "titles": {
          "ar": "باب مِيرَاثِ ذَوِي الْأَرْحَامِ مَعَ الْمَوَالِي",
          "en": "Chapter 32 – Inheritance of the relatives with the Mawali (slave)"
        }
      }
    ],
    "index": 2060,
    "local_index": 34,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:7:2:35",
        "titles": {
          "ar": "باب مِيرَاثِ الْغَرْقَى وَ أَصْحَابِ الْهَدْمِ",
          "en": "Chapter 33 – Inheritance of the drowned and the ones crushed under a collapsed building"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:7:2:33",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب فِي مِيرَاثِ الْمُطَلَّقَاتِ</span> فِي الْمَرَضِ وَ غَيْرِ الْمَرَضِ",
          "en": "Chapter 31 – Regarding inheritance of the divorced women during the illness and without illness"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:34",
    "titles": {
      "ar": "باب مِيرَاثِ ذَوِي الْأَرْحَامِ مَعَ الْمَوَالِي",
      "en": "Chapter 32 – Inheritance of the relatives with the Mawali (slave)"
    },
    "verse_count": 9,
    "verse_start_index": 13357,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/199)"
        ],
        "index": 13358,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ زُرْعَةَ عَنْ سَمَاعَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ عَلِيّاً ( عليه السلام ) لَمْ يَكُنْ يَأْخُذُ مِيرَاثَ أَحَدٍ مِنْ مَوَالِيهِ إِذَا مَاتَ وَ لَهُ قَرَابَةٌ كَانَ يَدْفَعُ إِلَى قَرَابَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus Bin Abdul Rahman, from Zur’at, from Sama’at who said, ",
            "‘Abu Abdullah<sup>asws</sup> said that Ali<sup>asws</sup> never used to take the inheritance of anyone from his<sup>asws</sup> Mawali upon his death and there was a relative of his. He<sup>asws</sup> used to hand it over to his relatives’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his Muhammad ibn ‘Isa ibn ‘Ubayd from Yunus ibn ‘Abd al-Rahman from Zur’ah from Sama‘ah who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali, ‘Alayhi al-Salam, did not take the legacy of any of his Mawali upon their death; instead if he had a relative he (the Imam) would give it to them/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/199)"
        ],
        "index": 13359,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي خَالَةٍ جَاءَتْ تُخَاصِمُ فِي مَوْلَى رَجُلٍ مَاتَ فَقَرَأَ هَذِهِ الْآيَةَ وَ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ فِي كِتابِ اللَّهِ فَدَفَعَ الْمِيرَاثَ إِلَى الْخَالَةِ وَ لَمْ يُعْطِ الْمَوْلَى ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a maternal aunt who came disputing regarding the slave of a man who had died. So he<sup>asws</sup> read this Verse <span class=\"ibTxt\">[33:6] and the possessors of relationships some of them are closer to others in the Book of Allah</span> – so he<sup>asws</sup> handed over the inheritance to the maternal aunt and did not give it to the master’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from ‘Asem ibn Humayd from Muhammad ibn Qays who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that ’ Amir al-Mu’minin, issued a judgment in the case of a maternal aunt who disputed against a Mawla’ (master) of a man who had died. He read this verse, . the relatives have priority over each other according to the book of Allah.’ (33:6) He (the Imam) gave the legacy to the maternal aunt instead of the Mawla ’ (Master).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/200)"
        ],
        "index": 13360,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ عَنْ حَنَانٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيُّ شَيْ‏ءٍ لِلْمَوَالِي فَقَالَ لَيْسَ لَهُمْ مِنَ الْمِيرَاثِ إِلَّا مَا قَالَ اللَّهُ عَزَّ وَ جَلَّ إِلَّا أَنْ تَفْعَلُوا إِلى أَوْلِيائِكُمْ مَعْرُوفاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and others, from Ahmad Bin Muhammad, from Al Hassan Bin Al Jaham, from Hanan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Which thing is for the Mawla (Master)?’ So he<sup>asws</sup> said: ‘There is nothing for them from the inheritance except what Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\">[33:6] except that you should do good to your guardians</span>’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya and others have narrated from Ahmad ibn Muhammad from al-Hassan ibn al-Jahm from Hanan who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about what is for a Mawla ’ (Master). He (the Imam) said, ‘There is nothing for them (Mawla’ (Masters)) except what Allah, most Majestic, most Glorious, has said, ‘. . . except if you do well-liked favor to your guardians.’ (33:6)” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/200)"
        ],
        "index": 13361,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ أَبِي الْحَمْرَاءِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيُّ شَيْ‏ءٍ لِلْمَوَالِي مِنَ الْمِيرَاثِ فَقَالَ لَيْسَ لَهُمْ شَيْ‏ءٌ إِلَّا التَّرْبَاءُ يَعْنِي التُّرَابَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazal, from Ibn Abu Al Hamra’a who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Which thing from the inheritance, is for the Mawla (Master)?’ So he<sup>asws</sup> said: ‘There is nothing for them except for the soil, meaning dust’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn abu al-Hamra’ who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about what Mawla’ (Master) receives of inheritance. He (the Imam) said, ‘They receive nothing except soil, that is, dirt.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/200)"
        ],
        "index": 13362,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:5",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ عَلِيٌّ ( عليه السلام ) إِذَا مَاتَ مَوْلًى لَهُ وَ تَرَكَ ذَا قَرَابَةٍ لَمْ يَأْخُذْ مِنْ مِيرَاثِهِ شَيْئاً وَ يَقُولُ أُولُوا الْأَرْحامِ بَعْضُهُمْ أَوْلى بِبَعْضٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Abdullah Bin Sinan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Ali<sup>asws</sup>, whenever a slave of his<sup>asws</sup> died and left relatives, he<sup>asws</sup> would not take anything from his inheritance, and he<sup>asws</sup> was saying <span class=\"ibTxt\">[33:6] and the possessors of relationships some of them are closer to others</span>’."
          ],
          "en.sarwar": [
            "5. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ‘Abd Allah ibn Sinan who has narrated the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying that Ali, ‘Alayhi al-Salam, upon the death of his slaves did not take anything from their legacy if they left any relatives, and he would say, ‘. . . relatives have priority to each other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/201)"
        ],
        "index": 13363,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:6",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ مُحَمَّدِ بْنِ تَسْنِيمٍ الْكَاتِبِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ عَمْرٍو الْأَزْرَقِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ سَأَلَهُ رَجُلٌ عَنْ رَجُلٍ مَاتَ وَ تَرَكَ ابْنَةَ أُخْتٍ لَهُ وَ تَرَكَ مَوَالِيَ وَ لَهُ عِنْدِي أَلْفُ دِرْهَمٍ وَ لَمْ يَعْلَمْ بِهَا أَحَدٌ فَجَاءَتِ ابْنَةُ أُخْتِهِ فَرَهَنَتْ عِنْدِي مُصْحَفاً فَأَعْطَيْتُهَا ثَلَاثِينَ دِرْهَماً فَقَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حِينَ قُلْتُ لَهُ عَلِمَ بِهَا أَحَدٌ قُلْتُ لَا قَالَ فَأَعْطِهَا إِيَّاهَا قِطْعَةً قِطْعَةً وَ لَا تُعْلِمْ أَحَداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hassan Al Taymi, from Muhammad Bin Tasneem the scribe, from Abdul Rahman Bin Amro, and from Muhammad Bin Sinan, from Amro Al Azraq who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying, and a man asked him<sup>asws</sup> about a man who died and left a daughter of his sister, and left slaves, and for him, with me are a thousand Dirhams, and no one knows about it. ",
            "So the daughter of his sister came over and she kept parchments with me as security, so I gave her thirty Dirhams. So Abu Abdullah<sup>asws</sup> said to me: ‘Does anyone know of it?’ I said, ‘No’. He<sup>asws</sup> said: ‘So give her piece by piece, and do not let anyone know’."
          ],
          "en.sarwar": [
            "6. Ahmad ibn Muhammad has narrated from Ali ibn al-Hassan al-Tamimiy from Muhammad ibn Tasnim al-Katib from ‘Abd al-Rahman ibn ‘Amr al-Arzaq who has narrated the following: “A man asked him (the Imam) about the case of a man who dies leaving behind the daughter of his sister and slaves. He has left one thousand dirham with him about which no one knows anything. The daughter of his sister came and left a holy book with him as a security deposit. He gave her thirty dirham. I heard abu ‘Abd Allah, ‘Alayhi al-Salam, ask, ‘Does anyone know about?’ I replied, ‘No, no one knows anything about it.’ He (the Imam) said, ‘Give it to her piece by piece and do not inform anyone about it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/201)"
        ],
        "index": 13364,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:7",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ عَلِيٌّ ( عليه السلام ) لَا يَأْخُذُ مِنْ مِيرَاثِ مَوْلًى لَهُ إِذَا كَانَ لَهُ ذُو قَرَابَةٍ وَ إِنْ لَمْ يَكُونُوا مِمَّنْ يَجْرِي لَهُمُ الْمِيرَاثُ الْمَفْرُوضُ فَكَانَ يَدْفَعُ مَالَهُ إِلَيْهِمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ziyad, from Abdullah Bin Sinan,",
            "Abu Abdullah<sup>asws</sup> has said: ‘Ali<sup>asws</sup> never took from the inheritance of a slave of his when there was a relative of his, and if they did not happen to be from the one for whom flows the Obligatory inheritances, so he<sup>asws</sup> used to hand it over to them (the other relatives)’."
          ],
          "en.sarwar": [
            "7. Humayd ibn Ziyad has narrated from al-Hassan ibn m h ibn Sama‘ah from Muhammad ibn Ziyad from ‘Abd Allah ibn Sinan who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Ali, ‘Alayhi al-Salam, did not take anything from legacy of his slaves if they had relatives; and if the relatives were not of those who have the ordained shares, he would distribute the legacy among them (relatives).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/201)"
        ],
        "index": 13365,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي ثَابِتٍ عَنْ حَنَانٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَاتَ مَوْلًى لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ انْظُرُوا هَلْ تَجِدُونَ لَهُ وَارِثاً فَقِيلَ لَهُ ابْنَتَانِ بِالْيَمَامَةِ مَمْلُوكَتَانِ فَاشْتَرَاهُمَا مِنْ مَالِ مَوْلَاهُ الْمَيِّتِ ثُمَّ دَفَعَ إِلَيْهِمَا بَقِيَّةَ الْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Abu Sabit, from hanan, from Ibn Abu Yafour, from Is’haq Bin Ammar, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘A slave of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> died, so he<sup>asws</sup> said: ‘Look around, can you find an inheritor for him?’ So it was said to him<sup>asws</sup>, ‘There are two daughters of his at Yamama, both slaves’. So he<sup>asws</sup> bought them both from the wealth of the dead slave, then handed over the rest to them both’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from abu Thabit from Hanan from ibn abu ibn abu Ya’fur from Ishaq ibn ‘Ammar who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that a slave of Ali ibn al-Husayn, ‘Alayhim al-Salam, died. He asked to ascertain if he has left any relatives. It was said that he has two daughters in Yamamah who are owned. He (the Imam) bought them from the legacy of his slave who had died, then gave them the rest of the legacy.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بسنديه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/202)"
        ],
        "index": 13366,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:34:9",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ أَبِي ثَابِتٍ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ إِسْحَاقَ قَالَ مَاتَ مَوْلًى لِعَلِيِّ بْنِ الْحُسَيْنِ ( عليه السلام ) قَالَ انْظُرُوا هَلْ تَجِدُونَ لَهُ وَارِثاً فَقِيلَ لَهُ ابْنَتَانِ بِالْيَمَامَةِ مَمْلُوكَتَانِ فَاشْتَرَاهُمَا مِنْ مَالِ الْمَيِّتِ ثُمَّ دَفَعَ إِلَيْهِمَا بَقِيَّةَ الْمَالِ .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي ثَابِتٍ مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Abu Sabit, from hanan Bin Sudeyr, from Ibn Abu Yafour, from Is’haq who said, ",
            "‘A slave of Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> died. He<sup>asws</sup> said: ‘Look around, can you find an inheritor for him?’ So it was said to him<sup>asws</sup>, ‘There are two daughters for him at Al-Yamama, both slaves’. So he<sup>asws</sup> bought them both from the wealth of the deceased, then handed over to them the remainder of the wealth’. ",
            "<span style=\"font-size: small\">Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abu Sabit - </span>similar to it."
          ],
          "en.sarwar": [
            "9. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from abu Thabit from Hanan ibn Sadir from ibn abu Ya’fur from Ishaq who has narrated the following: “A slave of Ali ibn al-Husayn, ‘Alayhim al-Salam, died. He said, ‘You must look if you can find his heirs.’ It was said that he has two daughters in Yamamah who are owned. He (the Imam) bought them from the assets of the deceased and gave the rest of legacy to them.’” Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from abu Thabit a similar Hadith. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:34",
  "kind": "verse_list"
}