{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:7:2:35",
        "titles": {
          "ar": "باب مِيرَاثِ الْغَرْقَى وَ أَصْحَابِ الْهَدْمِ",
          "en": "Chapter 33 – Inheritance of the drowned and the ones crushed under a collapsed building"
        }
      }
    ],
    "index": 2061,
    "local_index": 35,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:7:2:36",
        "titles": {
          "ar": "باب مَوَارِيثِ الْقَتْلَى وَ مَنْ يَرِثُ مِنَ الدِّيَةِ وَ مَنْ لَا يَرِثُ",
          "en": "Chapter 34 – Inheritances of the murdered, and who would inherit from the wergild (blood money compensation), and who would not inherit"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:7:2:34",
        "titles": {
          "ar": "باب مِيرَاثِ ذَوِي الْأَرْحَامِ مَعَ الْمَوَالِي",
          "en": "Chapter 32 – Inheritance of the relatives with the Mawali (slave)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:35",
    "titles": {
      "ar": "باب مِيرَاثِ الْغَرْقَى وَ أَصْحَابِ الْهَدْمِ",
      "en": "Chapter 33 – Inheritance of the drowned and the ones crushed under a collapsed building"
    },
    "verse_count": 7,
    "verse_start_index": 13366,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/202)"
        ],
        "index": 13367,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:35:1",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْقَوْمِ يَغْرَقُونَ فِي السَّفِينَةِ أَوْ يَقَعُ عَلَيْهِمُ الْبَيْتُ فَيَمُوتُونَ فَلَا يُعْلَمُ أَيُّهُمْ مَاتَ قَبْلَ صَاحِبِهِ فَقَالَ يُوَرَّثُ بَعْضُهُمْ مِنْ بَعْضٍ كَذَلِكَ هُوَ فِي كِتَابِ عَلِيٍّ ( عليه السلام ) .",
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ مِثْلَهُ إِلَّا أَنَّهُ قَالَ كَذَلِكَ وَجَدْنَاهُ فِي كِتَابِ عَلِيٍّ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the people who are drowning in the ship, or the house collapses upon them, so they are dying. So it is not know who has died before his companions’. So he<sup>asws</sup> said: ‘They would inherit from each other, such is how it is in the Book of Ali<sup>asws</sup>’. ",
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdul Rahman Bin Al Hajjaj, ",
            "- similar to it, except that he<sup>asws</sup> said: ‘Such is how we<sup>asws</sup> have found it to be in the Book of Ali<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from ibn Mahbub from ‘ Abd al-Rahman ibn al-Hajjaj who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a people who drown with a ship or a house falls on them and they die; and it is not known who has died first. He (the Imam) said, ‘They inherit each other and that is how it is in the book of Ali, ‘Alayhi al-Salam.”’ Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Abd al-Rahman ibn al- Hajjaj a similar Hadith except that he has said, ‘This is how we found in the book of Ali, Alayhi al- Salam.’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/203)"
        ],
        "index": 13368,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:35:2",
        "text": [
          " سَأَلْتُهُ عَنْ بَيْتٍ وَقَعَ عَلَى قَوْمٍ مُجْتَمِعِينَ فَلَا يُدْرَى أَيُّهُمْ مَاتَ قَبْلُ قَالَ فَقَالَ يُوَرَّثُ بَعْضُهُمْ مِنْ بَعْضٍ ",
          "قُلْتُ فَإِنَّ أَبَا حَنِيفَةَ أَدْخَلَ فِيهَا شَيْئاً قَالَ وَ مَا أَدْخَلَ قُلْتُ رَجُلَيْنِ أَخَوَيْنِ أَحَدُهُمَا مَوْلَايَ وَ الْآخَرُ مَوْلًى لِرَجُلٍ لِأَحَدِهِمَا مِائَةُ أَلْفِ دِرْهَمٍ وَ الْآخَرُ لَيْسَ لَهُ شَيْ‏ءٌ رَكِبَا فِي السَّفِينَةِ فَغَرِقَا فَلَمْ يُدْرَ أَيُّهُمَا مَاتَ أَوَّلًا كَانَ الْمَالُ لِوَرَثَةِ الَّذِي لَيْسَ لَهُ شَيْ‏ءٌ وَ لَمْ يَكُنْ لِوَرَثَةِ الَّذِي لَهُ الْمَالُ شَيْ‏ءٌ قَالَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَقَدْ سَمِعَهَا وَ هُوَ هَكَذَا."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a house which fell upon a people who had gathered (and they all died). So it was not known which one of them died first’. So he<sup>asws</sup> said: ‘They would inherit from each other’. ",
            "I said, ‘But Abu Haneefa has included something in it’. He<sup>asws</sup> said: ‘And what has he included?’ I said, ‘Two men, brother, one of them was my slave and the other was a slave of another man. For one of them was a hundred thousand Dirham, and the other one, there was nothing for him. They both sailed in the ship, so they drowned. So it was not know which of the two died first. The wealth is for the inheritors of the one who had nothing for him, and nothing will be for the inheritors of the one who had the wealth’. So Abu Abdullah<sup>asws</sup> said: ‘He (Abu Haneefa) has heard it (the answer), and it is like this’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from all ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj who has narrated the following: “I once asked abu ‘Abd Allah, Alayhi al-Salam, about a people on whom a house falls and they all die. It is not known who has died first. He (the Imam) said, ‘They all inherit each other.’ I then said, ‘Abu Hanifah has introduced something in it.’ He (the Imam) asked, ‘What has he introduced?’ I said, ‘Two men who were brothers, one of them was my Mawla’ (slave) and the other was a Mawla’ of another man. One of them had one hundred thousand dirham and the other did not have anything. They embarked on a ship but they drowned and it is not known which one died first, the legacy belongs to the heirs of the one who had nothing and the heirs of the one who had the asset does not receive anything.’ Abu ‘Abd Allah, Alayhi al-Salam, said, ‘He (abu Hanifah) has heard it (the answer) and that is the way it is.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> السند الول صحيح والثاني موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/203)"
        ],
        "index": 13369,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1407",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1368",
              "text": "ابْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1968",
              "text": "مُحَمَّدِ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ وَ حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:35:3",
        "text": [
          " قُلْتُ لَهُ رَجُلٌ وَ امْرَأَةٌ سَقَطَ عَلَيْهِمَا الْبَيْتُ فَمَاتَا قَالَ يُوَرَّثُ الرَّجُلُ مِنَ الْمَرْأَةِ وَ الْمَرْأَةُ مِنَ الرَّجُلِ قَالَ قُلْتُ فَإِنَّ أَبَا حَنِيفَةَ قَدْ أَدْخَلَ عَلَيْهِمْ فِي هَذَا شَيْئاً قَالَ وَ أَيَّ شَيْ‏ءٍ أَدْخَلَ عَلَيْهِمْ قُلْتُ رَجُلَيْنِ أَخَوَيْنِ أَعْجَمِيَّيْنِ لَيْسَ لَهُمَا وَارِثٌ إِلَّا مَوَالِيهِمَا أَحَدُهُمَا لَهُ مِائَةُ أَلْفِ دِرْهَمٍ مَعْرُوفَةٍ وَ الْآخَرُ لَيْسَ لَهُ شَيْ‏ءٌ رَكِبَا فِي سَفِينَةٍ فَغَرِقَا فَأُخْرِجَتِ الْمِائَةُ أَلْفٍ كَيْفَ يُصْنَعُ بِهَا ",
          "قَالَ تُدْفَعُ إِلَى مَوَالِي الَّذِي لَيْسَ لَهُ شَيْ‏ءٌ قَالَ فَقَالَ مَا أُنْكِرُ مَا أَدْخَلَ فِيهَا صَدَقَ وَ هُوَ هَكَذَا ثُمَّ قَالَ يُدْفَعُ الْمَالُ إِلَى مَوَالِي الَّذِي لَيْسَ لَهُ شَيْ‏ءٌ وَ لَمْ يَكُنْ لِلْآخَرِ مَالٌ يَرِثُهُ مَوَالِي الْآخَرِ فَلَا شَيْ‏ءَ لِوَرَثَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Abdul Rahman Bin Al Hajjan, and Humeyd Bin Ziyad, from Ibn Sama’at, from Muhammad Bin Abu Hamza, from Abdul Rahman Bin Al Hajjaj, ",
            "(The narrator says) ‘I said to Abu Abdullah<sup>asws</sup>, (about the case of) a man and a woman, upon whom the house had collapsed, so they both died’. He<sup>asws</sup> said: ‘The man would inherit from the woman, and the woman would inherit from the man’. I said, ‘But Abu Haneefa has included something upon them with regards to this’. He<sup>asws</sup> said: ‘And which thing has he included upon them?’ I said, ‘Two men, brothers, non-Arabs, not having any inheritor except their two masters. One of them had a hundred thousand Dirhams, well known, and the other there was nothing for him. They both sailed in a ship, so it drowned. So the one hundred Dirhams were extracted. What should be done with it?’ ",
            "He<sup>asws</sup> said: ‘It should be handed over to the master of the one who had nothing’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> do not deny what he has included in it as true, and it is like this’. Then he<sup>asws</sup> said: ‘Hand over the wealth to the master of the one who had nothing, and there would not be anything for the man who had wealth, to be inherited by the other master. So there is nothing for his inheritors’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Abd al-Rahman ibn al-Hajjaj and Humayd ibn Ziyad from ibn Sama‘ah from Muhammad ibn abu from ‘Abd al-Rahman ibn al-Hajjaj who has narrated the following: “I once asked abu ‘Abd Allah, Alayhi al-Salam, about the case of a man and a woman on whom a wall falls and they die. He (the Imam) said, ‘The man inherits from the woman and the woman inherits from the man.’ I then said that abu Hanifah has introduced something in it.’ He (the Imam) asked, ‘What has he introduced in it?’ I said that in the case of two non- Arab men who were brothers and had no heirs except their Mawla’ (Master) of whom one had one hundred thousand dirham, which was well known, and the other did not have anything. They embarked on a ship and they were drowned. The one hundred thousand dirham was taken out for distribution. He said that it all must be given to the Mawali of the one who had nothing. He (the Imam) said, ‘I do not deny what he has introduced; it is true and that is how it is.’ He (the Imam) then said, ‘The asset must be given to the Mawali of the one who did not anything . The other brother did not have anything so that the Mawali of the other could inherit anything.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/204)"
        ],
        "index": 13370,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/497",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:35:4",
        "text": [
          " قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِالْيَمَنِ فِي قَوْمٍ انْهَدَمَتْ عَلَيْهِمْ دَارٌ لَهُمْ فَبَقِيَ مِنْهُمْ صَبِيَّانِ أَحَدُهُمَا مَمْلُوكٌ وَ الْآخَرُ حُرٌّ فَأَسْهَمَ بَيْنَهُمَا فَخَرَجَ السَّهْمُ عَلَى أَحَدِهِمَا فَجَعَلَ الْمَالَ لَهُ وَ أَعْتَقَ الْآخَرَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Hareyz, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘Amir Al-Momineen<sup>asws</sup> judged at Al-Yemen regarding one people upon whom a house of theirs had collapsed. So there remained two young children, one of them being a slave, the other a free one. So he<sup>asws</sup> drew lots between the two of them, so the lot came upon one of the two, so he<sup>asws</sup> made the wealth to be for him, and emancipated (liberated) the other one’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz who has narrated the following: “One of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said that Amir al- Mu’minin issued a judgment in Yemen about a people on whom a house had collapsed and only two children were left, of whom one was owned and the other was free. He (the Imam) by means of raffle gave the assets to the one whose name came out and set the other one free.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/204)"
        ],
        "index": 13371,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/6",
              "text": "الْعَلَاءِ بْنِ رَزِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيٌّ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:35:5",
        "text": [
          " الرَّجُلِ يَسْقُطُ عَلَيْهِ وَ عَلَى امْرَأَتِهِ بَيْتٌ قَالَ تُوَرَّثُ الْمَرْأَةُ مِنَ الرَّجُلِ وَ الرَّجُلُ مِنَ الْمَرْأَةِ مَعْنَاهُ يُوَرَّثُ بَعْضُهُمْ مِنْ بَعْضٍ مِنْ صُلْبِ أَمْوَالِهِمْ لَا يَرِثُونَ مِمَّا يُورَثُ بَعْضُهُمْ مِنْ بَعْضٍ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Isa, from Yunus, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regard the mam, a house collapsed upon him and his wife. He<sup>asws</sup> said: ‘The woman would inherit from the man, and the man would inherit from the woman. Its meaning is, they would inherit each other from the origins of their wealth, they would not be inheriting anything from what they would have (already) inherited from each other’."
          ],
          "en.sarwar": [
            "5. Ali has narrated from Muhammad ibn ‘Isa from Yunus from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has narrated the following: “About the case of a man and a woman on whom a house falls, abu Ja‘far, ‘Alayhi al-Salam, has said, ‘The woman inherits from the man and the man inherits from the woman, which means that they inherit from the original of each other’s assets and not from what they inherit from each other.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/205)"
        ],
        "index": 13372,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4447",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ رَفَعَهُ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:35:6",
        "text": [
          " أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَضَى فِي رَجُلٍ وَ امْرَأَةٍ مَاتَا جَمِيعاً فِي الطَّاعُونِ مَاتَا عَلَى فِرَاشٍ وَاحِدٍ وَ يَدُ الرَّجُلِ وَ رِجْلُهُ عَلَى الْمَرْأَةِ فَجَعَلَ الْمِيرَاثَ لِلرَّجُلِ وَ قَالَ إِنَّهُ مَاتَ بَعْدَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> judged regarding a man and a woman who both died together in the plague. They both died upon one bed, and the hand and the leg of the man were found upon the woman. So he<sup>asws</sup> made the inheritance to be for the man and said: ‘He died after her’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah in a marfu‘ manner from ’Amir al-Mu’minin who has narrated the following: “About the case of a man and a woman who die together because of plague on one bed and the hand and leg of the man are found on the woman, ’ Amir al-Mu’minin issued a judgment that gave the assets to the man because of his death after the woman.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/205)"
        ],
        "index": 13373,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/312",
              "text": "الْحُسَيْنِ بْنِ الْمُخْتَارِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَمَّادِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ الْمُخْتَارِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:35:7",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لِأَبِي حَنِيفَةَ يَا أَبَا حَنِيفَةَ مَا تَقُولُ فِي بَيْتٍ سَقَطَ عَلَى قَوْمٍ وَ بَقِيَ مِنْهُمْ صَبِيَّانِ أَحَدُهُمَا حُرٌّ وَ الْآخَرُ مَمْلُوكٌ لِصَاحِبِهِ فَلَمْ يُعْرَفِ الْحُرُّ مِنَ الْمَمْلُوكِ فَقَالَ أَبُو حَنِيفَةَ يُعْتَقُ نِصْفُ هَذَا وَ يُعْتَقُ نِصْفُ هَذَا وَ يُقْسَمُ الْمَالُ بَيْنَهُمَا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَيْسَ كَذَلِكَ وَ لَكِنَّهُ يُقْرَعُ بَيْنَهُمَا فَمَنْ أَصَابَتْهُ الْقُرْعَةُ فَهُوَ حُرٌّ وَ يُعْتَقُ هَذَا فَيُجْعَلُ مَوْلًى لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hammad Bin Isa, from Al Husayn Bin Al Mukhtar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said to Abu Haneefa: ‘O Abu Haneefa! What are you saying regard a house which fell upon a group of people, and there remained two children from them, one of the free and the other one a slave of his companion, but the free is not recognised from the slave?’ So Abu Haneefa said, ‘Half of this should be liberated, and half of this, and the wealth be distributed between the two of them’. So he<sup>asws</sup> said: ‘It is not like that, but a lot be drawn between the two of them, so the one who is hit by the lot, so he would be free, and this one be liberated, so he is made to be a master of his’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il from Hammad ibn ‘Isa from al- Husayn ibn al-Mukhtar who has narrated the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, said to abu Hanifah, ‘O abu Hanifah, what do you say about the case of a people who all die because of the fall of a house? Only two children remain, of whom one is free and the other is a slave of his companion but it is not known which is which’ Abu Hanifah said, ‘One-half of this and one-half of this is set free and the asset must be divided between the two.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘It is not as that. By means of raffle whoever ’s name comes out is free and this one is set free to become the Mawla ’ (master) for him.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:35",
  "kind": "verse_list"
}