{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:7:2:36",
        "titles": {
          "ar": "باب مَوَارِيثِ الْقَتْلَى وَ مَنْ يَرِثُ مِنَ الدِّيَةِ وَ مَنْ لَا يَرِثُ",
          "en": "Chapter 34 – Inheritances of the murdered, and who would inherit from the wergild (blood money compensation), and who would not inherit"
        }
      }
    ],
    "index": 2062,
    "local_index": 36,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 37"
        },
        "path": "/books/al-kafi:7:2:37",
        "titles": {
          "ar": "باب مِيرَاثِ الْقَاتِلِ",
          "en": "Chapter 35 – Inheritance of the killer"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:7:2:35",
        "titles": {
          "ar": "باب مِيرَاثِ الْغَرْقَى وَ أَصْحَابِ الْهَدْمِ",
          "en": "Chapter 33 – Inheritance of the drowned and the ones crushed under a collapsed building"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:36",
    "titles": {
      "ar": "باب مَوَارِيثِ الْقَتْلَى وَ مَنْ يَرِثُ مِنَ الدِّيَةِ وَ مَنْ لَا يَرِثُ",
      "en": "Chapter 34 – Inheritances of the murdered, and who would inherit from the wergild (blood money compensation), and who would not inherit"
    },
    "verse_count": 8,
    "verse_start_index": 13373,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/205)"
        ],
        "index": 13374,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/133",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5572",
              "text": "سَوَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/711",
              "text": "الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ سَوَّارٍ عَنِ الْحَسَنِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:1",
        "text": [
          " إِنَّ عَلِيّاً ( عليه السلام ) لَمَّا هَزَمَ طَلْحَةَ وَ الزُّبَيْرَ أَقْبَلَ النَّاسُ مُنْهَزِمِينَ فَمَرُّوا بِامْرَأَةٍ حَامِلٍ عَلَى الطَّرِيقِ فَفَزِعَتْ مِنْهُمْ فَطَرَحَتْ مَا فِي بَطْنِهَا حَيّاً فَاضْطَرَبَ حَتَّى مَاتَ ثُمَّ مَاتَتْ أُمُّهُ مِنْ بَعْدِهِ",
          "فَمَرَّ بِهَا عَلِيٌّ ( عليه السلام ) وَ أَصْحَابُهُ وَ هِيَ مَطْرُوحَةٌ وَ وَلَدُهَا عَلَى الطَّرِيقِ فَسَأَلَهُمْ عَنْ أَمْرِهَا فَقَالُوا لَهُ إِنَّهَا كَانَتْ حُبْلَى فَفَزِعَتْ حِينَ رَأَتِ الْقِتَالَ وَ الْهَزِيمَةَ قَالَ فَسَأَلَهُمْ أَيُّهُمَا مَاتَ قَبْلَ صَاحِبِهِ فَقِيلَ إِنَّ ابْنَهَا مَاتَ قَبْلَهَا ",
          "قَالَ فَدَعَا بِزَوْجِهَا أَبِي الْغُلَامِ الْمَيِّتِ فَوَرَّثَهُ مِنِ ابْنِهِ ثُلُثَيِ الدِّيَةِ وَ وَرَّثَ أُمَّهُ ثُلُثَ الدِّيَةِ ثُمَّ وَرَّثَ الزَّوْجَ مِنِ امْرَأَتِهِ الْمَيِّتَةِ نِصْفَ ثُلُثِ الدِّيَةِ الَّذِي وَرِثَتْهُ مِنِ ابْنِهَا وَ وَرَّثَ قَرَابَةَ الْمَرْأَةِ الْمَيِّتَةِ الْبَاقِيَ ",
          "ثُمَّ وَرَّثَ الزَّوْجَ أَيْضاً مِنْ دِيَةِ امْرَأَتِهِ الْمَيِّتَةِ نِصْفَ الدِّيَةِ وَ هُوَ أَلْفَانِ وَ خَمْسُمِائَةِ دِرْهَمٍ وَ وَرَّثَ قَرَابَةَ الْمَرْأَةِ الْمَيِّتَةِ نِصْفَ الدِّيَةِ وَ هُوَ أَلْفَانِ وَ خَمْسُمِائَةِ دِرْهَمٍ وَ ذَلِكَ أَنَّهُ لَمْ يَكُنْ لَهَا وَلَدٌ غَيْرُ الَّذِي رَمَتْ بِهِ حِينَ فَزِعَتْ ",
          "قَالَ وَ أَدَّى ذَلِكَ كُلَّهُ مِنْ بَيْتِ مَالِ الْبَصْرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Hammad Bin Isa, from Sawwar, from Al Hassan who said, ",
            "‘When Ali<sup>asws</sup> defeated Talha and Al-Zubeyr, the people faced their defeat, so they passed by a pregnant woman upon the road. So she panicked from them, and gave birth to what was in her belly, alive. So it (child) became restless until it died. Then its mother died from after it.",
            "So Ali<sup>asws</sup> and his companions passed by her and she and her child were lying upon the road. So he<sup>asws</sup> told them about her matter, so they said to him<sup>asws</sup>, ‘But rather, she was pregnant, so she panicked when she saw the fighting and the defeat’. So he<sup>asws</sup> asked them, ‘Which of the two died before its companion?’ So it was said, ‘Her son died before her’. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> called her husband, father of the dead boy, so made him to inherit from his son, two-thirds of the wergild (blood money compensation), and her mother to inherit a third of the wergild. Then made the husband to inherit from his dead wife, half of the one-third wergild which she had inherited from her son, and made the relatives of the dead woman, the remainder (of the one-third wergild). ",
            "Then made the husband to inherit as well from the wergild of the dead woman, half of the wergild, and it was two thousand and five hundred Dirhams, and made the relatives of the dead woman to inherit half of the wergild, and it was two thousand and five hundred Dirhams, and that is because there did not happen to be for her any child other than that which had been miscarried with when she panicked. ",
            "He (the narrator) said, ‘And he<sup>asws</sup> paid all of that from the Public Treasury of Al-Basra’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father all from ibn Mahbub from Hammad ibn ‘Isa from Sawwar from al-Hassan who has narrated the following: “When Ali, ‘Alayhi al-Salam, defeated Talhah and al-Zubayr, people came defeated and passed by a pregnant woman on the road who was frightened and miscarried her child who was alive but then died. She, because of shock died after the child. Ali, ‘Alayhi al-Salam, and his people passed by where she with her child was left on the road. He (the Imam) asked them about her case and they said that she was pregnant. Because of shock on seeing the dead and defeated she has died. He (the Imam) then asked, ’Who died first?’ They said, ’The child died before her.’ He (the Imam) called her husband and made him to inherit his son for two-thirds of the wergild and the mother to inherit one-third of the wergild. He (the Imam) made the man to inherit from his dead wife one-half of the one-third, which she had inherited of the wergild of her son. The relatives of the dead woman inherited the remaining. He (the Imam) then made the husband to inherit also from the wergild of the dead woman, one-half which is two thousand and five hundred dirham. He (the Imam) allowed the relatives of the dead woman to inherit the other one-half, which was two thousand and five hundred dirham. This is because she did not have any children other than that whom she miscarried because of shock. He (the narrator) has said that he (the Imam) paid all of it from the public treasury of Basrah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/206)"
        ],
        "index": 13375,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1349",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/387",
              "text": "أَبِي أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/180",
              "text": "سُلَيْمَانَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:2",
        "text": [
          " قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي دِيَةِ الْمَقْتُولِ أَنَّهُ يَرِثُهَا الْوَرَثَةُ عَلَى كِتَابِ اللَّهِ وَ سِهَامِهِمْ إِذَا لَمْ يَكُنْ عَلَى الْمَقْتُولِ دَيْنٌ إِلَّا الْإِخْوَةَ وَ الْأَخَوَاتِ مِنَ الْأُمِّ فَإِنَّهُمْ لَا يَرِثُونَ مِنْ دِيَتِهِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Abu Ayoub, from Suleyman Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged with regards to a wergild of the murdered that the inheritors would inherit the inheritance upon the the Book of Allah<sup>azwj</sup> and their (legislated) shares, if there does not happen to be a debt upon the murdered, except for the brothers and the sisters from the mother, so they would not be inheriting anything from his wergild’."
          ],
          "en.sarwar": [
            "2. Ibn Mahbub has narrated from abu Ayyub from Sulayman ibn Khalid who has narrated the following: “’Amir al-Mu’minin, ‘Alayhi al-Salam, issued a judgment about the wergild of one slain that the heirs inherit from it according to the book of Allah their shares if there is no debt on the deceased except the brothers and sisters from the mother’s side who do not inherit from the wergild anything.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/206)"
        ],
        "index": 13376,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1349",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:3",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّ الدِّيَةَ يَرِثُهَا الْوَرَثَةُ إِلَّا الْإِخْوَةَ وَ الْأَخَوَاتِ مِنَ الْأُمِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Abdullah Bin Sinan who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> judged that the wergild, the inheritors would inherit it except for the brothers and the sisters from the mother’."
          ],
          "en.sarwar": [
            "3. Ibn Mahbub has narrated from ‘Abd Allah ibn Sinan who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Amir al-Mu’minin issued a judgment that said, ’All heirs inherit from the wergild except brothers and sisters from the mother’s side.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/207)"
        ],
        "index": 13377,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "وَ عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:4",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَنَّ الدِّيَةَ يَرِثُهَا الْوَرَثَةُ إِلَّا الْإِخْوَةَ مِنَ الْأُمِّ فَإِنَّهُمْ لَا يَرِثُونَ مِنَ الدِّيَةِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Amir Al-Momineen<sup>asws</sup> judged that the wergild, the inheritors would inherit it except for the brothers from the mother, so they would not be inheriting anything from the wergild’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Amir al-Mu’minin issued a judgment that said, ’All heirs inherit from the wergild except brothers and sisters from the mother’s side who do not inherit anything from the wergild.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/207)"
        ],
        "index": 13378,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/152",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/280",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1842",
              "text": "مُحَمَّدِ بْنِ قَيْسٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:5",
        "text": [
          " قَالَ الدِّيَةُ يَرِثُهَا الْوَرَثَةُ عَلَى فَرَائِضِ الْمَوَارِيثِ إِلَّا الْإِخْوَةَ مِنَ الْأُمِّ فَإِنَّهُمْ لَا يَرِثُونَ مِنَ الدِّيَةِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The wergild, the inheritors would inherit it upon the Obligated inheritances except the brothers from the mother, so they would not be inheriting anything from the wergild’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ‘Asem ibn Hakim from Muhammad ibn Qays who has narrated the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ’From the wergild the heirs receive according to their ordained shares except brothers and sisters from the mother’s side who do not inherit anything thereof.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/207)"
        ],
        "index": 13379,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1519",
              "text": "ابْنِ سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/60",
              "text": "عَبْدِ اللَّهِ بْنِ جَبَلَةَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3422",
              "text": "عَلِيِّ بْنِ رِبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/480",
              "text": "عَبْدِ اللَّهِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/281",
              "text": "عُبَيْدِ بْنِ زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ وَ عَلِيِّ بْنِ رِبَاطٍ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:6",
        "text": [
          " لَا يَرِثُ الْإِخْوَةُ مِنَ الْأُمِّ مِنَ الدِّيَةِ شَيْئاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from Abdullah Bin Jabala and Ali Bin Rabat, from Abdullah Bin Bukeyr, from Ubeyd Bin Zurara, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘The brothers from the mother do not inherit anything from the wergild’."
          ],
          "en.sarwar": [
            "6. Humayd ibn Ziyad has narrated from ibn Sama‘ah from ‘Abd Allah ibn Jabalah and Ali ibn Ribat from ‘Abd Allah ibn Bukayr from ‘Ubayd ibn Zurarah who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that brothers from mother’s side do not receive any share from the wergild.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/207)"
        ],
        "index": 13380,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1791",
              "text": "يَحْيَى الْأَزْرَقِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ يَحْيَى الْأَزْرَقِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:7",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُقْتَلُ وَ يَتْرُكُ دَيْناً وَ لَيْسَ لَهُ مَالٌ فَيَأْخُذُ أَوْلِيَاؤُهُ الدِّيَةَ أَ عَلَيْهِمْ أَنْ يَقْضُوا دَيْنَهُ قَالَ نَعَمْ قُلْتُ وَ إِنْ لَمْ يَتْرُكْ شَيْئاً قَالَ نَعَمْ إِنَّمَا أَخَذُوا دِيَتَهُ فَعَلَيْهِمْ أَنْ يَقْضُوا دَيْنَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Noman, from Yahys Al Azraq who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who was murdered and left debts, and there was not wealth for him. So his guardians took the wergild. Is it upon them to pay off his debts?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘And if he had not left anything?’ He<sup>asws</sup> said: ‘Yes. But rather, they took the wergild, therefore it is upon them that they pay off his debts’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Nu’man from Yahya al-Arzaq who has narrated the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who is killed, leaving behind a debt and has left no assets but his heirs receive the wergild; if they must pay his debt. He (the Imam) said, ‘Yes, they must do so.’ I then asked, ‘Even if he does not leave anything they must pay his debts?’ He (the Imam) said, ‘Yes, because they have received the wergild, thus, they must pay his debt.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/207)"
        ],
        "index": 13381,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/331",
              "text": "دَاوُدَ بْنِ الْحُصَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1986",
              "text": "أَبِي الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي الْعَبَّاسِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:36:8",
        "text": [
          " سَأَلْتُهُ هَلْ لِلْإِخْوَةِ مِنَ الْأُمِّ مِنَ الدِّيَةِ شَيْ‏ءٌ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Dawood Bin Al Husayn, from Abu Al Abbas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup>, ‘Is there anything for the brothers from the mother from the wergild?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad from ibn abu Nasr from Dawud ibn al- Haseen from abu al-‘Abbas who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, if brothers from mother’s side can receive any inheritance from the wergild. He (the Imam) said, ‘No, they cannot do so.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:36",
  "kind": "verse_list"
}