{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 39"
        },
        "path": "/books/al-kafi:7:2:39",
        "titles": {
          "ar": "باب آخَرُ فِي مِيرَاثِ أَهْلِ الْمِلَلِ",
          "en": "Chapter 37 – Another Chapter regaring the inheritance of the people of (other) Religions"
        }
      }
    ],
    "index": 2065,
    "local_index": 39,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 40"
        },
        "path": "/books/al-kafi:7:2:40",
        "titles": {
          "ar": "باب أَنَّ مِيرَاثَ أَهْلِ الْمِلَلِ بَيْنَهُمْ عَلَى كِتَابِ اللَّهِ وَ سُنَّةِ نَبِيِّهِ ( صلى الله عليه وآله )",
          "en": "Chapter 38 – The inheritance of the people of the (other) Religions among them upon the Book of Allah<sup>azwj</sup> and the Sunnah of His<sup>azwj</sup> Prophet<sup>saww</sup>"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 38"
        },
        "path": "/books/al-kafi:7:2:38",
        "titles": {
          "ar": "باب مِيرَاثِ أَهْلِ الْمِلَلِ",
          "en": "Chapter 36 – Inheritance of the people of the (other) Religions"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:39",
    "titles": {
      "ar": "باب آخَرُ فِي مِيرَاثِ أَهْلِ الْمِلَلِ",
      "en": "Chapter 37 – Another Chapter regaring the inheritance of the people of (other) Religions"
    },
    "verse_count": 4,
    "verse_start_index": 13397,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/213)"
        ],
        "index": 13398,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1903",
              "text": "مَالِكِ بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ مَالِكِ بْنِ أَعْيَنَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:39:1",
        "text": [
          " سَأَلْتُهُ عَنْ نَصْرَانِيٍّ مَاتَ وَ لَهُ ابْنُ أَخٍ مُسْلِمٌ وَ ابْنُ أُخْتٍ مُسْلِمٌ وَ لِلنَّصْرَانِيِّ أَوْلَادٌ وَ زَوْجَةٌ نَصَارَى قَالَ فَقَالَ أَرَى أَنْ يُعْطَى ابْنُ أَخِيهِ الْمُسْلِمُ ثُلُثَيْ مَا تَرَكَ وَ يُعْطَى ابْنُ أُخْتِهِ ثُلُثَ مَا تَرَكَ إِنْ لَمْ يَكُنْ لَهُ وُلْدٌ صِغَارٌ فَإِنْ كَانَ لَهُ وُلْدٌ صِغَارٌ فَإِنَّ عَلَى الْوَارِثَيْنِ أَنْ يُنْفِقَا عَلَى الصِّغَارِ مِمَّا وَرِثَا مِنْ أَبِيهِمْ حَتَّى يُدْرِكُوا ",
          "قِيلَ لَهُ كَيْفَ يُنْفِقَانِ قَالَ فَقَالَ يُخْرِجُ وَارِثُ الثُّلُثَيْنِ ثُلُثَيِ النَّفَقَةِ وَ يُخْرِجُ وَارِثُ الثُّلُثِ ثُلُثَ النَّفَقَةِ فَإِنْ أَدْرَكُوا قَطَعَا النَّفَقَةَ عَنْهُمْ ",
          "قِيلَ لَهُ فَإِنْ أَسْلَمَ الْأَوْلَادُ وَ هُمْ صِغَارٌ قَالَ فَقَالَ يُدْفَعُ مَا تَرَكَ أَبُوهُمْ إِلَى الْإِمَامِ حَتَّى يُدْرِكُوا فَإِنْ بَقُوا عَلَى الْإِسْلَامِ دَفَعَ الْإِمَامُ مِيرَاثَهُمْ إِلَيْهِمْ وَ إِنْ لَمْ يَبْقَوْا عَلَى الْإِسْلَامِ إِذَا أَدْرَكُوا دَفَعَ الْإِمَامُ مِيرَاثَهُ إِلَى ابْنِ أَخِيهِ وَ ابْنِ أُخْتِهِ الْمُسْلِمَيْنِ يَدْفَعُ إِلَى ابْنِ أَخِيهِ ثُلُثَيْ مَا تَرَكَ وَ يَدْفَعُ إِلَى ابْنِ أُخْتِهِ ثُلُثَ مَا تَرَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Ahmad Bin Muhammad, and a number of our companions, from Sahl Bin Ziyad, altogether from Al Hassan Bin Mahboub, from Hisham Bin Salim, from Malik Bin Ayn, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a Christian who died and for him was a son of his Muslim brother, and a son of a Muslim sister, and for the Christian were children and a Christian wife. So he<sup>asws</sup> said: ‘I<sup>asws</sup> see that you should give the son of his brother two-thirds of what is left (as legacy), and give the son of his sister a third of what is left, if there does not happen to be young children for him. So if there were small children for him, so it would be upon the two inheritors that they should spent upon the small children from what they both had inherited from their father, until they mature’.",
            "It was said to him<sup>asws</sup>, ‘How should the two of them be spending?’ So he<sup>asws</sup> said: ‘The inheritor of the two thirds of the inheritance should take out two thirds of the expenses, and the inheritor of the one-third of the inheritance should take out a one-third of the expenses about them’. ",
            "It was said to him<sup>asws</sup>, so if the children become Muslim and they are still young?’ So he<sup>asws</sup> said: ‘Hand over to the Imam<sup>asws</sup> whatever their father had left until they grow up. So if they remain upon Al-Islam, the Imam<sup>asws</sup> hands over their inheritance to them, but if they do not remain upon Al-Islam when they mature, the Imam<sup>asws</sup> hands over their inheritance to the son of his brother, and the son of his sister, the two Muslim. To the son of the brother two-thirds would be handed over, and to the son of the sister, a one-third of whatever was left (as legacy)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and a number of our people have narrated from Sahl ibn Ziyad all from al-Hassan ibn Mahbub from Hisham ibn Salim from Malik ibn ’A‘yan, who has narrated the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a Christian man who has died. The son of his brother is a Muslim and a son of his sister is a Muslim. The Christian man has children and a Christian wife. He (the Imam) said, ’Two-thirds of his legacy must be given to the son of his brother. One-third must be given to the son of his sister if he does not have any children who are small. However, if he has small children, then the heirs must pay for the maintenance of the small children from the legacy their father has left behind until they become mature.’ It then was asked from him (the Imam), ‘How must the two spend?’ He (the Imam) said, ‘The one who has received two- thirds must pay two-thirds of the maintenance and the one who has received one-third must pay one- third of maintenance until they become mature at which time they can discontinue payment for them.’ It then was asked, ‘What happens if the children become Muslims when they are small?’ He (the Imam) said, ‘Whatever their father has left behind must be given to the Imam until they become mature. If they remain Muslims the Imam gives their legacy to them. However, if they did not remain Muslims when they become mature, the Imam gives the legacy to the son of his brother and the son of his sister who are Muslims. Two-thirds of what is left is given to the son of his brother and one-third of what is left to the son of his sister.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/215)"
        ],
        "index": 13399,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1349",
              "text": "ابْنُ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/376",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "ابْنُ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:39:2",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ مُسْلِمٍ مَاتَ وَ لَهُ أُمٌّ نَصْرَانِيَّةٌ وَ لَهُ زَوْجَةٌ وَ وُلْدٌ مُسْلِمُونَ قَالَ فَقَالَ إِنْ أَسْلَمَتْ أُمُّهُ قَبْلَ أَنْ يُقْسَمَ مِيرَاثُهُ أُعْطِيَتِ السُّدُسَ قُلْتُ فَإِنْ لَمْ يَكُنْ لَهُ امْرَأَةٌ وَ لَا وُلْدٌ وَ لَا وَارِثٌ لَهُ سَهْمٌ فِي الْكِتَابِ مِنَ الْمُسْلِمِينَ وَ أُمُّهُ نَصْرَانِيَّةٌ وَ لَهُ قَرَابَةٌ نَصَارَى مِمَّنْ لَهُ سَهْمٌ فِي الْكِتَابِ لَوْ كَانُوا مُسْلِمِينَ لِمَنْ يَكُونُ مِيرَاثُهُ قَالَ إِنْ أَسْلَمَتْ أُمُّهُ فَإِنَّ جَمِيعَ مِيرَاثِهِ لَهَا وَ إِنْ لَمْ تُسْلِمْ أُمُّهُ وَ أَسْلَمَ بَعْضُ قَرَابَتِهِ مِمَّنْ لَهُ سَهْمٌ فِي الْكِتَابِ فَإِنَّ مِيرَاثَهُ لَهُ وَ إِنْ لَمْ يُسْلِمْ مِنْ قَرَابَتِهِ أَحَدٌ فَإِنَّ مِيرَاثَهُ لِلْإِمَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Ibn Raib, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a Muslim man who died and for him was a Christian mother, and for him was a Muslim wife and a Muslim child. So he<sup>asws</sup> said: ‘If the mother becomes a Muslim before the distribution of his inheritance, give her the one-sixth’. I said, ‘So if there did not happen to be a wife for him nor a child, nor any inheritor for him from the Muslims, with a legislated share in the Book (Quran), and his mother is a Christian, and for him are Christian relatives, from the ones who dont have for them a legislated share in the Book had they been Muslims. For whom would the inheritance be?’ He<sup>asws</sup> said: ‘If the mother becomes a Muslim, then the entirety of the inheritance is for her, and if his mother does not become a Muslim, and some of his relatives become Muslim, from the ones who have a legislated share in the Book, so the inheritance would be for him. And if no one from his relatives becomes Muslim, so his inheritance is for the Imam<sup>asws</sup>’."
          ],
          "en.sarwar": [
            "2. Ibn Mahbub has narrated from ibn Ri’ab from abu Basir who has narrated the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the case of a Muslim man who has died and his mother is a Christian. He has a wife and Muslim children. He (the Imam) said, ‘If his mother becomes a Muslim before the legacy is distributed, she receives one-sixth.’ I then asked, ‘What happens if he does not have a wife and children or an heir with ordained shares in the book and his mother is a Christian and has other Christian relatives of those who have ordained shares in the book had they been Muslims. Who receives his legacy?’ He (the Imam) said, ‘If his mother becomes a Muslim, all of his legacy belongs to her; but if she did not become a Muslim instead certain others from his relatives become Muslims of those who have ordained shares according to the book, his legacy belongs to him. If no one from his relatives becomes a Muslim then his legacy belongs to the Imam.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/216)"
        ],
        "index": 13400,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "عَبْدِ اللَّهِ بْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:39:3",
        "text": [
          " مَنْ أَسْلَمَ عَلَى مِيرَاثٍ قَبْلَ أَنْ يُقْسَمَ فَلَهُ مِيرَاثُهُ وَ إِنْ أَسْلَمَ بَعْدَ مَا قُسِمَ فَلَا مِيرَاثَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Muskan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who becomes a Muslim upon an inheritance before the distribution, so for him is his inheritance, and if he becomes a Muslim after the distribution, so there is no inheritance for him’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ibn abu ‘ Umayr from ‘Abd Allah ibn Muskan who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one becomes a Muslim before the legacy is distributed, he receives his share but if one becomes a Muslim after the legacy is distributed then there is nothing for him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/216)"
        ],
        "index": 13401,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/215",
              "text": "أَبَانٍ الْأَحْمَرِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/7",
              "text": "مُحَمَّدِ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/524",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبَانٍ الْأَحْمَرِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:39:4",
        "text": [
          " مَنْ أَسْلَمَ عَلَى مِيرَاثٍ قَبْلَ أَنْ يُقْسَمَ الْمِيرَاثُ فَهُوَ لَهُ وَ مَنْ أَسْلَمَ بَعْدَ مَا قُسِمَ فَلَا مِيرَاثَ لَهُ وَ مَنْ أُعْتِقَ عَلَى مِيرَاثٍ قَبْلَ أَنْ يُقْسَمَ الْمَوَارِيثُ فَهُوَ لَهُ وَ مَنْ أُعْتِقَ بَعْدَ مَا قُسِمَ فَلَا مِيرَاثَ لَهُ ",
          "وَ قَالَ فِي الْمَرْأَةِ إِذَا أَسْلَمَتْ قَبْلَ أَنْ يُقْسَمَ الْمِيرَاثُ فَلَهَا الْمِيرَاثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Aban Al Ahmar, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The one who becomes a Muslim upon an inheritance before the distribution of the inheritance, so it is for him; but the one who becomes a Muslim after the distribution, so there is no inheritance for him; and the one who is emancipated (liberated) upon an inheritance before the distribution of the inheritance, so it is for him; and the one who is emancipated (liberated) after the distribution, so there is no inheritance for him’. ",
            "And he<sup>asws</sup> said regarding the woman: ‘If she becomes a Muslim before the distribution of the inheritance, so for her is the inheritance’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Aban al-Ahmar from Muhammad ibn Muslim who has narrated the following: “One of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘If one becomes a Muslim before the legacy is distributed the legacy belongs to him. If one becomes a Muslim after the legacy is distributed there is no legacy for him. If one is set free before the legacy is distributed it belongs to him but if one is set free after the legacy is distributed then there is no legacy for him.’ About the case of a woman he (the Imam) said, ‘If she becomes a Muslim before the legacy is distributed she receives her share of the legacy.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:39",
  "kind": "verse_list"
}