{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 44"}, "path": "/books/al-kafi:7:2:44", "titles": {"ar": "باب", "en": "Chapter 43 – A Chapter"}}], "index": 2061, "local_index": 44, "part_type": "Chapter", "path": "/books/al-kafi:7:2:44", "titles": {"ar": "باب", "en": "Chapter 43 – A Chapter"}, "verse_count": 2, "verse_start_index": 13407, "verses": [{"index": 13408, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:44:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ كَانَتْ لَهُ أُمٌّ مَمْلُوكَةٌ فَلَمَّا حَضَرَتْهُ الْوَفَاةُ انْطَلَقَ رَجُلٌ مِنْ أَصْحَابِنَا فَاشْتَرَى أُمَّهُ وَ اشْتَرَطَ عَلَيْهَا أَنِّي أَشْتَرِيكِ وَ أُعْتِقُكِ فَإِذَا مَاتَ ابْنُكِ فُلَانُ بْنُ فُلَانٍ فَوَرِثْتِهِ أَعْطِينِي نِصْفَ مَا تَرِثِينَ عَلَى أَنْ تُعْطِينِي بِذَلِكِ عَهْدَ اللَّهِ وَ عَهْدَ رَسُولِهِ فَرَضِيَتْ بِذَلِكَ فَأَعْطَتْهُ عَهْدَ اللَّهِ وَ عَهْدَ رَسُولِهِ لَتَفِيَنَّ لَهُ بِذَلِكَ فَاشْتَرَاهَا الرَّجُلُ فَأَعْتَقَهَا عَلَى ذَلِكَ الشَّرْطِ وَ مَاتَ ابْنُهَا بَعْدَ ذَلِكَ فَوَرِثَتْهُ وَ لَمْ يَكُنْ لَهُ وَارِثٌ غَيْرُهَا \nقَالَ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَقَدْ أَحْسَنَ إِلَيْهَا وَ أُجِرَ فِيهَا إِنَّ هَذَا لَفَقِيهٌ وَ الْمُسْلِمُونَ عِنْدَ شُرُوطِهِمْ وَ عَلَيْهَا أَنْ تَفِيَ لَهُ بِمَا عَاهَدَتِ اللَّهَ وَ رَسُولَهُ عَلَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub and Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and Ali Bin Ibrahim, form his father, altogether from Ibn Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, \n‘I asked Abu Ja’far<sup>asws</sup> about a man who had a mother who was a slave. So when the death presented itself to him, a man from our companions and bought his mother, and stipulated a condition upon her, ‘I am buying you and emancipating (liberated) you, so when your son dies, so and so son of so and so, and when you inherit him, so give me half of what you inherit, and the condition that you would be giving that, vowing by Allah<sup>azwj</sup> and vowing by His<sup>azwj</sup> Rasool<sup>saww</sup>’. So she was pleased with that, and she gave him the vow of Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup> to convince him. So the man bought her and emancipated (liberated) her upon that condition, and her son died after that. So she inherited him and there did not happen to be any inheritor apart from her. \nHe (the narrator) said, ‘So Abu Ja’far<sup>asws</sup> said: ‘He did a favour to her, and he should be recompensed by her. This is for a Faqih and the Muslims during the stipulations of their conditions, and it is upon her that she should fulfill whatever she had vowed by Allah<sup>azwj</sup> and His<sup>azwj</sup> Rasool<sup>saww</sup>, to him’."}]}, {"index": 13409, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:2:44:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ كَاتَبَ مَمْلُوكَهُ وَ اشْتَرَطَ عَلَيْهِ أَنَّ مِيرَاثَهُ لَهُ فَرُفِعَ ذَلِكَ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَأَبْطَلَ شَرْطَهُ وَ قَالَ شَرْطُ اللَّهِ قَبْلَ شَرْطِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of his companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who contracted his slave and stipulated a condition upon him that his inheritance would be for him. So that was raised to Amir Al-Momineen<sup>asws</sup>, so he<sup>asws</sup> invalidated his condition and said: ‘The Stipulated Condition of Allah<sup>azwj</sup> is before the stipulation of your condition’."}]}]}, "index": "al-kafi:7:2:44", "kind": "verse_list"}