{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:7:2:48",
        "titles": {
          "ar": "باب مِيرَاثِ الْمَفْقُودِ",
          "en": "Chapter 46 – Inheritance of the lost (unknown whereabouts)"
        }
      }
    ],
    "index": 2074,
    "local_index": 48,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:48",
    "titles": {
      "ar": "باب مِيرَاثِ الْمَفْقُودِ",
      "en": "Chapter 46 – Inheritance of the lost (unknown whereabouts)"
    },
    "verse_count": 9,
    "verse_start_index": 13432,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/229)"
        ],
        "index": 13433,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ [يُونُسَ] عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ سَأَلَ خَطَّابٌ الْأَعْوَرُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) وَ أَنَا جَالِسٌ فَقَالَ إِنَّهُ كَانَ عِنْدَ أَبِي أَجِيرٌ يَعْمَلُ عِنْدَهُ بِالْأَجْرِ فَفَقَدْنَاهُ وَ بَقِيَ لَهُ مِنْ أَجْرِهِ شَيْ‏ءٌ وَ لَا نَعْرِفُ لَهُ وَارِثاً قَالَ فَاطْلُبُوهُ قَالَ قَدْ طَلَبْنَاهُ فَلَمْ نَجِدْهُ قَالَ فَقَالَ مَسَاكِينُ وَ حَرَّكَ يَدَيْهِ ",
          "قَالَ فَأَعَادَ عَلَيْهِ قَالَ اطْلُبْ وَ اجْهَدْ فَإِنْ قَدَرْتَ عَلَيْهِ وَ إِلَّا فَهُوَ كَسَبِيلِ مَالِكَ حَتَّى يَجِي‏ءَ لَهُ طَالِبٌ فَإِنْ حَدَثَ بِكَ حَدَثٌ فَأَوْصِ بِهِ إِنْ جَاءَ لَهُ طَالِبٌ أَنْ يُدْفَعَ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus, from Hisham Bin Salim who said, ",
            "‘Khatab Al-Awr asked Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), and I was seated there, so he said, ‘There was an employee with my father who worked for him for the wages. So we lost him, and there remained for him something from his wages, and we do not recognise his inheritors’. He<sup>asws</sup> said: ‘So seek him’. He said, ‘We have sought him, but could not find him’. So he<sup>asws</sup> said: ‘Poor’ – and he<sup>asws</sup> moved his<sup>asws</sup> hands (gestured). ",
            "He (the narrator) said, ‘So I repeated to him<sup>asws</sup>. He<sup>asws</sup> said: ‘Seek and strive in accordance to your ability, or else it is like your wealth until there comes someone seeking it. So if there befalls with you what befalls (death), so bequeath with it that if someone comes seeking it, then it should be handed over to him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa ibn ‘Ubayd from [Yunus] from Hisham ibn Salim who has narrated the following: “Khattab al-A‘war asked abu Ibrahim, ‘Alayhi al-Salam, when I was sitting, ‘A man worked on hire with my father and we lost him. A certain amount from his wages was left with us and we did not know any of his heirs. He (the Imam) said, ‘You must search for him.’ He said, ‘We searched but did not find him.’ He (the Imam) said, ‘Destitute people’, making a hand gesture with his both hands. The man repeated his question. He (the Imam) said, ‘Search and try hard if you can find him, otherwise, it is like your other assets until someone comes asking for it; and if something happens to you, make a will about it to give it to the one who may come asking for it (remaining wages).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/230)"
        ],
        "index": 13434,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:2",
        "text": [
          "يُونُسُ عَنْ أَبِي ثَابِتٍ وَ ابْنِ عَوْنٍ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> فِي رَجُلٍ كَانَ لَهُ عَلَى رَجُلٍ حَقٌّ فَفَقَدَهُ وَ لَا يَدْرِي أَيْنَ يَطْلُبُهُ وَ لَا يَدْرِي أَ حَيٌّ هُوَ أَمْ مَيِّتٌ وَ لَا يَعْرِفُ لَهُ وَارِثاً وَ لَا نَسَباً وَ لَا بَلَداً قَالَ اطْلُبْ قَالَ إِنَّ ذَلِكَ قَدْ طَالَ فَأَتَصَدَّقُ بِهِ قَالَ اطْلُبْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Yunus, from Abu Sabit and Ibn Awn, from Muawiya Bin Wahab, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who had a right upon a man, so he lost him and he did not know where to seek him, and he did not know whether he was alive or he was dead, and he did not recognise an inheritor for him, nor a clan, nor a city. He<sup>asws</sup> said: ‘Seek him’. He said, If that is prolonged, so I should give in charity with it?’ He<sup>asws</sup> said: ‘Seek him’."
          ],
          "en.sarwar": [
            "2. Yunus ibn Thabit and ibn ‘Awn has narrated from Mu‘awiyah ibn Wahab who has narrated the following: “This is about the case of a man who has a right on another man. However, he was lost and he did not know where to look for him, not knowing if he is dead or living. He does not know of anyone as his heir, or a town or lineage relation. He (the Imam) said, ‘He must search but if it becomes very long then he must give it in charity.’ He (the Imam) said, ‘You must search for him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/230)"
        ],
        "index": 13435,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:3",
        "text": [
          "يُونُسُ عَنْ نَصْرِ بْنِ حَبِيبٍ صَاحِبِ الْخَانِ قَالَ كَتَبْتُ إِلَى عَبْدٍ صَالِحٍ ( عليه السلام ) قَدْ وَقَعَتْ عِنْدِي مِائَتَا دِرْهَمٍ وَ أَرْبَعَةُ دَرَاهِمَ وَ أَنَا صَاحِبُ فُنْدُقٍ وَ مَاتَ صَاحِبُهَا وَ لَمْ أَعْرِفْ لَهُ وَرَثَةً فَرَأْيُكَ فِي إِعْلَامِي حَالَهَا وَ مَا أَصْنَعُ بِهَا فَقَدْ ضِقْتُ بِهَا ذَرْعاً فَكَتَبَ اعْمَلْ فِيهَا وَ أَخْرِجْهَا صَدَقَةً قَلِيلًا قَلِيلًا حَتَّى تَخْرُجَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Yunus, from Nasr Bin Habeeb, the author of Al Khan, who said, ",
            "‘I wrote to Abd Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) that there were with me one hundred and forty Dirhams, and I am an owner of a hotel, and its owner (of the money) died, and I do not recognise any inheritor of his. So, your<sup>asws</sup> view in letting me know of its state and what shall I do with it, for I am fed up with it’. So he<sup>asws</sup> wrote: ‘You can work in it and take out charity, little by little until it is taken out (completely)’."
          ],
          "en.sarwar": [
            "3. Yunus has narrated from Nasr ibn Habib Sahib al-Khan who has narrated the following: “I once wrote to the virtuous servant (of Allah) about two hundred and four dirham which remained with me. I own a hotel. The owner of dirham has died and I do not know any heirs for him. I need your opinion on this matter and what must I do about it; I am depressed thereby. He (the Imam) wrote and said, ‘You can work with it and give it as charity little by little until it is complete.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/231)"
        ],
        "index": 13436,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:4",
        "text": [
          "يُونُسُ عَنِ الْهَيْثَمِ أَبِي رَوْحٍ صَاحِبِ الْخَانِ قَالَ كَتَبْتُ إِلَى عَبْدٍ صَالِحٍ ( عليه السلام ) أَنِّي أَتَقَبَّلُ الْفَنَادِقَ فَيَنْزِلُ عِنْدِيَ الرَّجُلُ فَيَمُوتُ فَجْأَةً لَا أَعْرِفُهُ وَ لَا أَعْرِفُ بِلَادَهُ وَ لَا وَرَثَتَهُ فَيَبْقَى الْمَالُ عِنْدِي كَيْفَ أَصْنَعُ بِهِ وَ لِمَنْ ذَلِكَ الْمَالُ فَكَتَبَ ( عليه السلام ) اتْرُكْهُ عَلَى حَالِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Yunus, from Al Haysam Abu Rawh author of Al Khan, said, ",
            "‘I wrote to Abd Salih<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), ‘I manage hotels, so there lodged with me the man, and he died suddenly. I do not know him, nor do I know his city, nor any inheritor for him. So there remains the wealth with me, how should I deal with it, and for whom is that wealth?’ So he<sup>asws</sup> wrote: ‘Leave it upon its state’ (until you find his inheritors)."
          ],
          "en.sarwar": [
            "4. Yunus has narrated from al-Haytham abu Ruh Sahib al-Khan who has narrated the following: “I once wrote to the virtuous servant (of Allah) that I manage hotels. A man who stays in the hotel may die suddenly and I do not know his town and his heirs; and his assets remain with me. What must I do about it? He (the Imam) wrote back, ‘You must leave it in its condition.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/231)"
        ],
        "index": 13437,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:5",
        "text": [
          "يُونُسُ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قَالَ لِي أَبُو الْحَسَنِ ( عليه السلام ) الْمَفْقُودُ يُتَرَبَّصُ بِمَالِهِ أَرْبَعَ سِنِينَ ثُمَّ يُقْسَمُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Yunus, from Is’haq Bin Ammar who said, ",
            "‘Abu Al-Hassan<sup>asws</sup> said to me: ‘The lost, one should wait with his wealth for four years, then distribute it’."
          ],
          "en.sarwar": [
            "5. Yunus has narrated from Ishaq ibn ‘Ammar who has narrated the following: “Abu al-Hassan, ‘Alayhi al-Salam, said to me, ‘The assets of a lost person must be kept for four years; then they are distributed.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/231)"
        ],
        "index": 13438,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ الثَّانِيَ ( عليه السلام ) عَنْ دَارٍ كَانَتْ لِامْرَأَةٍ وَ كَانَ لَهَا ابْنٌ وَ ابْنَةٌ فَغَابَ الِابْنُ بِالْبَحْرِ وَ مَاتَتِ الْمَرْأَةُ فَادَّعَتِ ابْنَتُهَا أَنَّ أُمَّهَا كَانَتْ صَيَّرَتْ هَذِهِ الدَّارَ لَهَا وَ بَاعَتْ أَشْقَاصاً مِنْهَا وَ بَقِيَتْ فِي الدَّارِ قِطْعَةٌ إِلَى جَنْبِ دَارِ رَجُلٍ مِنْ أَصْحَابِنَا وَ هُوَ يَكْرَهُ أَنْ يَشْتَرِيَهَا لِغَيْبَةِ الِابْنِ وَ مَا يَتَخَوَّفُ مِنْ أَنْ لَا يَحِلَّ لَهُ شِرَاؤُهَا وَ لَيْسَ يُعْرَفُ لِلِابْنِ خَبَرٌ فَقَالَ لِي وَ مُنْذُ كَمْ غَابَ فَقُلْتُ مُنْذُ سِنِينَ كَثِيرَةٍ فَقَالَ يُنْتَظَرُ بِهِ غَيْبَتُهُ عَشْرَ سِنِينَ ثُمَّ يُشْتَرَى فَقُلْتُ لَهُ فَإِذَا انْتُظِرَ بِهِ غَيْبَتُهُ عَشْرَ سِنِينَ يَحِلُّ شِرَاؤُهَا قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Mahziyar who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> - about a house which belonged to a woman, and had a son and a daughter. The son disappeared in the sea, and the woman died, so she left (behind) her daughter. So her daughter claimed that when she was small, her mother had made this house to be for her, and then she sold parts from it, and there remained a part in the house by the side of a house of a man from our companions and he disliked buying it due to the disappearance of the son, and what made him fear that it might not be Permissible for him to buy it, and there is no new of the son (who had disappeared in the sea). So he<sup>asws</sup> said to me: ‘And since how long has he been absent?’ So I said, ‘Since many years’. So he<sup>asws</sup> said: ‘He should wait with it after his absence for ten years, then he should buy it’. So I said to him<sup>asws</sup>, ‘So if one were to wait with it after his absence of ten years, it is Permissible to buy it?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from who has narrated the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about the case of a house that belongs to a woman who had a son and a daughter. Her son disappeared in the ocean, the woman died and the daughter claimed that her mother had given the house to her and she sold certain parts of it. One portion was left next to the house of a man of our people, he did not like to buy it because of the disappearance of the son, and for fear that, it may not be lawful for him to buy it with no news from the son. He (the Imam) asked me, ‘For how long has he disappeared?’ I replied, ‘It is many years.’ He (the Imam) said, ‘One must wait for ten years, then buy it.’ I then asked, ‘Is it lawful to buy it after ten years?’ He (the Imam) said, ‘Yes, it is lawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/232)"
        ],
        "index": 13439,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:7",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ كَانَ لَهُ وُلْدٌ فَغَابَ بَعْضُ وُلْدِهِ وَ لَمْ يَدْرِ أَيْنَ هُوَ وَ مَاتَ الرَّجُلُ كَيْفَ يُصْنَعُ بِمِيرَاثِ الْغَائِبِ مِنْ أَبِيهِ قَالَ يُعْزَلُ حَتَّى يَجِي‏ءَ قُلْتُ فُقِدَ الرَّجُلُ فَلَمْ يَجِئْ فَقَالَ إِنْ كَانَ وَرَثَةُ الرَّجُلِ مِلَاءً بِمَالِهِ اقْتَسَمُوهُ بَيْنَهُمْ فَإِذَا جَاءَ رَدُّوهُ عَلَيْهِ .",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ حَمَّادٍ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar who said, ",
            "‘I asked him<sup>asws</sup> about a man for whom were children. So one of the children disappeared and he did not know where he was, and the man died. How should we deal with the inheritance of the disappeared one from his father?’ He<sup>asws</sup> said: ‘Keep it aside until he comes’. I said, ‘The man is lost and will not be coming’. So he<sup>asws</sup> said: ‘If the inheritors of the man were reliable with his wealth, distribute it between them, so when he comes, they can return it to him’.",
            "A number of our companions, from Sahl Bin Ziyad, from Ahmad Bin Muhammad Bin Abu Nasr, from Hammad, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), similar to it’."
          ],
          "en.sarwar": [
            "7. Abu Ali al-Ash ‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan from Ishaq ibn ‘Ammar who has narrated the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a man who had several sons, of whom one disappeared and he did not know where he was. The man died. What must be done with the share of the legacy for the son who has disappeared? He (the Imam) said, ‘It must be kept aside until he comes? I then said, ‘The man is lost (the father died) he did not come? He (the Imam) said, ‘If the heirs are trusted for his asset, they can distribute among themselves; and when he comes then give it to him?” A number of our people have narrated from Sahl ibn Ziyad from Ahmad ibn Muhammad ibn abu Nasr from Hammad from Ishaq ibn ‘Ammar from abu Ibrahim ‘Alayhi al-Salam, a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/232)"
        ],
        "index": 13440,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:8",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنِ ابْنِ رِبَاطٍ وَ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي الْحَسَنِ الْأَوَّلِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ كَانَ لَهُ وُلْدٌ فَغَابَ بَعْضُ وُلْدِهِ وَ لَمْ يَدْرِ أَيْنَ هُوَ وَ مَاتَ الرَّجُلُ فَأَيُّ شَيْ‏ءٍ يُصْنَعُ بِمِيرَاثِ الرَّجُلِ الْغَائِبِ مِنْ أَبِيهِ قَالَ يُعْزَلُ حَتَّى يَجِي‏ءَ قُلْتُ فَعَلَى مَالِهِ زَكَاةٌ قَالَ لَا حَتَّى يَجِي‏ءَ قُلْتُ فَإِذَا جَاءَ يُزَكِّيهِ قَالَ لَا حَتَّى يَحُولَ عَلَيْهِ الْحَوْلُ فِي يَدِهِ فَقُلْتُ فُقِدَ الرَّجُلُ فَلَمْ يَجِئْ قَالَ إِنْ كَانَ وَرَثَةُ الرَّجُلِ مِلَاءً بِمَالِهِ اقْتَسَمُوهُ بَيْنَهُمْ فَإِذَا هُوَ جَاءَ رَدُّوهُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ibn Rabat and Abdullah Bin Jabalat, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Al Hassan<sup>asws</sup> the first, said, ‘I asked him<sup>asws</sup> about a man who had children for him, so one of his children disappeared and he did not know where he was, and the man died. So what should be done with the inheritance of the man, for the absent one from his father?’ He<sup>asws</sup> said: ‘Keep it aside until he comes’. I said, ‘So upon his wealth is the Zakat?’ He<sup>asws</sup> said: ‘No, until he comes’. I said, ‘So if he comes, he has to purify it (by paying Zakat)?’ He<sup>asws</sup> said: ‘No, until there turns a year with it being in his hands’. So I said, ‘The man is lost and does not come?’ He<sup>asws</sup> said: ‘If the inheritors of the man can be relied upon with his wealth, so distribute it between them. So whenever he comes, it should be returned to him’."
          ],
          "en.sarwar": [
            "8. Humayd ibn Ziyad from al-Hassan ibn Muhammad ibn Sama‘ah, from ibn Ribat and ‘Abd Allah ibn Jabalah from Ishaq ibn ‘Ammar who has narrated the following: “I once asked abu al-Hassan, al-Awwal, ‘Alayhi al-Salam, about the case of a man who has several sons, of whom one disappeared and he did not know where he was. The man died. What must be done with his share of legacy from his father? He (the Imam) said, ‘It must be kept aside until he comes? I then asked if there is Zakat on his assets. He (the Imam) said, ‘No, there is no Zakat until he comes? I then asked if he must pay Zakat when he comes. He (the Imam) said, ‘No, until one year passes with the asset in his possession? I then said, ‘The man is lost and he has not come back? He (the Imam) said, ‘If the heirs of the man can be trusted about his assets, they can distribute it among themselves and when he comes give it to him?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/232)"
        ],
        "index": 13441,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:48:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ قَالَ ( عليه السلام ) الْمَفْقُودُ يَحْبِسُ مَالَهُ الْوَرَثَةُ عَلَى قَدْرِ مَا يُطْلَبُ فِي الْأَرْضِ أَرْبَعَ سِنِينَ فَإِنْ لَمْ يُقْدَرْ عَلَيْهِ قُسِمَ مَالُهُ بَيْنَ الْوَرَثَةِ وَ إِنْ كَانَ لَهُ وُلْدٌ حُبِسَ الْمَالُ وَ أُنْفِقَ عَلَى وُلْدِهِ تِلْكَ الْأَرْبَعَ سِنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Usman Bin Isa, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The lost one, the inheritors should withhold his wealth upon doing their best to seek him in the earth, for four years. So if they are not able to locate him, the wealth is distributed between the inheritors. And if there was a child for him, withhold the wealth, and spend upon that very child for four years’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ‘Uthman ibn ‘Isa from Sama‘ah, who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The heirs must keep the assets of one who is lost for the duration of four years’ searching. If he is not found, his assets are distributed among the heirs. If he has children, the assets must be withheld and the expenses of his children must be provided during the four years?” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:48",
  "kind": "verse_list"
}