{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 48"}, "path": "/books/al-kafi:7:2:48", "titles": {"ar": "باب مِيرَاثِ الْمُسْتَهِلِّ", "en": "Chapter 47 – Inheritance of the new born"}}], "index": 2065, "local_index": 48, "part_type": "Chapter", "path": "/books/al-kafi:7:2:48", "titles": {"ar": "باب مِيرَاثِ الْمُسْتَهِلِّ", "en": "Chapter 47 – Inheritance of the new born"}, "verse_count": 6, "verse_start_index": 13430, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 13431, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:48:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ فِي الْمَنْفُوسِ إِذَا تَحَرَّكَ وَرِثَ إِنَّهُ رُبَّمَا كَانَ أَخْرَسَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyrf, from Rabie Bin Abdullah, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying regarding the new born: ‘If it moves, it inherits, perhaps it is speechless’."]}}, {"index": 13432, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:2:48:2", "text": ["عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِي السِّقْطِ إِذَا سَقَطَ مِنْ بَطْنِ أُمِّهِ فَتَحَرَّكَ تَحَرُّكاً بَيِّناً يَرِثُ وَ يُورَثُ فَإِنَّهُ رُبَّمَا كَانَ أَخْرَسَ ."], "translations": {"en.hubeali": ["Ali, from his father, from Hammad Bin Isa, from Rabie who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying regarding the miscarried child, when it is miscarried from the belly of its mother, so it moves. Manifest movement makes him inherit and be inherited from, for perhaps it was mute’."]}}, {"index": 13433, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:2:48:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ مَاتَ وَ تَرَكَ امْرَأَتَهُ وَ هِيَ حَامِلٌ فَوَضَعَتْ بَعْدَ مَوْتِهِ غُلَاماً ثُمَّ مَاتَ الْغُلَامُ بَعْدَ مَا وَقَعَ عَلَى الْأَرْضِ فَشَهِدَتِ الْمَرْأَةُ الَّتِي قَبِلَتْهَا أَنَّهُ اسْتَهَلَّ وَ صَاحَ حِينَ وَقَعَ عَلَى الْأَرْضِ ثُمَّ مَاتَ بَعْدَ ذَلِكَ قَالَ عَلَى الْإِمَامِ أَنْ يُجِيزَ شَهَادَتَهَا فِي رُبُعِ مِيرَاثِ الْغُلَامِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, and a number of our companions, from Sahl Bin Ziyad, altogether from Ibn Mahboub, from Umar Bin Yazeed who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who died and left his woman, and she was pregnant. So there was born, after his death, a boy. Then the boy died after having fallen upon the ground. So, the woman who was the midwife testified that he moved and shrieked when he fell upon the ground, then died after that. He<sup>asws</sup> said: ‘It is upon the Imam<sup>asws</sup> that he<sup>asws</sup> allow her testimony regarding the one-quarter of the inheritance of the boy’. (p.s. – two men or four women is the requirement of the testimony)."]}}, {"index": 13434, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:2:48:4", "text": ["ابْنُ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ تَجُوزُ شَهَادَةُ الْقَابِلَةِ فِي الْمَوْلُودِ إِذَا اسْتَهَلَّ وَ صَاحَ فِي الْمِيرَاثِ وَ يُوَرَّثُ الرُّبُعَ مِنَ الْمِيرَاثِ بِقَدْرِ شَهَادَةِ امْرَأَةٍ وَاحِدَةٍ قُلْتُ فَإِنْ كَانَتَا امْرَأَتَيْنِ قَالَ تَجُوزُ شَهَادَتُهُمَا فِي النِّصْفِ مِنَ الْمِيرَاثِ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Abdullah Sinan who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The testimony of the midwife is allowed regarding the birth, when it moves and shrieks, with regards to the inheritance, and he would inherit the one-quarter from the inheritance by the measurement of the testimony of the one woman’. I said, ‘So if there were two women?’ He<sup>asws</sup> said: ‘Both their testimonies is allowed regarding the half of the inheritance’."]}}, {"index": 13435, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:2:48:5", "text": ["حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مِيرَاثِ الْمَنْفُوسِ مِنَ الدِّيَةِ قَالَ لَا يَرِثُ مِنَ الدِّيَةِ شَيْئاً حَتَّى يَصِيحَ وَ يُسْمَعَ صَوْتُهُ ."], "translations": {"en.hubeali": ["Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ziyad, from Abdullah Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regard the inheritance of the new born from the wergild. He<sup>asws</sup> said: ‘He would not inherit anything from the wergild until he shrieks, and his voice is heard’."]}}, {"index": 13436, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:2:48:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ عَوْنٍ عَنْ بَعْضِهِمْ قَالَ سَمِعْتُهُ ( عليه السلام ) يَقُولُ إِنَّ الْمَنْفُوسَ لَا يَرِثُ مِنَ الدِّيَةِ شَيْئاً حَتَّى يَسْتَهِلَّ وَ يُسْمَعَ صَوْتُهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Awn, from one of them who said, ", "‘I heard him<sup>asws</sup> saying that the new born does not inherit anything from the wergild until it moves and his voice is heard’."]}}]}, "index": "al-kafi:7:2:48", "kind": "verse_list"}