{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 49"
        },
        "path": "/books/al-kafi:7:2:49",
        "titles": {
          "ar": "باب مِيرَاثِ الْمُسْتَهِلِّ",
          "en": "Chapter 47 – Inheritance of the new born"
        }
      }
    ],
    "index": 2075,
    "local_index": 49,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/al-kafi:7:2:50",
        "titles": {
          "ar": "باب مِيرَاثِ الْخُنْثَى",
          "en": "Chapter 48 – Inheritance of the hermaphrodite (genderless)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 48"
        },
        "path": "/books/al-kafi:7:2:48",
        "titles": {
          "ar": "باب مِيرَاثِ الْمَفْقُودِ",
          "en": "Chapter 46 – Inheritance of the lost (unknown whereabouts)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:49",
    "titles": {
      "ar": "باب مِيرَاثِ الْمُسْتَهِلِّ",
      "en": "Chapter 47 – Inheritance of the new born"
    },
    "verse_count": 6,
    "verse_start_index": 13441,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/233)"
        ],
        "index": 13442,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:49:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ رِبْعِيِّ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ فِي الْمَنْفُوسِ إِذَا تَحَرَّكَ وَرِثَ إِنَّهُ رُبَّمَا كَانَ أَخْرَسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyrf, from Rabie Bin Abdullah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying regarding the new born: ‘If it moves, it inherits, perhaps it is speechless’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan all from ibn abu ‘Umayr from Rib‘iy ibn ‘ Abd Allah who has narrated the following: “I once heard abu ’Abd Allah, ‘Alayhi al-Salam, saying about newborn, ‘If he moves, he inherits; perhaps he is speechless.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/233)"
        ],
        "index": 13443,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:49:2",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ فِي السِّقْطِ إِذَا سَقَطَ مِنْ بَطْنِ أُمِّهِ فَتَحَرَّكَ تَحَرُّكاً بَيِّناً يَرِثُ وَ يُورَثُ فَإِنَّهُ رُبَّمَا كَانَ أَخْرَسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Hammad Bin Isa, from Rabie who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying regarding the miscarried child, when it is miscarried from the belly of its mother, so it moves. Manifest movement makes him inherit and be inherited from, for perhaps it was mute’."
          ],
          "en.sarwar": [
            "2. Ali has narrated from his father from Hammad ibn ‘Isa from Rib‘iy who has narrated the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘If a miscarried child falls off the womb of his mother and moves with clear movement, he inherits and is inherited; perhaps he is speechless so that he did not cry.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/233)"
        ],
        "index": 13444,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:49:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عُمَرَ بْنِ يَزِيدَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ مَاتَ وَ تَرَكَ امْرَأَتَهُ وَ هِيَ حَامِلٌ فَوَضَعَتْ بَعْدَ مَوْتِهِ غُلَاماً ثُمَّ مَاتَ الْغُلَامُ بَعْدَ مَا وَقَعَ عَلَى الْأَرْضِ فَشَهِدَتِ الْمَرْأَةُ الَّتِي قَبِلَتْهَا أَنَّهُ اسْتَهَلَّ وَ صَاحَ حِينَ وَقَعَ عَلَى الْأَرْضِ ثُمَّ مَاتَ بَعْدَ ذَلِكَ قَالَ عَلَى الْإِمَامِ أَنْ يُجِيزَ شَهَادَتَهَا فِي رُبُعِ مِيرَاثِ الْغُلَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and a number of our companions, from Sahl Bin Ziyad, altogether from Ibn Mahboub, from Umar Bin Yazeed who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who died and left his woman, and she was pregnant. So there was born, after his death, a boy. Then the boy died after having fallen upon the ground. So, the woman who was the midwife testified that he moved and shrieked when he fell upon the ground, then died after that. He<sup>asws</sup> said: ‘It is upon the Imam<sup>asws</sup> that he<sup>asws</sup> allow her testimony regarding the one-quarter of the inheritance of the boy’. (p.s. – two men or four women is the requirement of the testimony)."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and A number of our people have narrated from Sahl ibn Ziyad all from ibn Mahbub from ‘Umar ibn Yazid who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who dies leaving behind a woman who is pregnant. She gives birth after his death and the boy dies after falling on the ground. The female nurse saw and heard him crying when falling on the ground but then died. He (the Imam) said, ‘It is up to the Imam to apply her testimony for the one-fourth of the legacy of the boy.’” (The testimony of the nurse is one out of four needed) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/234)"
        ],
        "index": 13445,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:49:4",
        "text": [
          "ابْنُ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ سِنَانٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ تَجُوزُ شَهَادَةُ الْقَابِلَةِ فِي الْمَوْلُودِ إِذَا اسْتَهَلَّ وَ صَاحَ فِي الْمِيرَاثِ وَ يُوَرَّثُ الرُّبُعَ مِنَ الْمِيرَاثِ بِقَدْرِ شَهَادَةِ امْرَأَةٍ وَاحِدَةٍ قُلْتُ فَإِنْ كَانَتَا امْرَأَتَيْنِ قَالَ تَجُوزُ شَهَادَتُهُمَا فِي النِّصْفِ مِنَ الْمِيرَاثِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ibn Mahboub, from Abdullah Sinan who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The testimony of the midwife is allowed regarding the birth, when it moves and shrieks, with regards to the inheritance, and he would inherit the one-quarter from the inheritance by the measurement of the testimony of the one woman’. I said, ‘So if there were two women?’ He<sup>asws</sup> said: ‘Both their testimonies is allowed regarding the half of the inheritance’."
          ],
          "en.sarwar": [
            "4. Ibn Mahbub has narrated from ‘Abd Allah ibn Sinan who has narrated the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘The testimony of a female nurse about the crying of a newborn at the time of birth is effective for one-fourth of the legacy proportionate to the testimony of one woman.’ I then asked, ‘What happens if they are two women?’ He (the Imam) said, ‘It is effective for one-half of the legacy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/234)"
        ],
        "index": 13446,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:49:5",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنْ عَبْدِ اللَّهِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي مِيرَاثِ الْمَنْفُوسِ مِنَ الدِّيَةِ قَالَ لَا يَرِثُ مِنَ الدِّيَةِ شَيْئاً حَتَّى يَصِيحَ وَ يُسْمَعَ صَوْتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Muhammad Bin Ziyad, from Abdullah Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regard the inheritance of the new born from the wergild. He<sup>asws</sup> said: ‘He would not inherit anything from the wergild until he shrieks, and his voice is heard’."
          ],
          "en.sarwar": [
            "5. Humayd ibn Ziyad from al-Hassan ibn Muhammad ibn Sama‘ah from Muhammad ibn Ziyad from ‘Abd Allah ibn Sinan who has narrated the following: “About the case of inheritance of a newborn from a wergild, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘He cannot inherit from a wergild anything unless he cries at birth and his crying is heard.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/234)"
        ],
        "index": 13447,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:49:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ عَوْنٍ عَنْ بَعْضِهِمْ قَالَ سَمِعْتُهُ ( عليه السلام ) يَقُولُ إِنَّ الْمَنْفُوسَ لَا يَرِثُ مِنَ الدِّيَةِ شَيْئاً حَتَّى يَسْتَهِلَّ وَ يُسْمَعَ صَوْتُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Awn, from one of them who said, ",
            "‘I heard him<sup>asws</sup> saying that the new born does not inherit anything from the wergild until it moves and his voice is heard’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from ibn ‘Awn from certain persons of them who has narrated the following: “I once heard him (the Imam), ‘Alayhi al-Salam, saying, ‘A newborn does not inherit from a wergild anything unless he cries at the time of birth and his voice is heard.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:49",
  "kind": "verse_list"
}