{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:7:2:5",
        "titles": {
          "ar": "باب نَادِرٌ",
          "en": "Chapter 4 – Miscellaneous"
        }
      }
    ],
    "index": 2031,
    "local_index": 5,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:7:2:6",
        "titles": {
          "ar": "باب فِي إِبْطَالِ الْعَوْلِ",
          "en": "Chapter 5 – Invalidation of the deficiencies/excess (in the legislated shares of inheritances)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:7:2:4",
        "titles": {
          "ar": "باب أَنَّ الْفَرَائِضَ لَا تُقَامُ إِلَّا بِالسَّيْفِ",
          "en": "Chapter 3 – The The Obligations cannot be established except by the sword"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:5",
    "titles": {
      "ar": "باب نَادِرٌ",
      "en": "Chapter 4 – Miscellaneous"
    },
    "verse_count": 2,
    "verse_start_index": 13209,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/120)"
        ],
        "index": 13210,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/140",
              "text": "أَحْمَدَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/141",
              "text": "سَعْدَانَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2119",
              "text": "غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ وَ الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِنَا قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:5:1",
        "relations": {
          "Mentions": [
            "/books/quran:3:182",
            "/books/quran:26:227"
          ]
        },
        "text": [
          " أَتَى أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) رَجُلٌ بِالْبَصْرَةِ بِصَحِيفَةٍ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ انْظُرْ إِلَى هَذِهِ الصَّحِيفَةِ فَإِنَّ فِيهَا نَصِيحَةً فَنَظَرَ فِيهَا ثُمَّ نَظَرَ إِلَى وَجْهِ الرَّجُلِ فَقَالَ إِنْ كُنْتَ صَادِقاً كَافَيْنَاكَ وَ إِنْ كُنْتَ كَاذِباً عَاقَبْنَاكَ وَ إِنْ شِئْتَ أَنْ نُقِيلَكَ أَقَلْنَاكَ فَقَالَ بَلْ تُقِيلُنِي يَا أَمِيرَ الْمُؤْمِنِينَ ",
          "فَلَمَّا أَدْبَرَ الرَّجُلُ قَالَ أَيَّتُهَا الْأُمَّةُ الْمُتَحَيِّرَةُ بَعْدَ نَبِيِّهَا أَمَا إِنَّكُمْ لَوْ قَدَّمْتُمْ مَنْ قَدَّمَ اللَّهُ وَ أَخَّرْتُمْ مَنْ أَخَّرَ اللَّهُ وَ جَعَلْتُمُ الْوِلَايَةَ وَ الْوِرَاثَةَ حَيْثُ جَعَلَهَا اللَّهُ مَا عَالَ وَلِيُّ اللَّهِ وَ لَا طَاشَ سَهْمٌ مِنْ فَرَائِضِ اللَّهِ وَ لَا اخْتَلَفَ اثْنَانِ فِي حُكْمِ اللَّهِ وَ لَا تَنَازَعَتِ الْأُمَّةُ فِي شَيْ‏ءٍ مِنْ أَمْرِ اللَّهِ إِلَّا عِلْمُ ذَلِكَ عِنْدَنَا مِنْ كِتَابِ اللَّهِ فَذُوقُوا وَبَالَ مَا قَدَّمَتْ أَيْدِيكُمْ وَ مَا اللَّهُ بِظَلَّامٍ لِلْعَبِيدِ وَ سَيَعْلَمُ الَّذِينَ ظَلَمُوا أَيَّ مُنْقَلَبٍ يَنْقَلِبُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary and Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan Bin Muslim, from someone else from our companions who said, ",
            "‘A man came over to Amir Al-Momineen<sup>asws</sup> at Al-Basra with a parchment, so he said, ‘O Amir Al-Momineen<sup>asws</sup>! Look into this parchment, for therein is advice’. So he<sup>asws</sup> looked into it, then looked at the face of the man, so he<sup>asws</sup> said: ‘If you are truthful we<sup>asws</sup> will remunerate you, and if you are a liar we<sup>asws</sup> will punish you, and if you like that we<sup>asws</sup> should release you, we<sup>asws</sup> shall release you’. So he said, ‘Release me, O Amir Al-Momineen<sup>asws</sup>’. ",
            "So when the man turned back, he<sup>asws</sup> said: ‘O you community (who is) confused after its Prophet<sup>saww</sup>! But had you prioritised the one<sup>asws</sup> whom Allah<sup>azwj</sup> has prioritised, and pushed back the one whom Allah<sup>azwj</sup> has Pushed back, and made the Wilayah and the inheritance where Allah<sup>azwj</sup> has Made it to be, the Guradians<sup>asws</sup> of Allah<sup>azwj</sup> would not be needy, nor would a portion from the Obligations (legislated shares of inheritance) of Allah<sup>azwj</sup> been neglected, nor two (people) would have differed regarding the Judgements of Allah<sup>azwj</sup>, nor would the community have squabbled with regards to anything from the Commands of Allah<sup>azwj</sup>, except that the Knowledge of that is in our<sup>asws</sup> possession from the Book of Allah<sup>azwj</sup>. Therefore, taste the evil consequences of <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h182\">[3:182]</a> what your own hands have sent before and because Allah is not in the least unjust to the servants <a href=\"/#/books/quran:26#h227\">[26:227]</a> and they who act unjustly shall come to know the turning they shall be Overturned with</span>’."
          ],
          "en.sarwar": [
            "1. Abu Ali al-Ash ‘ariy and al-Husayn from Muhammad have narrated from Ahmad ibn Ishaq from Sa‘d an ibn Muslim from more than one person of our people who has narrated the following: “A man in Basrah brought a Sahifah (a booklet) and said, ‘O ’Amir al-Mu’minin, look at this booklet; there is advice in it.’ He (the Imam) looked at it, then he looked at the face of the man and said, ’If you are truthful we compensate you; if you are not truthful we will penalize you, if you want us to release you we will release you.’ He said, ’Release me O ’Amir al-Mu’minin. ’ When the man left ’Amir al-Mu’minin said, ‘You are the confused nation after your Prophet. Had you given priority to what Allah has given priority, kept back what Allah has kept back, placed people who possess divine authority and who inherit divine authority as Allah has placed, people who possess divine authority would not become needy. Obligations ordained by Allah would not remain neglected, two people would not quarrel [about a command of Allah and a nation would not fight over a command of Allah] but that the knowledge thereof is with us in the book of Allah. So taste the evil consequences of what your hands have sent ahead of you. Allah is not unjust to the servants. Very soon the unjust will find to what kind of returning place they have returned.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/121)"
        ],
        "index": 13211,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/555",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1827",
              "text": "عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/360",
              "text": "مُحَمَّدِ بْنِ الْوَلِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/550",
              "text": "يُونُسَ بْنِ يَعْقُوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمِيِّ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:5:2",
        "relations": {
          "Mentions": [
            "/books/quran:3:182",
            "/books/quran:26:227"
          ]
        },
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ الْحَمْدُ لِلَّهِ الَّذِي لَا مُقَدِّمَ لِمَا أَخَّرَ وَ لَا مُؤَخِّرَ لِمَا قَدَّمَ ",
          "ثُمَّ ضَرَبَ بِإِحْدَى يَدَيْهِ عَلَى الْأُخْرَى ثُمَّ قَالَ يَا أَيَّتُهَا الْأُمَّةُ الْمُتَحَيِّرَةُ بَعْدَ نَبِيِّهَا لَوْ كُنْتُمْ قَدَّمْتُمْ مَنْ قَدَّمَ اللَّهُ وَ أَخَّرْتُمْ مَنْ أَخَّرَ اللَّهُ وَ جَعَلْتُمُ الْوِلَايَةَ وَ الْوِرَاثَةَ حَيْثُ جَعَلَهَا اللَّهُ مَا عَالَ وَلِيُّ اللَّهِ وَ لَا عَالَ سَهْمٌ مِنْ فَرَائِضِ اللَّهِ وَ لَا اخْتَلَفَ اثْنَانِ فِي حُكْمِ اللَّهِ وَ لَا تَنَازَعَتِ الْأُمَّةُ فِي شَيْ‏ءٍ مِنْ أَمْرِ اللَّهِ إِلَّا وَ عِنْدَنَا عِلْمُهُ مِنْ كِتَابِ اللَّهِ فَذُوقُوا وَبَالَ أَمْرِكُمْ وَ مَا فَرَّطْتُمْ فِي مَا قَدَّمَتْ أَيْدِيكُمْ وَ مَا اللَّهُ بِظَلَّامٍ لِلْعَبِيدِ وَ سَيَعْلَمُ الَّذِينَ ظَلَمُوا أَيَّ مُنْقَلَبٍ يَنْقَلِبُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad, from Ali Bin Al Hassan Al Taymi, from Muhammad Bin Al Waleed, from Yunus Bin Yaqoub, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The Praise is for Allah<sup>azwj</sup> Who, none can place first what He<sup>azwj</sup> Places as last, nor place last what He<sup>azwj</sup> has Places as first’. ",
            "Then he<sup>asws</sup> struck with one of his<sup>asws</sup> hands upon the other, then said: ‘O you community (who is) confused after its Prophet<sup>saww</sup>! Had you placed first the one<sup>asws</sup> whom Allah<sup>azwj</sup> had Placed as first, and placed last the one whom Allah<sup>azwj</sup> had Placed as last, and made the Wilayah and the inheritance where Allah<sup>azwj</sup> has Made it to be, the Guardian<sup>asws</sup> of Allah<sup>azwj</sup> would not be needy, nor a portion from the Obligations (legislated shares of inheritance) of Allah<sup>azwj</sup> had been neglected, nor two (people) would have differed regarding the Judgements of Allah<sup>azwj</sup>, nor would the community have squabbled with regards to something form the Commands of Allah<sup>azwj</sup>, except that in our<sup>asws</sup> possession is its Knowledge from the Book of Allah<sup>azwj</sup>. Therefore, taste the evil consequences of your affairs and what you have failed to do and <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h182\">[3:182]</a> what your own hands have sent before and because Allah is not in the least unjust to the servants <a href=\"/#/books/quran:26#h227\">[26:227]</a> and they who act unjustly shall come to know the turning they shall be Overturned with</span>’."
          ],
          "en.sarwar": [
            "2. Ahmad ibn Muhammad has narrated from Ali ibn al-Husayn al-Taymiy from Muhammad ibn al-Walid from Yunus ibn Ya’qub who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘All praise belongs to Allah. What Allah places last no one is able to place it first, and no one is able to place last what He has placed first.’ He (the Imam) then tapped his one hand with the other hand. He said, ‘O confused nation after her Prophet, had you placed first what Allah had done so and had you placed last what Allah had placed last, had you placed people who possess divine authority and who inherit divine authority as Allah had done, people who possess divine authority would not become needy. Deficiency did not occur in the ordained obligations toward Allah. No two people ever disagree on an issue of the laws of Allah or a nation fight over a thing of the commandments of Allah. However, the answer to it and knowledge thereof is with us in the book of Allah. Thus, taste the evil consequences of your affairs and the excess that you committed by your hand’s sending ahead of you. Allah is not unjust to the servants and very soon the unjust will find to what terrible returning place they have returned.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:5",
  "kind": "verse_list"
}