{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:7:2:51",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 49 – Another chapter form it"
        }
      }
    ],
    "index": 2077,
    "local_index": 51,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 52"
        },
        "path": "/books/al-kafi:7:2:52",
        "titles": {
          "ar": "باب",
          "en": "Chapter 50 – A chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 50"
        },
        "path": "/books/al-kafi:7:2:50",
        "titles": {
          "ar": "باب مِيرَاثِ الْخُنْثَى",
          "en": "Chapter 48 – Inheritance of the hermaphrodite (genderless)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:51",
    "titles": {
      "ar": "باب آخَرُ مِنْهُ",
      "en": "Chapter 49 – Another chapter form it"
    },
    "verse_count": 3,
    "verse_start_index": 13452,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/237)"
        ],
        "index": 13453,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:51:1",
        "refs": {
          "Mentions": [
            "/books/quran:37:141"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ إِسْمَاعِيلَ</span> عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِجَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ إِسْحَاقَ الْفَزَارِيِّ قَالَ سُئِلَ وَ أَنَا عِنْدَهُ يَعْنِي أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مَوْلُودٍ وُلِدَ وَ لَيْسَ بِذَكَرٍ وَ لَا أُنْثَى وَ لَيْسَ لَهُ إِلَّا دُبُرٌ كَيْفَ يُوَرَّثُ قَالَ يَجْلِسُ الْإِمَامُ وَ يَجْلِسُ مَعَهُ نَاسٌ فَيَدْعُو اللَّهَ وَ يُجِيلُ السِّهَامَ عَلَى أَيِّ مِيرَاثٍ يُوَرَّثُ مِيرَاثِ الذَّكَرِ أَوْ مِيرَاثِ الْأُنْثَى فَأَيُّ ذَلِكَ خَرَجَ وَرَّثَهُ عَلَيْهِ ",
          "ثُمَّ قَالَ وَ أَيُّ قَضِيَّةٍ أَعْدَلُ مِنْ قَضِيَّةٍ يُجَالُ عَلَيْهَا بِالسِّهَامِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَساهَمَ فَكانَ مِنَ الْمُدْحَضِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazal Bin Shazaan and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, altogether from Safwan Bin Yahya, from Abdullah Bin Muskan, from Is’haq Al Fazary who said, ",
            "‘He<sup>asws</sup> was asked and I was in his<sup>asws</sup> presence, meaning Abu Abdullah<sup>asws</sup>, about the birth of a child and not being with a male part nor a femal part, and there was not for him except for a backside. How would he inherit?’ He<sup>asws</sup> said: ‘The Imam<sup>asws</sup> would be seated in a gathering, and the people would be seated along with him<sup>asws</sup>, so he<sup>asws</sup> would supplicate to Allah<sup>azwj</sup>, and would make the drawing of the lots upon which inheritance it would inherit, the inheritance of the male or the inheritance of the female? So whichever of that comes out, it would inherit upon it’. ",
            "Then he<sup>asws</sup> said: ‘And which judgement is more just than a judgement made upon it by the drawing of the lots. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:37#h141\">[37:141]</a> So he drew lots (with them), so he was of those who are cast off</span>’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan and abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al- Jabbar all from Safwan ibn Yahya from ‘Abd Allah ibn Muskan from Ishaq al-Fazariy who has narrated the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked, when I was with him, about the case of a newborn who is not a male or female but there is only the anus and how to deal with the inheritance of such person. He (the Imam) said, ‘The Imam and people come in a gathering, pray to Allah then arrange a raffle to see the name of which sex comes and deal with the case according to the result of the raffle. No other means is as fair as raffle; Allah, most Majestic, most Glorious, has said, ‘They cast raffle and he lost in the raffle.’” <a href=\"/#/books/quran:37#h141\">[37:141]</a> "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/238)"
        ],
        "index": 13454,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:51:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ فُضَيْلِ بْنِ يَسَارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مَوْلُودٍ لَيْسَ لَهُ مَا لِلرِّجَالِ وَ لَا لَهُ مَا لِلنِّسَاءِ قَالَ يُقْرِعُ الْإِمَامُ أَوِ الْمُقْرِعُ بِهِ يَكْتُبُ عَلَى سَهْمٍ عَبْدَ اللَّهِ وَ عَلَى سَهْمٍ آخَرَ أَمَةَ اللَّهِ ثُمَّ يَقُولُ الْإِمَامُ أَوِ الْمُقْرِعُ اللَّهُمَّ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ عَالِمُ الْغَيْبِ وَ الشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ فَبَيِّنْ لَنَا أَمْرَ هَذَا الْمَوْلُودِ كَيْفَ يُوَرَّثُ مَا فَرَضْتَ لَهُ فِي الْكِتَابِ ثُمَّ يُطْرَحُ السَّهْمَانِ فِي سِهَامٍ مُبْهَمَةٍ ثُمَّ تُجَالُ السِّهَامُ عَلَى مَا خَرَجَ وُرِّثَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Ali Bin Raib, from Fuzeyl Bin Yasaar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a child born, there was neither for him what is for the men, nor for him what is for the women. He<sup>asws</sup> said: ‘The Imam<sup>asws</sup> or the drawer of lots would draw lots. It would be written on one lot, ‘servant of Allah<sup>azwj</sup>’, and on another lot would be written, ‘maid of Allah<sup>azwj</sup>’. Then the Imam<sup>asws</sup> or the drawer of the lots would be saying: ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> are Allah<sup>azwj</sup>. There is no god except for You<sup>azwj</sup>, Knower of the unseen and the seen. You<sup>azwj</sup> Judge between Your<sup>azwj</sup> servants regarding what they used to be differing in. So Clarify for us the matter of this birth, how he should inherit what is Obligated for him in the Book (Quran)’. Then the two lots would be thrown in vague lots. Then the lots would be made upon what comes out, it would inherit upon it’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad, all from ibn Mahbub from Ali ibn Ri’ab from Fudayl ibn Yasar who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a newborn who does not have the male or female organ. He (the Imam) said, ‘The Imam or one who casts raffle settles it by means of casting a raffle. On one token, he writes ‘male servant of Allah’, on the other he writes ‘female servant of Allah’. Then the Imam or the one who is casting the raffle says, ‘O Lord, You are Allah, no one deserves worship except You. You have the knowledge of the apparent and the unseen. You decide among Your servants in matters where they have differences, so please guide us in the matter of this newborn about inheritance and about Your ordained shares for this newborn in the book.’ The two tokens then are mixed with other similar tokens, then one is picked up randomly until one of the two tokens comes out and accordingly the matter of inheritance is decided.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/238)"
        ],
        "index": 13455,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:51:3",
        "refs": {
          "Mentions": [
            "/books/quran:37:141"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ وَ الْحَجَّالِ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُئِلَ عَنْ مَوْلُودٍ لَيْسَ بِذَكَرٍ وَ لَا أُنْثَى لَيْسَ لَهُ إِلَّا دُبُرٌ كَيْفَ يُوَرَّثُ قَالَ يَجْلِسُ الْإِمَامُ وَ يَجْلِسُ عِنْدَهُ نَاسٌ مِنَ الْمُسْلِمِينَ فَيَدْعُو اللَّهَ عَزَّ وَ جَلَّ وَ تُجَالُ السِّهَامُ عَلَيْهِ عَلَى أَيِّ مِيرَاثٍ يُوَرِّثُهُ أَ مِيرَاثِ الذَّكَرِ أَوْ مِيرَاثِ الْأُنْثَى فَأَيُّ ذَلِكَ خَرَجَ عَلَيْهِ وَرَّثَهُ ",
          "ثُمَّ قَالَ وَ أَيُّ قَضِيَّةٍ أَعْدَلُ مِنْ قَضِيَّةٍ تُجَالُ عَلَيْهَا السِّهَامُ يَقُولُ اللَّهُ تَعَالَى فَساهَمَ فَكانَ مِنَ الْمُدْحَضِينَ قَالَ وَ مَا مِنْ أَمْرٍ يَخْتَلِفُ فِيهِ اثْنَانِ إِلَّا وَ لَهُ أَصْلٌ فِي كِتَابِ اللَّهِ وَ لَكِنْ لَا تَبْلُغُهُ عُقُولُ الرِّجَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal and Al Hajjal, from Sa’alba Bin Maymoun, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the child born, not being with a male part, nor a female part, there was not for him except for a backside. How would he inherit?’ He<sup>asws</sup> said: ‘The Imam<sup>asws</sup> would sit in a gathering, and there would sit in his<sup>asws</sup> presence people from the Muslims. So he<sup>asws</sup> would be supplicating to Allah<sup>azwj</sup> Mighty and Majestic, and the lots would be made upon it which inheritance would he be inheriting, the inheritance of the males or the inheritance of the females? So whichever of that comes out upon him, he would inherit’. ",
            "Then he<sup>asws</sup> said: ‘And which judgement is more just than the judgement made upon the drawing of lots. Allah<sup>azwj</sup> the High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:37#h141\">[37:141]</a> So he drew lots (with them), so he was of those who are cast off</span>’. He<sup>asws</sup> said: ‘And there is none from the matters in which two (people) have differed except that for it is an origin in the Book of Allah<sup>azwj</sup>, but the intellects of the men cannot reach it’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal and al-Hajjal from Thadabah ibn Maymun from certain persons of our people who has narrated the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the case of a newborn who is not a male or female except that the child has an anus and about the inheritance of such child. He (the Imam) said, ‘The Imam with Muslim people sits in a gathering and prays to Allah, most Majestic, most Glorious, then mixes the arrows (tokens) to find out thereby if the child must receive from the legacy as a male or a female person. Whichever ’s token or arrow comes out it then is taken as means of settlement. He (the Imam) then said, ‘No other means is as fair as raffle; Allah, most Majestic, most Glorious, has said, ‘They cast raffle and he was of those who failed in the raffle.’ <a href=\"/#/books/quran:37#h141\">[37:141]</a>” He (the Imam) said, ‘For every matter about which two people dispute, there is a principle for it in the book of Allah but the power of reason of people cannot reach it.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:51",
  "kind": "verse_list"
}