{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 52"}, "path": "/books/al-kafi:7:2:52", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 51 – Another chapter from it"}}], "index": 2069, "local_index": 52, "part_type": "Chapter", "path": "/books/al-kafi:7:2:52", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 51 – Another chapter from it"}, "verse_count": 2, "verse_start_index": 13445, "verses": [{"index": 13446, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:52:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ حَرِيزِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ وُلِدَ عَلَى عَهْدِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مَوْلُودٌ لَهُ رَأْسَانِ وَ صَدْرَانِ فِي حَقْوٍ وَاحِدٍ فَسُئِلَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يُوَرَّثُ مِيرَاثَ اثْنَيْنِ أَوْ وَاحِدٍ فَقَالَ يُتْرَكُ حَتَّى يَنَامَ ثُمَّ يُصَاحُ بِهِ فَإِنِ انْتَبَهَا جَمِيعاً مَعاً كَانَ لَهُ مِيرَاثُ وَاحِدٍ وَ إِنِ انْتَبَهَ وَاحِدٌ وَ بَقِيَ الْآخَرُ نَائِماً يُوَرَّثُ مِيرَاثَ اثْنَيْنِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, from Ali Bin Ahmad Bin Asheym, from Al Qasim Bin Muhammad Al Jowhary, from Hareyz Bin Abdullah, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘In the era of Amir Al-Momineen<sup>asws</sup>, a child was born and it had two heads for it and two chests in one lower part. So Amir Al-Momineen<sup>asws</sup> was asked, ‘Would it inherit two inheritances or one?’ So he<sup>asws</sup> said: ‘Leave it until he goes to sleep, then shout at it. So if both heads wake up together, there would be one inheritance for it, and if one head wakes up and the other one remains sleeping, he would inherit the inheritance of two’."}]}, {"index": 13447, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:2:52:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ الْجَوْهَرِيِّ عَنْ حَرِيزِ بْنِ عَبْدِ اللَّهِ مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "<span style=\"font-size: small\">A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Al Qasim Bin Muhammad Al Jowhary, from Hareyz Bin Abdullah,</span> - similar to it."}]}]}, "index": "al-kafi:7:2:52", "kind": "verse_list"}