{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 52"
        },
        "path": "/books/al-kafi:7:2:52",
        "titles": {
          "ar": "باب",
          "en": "Chapter 50 – A chapter"
        }
      }
    ],
    "index": 2078,
    "local_index": 52,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 53"
        },
        "path": "/books/al-kafi:7:2:53",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 51 – Another chapter from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 51"
        },
        "path": "/books/al-kafi:7:2:51",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 49 – Another chapter form it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:52",
    "titles": {
      "ar": "باب",
      "en": "Chapter 50 – A chapter"
    },
    "verse_count": 1,
    "verse_start_index": 13455,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/238)"
        ],
        "index": 13456,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4459",
              "text": "مُحَمَّدِ بْنِ سَعِيدٍ الْآذَرْبِيجَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1361",
              "text": "عَبْدِ اللَّهِ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3863",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ كَيْسَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4460",
              "text": "مُوسَى بْنِ مُحَمَّدٍ أَخِي أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سَعِيدٍ الْآذَرْبِيجَانِيِّ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ كَيْسَانَ جَمِيعاً عَنْ مُوسَى بْنِ مُحَمَّدٍ أَخِي أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:52:1",
        "text": [
          " يَحْيَى بْنَ أَكْثَمَ سَأَلَهُ فِي الْمَسَائِلِ الَّتِي سَأَلَهُ عَنْهَا قَالَ وَ أَخْبِرْنِي عَنِ الْخُنْثَى وَ قَوْلِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فِيهِ يُوَرَّثُ الْخُنْثَى مِنَ الْمَبَالِ مَنْ يَنْظُرُ إِلَيْهِ إِذَا بَالَ وَ شَهَادَةُ الْجَارِّ إِلَى نَفْسِهِ لَا تُقْبَلُ مَعَ أَنَّهُ عَسَى أَنْ تَكُونَ امْرَأَةً وَ قَدْ نَظَرَ إِلَيْهَا الرِّجَالُ أَوْ عَسَى أَنْ يَكُونَ رَجُلًا وَ قَدْ نَظَرَ إِلَيْهِ النِّسَاءُ وَ هَذَا مِمَّا لَا يَحِلُّ ",
          "فَأَجَابَهُ أَبُو الْحَسَنِ الثَّالِثُ ( عليه السلام ) عَنْهَا أَمَّا قَوْلُ عَلِيٍّ ( عليه السلام ) فِي الْخُنْثَى أَنَّهُ يُوَرَّثُ مِنَ الْمَبَالِ فَهُوَ كَمَا قَالَ وَ يَنْظُرُ قَوْمٌ عُدُولٌ يَأْخُذُ كُلُّ وَاحِدٍ مِنْهُمْ مِرْآةً وَ يَقُومُ الْخُنْثَى خَلْفَهُمْ عُرْيَانَةً فَيَنْظُرُونَ فِي الْمِرْآةِ فَيَرَوْنَ شَبَحاً فَيَحْكُمُونَ عَلَيْهِ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Saeed Al Azarbayjani and Muhammad Bin Yahya, from Abdullah Bin Ja’far, from Al Hassan Bin Ali Bin Kayaan, altogether, ",
            "(It has been narrated) from Musa Bin Muhammad, a brother of Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> that Yahya Bin Aksam asked him<sup>asws</sup> among the questions that he asked him<sup>asws</sup> was, ‘Inform me about the (adult) hermaphrodite (genderless) and the words of Amir Al-Momineen<sup>asws</sup> with regards to it that the hermaphrodite would inherit based on its urination. One looks at it when it urinates and a testimony of one unjust to himself (a sinner) is not acceptable along with that perhaps that it might be a female and the man looks at her, or perhaps it happens to be a man and the woman looks at her, and this is from what is not Permissible’.",
            "So Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> answered him about it: ‘The words of Ali<sup>asws</sup> regarding the hermaphrodite is that it would inherit based upon the urination so it is as he<sup>asws</sup> has said. And a group of people would turn around, each one of them taking a mirror, and the (adult) hermaphrodite would be stood behind them, naked, so they would be looking in the mirror, so they would be seeing a resemblance, so they would be deciding upon it’."
          ],
          "en.sarwar": [
            "1. Ali ibn Muhammad has narrated from Muhammad ibn Sa‘id al-Azarbayijaniy and Muhammad ibn Yahya from ‘Abd Allah ibn Ja‘far from al-Hassan ibn Ali ibn Kaysan all from Musa ibn Muhammad son of brother of abu al-Hassan, al-Thalith, ‘Alayhi al-Salam, who has narrated the following: “Yahya ibn Aktham asked him (the Imam) questions; among the questions that he asked one was about hermaphrodite and the words of ’ Amir al-Mu’minin that a hermaphrodite inherits according to the manner of urinating and that who must look at the child (the person) when urinating and that the testimony of one who is unfair to himself is not accepted. That perhaps such person is a female and a man looks at her or that the person is a female and a man has looked at her, which is not lawful. Abu al-Hassan, al-Thalith, ‘Alayhi al-Salam, answered him saying, ‘The words of ’ Amir al-Mu’minin that a hermaphrodite inherits according to the manner of urinating, are as they are. People of justice must look at hermaphrodite, each one takes a mirror, and the hermaphrodite stands behind them. They see a form and judge accordingly.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:52",
  "kind": "verse_list"
}