{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 56"
        },
        "path": "/books/al-kafi:7:2:56",
        "titles": {
          "ar": "باب",
          "en": "Chapter 54 – A chapter"
        }
      }
    ],
    "index": 2082,
    "local_index": 56,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/al-kafi:7:2:57",
        "titles": {
          "ar": "باب مِيرَاثِ وَلَدِ الزِّنَى",
          "en": "Chapter 55 – Inheritance of the child of the adultery (bastard)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 55"
        },
        "path": "/books/al-kafi:7:2:55",
        "titles": {
          "ar": "باب آخَرُ فِي ابْنِ الْمُلَاعَنَةِ",
          "en": "Chapter 53 – Another Chapter regarding the son of a cursed mother (by her husband)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:56",
    "titles": {
      "ar": "باب",
      "en": "Chapter 54 – A chapter"
    },
    "verse_count": 1,
    "verse_start_index": 13469,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/245)"
        ],
        "index": 13470,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4462",
              "text": "إِسْحَاقُ بْنُ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ قَالَ حَدَّثَنِي إِسْحَاقُ بْنُ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:56:1",
        "text": [
          " سَأَلْتُ أَبَا إِبْرَاهِيمَ ( عليه السلام ) عَنْ رَجُلٍ ادَّعَتْهُ النِّسَاءُ دُونَ الرِّجَالِ بَعْدَ مَا ذَهَبَتْ رِجَالُهُنَّ وَ انْقَرَضُوا وَ صَارَ رَجُلًا وَ زَوَّجْنَهُ وَ أَدْخَلْنَهُ فِي مَنَازِلِهِنَّ وَ فِي يَدَيْ رَجُلٍ دَارٌ فَبَعَثَ إِلَيْهِ عَصَبَةُ الرِّجَالِ وَ النِّسَاءِ الَّذِينَ انْقَرَضُوا فَنَاشَدُوهُ اللَّهَ أَنْ لَا يُعْطِيَ حَقَّهُمْ مَنْ لَيْسَ مِنْهُمْ وَ قَدْ عَرَفَ الرَّجُلُ الَّذِي فِي يَدَيْهِ الدَّارُ قِصَّتَهُ وَ أَنَّهُ مُدَّعٍ كَمَا وَصَفْتُ لَكَ وَ اشْتَبَهَ عَلَيْهِ الْأَمْرُ لَا يَدْرِي يَدْفَعُهَا إِلَى الرَّجُلِ أَوْ إِلَى عَصَبَةِ النِّسَاءِ أَوْ عَصَبَةِ الرِّجَالِ ",
          "قَالَ فَقَالَ لِي يَدْفَعُهُ إِلَى الَّذِي يَعْرِفُ أَنَّ الْحَقَّ لَهُمْ عَلَى مَعْرِفَتِهِ الَّتِي يَعْرِفُ يَعْنِي عَصَبَةَ النِّسَاءِ لِأَنَّهُ لَمْ يُعْرَفْ لِهَذَا الْمُدَّعِي مِيرَاثٌ بِدَعْوَى النِّسَاءِ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Is’haq Bin Ammar who said, ",
            "‘I asked Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) about a man who claimed to the women besides the men, after the going away of their men and becoming extinct. And he became a man and they got him married and entered him into their chambers, and in the hands of a man was a house. So the relatives of the men and the women who had become extinct had asked him, and adjured him by Allah<sup>azwj</sup>, that he would not give their rights to the one who was not from them, and the man in whose hand was the house knew the story, and he had a claimant just as I have described to you<sup>asws</sup>, and the matter was confusing to him, and he does not know whether to hand it over to the man, or to the relatives of the women, or relatives of the men’.",
            "He (the narrator) said, ‘So he<sup>asws</sup> said to me: ‘Hand it over to the one whom he recognises that the right is for them upon his understanding with which he understands, meaning the relatives of the women, because he does not recognise for this claimant (the man), any inheritance by the claiming of the women for him’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman who has narrated the following: “Ishaq ibn ‘Ammar narrated to me that he once asked abu Ibrahim, ‘Alayhi al-Salam, about the case of a man against whom a woman without a man had laid a claim when their men were no more. When he became a man, the women married him and allowed him to enter their homes. A man had a house in his possession. The relatives of men and women who were no more asked him on oath not to give their right to those who do not have any right. The man who had the house in his possession knew the story of the man that he is being claimed as I mentioned but he is confused and does not know to whom he must give it; must he give it to the man or to the relatives of the women or to the relatives of men? He (the Imam) said, ‘He must give it to the one whom he knows is rightful to the best of his knowledge, that is, the relatives of the women because he does not know of any right for inheritance in favor of the man just because the women have claimed him. 5 ” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:56",
  "kind": "verse_list"
}