{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 57"}, "path": "/books/al-kafi:7:2:57", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 56 – Another chapter from it"}}], "index": 2074, "local_index": 57, "part_type": "Chapter", "path": "/books/al-kafi:7:2:57", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 56 – Another chapter from it"}, "verse_count": 2, "verse_start_index": 13463, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 13464, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:57:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنِ ابْنِ رِئَابٍ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ فَجَرَ بِنَصْرَانِيَّةٍ فَوَلَدَتْ مِنْهُ غُلَاماً فَأَقَرَّ بِهِ ثُمَّ مَاتَ فَلَمْ يَتْرُكْ وَلَداً غَيْرَهُ أَ يَرِثُهُ قَالَ نَعَمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ibn Raib, from hanan Bin Sudeyr, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who was immoral with a Christian woman, so she gave birth to a boy from it. So he accepted it, then died, and he did not leave any child other than him. Would he inherit him?’ He<sup>asws</sup> said: ‘Yes’."]}}, {"index": 13465, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:2:57:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ بْنِ بَزِيعٍ وَ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ حَنَانِ بْنِ سَدِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ مُسْلِمٍ فَجَرَ بِامْرَأَةٍ يَهُودِيَّةٍ فَأَوْلَدَهَا ثُمَّ مَاتَ وَ لَمْ يَدَعْ وَارِثاً قَالَ فَقَالَ يُسَلَّمُ لِوَلَدِهِ الْمِيرَاثُ مِنَ الْيَهُودِيَّةِ ", "قُلْتُ فَرَجُلٌ نَصْرَانِيٌّ فَجَرَ بِامْرَأَةٍ مُسْلِمَةٍ فَأَوْلَدَهَا غُلَاماً ثُمَّ مَاتَ النَّصْرَانِيُّ وَ تَرَكَ مَالًا لِمَنْ يَكُونُ مِيرَاثُهُ قَالَ يَكُونُ مِيرَاثُهُ لِابْنِهِ مِنَ الْمُسْلِمَةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Ismail Bin Bazie and Al Hassan Bin Mahboub, from Hanan Bin Sudeyr who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a Muslim man who was immoral with a Jewish woman, so she gave birth. Then he died and did not leave any inheritors. So he<sup>asws</sup> said: ‘Keep the inheritance safe for his child from the Jewish woman’. ", "I said, ‘So a Christian man is immoral with a Muslim woman, so she gives birth to a boy, then the Christian man dies and leave wealth; for whom would be his inheritance?’ He<sup>asws</sup> said: ‘His inheritance would happen to be for his son from the Muslim woman’."]}}]}, "index": "al-kafi:7:2:57", "kind": "verse_list"}