{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 57"
        },
        "path": "/books/al-kafi:7:2:57",
        "titles": {
          "ar": "باب مِيرَاثِ وَلَدِ الزِّنَى",
          "en": "Chapter 55 – Inheritance of the child of the adultery (bastard)"
        }
      }
    ],
    "index": 2083,
    "local_index": 57,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 58"
        },
        "path": "/books/al-kafi:7:2:58",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 56 – Another chapter from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 56"
        },
        "path": "/books/al-kafi:7:2:56",
        "titles": {
          "ar": "باب",
          "en": "Chapter 54 – A chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:57",
    "titles": {
      "ar": "باب مِيرَاثِ وَلَدِ الزِّنَى",
      "en": "Chapter 55 – Inheritance of the child of the adultery (bastard)"
    },
    "verse_count": 4,
    "verse_start_index": 13470,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/245)"
        ],
        "index": 13471,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:57:1",
        "text": [
          " أَيُّمَا رَجُلٍ وَقَعَ عَلَى وَلِيدَةِ قَوْمٍ حَرَاماً ثُمَّ اشْتَرَاهَا ثُمَّ ادَّعَى وَلَدَهَا فَإِنَّهُ لَا يُوَرَّثُ مِنْهُ شَيْ‏ءٌ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ الْوَلَدُ لِلْفِرَاشِ وَ لِلْعَاهِرِ الْحَجَرُ وَ لَا يُوَرَّثُ وَلَدَ الزِّنَا إِلَّا رَجُلٌ يَدَّعِي ابْنَ وَلِيدَتِهِ وَ أَيُّمَا رَجُلٍ أَقَرَّ بِوَلَدِهِ ثُمَّ انْتَفَى مِنْهُ فَلَيْسَ ذَلِكَ لَهُ وَ لَا كَرَامَةَ يَلْحَقُ بِهِ وَلَدُهُ إِذَا كَانَ مِنِ امْرَأَتِهِ أَوْ وَلِيدَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whichever man falls upon a slave girl of a people unlawfully, then buys her, then claims her child (to be his), so he would not inherit from him anything, for Rasool-Allah<sup>saww</sup> said: ‘The child is for the bed and for the adulterer is the stone, and the son of the adultery would not inherit except a man who claims a son of his slave girl, and whichever man accepts his child, then denies from it, so that is not for him, nor is it honourable; his child would be attached to him whether it was from his wife or from his slave girl’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad from al-Halabiy who has narrated the following: “This is a pronouncement from abu ‘ Abd Allah, ‘Alayhi al-Salam. He (the Imam) has said, Tf a man falls upon a slave-girl of a people unlawfully, then buys her and claims her child, he cannot inherit from such a child anything. It is because the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “A child belongs to the bed (owner thereof) and for the fornicator is the stone (penalty by stoning to death with due judicial process).” A child born out of wedlock cannot be made to inherit except in the case of a man who claims the child of his newly purchased (already pregnant) slave-girl. Anyone who claims a child to be his child then rejects him, such child is not his and it is not honorable, his child is joined with him if the child is from his wife or (newly purchased) slave-girl.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/246)"
        ],
        "index": 13472,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/372",
              "text": "عَلِيِّ بْنِ سَيْفٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1848",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ سَيْفٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:57:2",
        "text": [
          " كَتَبَ بَعْضُ أَصْحَابِنَا كِتَاباً إِلَى أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) مَعِي يَسْأَلُهُ عَنْ رَجُلٍ فَجَرَ بِامْرَأَةٍ ثُمَّ إِنَّهُ تَزَوَّجَهَا بَعْدَ الْحَمْلِ فَجَاءَتْ بِوَلَدٍ وَ هُوَ أَشْبَهُ خَلْقِ اللَّهِ بِهِ فَكَتَبَ بِخَطِّهِ وَ خَاتَمِهِ الْوَلَدُ لِغَيَّةٍ لَا يُوَرَّثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Sayf, from Muhammad Bin Al Hassan Al Ashary who said, ",
            "‘One of our companions wrote a letter to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> along with me, asking him<sup>asws</sup> about a man who was immoral with a woman, then he married her after the pregnancy, so she came with a child, and he resembles him most from the creatures of Allah<sup>azwj</sup>. So he<sup>asws</sup> wrote by his<sup>asws</sup> own handwriting and his<sup>asws</sup> seal: ‘The child of sin does not inherit’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Sayf from Muhammad ibn af-Hassan al-Ash ‘ariy who has narrated the following: “Once certain persons of our people with me wrote to abu Ja’far, al-Thaniy, ‘Alayhi al-Salam, asking about a man who commits the indecent act with a woman, then marries her after she becomes pregnant and gives birth to a child who of all creatures is similar to him. He (the Imam) wrote back in his handwriting the answer that said, ‘A child born out of wedlock cannot be made to inherit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/246)"
        ],
        "index": 13473,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1894",
              "text": "عَلِيِّ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1669",
              "text": "يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ عَلِيِّ بْنِ سَالِمٍ عَنْ يَحْيَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:57:3",
        "text": [
          " رَجُلٍ وَقَعَ عَلَى وَلِيدَةٍ حَرَاماً ثُمَّ اشْتَرَاهَا فَادَّعَى ابْنَهَا قَالَ فَقَالَ لَا يُوَرَّثُ مِنْهُ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ الْوَلَدُ لِلْفِرَاشِ وَ لِلْعَاهِرِ الْحَجَرُ وَ لَا يُوَرَّثُ وَلَدَ الزِّنَا إِلَّا رَجُلٌ يَدَّعِي ابْنَ وَلِيدَتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Ali Bin Salim, from Yahya, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who fell upon a slave girl unlawfully, then bought her, so he claimed her son (as his). So he<sup>asws</sup> said: ‘He would not inherit from him. Rasool-Allah<sup>saww</sup> said: ‘The child is for the bed (upon which it was conceived), and for the adulterer is the stone, and the child of the adultery would not inherit except a man who claims a son of a slave girl’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus from Ali ibn Salim from Yahya who has narrated the following: “This is a pronouncement of abu ’Abd Allah, ‘Alayhi al-Salam, about the case of a man who falls upon the slave-girl of a people in an unlawful manner. He then buys her and claims her child. He (the Imam) has said, ’He cannot inherit from such child because the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “A child belongs to the bed (owner thereof) and the fornicator deserve stones (to be stoned to death as penalty with due judicial process).” A child born out of wedlock cannot be inherited or made to inherit except in the case of a man who claims the child of his slave-girl.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/246)"
        ],
        "index": 13474,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/904",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1848",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْأَشْعَرِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:57:4",
        "text": [
          " كَتَبَ بَعْضُ أَصْحَابِنَا إِلَى أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) مَعِي يَسْأَلُهُ عَنْ رَجُلٍ فَجَرَ بِامْرَأَةٍ ثُمَّ إِنَّهُ تَزَوَّجَهَا بَعْدَ الْحَمْلِ فَجَاءَتْ بِوَلَدٍ وَ هُوَ أَشْبَهُ خَلْقِ اللَّهِ بِهِ فَكَتَبَ بِخَطِّهِ وَ خَاتَمِهِ الْوَلَدُ لِغَيَّةٍ لَا يُوَرَّثُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Mahziyar, from Muhammad Bin Al Hassan Al Ashary who said, ",
            "‘One of our companions wrote to Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup> along with me, asking him<sup>asws</sup> about a man who was immoral with a woman, then he married her after the pregnancy, so she came with a child, and he resembled him the most from the creatures of Allah<sup>azwj</sup>. So he<sup>asws</sup> wrote by his<sup>asws</sup> handwriting and his<sup>asws</sup> seal: ‘The child of sin does not inherit’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from Muhammad ibn al-Hassan al-Ash‘ariy who has narrated the following: “Once certain persons of our people with me wrote to abu Ja’far, al-Thaniy, ‘Alayhi al-Salam, asking about a man who commits the indecent act with a woman; then marries her after she becomes pregnant and gives birth to a child who of all creatures is similar to him. He (the Imam) wrote back in his handwriting the answer that said, ‘A child from the indecent act is not inherited.’” Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus who has narrated the following: “Inheritance of a child born out of wedlock belongs to the relatives of his mother like inheritance of a child of Mula‘anah (condemnation). (This is not a Hadith. It is the fatwa of Yunus and none of the many Ahadith that we have read has discussed it.) "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:57",
  "kind": "verse_list"
}