{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 58"}, "path": "/books/al-kafi:7:2:58", "titles": {"ar": "باب", "en": "Chapter 57 – A Chapter"}}], "index": 2075, "local_index": 58, "part_type": "Chapter", "path": "/books/al-kafi:7:2:58", "titles": {"ar": "باب", "en": "Chapter 57 – A Chapter"}, "verse_count": 2, "verse_start_index": 13465, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 13466, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:58:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمٍ مَوْلَى طِرْبَالٍ عَنْ حَرِيزٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ كَانَ يَطَأُ جَارِيَةً لَهُ وَ أَنَّهُ كَانَ يَبْعَثُهَا فِي حَوَائِجِهِ وَ أَنَّهَا حَبِلَتْ وَ أَنَّهُ [اتَّهَمَهَا وَ] بَلَغَهُ عَنْهَا فَسَادٌ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا هِيَ وَلَدَتْ أَمْسَكَ الْوَلَدَ وَ لَا يَبِيعُهُ وَ يَجْعَلُ لَهُ نَصِيباً مِنْ دَارِهِ [وَ مَالِهِ] ", "قَالَ فَقِيلَ لَهُ رَجُلٌ يَطَأُ جَارِيَةً لَهُ وَ إِنَّهُ لَمْ يَكُنْ يَبْعَثُهَا فِي حَوَائِجِهِ وَ إِنَّهُ اتَّهَمَهَا وَ حَبِلَتْ فَقَالَ إِذَا هِيَ وَلَدَتْ أَمْسَكَ الْوَلَدَ وَ لَا يَبِيعُهُ وَ يَجْعَلُ لَهُ نَصِيباً مِنْ دَارِهِ وَ مَالِهِ وَ لَيْسَتْ هَذِهِ مِثْلَ تِلْكَ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Qasim Bin Muhammad, from Suleym, a slave of Tirbal, from Hareyz, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who went to his slave girl of his, and he had sent her somewhere regarding a need of his, and she became pregnant, and he accused her and news of her mischief reached him. So Abu Abdullah<sup>asws</sup> said: ‘When she gives birth, she should keep the child and not sell him, and make for him a share from his house and his wealth’. ", "He (the narrator) said, ‘It was said to him<sup>asws</sup>, ‘A man went to a slave girl of his, and he had not sent her regarding a need of his, and he accused her, and she was pregnant’. So he<sup>asws</sup> said: ‘When she gives birth, he should keep the child and not sell him, and make for him a share from his house and his wealth, and this is not similar to that’."]}}, {"index": 13467, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:2:58:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ رَجُلًا مِنَ الْأَنْصَارِ أَتَى أَبِي فَقَالَ لَهُ إِنِّي ابْتُلِيتُ بِأَمْرٍ عَظِيمٍ إِنَّ لِي جَارِيَةً كُنْتُ أَطَأُهَا فَوَطِئْتُهَا يَوْماً وَ خَرَجْتُ فِي حَاجَةٍ لِي بَعْدَ مَا اغْتَسَلْتُ مِنْهَا وَ نَسِيتُ نَفَقَةً لِي فَرَجَعْتُ إِلَى الْمَنْزِلِ لآِخُذَهَا فَوَجَدْتُ غُلَامِي عَلَى بَطْنِهَا فَعَدَدْتُ لَهَا مِنْ يَوْمِي ذَلِكَ تِسْعَةَ أَشْهُرٍ فَوَلَدَتْ جَارِيَةً ", "قَالَ فَقَالَ لَهُ أَبِي لَا يَنْبَغِي لَكَ أَنْ تَقْرَبَهَا وَ لَا تَبِيعَهَا وَ لَكِنْ أَنْفِقْ عَلَيْهَا مِنْ مَالِكَ مَا دُمْتَ حَيّاً ثُمَّ أَوْصِ عِنْدَ مَوْتِكَ أَنْ يُنْفَقَ عَلَيْهَا مِنْ مَالِكَ حَتَّى يَجْعَلَ اللَّهُ لَهَا مَخْرَجاً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, altogether from Ibn Mahboub, from Abdullah Bin Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man from the Helpers came to my<sup>asws</sup> father<sup>asws</sup>, so he said to him<sup>asws</sup>, ‘I have been afflicted with a grievous matter. There is a slave girl for me, and I had gone to her. So one day I went to her, and then I went out regarding a need of mine, after having washed myself from her, and I forgot some expenses money from myself. So I returned to the house in order to take it, so I found my slave upon her belly. So I counted for her from that day of mine for nine months. So the slave girl gave birth’.", "He<sup>asws</sup> said: ‘So my<sup>asws</sup> father<sup>asws</sup> said to him: ‘It is not befitting for you that you should go near her, nor sell her, but spend upon her from your wealth for as long as you are alive. Then bequeath during your death that they (inheritors) should spend upon her from your wealth until Allah<sup>azwj</sup> Makes for her a way out’."]}}]}, "index": "al-kafi:7:2:58", "kind": "verse_list"}