{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:7:2:6",
        "titles": {
          "ar": "باب فِي إِبْطَالِ الْعَوْلِ",
          "en": "Chapter 5 – Invalidation of the deficiencies/excess (in the legislated shares of inheritances)"
        }
      }
    ],
    "index": 2032,
    "local_index": 6,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:6",
    "titles": {
      "ar": "باب فِي إِبْطَالِ الْعَوْلِ",
      "en": "Chapter 5 – Invalidation of the deficiencies/excess (in the legislated shares of inheritances)"
    },
    "verse_count": 2,
    "verse_start_index": 13211,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/122)"
        ],
        "index": 13212,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:6:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي مَرْيَمَ الْأَنْصَارِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ الَّذِي يَعْلَمُ عَدَدَ رَمْلِ عَالِجٍ لَيَعْلَمُ أَنَّ الْفَرَائِضَ لَا تَعُولُ عَلَى أَكْثَرَ مِنْ سِتَّةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from one of our companions, from Aban Bin Usman, from Abu Maryam Al Ansary, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The One<sup>azwj</sup> Who Knows the number of (grains of) sand can be relied upon to know that the Obligatory (legislated shares of inheritance), there cannot be a deficiency/excess (in these), are no more than six’."
          ],
          "en.sarwar": [
            "1. Al-Husayn from Muhammad has narrated from Mu‘alla’ ibn Muhammad from certain persons of our people from Aban ibn ‘Uthman from abu Maryam al-Ansariy who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘The one who knows the number of the grains of sand of a sand valley definitely knows that no deficiency takes place in the ordained shares which are not more than six.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/122)"
        ],
        "index": 13213,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:6:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) رُبَّمَا أُعِيلَ السِّهَامُ حَتَّى يَكُونَ عَلَى الْمِائَةِ أَوْ أَقَلَّ أَوْ أَكْثَرَ فَقَالَ لَيْسَ تَجُوزُ سِتَّةً ثُمَّ قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ إِنَّ الَّذِي أَحْصَى رَمْلَ عَالِجٍ لَيَعْلَمُ أَنَّ السِّهَامَ لَا تَعُولُ عَلَى سِتَّةٍ لَوْ يُبْصِرُونَ وَجْهَهَا لَمْ تَجُزْ سِتَّةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus Bin Abdul Rahman, from Sama’at, from Abu Baseer who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Perhaps (sometimes) the (legislated) shares (of inheritances) can happen to be over a hundred, or less, or more’. So he<sup>asws</sup> said: ‘These do not exceed six’.  Then he<sup>asws</sup> said: ‘Amir Al Momineen<sup>asws</sup> was saying: ‘The One<sup>azwj</sup> Who Counted the (grains of) sand can be relied upon to know that the (legislated) shares (of inheritances) there is no deficiency/excess upon six. If they view their aspects, these would not exceed six’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa from Yunus ibn ‘Abd al-Rahman from Sama‘ah from abu Basir who has narrated the following: “I once said to abu Ja‘far, ‘Alayhi al-Salam, ‘The ordained shares may turn into one hundred or less or more/ He (the Imam) said, ‘The ordained sharers do not exceed six.’ He (the Imam) said that Amir al-Mu’minin would say, ‘The one who has enumerated the number of the grains of sand of a sand valley knows that the ordained shares do not exceed six: if you consider its aspects, it does not exceed six/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/122)"
        ],
        "part_type": "Hadith",
        "text": [
          "3- مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ عَلِيِّ بْنِ عَبْدِ اللهِ عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ قَالَ حَدَّثَنِي أَبِي عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ قَالَ حَدَّثَنِي الزُّهْرِيُّ عَنْ عُبَيْدِ اللهِ بْنِ عَبْدِ اللهِ بْنِ عُتْبَةَ قَالَ جَالَسْتُ ابْنَ عَبَّاسٍ فَعَرَضَ ذِكْرُ الْفَرَائِضِ فِي الْمَوَارِيثِ فَقَالَ ابْنُ عَبَّاسٍ سُبْحَانَ اللهِ الْعَظِيمِ أَتَرَوْنَ أَنَّ الَّذِي أَحْصَى رَمْلَ عَالِجٍ عَدَداً جَعَلَ فِي مَالٍ نِصْفاً وَنِصْفاً وَثُلُثاً فَهَذَانِ النِّصْفَانِ قَدْ ذَهَبَا بِالْمَالِ فَأَيْنَ مَوْضِعُ الثُّلُثِ فَقَالَ لَهُ زُفَرُ بْنُ أَوْسٍ الْبَصْرِيُّ يَا أَبَا الْعَبَّاسِ فَمَنْ أَوَّلُ مَنْ أَعَالَ الْفَرَائِضَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ لَمَّا الْتَفَّتْ عِنْدَهُ الْفَرَائِضُ وَدَفَعَ بَعْضُهَا بَعْضاً قَالَ وَاللهِ مَا أَدْرِي أَيَّكُمْ قَدَّمَ اللهُ وَأَيَّكُمْ أَخَّرَ وَمَا أَجِدُ شَيْئاً هُوَ أَوْسَعُ مِنْ أَنْ أَقْسِمَ عَلَيْكُمْ هَذَا الْمَالَ بِالْحِصَصِ فَأَدْخَلَ عَلَى كُلِّ ذِي حَقٍّ مَا دَخَلَ عَلَيْهِ مِنْ عَوْلِ الْفَرِيضَةِ وَايْمُ اللهِ أَنْ لَوْ قَدَّمَ مَنْ قَدَّمَ اللهُ وَأَخَّرَ مَنْ أَخَّرَ اللهُ مَا عَالَتْ فَرِيضَةٌ فَقَالَ لَهُ زُفَرُ بْنُ أَوْسٍ وَأَيَّهَا قَدَّمَ وَأَيَّهَا أَخَّرَ فَقَالَ كُلُّ فَرِيضَةٍ لَمْ يُهْبِطْهَا اللهُ عَزَّ وَجَلَّ عَنْ فَرِيضَةٍ إِلا إِلَى فَرِيضَةٍ فَهَذَا مَا قَدَّمَ اللهُ وَأَمَّا مَا أَخَّرَ اللهُ فَكُلُّ فَرِيضَةٍ إِذَا زَالَتْ عَنْ فَرْضِهَا وَلَمْ يَكُنْ لَهَا إِلا مَا بَقِيَ فَتِلْكَ الَّتِي أَخَّرَ اللهُ وَأَمَّا الَّتِي قَدَّمَ فَالزَّوْجُ لَهُ النِّصْفُ فَإِذَا دَخَلَ عَلَيْهِ مَا يُزِيلُهُ عَنْهُ رَجَعَ إِلَى الرُّبُعِ وَلا يُزِيلُهُ عَنْهُ شَيْ‏ءٌ وَالزَّوْجَةُ لَهَا الرُّبُعُ فَإِذَا زَالَتْ عَنْهُ صَارَتْ إِلَى الثُّمُنِ لا يُزِيلُهَا عَنْهُ شَيْ‏ءٌ وَالأمُّ لَهَا الثُّلُثُ فَإِذَا زَالَتْ عَنْهُ صَارَتْ إِلَى السُّدُسِ وَلا يُزِيلُهَا عَنْهُ شَيْ‏ءٌ فَهَذِهِ الْفَرَائِضُ الَّتِي قَدَّمَ اللهُ عَزَّ وَجَلَّ وَأَمَّا الَّتِي أَخَّرَ اللهُ فَفَرِيضَةُ الْبَنَاتِ وَالأخَوَاتِ لَهَا النِّصْفُ وَالثُّلُثَانِ فَإِذَا أَزَالَتْهُنَّ الْفَرَائِضُ عَنْ ذَلِكَ لَمْ يَكُنْ لَهَا إِلا مَا بَقِيَ فَتِلْكَ الَّتِي أَخَّرَ اللهُ فَإِذَا اجْتَمَعَ مَا قَدَّمَ اللهُ وَمَا أَخَّرَ بُدِئَ بِمَا قَدَّمَ اللهُ فَأُعْطِيَ حَقَّهُ كَامِلا فَإِنْ بَقِيَ شَيْ‏ءٌ كَانَ لِمَنْ أَخَّرَ اللهُ فَإِنْ لَمْ يَبْقَ شَيْ‏ءٌ فَلا شَيْ‏ءَ لَهُ فَقَالَ لَهُ زُفَرُ بْنُ أَوْسٍ مَا مَنَعَكَ أَنْ تُشِيرَ بِهَذَا الرَّأْيِ عَلَى عُمَرَ فَقَالَ هَيْبَتُهُ فَقَالَ الزُّهْرِيُّ وَاللهِ لَوْ لا أَنَّهُ تَقَدَّمَهُ إِمَامٌ عَدْلٌ كَانَ أَمْرُهُ عَلَى الْوَرَعِ فَأَمْضَى أَمْراً فَمَضَى مَا اخْتَلَفَ عَلَى ابْنِ عَبَّاسٍ فِي الْعِلْمِ اثْنَانِ. "
        ],
        "translations": {
          "en.sarwar": [
            "3. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Muhammad ibn Yahya from Ali ibn ‘Abd Allah from Ya‘qub ibn Ibrahim ibn Sa‘d who has said that narrated to me my father from Muhammad ibn Ishaq who has said that narrated to me al- Zuhriy from ‘Ubayd Allah ibn ‘Utbah who has narrated the following: “I sat with ibn al- ‘Abbas that a mention of ordained shares of inheritance was made and ibn al- ‘Abbas said, ‘Allah is free of all defects, the most great. Do you think that one who enumerates the number of the grains of sand in a sand valley has designated half and half and one-third? The two halves take away the legacy then where is the room for the one-third?’ Zufar ibn ’Aws al-Basriy said, ‘O ibn al- ‘Abbas, who was the first one who caused excess or deficiency in the ordained shares? He said, ‘It was ‘Umar ibn al-Khattab when several ordained shares were before him which he gave certain amount to certain people and he said, “I do not know which one of you is first and which one is last according to Allah and I do not find anything bigger to distribute this asset among you in shares.” So he deducted from each of those with ordained shares to offset for the deficiency. I swear by Allah had he placed first whom Allah had placed first and placed last whom Allah had placed last, then no deficiency would take place in the ordained shares.’ Zufar ibn ’Aws then said to him, ‘What has He placed first and what has He placed last?’ He said, ‘Every ordained share that Allah, most Majestic, most Glorious, has not brought down from its being an ordained share except to another ordained share is what Allah has placed first. What Allah has placed last are such shares that when being moved from its status has no replacement except whatever is left, thus it is what Allah has placed last. The ordained shares that He has placed first are one-half, which is the share of a husband. When something is added to it then it is reduced to one-fourth and thereafter it is not removed to some other position. The share of a wife is one-fourth but when it is removed, it becomes one-eighth and then it remains without change. The share of a mother is one-third and when it is reduced, it becomes one-sixth and it then remains unchanged and these are the ordained shares that Allah, most Majestic, most Glorious, has placed first. Of the shares, that Allah has placed last is the share of two daughters and sisters, which are one-half and two-thirds. However, when they are removed from these positions they are not placed in another position with the remaining of the legacy. Thus, they are that which Allah has placed last. When the ones that are placed first and those, who are placed last come together, the ones that are placed first are given priority. A complete right is given to the beneficiary; then if anything left is given to those whose shares Allah has placed last. If nothing remains then there is nothing for him.’ Zufar ibn ’Aws then said to him (ibn Abbas), ‘What stopped you from giving this advice to ‘Umar?’ He (ibn Abbass) said, ‘It is his fearsomeness. ’ Al-Zuhriy has said, ‘By Allah, had he (ibn Abbas) presented it before a just Imam, who based his command on justice and piety, who would approve it, (the idea of ibn Abbas) then it would pass (in practical form among people) because no two people have disputed over the knowledge of ibn al-‘ Abbas.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:6",
  "kind": "verse_list"
}