{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:7:2", "titles": {"ar": "كتاب  الْمَوَارِيثِ", "en": "THE BOOK OF INHERITANCES"}}, {"indexed_titles": {"en": "Chapter 60"}, "path": "/books/al-kafi:7:2:60", "titles": {"ar": "باب إِقْرَارِ بَعْضِ الْوَرَثَةِ بِدَيْنٍ", "en": "Chapter 59 – Acceptance of a debt with an inheritor"}}], "index": 2077, "local_index": 60, "part_type": "Chapter", "path": "/books/al-kafi:7:2:60", "titles": {"ar": "باب إِقْرَارِ بَعْضِ الْوَرَثَةِ بِدَيْنٍ", "en": "Chapter 59 – Acceptance of a debt with an inheritor"}, "verse_count": 2, "verse_start_index": 13470, "verses": [{"index": 13471, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:2:60:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زَكَرِيَّا بْنِ يَحْيَى عَنِ الشَّعِيرِيِّ عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ كُنَّا عَلَى بَابِ أَبِي جَعْفَرٍ ( عليه السلام ) وَ نَحْنُ جَمَاعَةٌ نَنْتَظِرُهُ أَنْ يَخْرُجَ إِذْ جَاءَتِ امْرَأَةٌ فَقَالَتْ أَيُّكُمْ أَبُو جَعْفَرٍ فَقَالَ لَهَا الْقَوْمُ مَا تُرِيدِينَ مِنْهُ قَالَتْ أُرِيدُ أَنْ أَسْأَلَهُ عَنْ مَسْأَلَةٍ فَقَالُوا لَهَا هَذَا فَقِيهُ أَهْلِ الْعِرَاقِ فَسَلِيهِ فَقَالَتْ إِنَّ زَوْجِي مَاتَ وَ تَرَكَ أَلْفَ دِرْهَمٍ وَ كَانَ لِي عَلَيْهِ مِنْ صَدَاقِي خَمْسُمِائَةِ دِرْهَمٍ فَأَخَذْتُ صَدَاقِي وَ أَخَذْتُ مِيرَاثِي ثُمَّ جَاءَ رَجُلٌ فَادَّعَى عَلَيْهِ أَلْفَ دِرْهَمٍ فَشَهِدْتُ لَهُ\nفَقَالَ الْحَكَمُ فَبَيْنَا أَنَا أَحْسُبُ مَا يُصِيبُهَا إِذْ خَرَجَ أَبُو جَعْفَرٍ ( عليه السلام ) فَقَالَ مَا هَذَا الَّذِي أَرَاكَ تُحَرِّكُ بِهِ أَصَابِعَكَ يَا حَكَمُ فَأَخْبَرْتُهُ بِمَقَالَةِ الْمَرْأَةِ وَ مَا سَأَلَتْ عَنْهُ فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) أَقَرَّتْ بِثُلُثِ مَا فِي يَدَيْهَا وَ لَا مِيرَاثَ لَهَا \nقَالَ الْحَكَمُ فَوَ اللَّهِ مَا رَأَيْتُ أَحَداً أَفْهَمَ مِنْ أَبِي جَعْفَرٍ ( عليه السلام ) ", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Ibn Abu Umeyr, from Jameel Bin Darraj, from Zakariyya Bin Yahya, from Al Shairi, from Al Hakam Bin Uteyba who said, \n‘We were at the door of Abu Ja’far<sup>asws</sup>, and we were a group awaing him<sup>asws</sup> that he<sup>asws</sup> comes out, when a woman came over. So she said, ‘Which one of you is Abu Ja’far<sup>asws</sup>?’ So the group said to her, ‘What do you want from him<sup>asws</sup>?’ She said, ‘I want to ask him<sup>asws</sup> a question’. So they said to her, ‘This here is a jurist of the people of Al-Iraq, so ask him (instead)’. She said, ‘My husband died and left a thousand Dirhams, and there is still outstanding upon him, for me, my dower of five hundred Dirhams. So I took my dower and I took my inheritance. Then a man came over, so he claimed a thousand Dirhams against him. So I testified for him (that such is the case)’. \nSo Al-Hakam said, ‘So while I was calculating what is for her, when Abu Ja’far<sup>asws</sup> came out, so he<sup>asws</sup> said: ‘What is this which I<sup>asws</sup> see you moving your fingers, O Hakam?’ So I informed him<sup>asws</sup> with the words of the woman, and what she asked about?’ So Abu Ja’far<sup>asws</sup> said: ‘She acceptes with a third of what is in her hands, and there is no inheritance for her’.\nAl-Hakam said, ‘By Allah<sup>azwj</sup>! I have never seen anyone of more understanding that Abu Ja’far<sup>asws</sup>’."}]}, {"index": 13472, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:2:60:2", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ وَ حُسَيْنِ بْنِ عُثْمَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ مَاتَ وَ أَقَرَّ بَعْضُ وَرَثَتِهِ لِرَجُلٍ بِدَيْنٍ قَالَ يَلْزَمُهُ ذَلِكَ فِي حِصَّتِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Muhammad Bin Abu Hamza, and Husayn Bin Usman, from Is’haq Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who died and one of his inheritors accepted a debt for a man. He<sup>asws</sup> said: ‘That is necessary (to be paid off) from their shares’."}]}]}, "index": "al-kafi:7:2:60", "kind": "verse_list"}