{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:7:2",
        "titles": {
          "ar": "كتاب  الْمَوَارِيثِ",
          "en": "THE BOOK OF INHERITANCES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:7:2:62",
        "titles": {
          "ar": "باب",
          "en": "Chapter 60 – A Chapter"
        }
      }
    ],
    "index": 2088,
    "local_index": 62,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:2:62",
    "titles": {
      "ar": "باب",
      "en": "Chapter 60 – A Chapter"
    },
    "verse_count": 1,
    "verse_start_index": 13483,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/254)"
        ],
        "index": 13484,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:2:62:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ دَخَلْتُ عَلَيْهِ وَ سَلَّمْتُ وَ قُلْتُ جُعِلْتُ فِدَاكَ مَا تَقُولُ فِي رَجُلٍ مَاتَ وَ لَيْسَ لَهُ وَارِثٌ إِلَّا أَخٌ لَهُ مِنَ الرَّضَاعَةِ يَرِثُهُ قَالَ نَعَمْ أَخْبَرَنِي أَبِي عَنْ جَدِّي أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ مَنْ شَرِبَ مِنْ لَبَنِنَا أَوْ أَرْضَعَ لَنَا وَلَداً فَنَحْنُ آبَاؤُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Marouk Bin Ubeyd, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I went over to him<sup>asws</sup> and I greeted and said, ‘May I be sacrificed for you<sup>asws</sup>! What are you<sup>asws</sup> saying regarding a man who dies and there is no inheritor for him except for a brother of his from the breastfeeding. Would he inherit him?’ He<sup>asws</sup> said: ‘Yes. My<sup>asws</sup> father<sup>asws</sup> informed me<sup>asws</sup> from his<sup>asws</sup> grandfather<sup>asws</sup> that Rasool-Allah<sup>saww</sup> said: ‘The one who drinks from our<sup>asws</sup> milks or breasfeeds a child for us<sup>asws</sup>, so we<sup>asws</sup> are his fathers’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Marwak ibn ‘Ubayd who has narrated the following: “I once visited abu al-Hassan al-Rida’, ‘Alayhi al-Salam. I offered greeting of peace and asked saying, ‘I pray to Allah to keep my soul in service for your cause. What do you say about the case of a man who dies and has no other heirs except a brother who is due to breastfeeding; can he inherit him? He (the Imam) said, ‘Yes, my father narrated to me from my grandfather, the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, who has said, ‘One who drinks from our milk or gives milk to one of our children, we then are his fathers.”’ (This is perhaps to protect one from tyrants). "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:2:62",
  "kind": "verse_list"
}