{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:3:2", "titles": {"ar": "كِتَابُ الْحَيْضِ", "en": "THE BOOK OF MENSTRUATION (HAYDH)"}}, {"indexed_titles": {"en": "Chapter 10"}, "path": "/books/al-kafi:3:2:10", "titles": {"ar": "باب مَعْرِفَةِ دَمِ الْحَيْضِ مِنْ دَمِ الِاسْتِحَاضَةِ", "en": "Chapter 10 – Recognition of the menstruation (Haydh) blood from the inter-period bleeding (Istihaaza)"}}], "index": 557, "local_index": 10, "part_type": "Chapter", "path": "/books/al-kafi:3:2:10", "titles": {"ar": "باب مَعْرِفَةِ دَمِ الْحَيْضِ مِنْ دَمِ الِاسْتِحَاضَةِ", "en": "Chapter 10 – Recognition of the menstruation (Haydh) blood from the inter-period bleeding (Istihaaza)"}, "verse_count": 3, "verse_start_index": 4165, "verses": [{"index": 4166, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:2:10:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَفْصِ بْنِ الْبَخْتَرِيِّ قَالَ دَخَلَتْ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) امْرَأَةٌ فَسَأَلَتْهُ عَنِ الْمَرْأَةِ يَسْتَمِرُّ بِهَا الدَّمُ فَلَا تَدْرِي حَيْضٌ هُوَ أَوْ غَيْرُهُ قَالَ فَقَالَ لَهَا إِنَّ دَمَ الْحَيْضِ حَارٌّ عَبِيطٌ أَسْوَدُ لَهُ دَفْعٌ وَ حَرَارَةٌ وَ دَمَ الِاسْتِحَاضَةِ أَصْفَرُ بَارِدٌ فَإِذَا كَانَ لِلدَّمِ حَرَارَةٌ وَ دَفْعٌ وَ سَوَادٌ فَلْتَدَعِ الصَّلَاةَ \nقَالَ فَخَرَجَتْ وَ هِيَ تَقُولُ وَ اللَّهِ أَنْ لَوْ كَانَ امْرَأَةً مَا زَادَ عَلَى هَذَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hafs Bin Al Bakhtary who said, \n‘A woman came over to Abu Abdullah<sup>asws</sup> and she asked him<sup>asws</sup> about the woman whose bleeding is continuous with her, so she does not know whether it is menstruation (<span class=\"iTxt\">Haydh</span>) or something else. So he<sup>asws</sup> said to her: ‘The blood of the menstruation (<span class=\"iTxt\">Haydh</span>) is warm, thick, black, there being a spurt for it and heat; and the blood of the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) is yellow, cold. So when there was heat and spurting and blackness for the blood, so let her leave the <span class=\"iTxt\">Salaat</span>’. \nHe (the narrator) said, ‘So she went out and she was saying, ‘By Allah<sup>azwj</sup>! Had he<sup>asws</sup> been a woman, she would not have increased upon this (explanation)’."}]}, {"index": 4167, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:2:10:2", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى وَ ابْنِ أَبِي عُمَيْرٍ جَمِيعاً عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ دَمَ الِاسْتِحَاضَةِ وَ الْحَيْضِ لَيْسَ يَخْرُجَانِ مِنْ مَكَانٍ وَاحِدٍ إِنَّ دَمَ الِاسْتِحَاضَةِ بَارِدٌ وَ دَمَ الْحَيْضِ حَارٌّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Hammad Bin Isa and Ibn Abu Umeyr, altogether from Muawiya Bin Ammar who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘The blood of the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) and the menstruation (<span class=\"iTxt\">Haydh</span>) do not come out from one place. The blood of the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) is cold, and the blood of the menstruation (<span class=\"iTxt\">Haydh</span>) is hot’."}]}, {"index": 4168, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:2:10:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْحَاقَ بْنِ جَرِيرٍ قَالَ سَأَلَتْنِي امْرَأَةٌ مِنَّا أَنْ أُدْخِلَهَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَاسْتَأْذَنْتُ لَهَا فَأَذِنَ لَهَا فَدَخَلَتْ وَ مَعَهَا مَوْلَاةٌ لَهَا فَقَالَتْ لَهُ يَا أَبَا عَبْدِ اللَّهِ قَوْلُهُ تَعَالَى زَيْتُونَةٍ لا شَرْقِيَّةٍ وَ لا غَرْبِيَّةٍ مَا عَنَى بِهَذَا فَقَالَ لَهَا أَيَّتُهَا الْمَرْأَةُ إِنَّ اللَّهَ تَعَالَى لَمْ يَضْرِبِ الْأَمْثَالَ لِلشَّجَرَةِ إِنَّمَا ضَرَبَ الْأَمْثَالَ لِبَنِي آدَمَ سَلِي عَمَّا تُرِيدِينَ\nقَالَتْ أَخْبِرْنِي عَنِ اللَّوَاتِي بِاللَّوَاتِي مَا حَدُّهُنَّ فِيهِ قَالَ حَدُّ الزِّنَا إِنَّهُ إِذَا كَانَ يَوْمُ الْقِيَامَةِ أُتِيَ بِهِنَّ وَ أُلْبِسْنَ مُقَطَّعَاتٍ مِنْ نَارٍ وَ قُمِعْنَ بِمَقَامِعَ مِنْ نَارٍ وَ سُرْبِلْنَ مِنَ النَّارِ وَ أُدْخِلَ فِي أَجْوَافِهِنَّ إِلَى رُءُوسِهِنَّ أَعْمِدَةٌ مِنْ نَارٍ وَ قُذِفَ بِهِنَّ فِي النَّارِ\nأَيَّتُهَا الْمَرْأَةُ إِنَّ أَوَّلَ مَنْ عَمِلَ هَذَا الْعَمَلَ قَوْمُ لُوطٍ وَ اسْتَغْنَى الرِّجَالُ بِالرِّجَالِ فَبَقِينَ النِّسَاءُ بِغَيْرِ رِجَالٍ فَفَعَلْنَ كَمَا فَعَلَ رِجَالُهُنَّ لِيَسْتَغْنِيَ بَعْضُهُنَّ بِبَعْضٍ\nفَقَالَتْ لَهُ أَصْلَحَكَ اللَّهُ مَا تَقُولُ فِي الْمَرْأَةِ تَحِيضُ فَتَجُوزُ أَيَّامُ حَيْضِهَا قَالَ إِنْ كَانَ حَيْضُهَا دُونَ عَشَرَةِ أَيَّامٍ اسْتَظْهَرَتْ بِيَوْمٍ وَاحِدٍ ثُمَّ هِيَ مُسْتَحَاضَةٌ قَالَتْ فَإِنَّ الدَّمَ يَسْتَمِرُّ بِهَا الشَّهْرَ وَ الشَّهْرَيْنِ وَ الثَّلَاثَةَ كَيْفَ تَصْنَعُ بِالصَّلَاةِ قَالَ تَجْلِسُ أَيَّامَ حَيْضِهَا ثُمَّ تَغْتَسِلُ لِكُلِّ صَلَاتَيْنِ \nفَقَالَتْ لَهُ إِنَّ أَيَّامَ حَيْضِهَا تَخْتَلِفُ عَلَيْهَا وَ كَانَ يَتَقَدَّمُ الْحَيْضُ الْيَوْمَ وَ الْيَوْمَيْنِ وَ الثَّلَاثَةَ وَ يَتَأَخَّرُ مِثْلَ ذَلِكَ فَمَا عِلْمُهَا بِهِ قَالَ دَمُ الْحَيْضِ لَيْسَ بِهِ خَفَاءٌ هُوَ دَمٌ حَارٌّ تَجِدُ لَهُ حُرْقَةً وَ دَمُ الِاسْتِحَاضَةِ دَمٌ فَاسِدٌ بَارِدٌ ", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Is’haq Bin Jareer who said, \n‘A woman from us asked me if I could get her to see Abu Abdullah<sup>asws</sup>. So I sought the permission for her and he<sup>asws</sup> permitted for her, and with her was a slave girl of hers. So she said to him, ‘O Abu Abdullah<sup>asws</sup>! The Words of the Exalted, <span class=\"ibTxt\">[24:35] lit from a blessed olive-tree, neither eastern nor western</span>, what is Meant by this?’ So he<sup>asws</sup> said to her: ‘O you woman! Allah<sup>azwj</sup> the Exalted does not Strike the examples for the trees. But rather, He<sup>azwj</sup> struck examples for the children of Adam<sup>as</sup>. Ask about whatever you are intending to’. \nShe said, ‘Inform me about the lesbian with the lesbian, what are their legal punishments (<span class=\"iTxt\">Hadd</span>)?’ He<sup>asws</sup> said: ‘The legal punishment (<span class=\"iTxt\">Hadd</span>) of the adultery. When it will be the Day of Judgement, they will come with them, and they would be wearing cut-outs of Fire, and harnessed by the harnesses of Fire, and wearing trousers of Fire, and columns of Fire would enter inside them to go up to their heads, and they will be thrown into the Fire. \nO you woman! The first ones who did this deed were the people of Lot<sup>as</sup>, and the men satisfied their needs with the men. So the women remained without men, and so they did just as their men were doing, satisfying each other’. \nSo she said to him<sup>asws</sup>, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! What are you<sup>asws</sup> saying regarding the woman who menstruates and it exceeds the (regular) days of her menstruation (<span class=\"iTxt\">Haydh</span>)?’ He<sup>asws</sup> said: ‘If her menstruation (<span class=\"iTxt\">Haydh</span>) was of less than ten days, she would examine after one day, then she would be with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>)’. She said, ‘Supposing the blood continues with her for the month and the two months, and the three, how would she deal with the <span class=\"iTxt\">Salaat</span>?’ He<sup>asws</sup> said: ‘She would sit (awaiting) for the (regular) days of her menstruation (<span class=\"iTxt\">Haydh</span>), then she would wash for every two <span class=\"iTxt\">Salaat</span>s’. \nSo she said to him<sup>asws</sup>, ‘If the days of her menstruation (<span class=\"iTxt\">Haydh</span>) are different upon her, and the menstruation (<span class=\"iTxt\">Haydh</span>) tended to precede by the day, or two days, and three, and it would get delayed similar to that, so what can she know with it?’ He<sup>asws</sup> said: ‘The blood of the menstruation (<span class=\"iTxt\">Haydh</span>) is not unknown. It is a hot blood. You would find a burning sensation with it. And the blood of the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) is putrid, cold’."}]}]}, "index": "al-kafi:3:2:10", "kind": "verse_list"}