{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:3:2", "titles": {"ar": "كِتَابُ الْحَيْضِ", "en": "THE BOOK OF MENSTRUATION (HAYDH)"}}, {"indexed_titles": {"en": "Chapter 11"}, "path": "/books/al-kafi:3:2:11", "titles": {"ar": "باب مَعْرِفَةِ دَمِ الْحَيْضِ وَ الْعُذْرَةِ وَ الْقَرْحَةِ", "en": "Chapter 11 – Recognition of the blood of menstruation (Haydh), and the virginity, and the ulcers"}}], "index": 558, "local_index": 11, "part_type": "Chapter", "path": "/books/al-kafi:3:2:11", "titles": {"ar": "باب مَعْرِفَةِ دَمِ الْحَيْضِ وَ الْعُذْرَةِ وَ الْقَرْحَةِ", "en": "Chapter 11 – Recognition of the blood of menstruation (Haydh), and the virginity, and the ulcers"}, "verse_count": 3, "verse_start_index": 4168, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 4169, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:2:11:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ خَلَفِ بْنِ حَمَّادٍ وَ رَوَاهُ أَحْمَدُ أَيْضاً عَنْ مُحَمَّدِ بْنِ أَسْلَمَ عَنْ خَلَفِ بْنِ حَمَّادٍ الْكُوفِيِّ قَالَ تَزَوَّجَ بَعْضُ أَصْحَابِنَا جَارِيَةً مُعْصِراً لَمْ تَطْمَثْ فَلَمَّا اقْتَضَّهَا سَالَ الدَّمُ فَمَكَثَ سَائِلًا لَا يَنْقَطِعُ نَحْواً مِنْ عَشَرَةِ أَيَّامٍ قَالَ فَأَرَوْهَا الْقَوَابِلَ وَ مَنْ ظَنُّوا أَنَّهُ يُبْصِرُ ذَلِكَ مِنَ النِّسَاءِ فَاخْتَلَفْنَ فَقَالَ بَعْضٌ هَذَا مِنْ دَمِ الْحَيْضِ وَ قَالَ بَعْضٌ هُوَ مِنْ دَمِ الْعُذْرَةِ فَسَأَلُوا عَنْ ذَلِكَ فُقَهَاءَهُمْ كَأَبِي حَنِيفَةَ وَ غَيْرِهِ مِنْ فُقَهَائِهِمْ فَقَالُوا هَذَا شَيْ‏ءٌ قَدْ أَشْكَلَ وَ الصَّلَاةُ فَرِيضَةٌ وَاجِبَةٌ فَلْتَتَوَضَّأْ وَ لْتُصَلِّ وَ لْيُمْسِكْ عَنْهَا زَوْجُهَا حَتَّى تَرَى الْبَيَاضَ فَإِنْ كَانَ دَمَ الْحَيْضِ لَمْ يَضُرَّهَا الصَّلَاةُ وَ إِنْ كَانَ دَمَ الْعُذْرَةِ كَانَتْ قَدْ أَدَّتِ الْفَرْضَ ", "فَفَعَلَتِ الْجَارِيَةُ ذَلِكَ وَ حَجَجْتُ فِي تِلْكَ السَّنَةِ فَلَمَّا صِرْنَا بِمِنًى بَعَثْتُ إِلَى أَبِي الْحَسَنِ مُوسَى بْنِ جَعْفَرٍ ( عليه السلام ) فَقُلْتُ جُعِلْتُ فِدَاكَ إِنَّ لَنَا مَسْأَلَةً قَدْ ضِقْنَا بِهَا ذَرْعاً فَإِنْ رَأَيْتَ أَنْ تَأْذَنَ لِي فَآتِيكَ وَ أَسْأَلُكَ عَنْهَا فَبَعَثَ إِلَيَّ إِذَا هَدَأَتِ الرِّجْلُ وَ انْقَطَعَ الطَّرِيقُ فَأَقْبِلْ إِنْ شَاءَ اللَّهُ", "قَالَ خَلَفٌ فَرَأَيْتُ اللَّيْلَ حَتَّى إِذَا رَأَيْتُ النَّاسَ قَدْ قَلَّ اخْتِلَافُهُمْ بِمِنًى تَوَجَّهْتُ إِلَى مِضْرَبِهِ فَلَمَّا كُنْتُ قَرِيباً إِذَا أَنَا بِأَسْوَدَ قَاعِدٍ عَلَى الطَّرِيقِ فَقَالَ مَنِ الرَّجُلُ فَقُلْتُ رَجُلٌ مِنَ الْحَاجِّ فَقَالَ مَا اسْمُكَ قُلْتُ خَلَفُ بْنُ حَمَّادٍ قَالَ ادْخُلْ بِغَيْرِ إِذْنٍ فَقَدْ أَمَرَنِي أَنْ أَقْعُدَ هَاهُنَا فَإِذَا أَتَيْتَ أَذِنْتُ لَكَ", "فَدَخَلْتُ وَ سَلَّمْتُ فَرَدَّ السَّلَامَ وَ هُوَ جَالِسٌ عَلَى فِرَاشِهِ وَحْدَهُ مَا فِي الْفُسْطَاطِ غَيْرُهُ فَلَمَّا صِرْتُ بَيْنَ يَدَيْهِ سَأَلَنِي وَ سَأَلْتُهُ عَنْ حَالِهِ فَقُلْتُ لَهُ إِنَّ رَجُلًا مِنْ مَوَالِيكَ تَزَوَّجَ جَارِيَةً مُعْصِراً لَمْ تَطْمَثْ فَلَمَّا اقْتَضَّهَا سَالَ الدَّمُ فَمَكَثَ سَائِلًا لَا يَنْقَطِعُ نَحْواً مِنْ عَشَرَةِ أَيَّامٍ وَ إِنَّ الْقَوَابِلَ اخْتَلَفْنَ فِي ذَلِكَ فَقَالَ بَعْضُهُنَّ دَمُ الْحَيْضِ وَ قَالَ بَعْضُهُنَّ دَمُ الْعُذْرَةِ فَمَا يَنْبَغِي لَهَا أَنْ تَصْنَعَ", "قَالَ فَلْتَتَّقِ اللَّهَ فَإِنْ كَانَ مِنْ دَمِ الْحَيْضِ فَلْتُمْسِكْ عَنِ الصَّلَاةِ حَتَّى تَرَى الطُّهْرَ وَ لْيُمْسِكْ عَنْهَا بَعْلُهَا وَ إِنْ كَانَ مِنَ الْعُذْرَةِ فَلْتَتَّقِ اللَّهَ وَ لْتَتَوَضَّأْ وَ لْتُصَلِّ وَ يَأْتِيهَا بَعْلُهَا إِنْ أَحَبَّ ذَلِكَ فَقُلْتُ لَهُ وَ كَيْفَ لَهُمْ أَنْ يَعْلَمُوا مِمَّا هُوَ حَتَّى يَفْعَلُوا مَا يَنْبَغِي قَالَ فَالْتَفَتَ يَمِيناً وَ شِمَالًا فِي الْفُسْطَاطِ مَخَافَةَ أَنْ يَسْمَعَ كَلَامَهُ أَحَدٌ قَالَ ثُمَّ نَهَدَ إِلَيَّ فَقَالَ يَا خَلَفُ سِرَّ اللَّهِ سِرَّ اللَّهِ فَلَا تُذِيعُوهُ وَ لَا تُعَلِّمُوا هَذَا الْخَلْقَ أُصُولَ دِينِ اللَّهِ بَلِ ارْضَوْا لَهُمْ مَا رَضِيَ اللَّهُ لَهُمْ مِنْ ضَلَالٍ ", "قَالَ ثُمَّ عَقَدَ بِيَدِهِ الْيُسْرَى تِسْعِينَ ثُمَّ قَالَ تَسْتَدْخِلُ الْقُطْنَةَ ثُمَّ تَدَعُهَا مَلِيّاً ثُمَّ تُخْرِجُهَا إِخْرَاجاً رَفِيقاً فَإِنْ كَانَ الدَّمُ مُطَوَّقاً فِي الْقُطْنَةِ فَهُوَ مِنَ الْعُذْرَةِ وَ إِنْ كَانَ مُسْتَنْقِعاً فِي الْقُطْنَةِ فَهُوَ مِنَ الْحَيْضِ ", "قَالَ خَلَفٌ فَاسْتَحَفَّنِي الْفَرَحُ فَبَكَيْتُ فَلَمَّا سَكَنَ بُكَائِي قَالَ مَا أَبْكَاكَ قُلْتُ جُعِلْتُ فِدَاكَ مَنْ كَانَ يُحْسِنُ هَذَا غَيْرُكَ قَالَ فَرَفَعَ يَدَهُ إِلَى السَّمَاءِ وَ قَالَ وَ اللَّهِ إِنِّي مَا أُخْبِرُكَ إِلَّا عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) عَنْ جَبْرَئِيلَ عَنِ اللَّهِ عَزَّ وَ جَلَّ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and a number of our companions, from Ahmad Bin Muhammad Bin Khalid, altogether from Muhammad Bin Khalid, from Khalaf Bin Hammad, and reported by Ahmad as well, from Muhammad Bin Aslam, from Khalaf Bin Hammad Al Kufy who said,", "‘One of our companions got married to a young girl who had yet to menstruate. So when he deflowered her, the blood flowed, and it remained flowing, not getting cut off for about ten days. So he showed her to the midwives and the ones from the women he thought had that insight. But they differed. So some of them said, ‘This is from the blood of menstruation (<span class=\"iTxt\">Haydh</span>)’, and some said, ‘It is from the blood of virginity’. So he asked their jurists like Abu Haneefa and others from the jurists, and they said, ‘This is something which has confusion, and the <span class=\"iTxt\">Salaat</span> is a necessity, an Obligation. So let her perform ablution, and let her pray <span class=\"iTxt\">Salaat</span>, and let her husband abstain from her until she sees the whiteness (no blood). So if it was the blood of menstruation (<span class=\"iTxt\">Haydh</span>), the <span class=\"iTxt\">Salaat</span> would not harm her, and if it was the blood of the virginity, she would have fulfilled the Obligation’. ", "So the girl did that, and I performed Hajj during that year. So when we came to be at Mina, I sent a message to Abu Al-Hassan Musa<sup>asws</sup> Bin Ja’far<sup>asws</sup>, saying, ‘May I be sacrificed for you<sup>asws</sup>! There is a problem for us which we have been straitened with and are fed up with it. So if you<sup>asws</sup> see fit to permit me so I can come over to see you<sup>asws</sup> and ask you<sup>asws</sup> about it’. So he<sup>asws</sup> sent a message over to me: ‘When the man (people) subside and the road is cut off (blocked by someone), so you can come over, Allah<sup>azwj</sup> Willing’. ", "He (the narrator) said, ‘I stayed behind and saw the night until when I saw the people had lessened, I stayed behind at Mina to go to his<sup>asws</sup> tent. So when I was near, I saw a black man seated upon the road (blocking it). So he said, ‘Who is the man (coming over)?’ So I said, ‘A man from the Pilgrims’. So he said, ‘What is your name?’ I said, ‘Khalaf Bin Hammad’. He said, ‘Enter without a permission, for he<sup>asws</sup> had ordered me that I should be seated over here, and whenever you come over, so I should permit for you (to enter the tent)’. ", "So I entered and greeted, and he<sup>asws</sup> returned the greetings, and he<sup>asws</sup> was seated upon his<sup>asws</sup> carpet, alone, there being no one else in the tent. So when I came to be in front of him<sup>asws</sup>, he<sup>asws</sup> asked me and I asked him<sup>asws</sup> about his<sup>asws</sup> state, and I said to him<sup>asws</sup>, ‘A man from the ones in your<sup>asws</sup> Wilayah married a young girl who had yet to menstruate. So when he deflowered her, the blood flowed and remained flowing, not being cut off, for about ten days, and the midwives differed with regards to that. So some of them said it is the blood of menstruation (<span class=\"iTxt\">Haydh</span>), and some of them said it is the blood of virginity. So what is befitting for her to do?’ ", "He<sup>asws</sup> said: ‘So let her fear Allah<sup>azwj</sup>, for it was from the blood of menstruation (<span class=\"iTxt\">Haydh</span>), so let her abstain from the <span class=\"iTxt\">Salaat</span> until she sees the purity, and let her husband abstain from her; and if it was from the blood of virginity, so let her fear Allah<sup>azwj</sup>, and let her perform ablution, and let her pray <span class=\"iTxt\">Salaat</span>, and her husband can come to her if he likes that’. So I said to him<sup>asws</sup>, ‘So how is it for them to know what it is from until they do what is befitting?’ So he<sup>asws</sup> looked towards the right and left in the tent, fearing that someone might hear his<sup>asws</sup> speech, then he<sup>asws</sup> diverted towards me and he<sup>asws</sup> said: ‘O Khalaf! A secret of Allah<sup>azwj</sup>! A secret of Allah<sup>azwj</sup>! Therefore, neither waste it nor teach it to these people, the Principles of the Religion. But, be pleased for them what Allah<sup>azwj</sup> is Pleased for them, from the straying’.", "He (the narrator) said: ‘Then he<sup>asws</sup> he formed the (number) ninety with his<sup>asws</sup> left hand, then said: ‘She should insert the cotton, then leave it for a while. Then she should take it out with a gentle extraction. So if it was an encircled blood in the cotton, so it is from the virginity, and if it was a splodge in the cotton, so it is from the menstruation (<span class=\"iTxt\">Haydh</span>)’. ", "Khalaf said, ‘I was overcome with the happiness, and I cried. So when my crying settled, he<sup>asws</sup> said: ‘What made you cry?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! Who can be better at this than you<sup>asws</sup>?’ So he<sup>asws</sup> raised his<sup>asws</sup> hand towards the sky and said: ‘By Allah<sup>azwj</sup>! I<sup>asws</sup> did not inform you except from Rasool-Allah<sup>saww</sup>, from Jibraeel<sup>as</sup>, from Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 4170, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:2:11:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زِيَادِ بْنِ سُوقَةَ قَالَ سُئِلَ أَبُو جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ اقْتَضَّ امْرَأَتَهُ أَوْ أَمَتَهُ فَرَأَتْ دَماً كَثِيراً لَا يَنْقَطِعُ عَنْهَا يَوْماً كَيْفَ تَصْنَعُ بِالصَّلَاةِ قَالَ تُمْسِكُ الْكُرْسُفَ فَإِنْ خَرَجَتِ الْقُطْنَةُ مُطَوَّقَةً بِالدَّمِ فَإِنَّهُ مِنَ الْعُذْرَةِ تَغْتَسِلُ وَ تُمْسِكُ مَعَهَا قُطْنَةً وَ تُصَلِّي فَإِنْ خَرَجَ الْكُرْسُفُ مُنْغَمِساً بِالدَّمِ فَهُوَ مِنَ الطَّمْثِ تَقْعُدُ عَنِ الصَّلَاةِ أَيَّامَ الْحَيْضِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Ibn Raib, from Ziyad Bin Sowqat who said, ", "‘Abu Ja’far<sup>asws</sup> was asked about a man who deflowers his wife, or his maid, so she sees a lot of blood, not being cut off from her for a day. How would she deal with the <span class=\"iTxt\">Salaat</span>?’ He<sup>asws</sup> said: ‘She would insert the cotton. So if the cotton comes out encircled with the blood, so it is from the virginity. She should wash and keep the cotton with her, and she should pray <span class=\"iTxt\">Salaat</span>. But if the cotton comes out immersed in blood, so it is from the menstruation (<span class=\"iTxt\">Haydh</span>). She should sit (abstaining) from the <span class=\"iTxt\">Salaat</span> for the days of the menstruation (<span class=\"iTxt\">Haydh</span>)’."]}}, {"index": 4171, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:2:11:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى رَفَعَهُ عَنْ أَبَانٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَتَاةٌ مِنَّا بِهَا قَرْحَةٌ فِي فَرْجِهَا وَ الدَّمُ سَائِلٌ لَا تَدْرِي مِنْ دَمِ الْحَيْضِ أَوْ مِنْ دَمِ الْقَرْحَةِ فَقَالَ مُرْهَا فَلْتَسْتَلْقِ عَلَى ظَهْرِهَا ثُمَّ تَرْفَعُ رِجْلَيْهَا ثُمَّ تَسْتَدْخِلُ إِصْبَعَهَا الْوُسْطَى فَإِنْ خَرَجَ الدَّمُ مِنَ الْجَانِبِ الْأَيْمَنِ فَهُوَ مِنَ الْحَيْضِ وَ إِنْ خَرَجَ مِنَ الْجَانِبِ الْأَيْسَرِ فَهُوَ مِنَ الْقَرْحَةِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, raising it from Aban who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘A young girl from us had an ulcer in her private part, and the blood flowed. She did not know whether it is from the blood of the ulcer’. So he<sup>asws</sup> said: ‘Instruct her, so let her lie down upon her back, then raise her two legs, then insert her middle finger. So it the blood comes out from the right hand side, so it is from the menstruation (<span class=\"iTxt\">Haydh</span>), but if it comes out from the left hand side, so it is from the ulcer’."]}}]}, "index": "al-kafi:3:2:11", "kind": "verse_list"}