{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:3:2:12",
        "titles": {
          "ar": "باب الْحُبْلَى تَرَى الدَّمَ",
          "en": "Chapter 12 – The pregnant woman sees the blood"
        }
      }
    ],
    "index": 559,
    "local_index": 12,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:2:12",
    "titles": {
      "ar": "باب الْحُبْلَى تَرَى الدَّمَ",
      "en": "Chapter 12 – The pregnant woman sees the blood"
    },
    "verse_count": 6,
    "verse_start_index": 4171,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/236)"
        ],
        "index": 4172,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ الصَّحَّافِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ أُمَّ وَلَدِي تَرَى الدَّمَ وَ هِيَ حَامِلٌ كَيْفَ تَصْنَعُ بِالصَّلَاةِ قَالَ فَقَالَ لِي إِذَا رَأَتِ الْحَامِلُ الدَّمَ بَعْدَ مَا تَمْضِي عِشْرُونَ يَوْماً مِنَ الْوَقْتِ الَّذِي كَانَتْ تَرَى فِيهِ الدَّمَ مِنَ الشَّهْرِ الَّذِي كَانَتْ تَقْعُدُ فِيهِ فَإِنَّ ذَلِكَ لَيْسَ مِنَ الرَّحِمِ وَ لَا مِنَ الطَّمْثِ فَلْتَتَوَضَّأْ وَ تَحْتَشِي بِكُرْسُفٍ وَ تُصَلِّ",
          "وَ إِذَا رَأَتِ الْحَامِلُ الدَّمَ قَبْلَ الْوَقْتِ الَّذِي كَانَتْ تَرَى فِيهِ الدَّمَ بِقَلِيلٍ أَوْ فِي الْوَقْتِ مِنْ ذَلِكَ الشَّهْرِ فَإِنَّهُ مِنَ الْحَيْضَةِ فَلْتُمْسِكْ عَنِ الصَّلَاةِ عَدَدَ أَيَّامِهَا الَّتِي كَانَتْ تَقْعُدُ فِي حَيْضِهَا فَإِنِ انْقَطَعَ الدَّمُ عَنْهَا قَبْلَ ذَلِكَ فَلْتَغْتَسِلْ وَ لْتُصَلِّ وَ إِنْ لَمْ يَنْقَطِعِ الدَّمُ عَنْهَا إِلَّا بَعْدَ مَا تَمْضِي الْأَيَّامُ الَّتِي كَانَتْ تَرَى فِيهَا الدَّمَ بِيَوْمٍ أَوْ يَوْمَيْنِ فَلْتَغْتَسِلْ ثُمَّ تَحْتَشِي وَ تَسْتَذْفِرُ وَ تُصَلِّ الظُّهْرَ وَ الْعَصْرَ ",
          "ثُمَّ لْتَنْظُرْ فَإِنْ كَانَ الدَّمُ فِيمَا بَيْنَهُمَا وَ بَيْنَ الْمَغْرِبِ لَا يَسِيلُ مِنْ خَلْفِ الْكُرْسُفِ فَلْتَتَوَضَّأْ وَ لْتُصَلِّ عِنْدَ وَقْتِ كُلِّ صَلَاةٍ مَا لَمْ تَطْرَحِ الْكُرْسُفَ فَإِنْ طَرَحَتِ الْكُرْسُفَ عَنْهَا فَسَالَ الدَّمُ وَجَبَ عَلَيْهَا الْغُسْلُ وَ إِنْ طَرَحَتِ الْكُرْسُفَ وَ لَمْ يَسِلِ الدَّمُ فَلْتَتَوَضَّأْ وَ لْتُصَلِّ وَ لَا غُسْلَ عَلَيْهَا ",
          "قَالَ وَ إِنْ كَانَ الدَّمُ إِذَا أَمْسَكَتِ الْكُرْسُفَ يَسِيلُ مِنْ خَلْفِ الْكُرْسُفِ صَبِيباً لَا يَرْقَأُ فَإِنَّ عَلَيْهَا أَنْ تَغْتَسِلَ فِي كُلِّ يَوْمٍ وَ لَيْلَةٍ ثَلَاثَ مَرَّاتٍ وَ تَحْتَشِيَ وَ تُصَلِّيَ وَ تَغْتَسِلَ لِلْفَجْرِ وَ تَغْتَسِلَ لِلظُّهْرِ وَ الْعَصْرِ وَ تَغْتَسِلَ لِلْمَغْرِبِ وَ الْعِشَاءِ ",
          "قَالَ وَ كَذَلِكَ تَفْعَلُ الْمُسْتَحَاضَةُ فَإِنَّهَا إِذَا فَعَلَتْ ذَلِكَ أَذْهَبَ اللَّهُ بِالدَّمِ عَنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Al Husayn Bin Muaym Al Sahhaf who said, ",
            "‘I said to Abu Abullah<sup>asws</sup> that a mother of my children saw the blood and she is pregnant. How should she deal with the <span class=\"iTxt\">Salaat</span>?’ So he<sup>asws</sup> said to me: ‘When the pregnant woman sees the blood after the passing of twenty days from the time in which she (normally) sees the blood during the month which she sits (abstaining from <span class=\"iTxt\">Salaat</span> during it), so that is not from the womb, nor from the menstruation (<span class=\"iTxt\">Haydh</span>). So let her perform ablution, and she should insert with a cloth, and she should pray <span class=\"iTxt\">Salaat</span>. ",
            "And when the pregnant woman sees the blood before the time which she used to see the blood beforehand, by a little, or during the time from that month, so it is from the menstruation (<span class=\"iTxt\">Haydh</span>). So let her abstain from the <span class=\"iTxt\">Salaat</span> for a number of days which she used to sit (abstaining) during her menstruation (<span class=\"iTxt\">Haydh</span>). So if the blood gets cut off from her before that, then let her wash, and let her pray <span class=\"iTxt\">Salaat</span>; but if the blood does not get cut off from her except after the passing of the days in which she used to see the blood, by a day or two days, so let her wash, then let her stuff with the cotton, and pray Al-Zohr and Al-Asr <span class=\"iTxt\">Salaat</span>. ",
            "Then let her wait. So if it was such that the blood, during what is between these two (Al-Zohr and Al-Asr) and Al-Maghrib, does not flow from the other side of the cloth, so let her perform ablution, and let her pray <span class=\"iTxt\">Salaat</span> during the time of every <span class=\"iTxt\">Salaat</span> for as long as the cotton is clean. So if the cloth is clean from her but the blood flows, the washing would be Obligated upon her; and if the cloth is clean and the blood does not flow, so let her perform ablution, and let her pray <span class=\"iTxt\">Salaat</span>, and there is no washing (Obligated) upon her’.",
            "He<sup>asws</sup> said: ‘And if it was so that the blood, being withheld by the cloth, flows from the other side of the cloth with an effusion, nor as perspiration, so upon her is that she should wash three times during every day and night, and she should stuff (the cotton), and she should pray <span class=\"iTxt\">Salaat</span>; and she would wash for Al-Fajr, and wash for Al-Zohr and Al-Asr, and wash for Al-Maghrib and Al-Isha’. ",
            "He<sup>asws</sup> said: ‘And similar to that is what the one with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) would do. So if she were to do that, Allah<sup>azwj</sup> would Remove the blood from her’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Mahbub from al-Husayn ibn Nu’aym al-Sahhaf who has said the following: “I once said to abu ’Abd Allah, ‘Alayhi al-Salam, that the mother of my child finds bleeding and she is pregnant. What must she do for her Salah (prayer)? He (the narrator) has said that he (the Imam) said to me, ‘If a pregnant woman finds bleeding after twenty days from the date in which her Hayd (menses) would begin in the month when she experienced Hayd (menses), then it is not from the womb and but because of Hayd (menses). She must take Wudu’, fill herself with cotton and perform Salah (prayer). If a pregnant woman finds bleeding during a short time before the date during which she would experience Hayd (menses) or during the date of her Hayd (menses) in that month, it then is because of Hayd (menses). She must stop Salah (prayer) during a time, which is equal to the duration of her Hayd (menses). If bleeding stops before the (duration of her Hayd (menses)), she must take Ghusl (bath), and perform Salah (prayer). If bleeding did not stop before one or two days after the end of such duration in which she used to experience Hayd (menses) she then must take Ghusl (bath) then fill with cotton and tie down herself by passing her clothes between her legs to the other side, perform al-Dhuhr and al-‘Asr Salah (prayer). She then must wait and examine if no bleeding from behind the cotton is found after al-Dhuhr and al-‘Asr Salah (prayers) until al-Maghrib, she must take Wudu’ and perform Salah (prayer) in each time of Salah (prayer) as long as the piece of cotton is not disposed. If cotton is disposed and bleeding is found, she must take Ghusl (bath), but if cotton is disposed and no bleeding is found, she must take Wudu’ and perform Salah (prayer). She is not required to take Ghusl (bath).’ He (the Imam) said, ‘If bleeding emerges outside of the cotton placed inside, like perspiration and does not cease, she must take Ghusl (bath) every day and night three times and fill with cotton, then perform Salah (prayer). She must take Ghusl (bath) for the morning Salah (prayer), then take Ghusl (bath) for al-Dhuhr and al-‘Asr, and then take Ghusl (bath) for al-Maghrib and al-‘Isha’ Salah (prayers).’ He (the Imam) said, ‘A woman experiencing Istihadah (irregular menses) must also follow this procedure. If she did so Allah removes bleeding from her.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/238)"
        ],
        "index": 4173,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:12:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ رِجَالِهِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنِ الْمَرْأَةِ الْحُبْلَى قَدِ اسْتَبَانَ حَبَلُهَا تَرَى مَا تَرَى الْحَائِضُ مِنَ الدَّمِ قَالَ تِلْكَ الْهِرَاقَةُ مِنَ الدَّمِ إِنْ كَانَ دَماً كَثِيراً أَحْمَرَ فَلَا تُصَلِّ وَ إِنْ كَانَ قَلِيلًا أَصْفَرَ فَلَيْسَ عَلَيْهَا إِلَّا الْوُضُوءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his men, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about the pregnant woman whose pregnancy is detected, sees what the menstruating woman sees, from the blood. He<sup>asws</sup> said: ‘That is the spilling from the blood. If it was a lot of blood, being red, so she should not pray <span class=\"iTxt\">Salaat</span>; but if it was a little (blood), being yellow, so there is nothing upon her, except for the ablution’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from certain persons of his narrators from Muhammad ibn Muslim who has said the following: “I once asked one of the Imam, ‘Alayhim al-Salam, about the case of the pregnant woman whose pregnancy has become apparent, but finds what a woman experiences because of Hayd (menses) of blood discharge. He (the Imam) said, ‘It is a spilling of blood; if the discharge is a great deal and of red color, she must not perform Salah (prayer). She then needs to take Wudu’ only if it is of a small amount and of yellow color.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/238)"
        ],
        "index": 4174,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:12:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنِ الْحُبْلَى تَرَى الدَّمَ كَمَا كَانَتْ تَرَى أَيَّامَ حَيْضِهَا مُسْتَقِيماً فِي كُلِّ شَهْرٍ فَقَالَ تُمْسِكُ عَنِ الصَّلَاةِ كَمَا كَانَتْ تَصْنَعُ فِي حَيْضِهَا فَإِذَا طَهُرَتْ صَلَّتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about the pregnant woman seeing the blood just as she would see during the days of her menstruation (<span class=\"iTxt\">Haydh</span>), regularly, during every month. So he<sup>asws</sup> said: ‘She should refrain from the <span class=\"iTxt\">Salaat</span> just as she would do during her menstruation (<span class=\"iTxt\">Haydh</span>). So when she is clean, she should pray <span class=\"iTxt\">Salaat</span>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ from Muhammad ibn Muslim who has said the following: “I once asked one of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, about the case of a pregnant woman who experiences blood discharge like the days of her Hayd (menses) every month as a straight habit. He (the Imam) said, ‘She must hold herself back from Salah (prayer) like in days of her Hayd (menses), and when she is clean then perform Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/238)"
        ],
        "index": 4175,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:12:4",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْحُبْلَى تَرَى الدَّمَ وَ هِيَ حَامِلٌ كَمَا كَانَتْ تَرَى قَبْلَ ذَلِكَ فِي كُلِّ شَهْرٍ هَلْ تَتْرُكُ الصَّلَاةَ قَالَ تَتْرُكُ إِذَا دَامَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, and Muhammad Bin Yahya, from Muhammad Bin Al Husayn, altogether from Safwan Bin Yahya, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the pregnant woman seeing the blood, and she is pregnant, just as she used to see before that during every month. Should she neglect the <span class=\"iTxt\">Salaat</span>?’ He<sup>asws</sup> said: ‘She should leave it when there is blood’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Muhammad ibn al-Husayn all from Safwan ibn Yahya from ’Abd al-Rahman ibn al-Hajjaj who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a pregnant woman who experiences blood discharge even when she is pregnant, like before every month, should she stop performing Salah (prayer)? He (the Imam) said, ’She must stop Salah if it continues.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/239)"
        ],
        "index": 4176,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:12:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ أَبُو دَاوُدَ جَمِيعاً عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ وَ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ سُئِلَ عَنِ الْحُبْلَى تَرَى الدَّمَ أَ تَتْرُكُ الصَّلَاةَ فَقَالَ نَعَمْ إِنَّ الْحُبْلَى رُبَّمَا قَذَفَتْ بِالدَّمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Abu Dawood, altogether from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, and Fazalat Bin Ayoub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having been asked about the pregnant woman seeing the blood, ‘Should she leave the <span class=\"iTxt\">Salaat</span>?’ So he<sup>asws</sup> said: ‘Yes. Sometimes the pregnant woman does tend to throw out the blood’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad from and Abu Dawud all from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd and Fadalah ibn Ayyub who has said the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, was asked about a pregnant woman who experiences blood discharge whether she must stop performing Salah (prayer)? He (the Imam) said, ‘Yes, she must stop performing Salah (prayer). Sometimes pregnant women also discharge blood.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/239)"
        ],
        "index": 4177,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:12:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ الْحُبْلَى رُبَّمَا طَمِثَتْ فَقَالَ نَعَمْ وَ ذَلِكَ أَنَّ الْوَلَدَ فِي بَطْنِ أُمِّهِ غِذَاؤُهُ الدَّمُ فَرُبَّمَا كَثُرَ فَفَضَلَ عَنْهُ فَإِذَا فَضَلَ دَفَعَتْهُ فَإِذَا دَفَعَتْهُ حَرُمَتْ عَلَيْهَا الصَّلَاةُ .",
          "وَ فِي رِوَايَةٍ أُخْرَى إِذَا كَانَ كَذَلِكَ تَأَخَّرَ الْوِلَادَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Suleyman Bin Khalid who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! Does the pregnant woman menstruate sometimes?’ So he<sup>asws</sup> said: ‘Yes, and that is because the child in the belly of its mother, its sustenance is the blood. So, sometimes there is excess from it, it is repelled. So when it is repelled, the <span class=\"iTxt\">Salaat</span> is Prohibited upon her’. ",
            "And in another report, ‘(He<sup>asws</sup> said): ‘When it was like that, the birth would be delayed’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Sulayman ibn Khalid who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a pregnant woman, saying, ‘I pray to Allah to keep my soul in service for your cause, can such woman experience Hayd (menses)? He (the Imam) said, ‘Yes, because the child’s food in mother’s womb is blood. It (blood) may exceed the amount of food for the child. It (the excess) is then repelled. When this happens, Salah (prayer) becomes unlawful for her.’” In another Hadith it is said that it causes a birth delay. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:2:12",
  "kind": "verse_list"
}