{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:3:2:13",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب النُّفَسَاءِ</span>",
          "en": "Chapter 13 – The post-childbirth bleeding (Nafsa’a)"
        }
      }
    ],
    "index": 560,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:3:2:14",
        "titles": {
          "ar": "باب النُّفَسَاءِ تَطْهُرُ ثُمَّ تَرَى الدَّمَ أَوْ رَأَتِ الدَّمَ قَبْلَ أَنْ تَلِدَ",
          "en": "Chapter 14 – The woman with post-childbirth bleeding (Nafsa’a) (becomes) clean, then she sees the blood, or saw the blood before she gave birth"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:3:2:12",
        "titles": {
          "ar": "باب الْحُبْلَى تَرَى الدَّمَ",
          "en": "Chapter 12 – The pregnant woman sees the blood"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:2:13",
    "titles": {
      "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب النُّفَسَاءِ</span>",
      "en": "Chapter 13 – The post-childbirth bleeding (Nafsa’a)"
    },
    "verse_count": 6,
    "verse_start_index": 4177,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/239)"
        ],
        "index": 4178,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/387",
              "text": "الْفُضَيْلِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/497",
              "text": "أَحَدِهِمَا ( عليهما السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ وَ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:13:1",
        "text": [
          " النُّفَسَاءُ تَكُفُّ عَنِ الصَّلَاةِ أَيَّامَ أَقْرَائِهَا الَّتِي كَانَتْ تَمْكُثُ فِيهَا ثُمَّ تَغْتَسِلُ وَ تَعْمَلُ كَمَا تَعْمَلُ الْمُسْتَحَاضَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl Bin Yasaar, and Zurara, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The woman with post-childbirth bleeding (<span class=\"iTxt\">Nafsa’a</span>) would pause from the <span class=\"iTxt\">Salaat</span> for the days of her (regular) pure period which she used to await in them. Then she should wash and do just as the one with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) would do’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah from af-Fudayf ibn Yasar from Zurarah who has said the following: “One of the two Imam, ‘Alayhim al-Salam, concerning how many days of Salah (prayer), a woman during her childbirth, does not need to perform, has said, ‘She must not perform Salah (prayer) for a number of days which is equal to the number of her Hayd (menses) free days (10 days). Thereafter she must take Ghusl (bath) and follow the rules for Istihadah (irregular menses).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/240)"
        ],
        "index": 4179,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/458",
              "text": "عَبْدِ اللَّهِ بْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2231",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ أَعْيَنَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَعْيَنَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:13:2",
        "text": [
          " قُلْتُ لَهُ إِنَّ امْرَأَةَ عَبْدِ الْمَلِكِ وَلَدَتْ فَعَدَّ لَهَا أَيَّامَ حَيْضِهَا ثُمَّ أَمَرَهَا فَاغْتَسَلَتْ وَ احْتَشَتْ وَ أَمَرَهَا أَنْ تَلْبَسَ ثَوْبَيْنِ نَظِيفَيْنِ وَ أَمَرَهَا بِالصَّلَاةِ فَقَالَتْ لَهُ لَا تَطِيبُ نَفْسِي أَنْ أَدْخُلَ الْمَسْجِدَ فَدَعْنِي أَقُومُ خَارِجاً عَنْهُ وَ أَسْجُدُ فِيهِ ",
          "فَقَالَ قَدْ أَمَرَ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قَالَ فَانْقَطَعَ الدَّمُ عَنِ الْمَرْأَةِ وَ رَأَتِ الطُّهْرَ وَ أَمَرَ عَلِيٌّ ( عليه السلام ) بِهَذَا قَبْلَكُمْ فَانْقَطَعَ الدَّمُ عَنِ الْمَرْأَةِ وَ رَأَتِ الطُّهْرَ فَمَا فَعَلَتْ صَاحِبَتُكُمْ قُلْتُ مَا أَدْرِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Abdullah Bin Bukeyr, from Abdul Rahman Bin Ayn who said, ",
            "‘I said to him<sup>asws</sup>, ‘The wife of Abdul Malik gave birth. So he counted for her the days of her menstruation (<span class=\"iTxt\">Haydh</span>), then instructed her to wash and insert a cloth, and he instructed her that she should wear two (layers of) clean clothes, and instructed her with the <span class=\"iTxt\">Salaat</span>. So, she said to him, ‘I do not feel good for myself that I should enter the Masjid, therefore leave me to stand outside from it, and I shall prostrate therein’’. ",
            "So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> had ordered with it and said: ‘If the blood gets cut off from the woman and she sees the purity (so she can enter the Masjid)’, and Ali<sup>asws</sup> had ordered with this before you: ‘If the blood gets cut off from the woman and she sees the cleanliness (so she can enter the Masjid)’. So what did your companion do?’ I said, ‘I do not know’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Abd Allah ibn Bukayr from ‘Abd al-Rahman ibn ’A‘yan who has said the following: “I once said to him (the Imam), ‘Alayhi al-Salam, that the wife of ‘Abd al-Malik gave birth. He instructed her to wait for the number of days of her Hayd (menses), then instructed her to take Ghusl (bath), fill up, wear two clean clothes and perform Salah (prayer). She said, ‘My soul does not feel happy to enter the Masjid; so allow me to stay out of the Masjid and prostrate in it.’ He (the Imam) said, ‘The Messenger of Allah had issued such commandments and said, ‘Bleeding stops and she finds cleanliness,’ and Ali, ‘Alayhi al-Salam, before you had issued such commandments; once bleeding stops the woman finds herself clean. What did the woman (of your companion) do?’ I replied, ‘I do not know.’” (‘Abd al-Malik mentioned is perhaps ‘Abd al-Malik ibn ’A‘yan, according to al-Dhakhirah). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/240)"
        ],
        "index": 4180,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:13:3",
        "text": [
          " سَأَلَتِ امْرَأَةٌ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَتْ إِنِّي كُنْتُ أَقْعُدُ مِنْ نِفَاسِي عِشْرِينَ يَوْماً حَتَّى أَفْتَوْنِي بِثَمَانِيَةَ عَشَرَ يَوْماً فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ لِمَ أَفْتَوْكِ بِثَمَانِيَةَ عَشَرَ يَوْماً فَقَالَ رَجُلٌ لِلْحَدِيثِ الَّذِي رُوِيَ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) قَالَ لِأَسْمَاءَ بِنْتِ عُمَيْسٍ حِينَ نَفِسَتْ بِمُحَمَّدِ بْنِ أَبِي بَكْرٍ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ أَسْمَاءَ سَأَلَتْ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ قَدْ أُتِيَ بِهَا ثَمَانِيَةَ عَشَرَ يَوْماً وَ لَوْ سَأَلَتْهُ قَبْلَ ذَلِكَ لَأَمَرَهَا أَنْ تَغْتَسِلَ وَ تَفْعَلَ مَا تَفْعَلُهُ الْمُسْتَحَاضَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, raising it, said, ",
            "‘A woman asked Abu Abdullah<sup>asws</sup> saying, ‘I was sitting (abstaining from <span class=\"iTxt\">Salaat</span>) due to my post-childbirth bleeding (<span class=\"iTxt\">Nafsa’a</span>), for twenty days, until I was issued with a verdict of eighteen days’. So Abu Abdullah<sup>asws</sup> said: ‘And why were you issued with a verdict of eighteen days?’ So a man said, ‘Due to the Hadeeth which is reported from Rasool-Allah<sup>saww</sup> saying to Asma Bint Umays, when she experienced post-childbirth bleeding (<span class=\"iTxt\">Nafsa’a</span>) with Muhammad Bin Abu Bakr’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Asma asked Rasool-Allah<sup>saww</sup> and eighteen days had already come to her, and had she asked before that he<sup>saww</sup> would have ordered her that she should wash and do what the one with the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) would do’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father in a marfu‘ the following: “A woman once asked abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘I would, because of childbirth, wait for twenty days and they gave a fatwa to wait for eighteen days. Abu ‘Abd Allah, ‘Alayhi al-Salam, asked, ‘Why did they give a fatwa for eighteen days?’ A man then said it is because of the Hadith from the Messenger of Allah who said to Asma’ bint ‘Umays for the birth of Muhammad ibn abu Bakr. Abu ‘Abd Allah, ‘Alayhi al-Salam, then said, ‘Asma’ asked the Messenger of Allah after eighteen days. Had she asked before, the Messenger of Allah would ask her to take Ghusl (bath) and do what a Mustahadah is required to do.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/241)"
        ],
        "index": 4181,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ زُرَارَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:13:4",
        "text": [
          " قُلْتُ لَهُ النُّفَسَاءُ مَتَى تُصَلِّي قَالَ تَقْعُدُ بِقَدْرِ حَيْضِهَا وَ تَسْتَظْهِرُ بِيَوْمَيْنِ فَإِنِ انْقَطَعَ الدَّمُ وَ إِلَّا اغْتَسَلَتْ وَ احْتَشَتْ وَ اسْتَثْفَرَتْ وَ صَلَّتْ وَ إِنْ جَازَ الدَّمُ الْكُرْسُفَ تَعَصَّبَتْ وَ اغْتَسَلَتْ ثُمَّ صَلَّتِ الْغَدَاةَ بِغُسْلٍ وَ الظُّهْرَ وَ الْعَصْرَ بِغُسْلٍ وَ الْمَغْرِبَ وَ الْعِشَاءَ بِغُسْلٍ وَ إِنْ لَمْ يَجُزِ الدَّمُ الْكُرْسُفَ صَلَّتْ بِغُسْلٍ وَاحِدٍ ",
          "قُلْتُ وَ الْحَائِضُ قَالَ مِثْلُ ذَلِكَ سَوَاءً فَإِنِ انْقَطَعَ عَنْهَا الدَّمُ وَ إِلَّا فَهِيَ مُسْتَحَاضَةٌ تَصْنَعُ مِثْلَ النُّفَسَاءِ سَوَاءً ثُمَّ تُصَلِّي وَ لَا تَدَعُ الصَّلَاةَ عَلَى حَالٍ فَإِنَّ النَّبِيَّ ( صلى الله عليه وآله ) قَالَ الصَّلَاةُ عِمَادُ دِينِكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, and Muhammad Bin Ismail, from Al Fazl Bin Shazaan, altogether from Hammad Bin Isa, from Hareyz, from Zurara who said, ",
            "‘I said to him<sup>asws</sup>, ‘The one with post-childbirth bleeding (<span class=\"iTxt\">Nafsa’a</span>), when would she pray <span class=\"iTxt\">Salaat</span>?’ He<sup>asws</sup> said: ‘She would sit (abstaining) by a measurement of her menstruation (<span class=\"iTxt\">Haydh</span>), and she would examine herself by two days. So if the blood is cut off (fine), or else she should wash, and insert a cotton, and secure it, and pray <span class=\"iTxt\">Salaat</span>. And, if the blood exceeds the cloth, she would tighten it and wash. Then she would pray the morning (<span class=\"iTxt\">Salaat</span>) with one washing, and Al-Zohr and Al-Asr with one washing, and Al-Maghrib and Al-Isha with one washing; and if the blood does not exceed the cloth, she would pray <span class=\"iTxt\">Salaat</span> with one washing.",
            "I said, ‘And (what about) the menstruating woman?’ He<sup>asws</sup> said: ‘Similar to that, in the same way. So, if the blood is cut off from her (fine), or else she would be as one with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>). She would do the like of the one with post-childbirth bleeding (<span class=\"iTxt\">Nafsa’a</span>), in the same way. Then she would pray <span class=\"iTxt\">Salaat</span> and she should not leave the <span class=\"iTxt\">Salaat</span> upon (any) state, for the Prophet<sup>saww</sup> said: ‘The <span class=\"iTxt\">Salaat</span> is a pillar of your Religion’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from all from Hammad ibn ‘Isa from Flariz from Zurarah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a woman who has given birth and as to when she must perform Salah (prayer). He (the Imam) said, ‘She must wait for the number of days that are equal to those of her Hayd (menses). She then must examine in two days if bleeding has stopped, otherwise, she must take Ghusl (bath), fill up herself, secure it with a belt of cloths. She must perform the morning Salah (prayer) with one Ghusl (bath), Salah (prayer) of al-Dhuhr and al-‘Asr with one Ghusl (bath) and Salah (prayer) of al-Maghrib and al-‘Isha’ with one Ghusl (bath). If blood does not pass through the cotton, she can perform Salah (prayer) with one Ghusl (bath) (everyday).’ I then asked about a woman experiencing Hayd (menses). He (the Imam) said, ‘It is the same. If bleeding stops, otherwise, it is Istihadah and she must do what the woman after childbirth does. She must perform Salah (prayer) in all conditions; the Holy prophet, has said, ‘Salah (prayer) is the pillar of your religion.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/242)"
        ],
        "index": 4182,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2366",
              "text": "أَبُو دَاوُدَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1968",
              "text": "مُحَمَّدِ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/550",
              "text": "يُونُسَ بْنِ يَعْقُوبَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ أَبُو دَاوُدَ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ مُحَمَّدِ بْنِ أَبِي حَمْزَةَ عَنْ يُونُسَ بْنِ يَعْقُوبَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:13:5",
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ تَجْلِسُ النُّفَسَاءُ أَيَّامَ حَيْضِهَا الَّتِي كَانَتْ تَحِيضُ ثُمَّ تَسْتَظْهِرُ وَ تَغْتَسِلُ وَ تُصَلِّي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, and Abu Dawood, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Muhammad Bin Abu Hamza, from Yunus Bin Yaqoub who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The woman with post-childbirth bleeding (<span class=\"iTxt\">Nafsa’a</span>) would sit (abstaining) for the days of her menstruation (<span class=\"iTxt\">Haydh</span>) which she used to menstruate it. Then she would examine herself, and she would wash and pray <span class=\"iTxt\">Salaat</span>’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad from and abu Dawud from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from Muhammad ibn abu Hamzah from Yunus ibn Ya’qub who has said the following: “I heard abu ’Abd Allah, ‘Alayhi al-Salam, say, ‘A woman after giving birth waits for a number of days equal to those of her Hayd (menses). She then must examine, take Ghusl (bath) and perform Salah (prayer).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/242)"
        ],
        "index": 4183,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/249",
              "text": "ابْنِ بُكَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:13:6",
        "text": [
          " تَقْعُدُ النُّفَسَاءُ أَيَّامَهَا الَّتِي كَانَتْ تَقْعُدُ فِي الْحَيْضِ وَ تَسْتَظْهِرُ بِيَوْمَيْنِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Ibn Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The woman with post-childbirth bleeding (<span class=\"iTxt\">Nafsa’a</span>) would sit (abstaining) for her days which she used to sit (abstaining) during the menstruation (<span class=\"iTxt\">Haydh</span>), and she would examine in two days’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from ibn Bukayr from Zurarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A woman for giving birth waits for the number of days of her Hayd (menses); then she must examine in two days.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:2:13",
  "kind": "verse_list"
}