{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:3:2:18",
        "titles": {
          "ar": "باب الْحَائِضِ تَقْضِي الصَّوْمَ وَ لَا تَقْضِي الصَّلَاةَ",
          "en": "Chapter 18 – The menstruating woman would make up the (missed) Fasts and she would not make up the (missed) Salaats"
        }
      }
    ],
    "index": 565,
    "local_index": 18,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:3:2:19",
        "titles": {
          "ar": "باب الْحَائِضِ وَ النُّفَسَاءِ تَقْرَءَانِ الْقُرْآنَ",
          "en": "Chapter 19 – The menstruating woman and the one with post-childbirth bleeding (Nafsa’a), reciting the Quran"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:3:2:17",
        "titles": {
          "ar": "باب الْمَرْأَةِ تَكُونُ فِي الصَّلَاةِ فَتَحُسُّ بِالْحَيْضِ",
          "en": "Chapter 17 – The woman happens to be in the Salaat, so she feels the menstruation (Haydh)"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:2:18",
    "titles": {
      "ar": "باب الْحَائِضِ تَقْضِي الصَّوْمَ وَ لَا تَقْضِي الصَّلَاةَ",
      "en": "Chapter 18 – The menstruating woman would make up the (missed) Fasts and she would not make up the (missed) Salaats"
    },
    "verse_count": 4,
    "verse_start_index": 4196,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/248)"
        ],
        "index": 4197,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:18:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ا</span>لْحُسَيْنُ بْنُ مُحَمَّدٍ</span> الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَا الْحَائِضُ تَقْضِي الصِّيَامَ وَ لَا تَقْضِي الصَّلَاةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Hassan Bin Muhammad Al Ashary, from Moalla Bin Muhammad, from Al Washa, from Aban, from the one who informed him, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> both having said: ‘The menstruating woman would make up the (missed) Fasts and would not make up the (missed) <span class=\"iTxt\">Salaat</span>s’."
          ],
          "en.sarwar": [
            "1. Al-Husayn ibn Muhammad al-Ash’ariy has narrated from Mu‘alla’ ibn Muhammad from af-Washsha’ from Aban from those who narrated to him has said the foffowing: “Abu Ja‘far, and abu ’Abd Allah, ‘Alayhim al-Salam, have said, ‘Woman experiencing Hayd (menses) must compensatory prayer fasting but not for Salah (prayer).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/248)"
        ],
        "index": 4198,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:18:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحَسَنِ بْنِ رَاشِدٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْحَائِضُ تَقْضِي الصَّلَاةَ قَالَ لَا قُلْتُ تَقْضِي الصَّوْمَ قَالَ نَعَمْ قُلْتُ مِنْ أَيْنَ جَاءَ هَذَا قَالَ إِنَّ أَوَّلَ مَنْ قَاسَ إِبْلِيسُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Hassan Bin Rashid who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The menstruating woman would make up the (missed) <span class=\"iTxt\">Salaat</span>s?’ He<sup>asws</sup> said: ‘No’. I said, ‘She should make up the (missed) Fasts?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Where has this come from?’ He<sup>asws</sup> said: ‘The first one who analogised was Iblees<sup>la</sup>’."
          ],
          "en.sarwar": [
            "2. Afi ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from af-Hassan ibn Rashid who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who experiences Hayd (menses) if she is required to perform Qada’ (compensatory prayer) of Salah (prayer) she has missed. He (the Imam) said, ‘No, she is not required.’ I asked if she is required to do Qada’ (compensatory prayer) of fasting. He (the Imam) said, ‘Yes, she is required to fast.’ I then asked, ‘From where has this come?’ He (the Imam) said, ‘The first one who used analogy was Iblis (Satan).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/248)"
        ],
        "index": 4199,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:18:3",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ أُذَيْنَةَ عَنْ زُرَارَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَضَاءِ الْحَائِضِ الصَّلَاةَ ثُمَّ تَقْضِي الصَّوْمَ قَالَ لَيْسَ عَلَيْهَا أَنْ تَقْضِيَ الصَّلَاةَ وَ عَلَيْهَا أَنْ تَقْضِيَ صَوْمَ شَهْرِ رَمَضَانَ ",
          "ثُمَّ أَقْبَلَ عَلَيَّ وَ قَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) كَانَ يَأْمُرُ بِذَلِكَ فَاطِمَةَ ( عليها السلام ) وَ كَانَتْ تَأْمُرُ بِذَلِكَ الْمُؤْمِنَاتِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Ibn Abu Umeyr, from Ibn Azina, from urara who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the menstruating woman making up for the (missed) <span class=\"iTxt\">Salaat</span>s, then she makes up for the (missed) Fasts’. He<sup>asws</sup> said: ‘It is not upon her that she makes up for the (missed) <span class=\"iTxt\">Salaat</span>s, and upon her is that she makes up for the (missed) Fasts of a month of Ramazan’. ",
            "Then he<sup>asws</sup> turned towards me and said: ‘Rasool-Allah<sup>saww</sup> had instructed Syeda Fatima<sup>asws</sup> with that, and she<sup>asws</sup> had ordered the believing women with that’."
          ],
          "en.sarwar": [
            "3. Afi ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ibn ’Udhaynah from Zurarah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about a woman who experiences Hayd (menses). I asked about Qada’ (compensatory prayer) of Salah (prayer) she has missed and that of fast. He (the Imam) said, ‘She is not required to perform Qada’ (compensatory prayer) of Salah (prayer) but she is required to do Qada’ (compensatory prayer) of fast of the month of Ramadan.’ He (the Imam) then turned to me and said that the Messenger of Allah would give such instructions to Fatimah, ‘Alayha al-Salam, and she would instruct the believing women so.’” "
          ]
        }
      },
      {
        "index": 4200,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:18:4",
        "refs": {
          "Mentions": [
            "/books/quran:3:36"
          ]
        },
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلًّى عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ إِسْمَاعِيلَ الْجُعْفِيِّ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) إِنَّ الْمُغِيرَةَ بْنَ سَعِيدٍ رَوَى عَنْكَ أَنَّكَ قُلْتَ لَهُ إِنَّ الْحَائِضَ تَقْضِي الصَّلَاةَ فَقَالَ مَا لَهُ لَا وَفَّقَهُ اللَّهُ إِنَّ امْرَأَةَ عِمْرَانَ نَذَرَتْ مَا فِي بَطْنِهَا مُحَرَّراً وَ الْمُحَرَّرُ لِلْمَسْجِدِ يَدْخُلُهُ ثُمَّ لَا يَخْرُجُ مِنْهُ أَبَداً ",
          "فَلَمَّا وَضَعَتْها قالَتْ رَبِّ إِنِّي وَضَعْتُها أُنْثى... وَ لَيْسَ الذَّكَرُ كَالْأُنْثى فَلَمَّا وَضَعَتْهَا أَدْخَلَتْهَا الْمَسْجِدَ فَسَاهَمَتْ عَلَيْهَا الْأَنْبِيَاءُ فَأَصَابَتِ الْقُرْعَةُ زَكَرِيَّا وَ كَفَّلَهَا زَكَرِيَّا",
          "فَلَمْ تَخْرُجْ مِنَ الْمَسْجِدِ حَتَّى بَلَغَتْ فَلَمَّا بَلَغَتْ مَا تَبْلُغُ النِّسَاءُ خَرَجَتْ فَهَلْ كَانَتْ تَقْدِرُ عَلَى أَنْ تَقْضِيَ تِلْكَ الْأَيَّامَ الَّتِي خَرَجَتْ وَ هِيَ عَلَيْهَا أَنْ تَكُونَ الدَّهْرَ فِي الْمَسْجِدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moalla, from Al Washa, from Aban Bin Usman, from Ismail Al Ju’fy who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘Al-Mugheira Bin Saeed reported from you<sup>asws</sup> that you<sup>asws</sup> said to him: ‘The menstruating woman would make up for the <span class=\"iTxt\">Salaat</span>’. So he<sup>asws</sup> said: ‘What is the matter with him? May Allah<sup>azwj</sup> not Reconcile him. The wife of Imran<sup>as</sup> vowed what was in her belly as a dedication, and the one dedicated to the Masjid would enter into it, then would not come out from it, ever. ",
            "<span class=\"ibTxt\"><a href=\"/#/books/quran:3#h36\">[3:36]</a> So when she gave birth to it, she said: My Lord! Surely I have brought it forth a female – (and Allah was more Knowing of what she gave birth to) - and the male is not like the female</span>. So when she had given birth to her<sup>as</sup> (Maryam<sup>as</sup>, she entered her<sup>asws</sup> into the Masjid. So the Prophets<sup>as</sup> drew lots over her<sup>as</sup>, and the vote came out for Zakariyya<sup>as</sup>, and Zakariyya<sup>as</sup> took the responsibility for her. ",
            "Thus, she<sup>as</sup> did not come out from the Masjid until she<sup>as</sup> was an adult. So when she<sup>as</sup> became an adult to what the women tend to reach in adulthood, she<sup>as</sup> went out. So was she<sup>as</sup> able upon making up for those days which she went out, and it was upon her<sup>as</sup> that she<sup>as</sup> would happen to be in the Masjid for ever?’"
          ],
          "en.sarwar": [
            "4. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ from al-Washsha’ from Aban ibn ‘Uthman from ’Isma‘il al- -Ju’fiy who has said the following: “I once said to abu Ja‘far, ‘Alayhi al-Salam, that al-Mughirah ibn Sa‘id has narrated from you that you have said, ‘A woman is required to perform Qada’ (compensatory prayer) of Salah (prayer) she has missed when experiencing Hayd (menses). He (the Imam) said, ‘What has happened to him, may Allah not accord him. The wife of ‘Imran made a vow about what was in her belly to be dedicated. What is dedicated to Masjid enters it then does not come out whereof forever. When she gave birth she said, ‘My Cherisher, I have given birth to a female. . . . and male is not like a female.’ When she gave birth she entered the Masjid, prophets cooperated with her and the raffle came out in the name of Zakariya’ who took charge of her upbringing. She did not come out of the Masjid until she was an adult. When she became what women become, she moved out. Was she able to perform Qada’ (compensatory prayer) of the days of Salah (prayer) she was out of the Masjid while she must have remained in the Masjid forever?”’ (The terms of dedication may not allow her to perform the form of Salah (prayer) Qada’ (compensatory prayer) required from her). "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:2:18",
  "kind": "verse_list"
}