{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 3"}, "path": "/books/al-kafi:3", "titles": {"ar": "الجزء الثالث‏", "en": "Volume Three"}}, {"indexed_titles": {"en": "Book 2"}, "path": "/books/al-kafi:3:2", "titles": {"ar": "كِتَابُ الْحَيْضِ", "en": "THE BOOK OF MENSTRUATION (HAYDH)"}}, {"indexed_titles": {"en": "Chapter 2"}, "path": "/books/al-kafi:3:2:2", "titles": {"ar": "باب أَدْنَى الْحَيْضِ وَ أَقْصَاهُ وَ أَدْنَى الطُّهْرِ", "en": "Chapter 2 – The minimum of the menstruation (Haydh), and its maximum, and the minimum of the purity"}}], "index": 549, "local_index": 2, "part_type": "Chapter", "path": "/books/al-kafi:3:2:2", "titles": {"ar": "باب أَدْنَى الْحَيْضِ وَ أَقْصَاهُ وَ أَدْنَى الطُّهْرِ", "en": "Chapter 2 – The minimum of the menstruation (Haydh), and its maximum, and the minimum of the purity"}, "verse_count": 5, "verse_start_index": 4128, "verses": [{"index": 4129, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:3:2:2:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ أَدْنَى مَا يَكُونُ مِنَ الْحَيْضِ فَقَالَ ثَلَاثَةٌ وَ أَكْثَرُهُ عَشَرَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Ahmad Bin Asheym, from Ahmad Bin Muhammad Bin Abu Nasr who said, \n‘I asked Abu Al-Hassan<sup>asws</sup> about the minimum of what happens to be from the menstruation (<span class=\"iTxt\">Haydh</span>). So he<sup>asws</sup> said: ‘Three (days), and the most of it is ten (days)’."}]}, {"index": 4130, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:3:2:2:2", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَقَلُّ مَا يَكُونُ الْحَيْضُ ثَلَاثَةُ أَيَّامٍ وَ أَكْثَرُ مَا يَكُونُ عَشَرَةُ أَيَّامٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, and Ali Bin Ibrahim, from his father, altogether from Ibn Abu Umeyr, from Muawiya Bin Ammar, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The least of what the menstruation (<span class=\"iTxt\">Haydh</span>) happens is for three days, and the most of what it can happen to be for is ten days’."}]}, {"index": 4131, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:3:2:2:3", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ أَدْنَى مَا يَكُونُ مِنَ الْحَيْضِ فَقَالَ أَدْنَاهُ ثَلَاثَةٌ وَ أَبْعَدُهُ عَشَرَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazl Bin Shazaan and Ali Bin Ibrahim, from his father, altogether from Safwan Bin Yahya who said, \n‘I asked Abu Al-Hassan<sup>asws</sup> about the least of what the menstruation (<span class=\"iTxt\">Haydh</span>) can happen to be. So he<sup>asws</sup> said: ‘The least is for three days, and the furthest (it can go to) is ten (days)’."}]}, {"index": 4132, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:3:2:2:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَا يَكُونُ الْقُرْءُ فِي أَقَلَّ مِنْ عَشَرَةِ أَيَّامٍ فَمَا زَادَ أَقَلُّ مَا يَكُونُ عَشَرَةٌ مِنْ حِينِ تَطْهُرُ إِلَى أَنْ تَرَى الدَّمَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Safwan, from Al A’ala, from Muhammad Bin Muslim, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The pure period (menstruation (<span class=\"iTxt\">Haydh</span>)-free) cannot happen to be less than ten days. That is the time from the end of one period of Haydh (menses) to the beginning of the second one’."}]}, {"index": 4133, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:3:2:2:5", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ رِجَالِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أَدْنَى الطُّهْرِ عَشَرَةُ أَيَّامٍ وَ ذَلِكَ أَنَّ الْمَرْأَةَ أَوَّلَ مَا تَحِيضُ رُبَّمَا كَانَتْ كَثِيرَةَ الدَّمِ فَيَكُونُ حَيْضُهَا عَشَرَةَ أَيَّامٍ فَلَا تَزَالُ كُلَّمَا كَبِرَتْ نَقَصَتْ حَتَّى تَرْجِعَ إِلَى ثَلَاثَةِ أَيَّامٍ فَإِذَا رَجَعَتْ إِلَى ثَلَاثَةِ أَيَّامٍ ارْتَفَعَ حَيْضُهَا وَ لَا يَكُونُ أَقَلَّ مِنْ ثَلَاثَةِ أَيَّامٍ \nفَإِذَا رَأَتِ الْمَرْأَةُ الدَّمَ فِي أَيَّامِ حَيْضِهَا تَرَكَتِ الصَّلَاةَ فَإِنِ اسْتَمَرَّ بِهَا الدَّمُ ثَلَاثَةَ أَيَّامٍ فَهِيَ حَائِضٌ وَ إِنِ انْقَطَعَ الدَّمُ بَعْدَ مَا رَأَتْهُ يَوْماً أَوْ يَوْمَيْنِ اغْتَسَلَتْ وَ صَلَّتْ وَ انْتَظَرَتْ مِنْ يَوْمَ رَأَتِ الدَّمَ إِلَى عَشَرَةِ أَيَّامٍ فَإِنْ رَأَتْ فِي تِلْكَ الْعَشَرَةِ أَيَّامٍ مِنْ يَوْمَ رَأَتِ الدَّمَ يَوْماً أَوْ يَوْمَيْنِ حَتَّى يَتِمَّ لَهَا ثَلَاثَةُ أَيَّامٍ فَذَلِكَ الَّذِي رَأَتْهُ فِي أَوَّلِ الْأَمْرِ مَعَ هَذَا الَّذِي رَأَتْهُ بَعْدَ ذَلِكَ فِي الْعَشَرَةِ فَهُوَ مِنَ الْحَيْضِ \nوَ إِنْ مَرَّ بِهَا مِنْ يَوْمَ رَأَتِ الدَّمَ عَشَرَةُ أَيَّامٍ وَ لَمْ تَرَ الدَّمَ فَذَلِكَ الْيَوْمُ وَ الْيَوْمَانِ الَّذِي رَأَتْهُ لَمْ يَكُنْ مِنَ الْحَيْضِ إِنَّمَا كَانَ مِنْ عِلَّةٍ إِمَّا مِنْ قَرْحَةٍ فِي جَوْفِهَا وَ إِمَّا مِنَ الْجَوْفِ فَعَلَيْهَا أَنْ تُعِيدَ الصَّلَاةَ تِلْكَ الْيَوْمَيْنِ الَّتِي تَرَكَتْهَا لِأَنَّهَا لَمْ تَكُنْ حَائِضاً فَيَجِبُ أَنْ تَقْضِيَ مَا تَرَكَتْ مِنَ الصَّلَاةِ فِي الْيَوْمِ وَ الْيَوْمَيْنِ\nوَ إِنْ تَمَّ لَهَا ثَلَاثَةُ أَيَّامٍ فَهُوَ مِنَ الْحَيْضِ وَ هُوَ أَدْنَى الْحَيْضِ وَ لَمْ يَجِبْ عَلَيْهَا الْقَضَاءُ وَ لَا يَكُونُ الطُّهْرُ أَقَلَّ مِنْ عَشَرَةِ أَيَّامٍ فَإِذَا حَاضَتِ الْمَرْأَةُ وَ كَانَ حَيْضُهَا خَمْسَةَ أَيَّامٍ ثُمَّ انْقَطَعَ الدَّمُ اغْتَسَلَتْ وَ صَلَّتْ فَإِنْ رَأَتْ بَعْدَ ذَلِكَ الدَّمَ وَ لَمْ يَتِمَّ لَهَا مِنْ يَوْمَ طَهُرَتْ عَشَرَةُ أَيَّامٍ فَذَلِكَ مِنَ الْحَيْضِ تَدَعُ الصَّلَاةَ \nوَ إِنْ رَأَتِ الدَّمَ مِنْ أَوَّلِ مَا رَأَتِ الثَّانِيَ الَّذِي رَأَتْهُ تَمَامَ الْعَشَرَةِ أَيَّامٍ وَ دَامَ عَلَيْهَا عَدَّتْ مِنْ أَوَّلِ مَا رَأَتِ الدَّمَ الْأَوَّلَ وَ الثَّانِيَ عَشَرَةَ أَيَّامٍ ثُمَّ هِيَ مُسْتَحَاضَةٌ تَعْمَلُ مَا تَعْمَلُهُ الْمُسْتَحَاضَةُ \nوَ قَالَ كُلُّ مَا رَأَتِ الْمَرْأَةُ فِي أَيَّامِ حَيْضِهَا مِنْ صُفْرَةٍ أَوْ حُمْرَةٍ فَهُوَ مِنَ الْحَيْضِ وَ كُلُّ مَا رَأَتْهُ بَعْدَ أَيَّامِ حَيْضِهَا فَلَيْسَ مِنَ الْحَيْضِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of his men, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The least of the pure (period) would be of ten days, and that is because the woman, at the beginning the menstruation (<span class=\"iTxt\">Haydh</span>) could be a lot of blood, so her menstruation (<span class=\"iTxt\">Haydh</span>) would come to be for ten days. So it would not cease as she gets older, it would keep reducing until it returns to being for three days. So when she returns to the three days (of menstruation (<span class=\"iTxt\">Haydh</span>)), her menstruation (<span class=\"iTxt\">Haydh</span>) would be Raised (she would enter menopause), and it would not happen to be for less than three days.\nSo when the woman sees the blood during the days of her menstruation (<span class=\"iTxt\">Haydh</span>), she should leave the <span class=\"iTxt\">Salaat</span>. So if the blood continues with her for three days, so she is menstruating, and if the blood gets cut off after having seen it for a day or two days, she should wash and pray <span class=\"iTxt\">Salaat</span>, and she should wait from the day she saw the blood, for up to ten days. So if she were to see the blood during these ten days, from the day she first saw the blood, by a day or two days until it completes the three days for her, so that which she had seen during the beginning of the matter, along with this which sees after that during the ten (days), so it is from the menstruation (<span class=\"iTxt\">Haydh</span>). \nAnd if there pass ten days for her from the days she first saw the blood, and she does not see the blood (anymore), so that day and the two days (after that) which she sees it would not happen to be from the menstruation (<span class=\"iTxt\">Haydh</span>). But rather, it would be from an illness, either from an ulcer in her inside or from the internal (problems). Thus, upon her would be that she repeats the <span class=\"iTxt\">Salaat</span> for those two days which she had neglected, because it did not happen to be a menstruation (<span class=\"iTxt\">Haydh</span>), and it would Obligate upon her that she makes up what she neglected from the <span class=\"iTxt\">Salaat</span> during the day and the two days. \nAnd if the three days are completed for her, so it is from the menstruation (<span class=\"iTxt\">Haydh</span>), and it is the least of the menstruation (<span class=\"iTxt\">Haydh</span>) and would not Obligate the making up (of the <span class=\"iTxt\">Salaat</span>) upon her; and the purity would not happen to be for less than ten days. So when the woman menstruates, and her menstruation (<span class=\"iTxt\">Haydh</span>) is for five days, then the blood gets cut off, she should wash and pray <span class=\"iTxt\">Salaat</span>. So if she were to see the blood after that and ten days are not completed from her from the day when she first saw the blood, so that is from the menstruation (<span class=\"iTxt\">Haydh</span>). She should leave the <span class=\"iTxt\">Salaat</span>.\nAnd if she sees the blood secondly after what she saw for the first complete ten days, and it is upon her for a number (of days), then it is inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>). She would do what the one with the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) does’.\nAnd he<sup>asws</sup> said: ‘Everything what the woman sees during the days of her menstruation (<span class=\"iTxt\">Haydh</span>), from yellowness or redness, so it is from the menstruation (<span class=\"iTxt\">Haydh</span>), and everything what she sees after the days of the her menstruation (<span class=\"iTxt\">Haydh</span>), so it is not from the menstruation (<span class=\"iTxt\">Haydh</span>)’."}]}]}, "index": "al-kafi:3:2:2", "kind": "verse_list"}