{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:3:2:7",
        "titles": {
          "ar": "باب غُسْلِ الْحَائِضِ وَ مَا يُجْزِئُهَا مِنَ الْمَاءِ",
          "en": "Chapter 7 – The washing of the menstruating woman, and what would suffice her from the water"
        }
      }
    ],
    "index": 554,
    "local_index": 7,
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:2:7",
    "titles": {
      "ar": "باب غُسْلِ الْحَائِضِ وَ مَا يُجْزِئُهَا مِنَ الْمَاءِ",
      "en": "Chapter 7 – The washing of the menstruating woman, and what would suffice her from the water"
    },
    "verse_count": 5,
    "verse_start_index": 4150,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/214)"
        ],
        "index": 4151,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:7:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ جَمِيعاً عَنْ عَبْدِ اللَّهِ بْنِ يَحْيَى الْكَاهِلِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ النِّسَاءَ الْيَوْمَ أَحْدَثْنَ مَشْطاً تَعْمِدُ إِحْدَاهُنَّ إِلَى الْقَرَامِلِ مِنَ الصُّوفِ تَفْعَلُهُ الْمَاشِطَةُ تَصْنَعُهُ مَعَ الشَّعْرِ ثُمَّ تَحْشُوهُ بِالرَّيَاحِينِ ثُمَّ تَجْعَلُ عَلَيْهِ خِرْقَةً رَقِيقَةً ثُمَّ تَخِيطُهُ بِمِسَلَّةٍ ثُمَّ تَجْعَلُهُ فِي رَأْسِهَا ثُمَّ تُصِيبُهَا الْجَنَابَةُ فَقَالَ كَانَ النِّسَاءُ الْأُوَلُ إِنَّمَا يَمْتَشِطْنَ الْمَقَادِيمَ فَإِذَا أَصَابَهُنَّ الْغُسْلُ بِقَذَرٍ مُرْهَا أَنْ تُرَوِّيَ رَأْسَهَا مِنَ الْمَاءِ وَ تَعْصِرَهُ حَتَّى يَرْوَى فَإِذَا رَوِيَ فَلَا بَأْسَ عَلَيْهَا ",
          "قَالَ قُلْتُ فَالْحَائِضُ قَالَ تَنْقُضُ الْمَشْطَ نَقْضاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, and Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, altogether from Abdullah Bin Yahya Al Kahily who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The women today are innovating combings (of the hair). One of them deliberates to the braid of wool, combing it by plaiting with the hair. Then she applies it with the perfume, then make a thin cloth to be upon it. Then she ties it with a pin upon her head. Then she is hit by the sexual impurity’. So he<sup>asws</sup> said: ‘The former women, rather, were combing their front hair. So when she has to wash (from the sexual impurity), instruct her that she would soak her head from the water, and squeeze them until they are soaked. So when (her hair) is soaked, then there is no problem upon her’. ",
            "He (the narrator) said, ‘I said, ‘So (what about) the menstruating woman?’ He<sup>asws</sup> said: ‘She should undo for the combing, with an undoing’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam and Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr all from ‘Abd Allah ibn Yahya al-Kahiliy who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that today women have found a certain manner of hair dressing. One of them can find a certain device made of wool which a hair dresser uses along with certain fragrance, then places in a thin piece of fabric, then ties it up with a pin and places it over her head and then she may experience sexual relation. He (the Imam), ‘Alayhi al-Salam, said, ‘Women of earlier times would only decorate their hairs at the front of their head. If they may need to take Ghusl (bath), instruct them to allow water to reach their head and wring the decorated hair so water reaches it; when water reaches it then it is not harmful. 5 I then asked about Hayd (menses) and he (the Imam) said, ‘Women experiencing Hayd (menses) must reduce it (such decoration of hairs) a great deal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/215)"
        ],
        "index": 4152,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:7:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ مُثَنًّى الْحَنَّاطِ عَنْ حَسَنٍ الصَّيْقَلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الطَّامِثُ تَغْتَسِلُ بِتِسْعَةِ أَرْطَالٍ مِنْ مَاءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Abu Nasr, from Musna Al Hannat, from Hassan Al Sayqal, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The menstruating woman should wash with (at least) nine Ratls of water (one Ratl = 450 gms. Approx.)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn abu Nasr from Muthanna’ al-Hannat from Hasan al-Sayqal who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A woman for her Ghusl (bath) due to Hayd (menses) must use nine Artal of water.” (One Ritl is about 449.28gms). "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/215)"
        ],
        "index": 4153,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:7:3",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ وَ غَيْرُهُ عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ أَبِي عُبَيْدَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْمَرْأَةِ الْحَائِضِ تَرَى الطُّهْرَ وَ هِيَ فِي السَّفَرِ وَ لَيْسَ مَعَهَا مِنَ الْمَاءِ مَا يَكْفِيهَا لِغُسْلِهَا وَ قَدْ حَضَرَتِ الصَّلَاةُ قَالَ إِذَا كَانَ مَعَهَا بِقَدْرِ مَا تَغْسِلُ بِهِ فَرْجَهَا فَتَغْسِلُهُ ثُمَّ تَتَيَمَّمُ وَ تُصَلِّي قُلْتُ فَيَأْتِيهَا زَوْجُهَا فِي تِلْكَ الْحَالِ قَالَ نَعَمْ إِذَا غَسَلَتْ فَرْجَهَا وَ تَيَمَّمَتْ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, and someone else, from Sahl Bin Ziyad, from Ibn Mahboub, from Ibn Raib, from Abu Ubeyda who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the menstruating woman seeking the purity, and she is during the journey, and there is no water with her. What would suffice her for her washing, and the <span class=\"iTxt\">Salaat</span> has presented itself?’ He<sup>asws</sup> said: ‘When it was such that there was water with her of a measure with which she can wash her private part, so she should wash it. Then she would perform Tayammum and pray <span class=\"iTxt\">Salaat</span>’. I said, ‘So can her husband come to her during that state?’ He<sup>asws</sup> said: ‘Yes. When she has washed her private part and performed Tayammum, so there is no problem’."
          ],
          "en.sarwar": [
            "3. Ali ibn Muhammad and others have narrated from Sahl ibn Ziyad from ibn Mahbub from ibn Ri’ab from abu ‘Ubaydah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who after Hayd (menses) experiences a Hayd-free condition during a journey and cannot find water enough for Ghusl (bath) when it is time for Salah (prayer). He (the Imam) said, ‘If she has enough water to wash clean her private parts, she must do so and take Tayammum instead of Ghusl (bath); then perform Salah (prayer). 5 I then asked, ‘What happens if her husband comes? 5 He (the Imam) said, ‘After her washing clean her private parts and Tayammum it is not harmful.  "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/215)"
        ],
        "index": 4154,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:7:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أَيُّوبَ الْخَزَّازِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ الْحَائِضُ مَا بَلَغَ بَلَلُ الْمَاءِ مِنْ شَعْرِهَا أَجْزَأَهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahbooub, from Abu Ayoub Al Khazzaz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The menstruating woman, whatever moisture of the water reaches from her hair, would suffice her’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from abu Ayyub al-Khazzaz from Muhammad ibn Muslim who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘For Ghusl (bath) because of Hayd (menses) if wetness and moisture reaches (the skin) from hairs it is sufficient.  "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/215)"
        ],
        "index": 4155,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:7:5",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الْحَائِضِ تَغْتَسِلُ وَ عَلَى جَسَدِهَا الزَّعْفَرَانُ لَمْ يَذْهَبْ بِهِ الْمَاءُ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan Bin Ali, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Bin Musa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the menstruating woman washing herself and upon her body is saffron, not going away with the water’. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "5. Abu Ali al-Ash’ariy has narrated from Muhammad ibn Ahmad from Ahmad ibn al-Hassan ibn Ali from ‘Amr ibn Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar ibn Musa who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, about a woman who takes Ghusl (bath) because of Hayd (menses) and there is saffron on her body which is not removed with Ghusl (bath), has said, ‘It is not harmful.  "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:2:7",
  "kind": "verse_list"
}