{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 3"
        },
        "path": "/books/al-kafi:3",
        "titles": {
          "ar": "الجزء الثالث‏",
          "en": "Volume Three"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:3:2:9",
        "titles": {
          "ar": "باب جَامِعٌ فِي الْحَائِضِ وَ الْمُسْتَحَاضَةِ",
          "en": "Chapter 9 – The comprehensive regarding the menstruation (Haydh) and the inter-period bleeding (Istihaaza)"
        }
      }
    ],
    "index": 556,
    "local_index": 9,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:3:2:10",
        "titles": {
          "ar": "باب مَعْرِفَةِ دَمِ الْحَيْضِ مِنْ دَمِ الِاسْتِحَاضَةِ",
          "en": "Chapter 10 – Recognition of the menstruation (Haydh) blood from the inter-period bleeding (Istihaaza)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:3:2:8",
        "titles": {
          "ar": "باب الْمَرْأَةِ تَرَى الدَّمَ وَ هِيَ جُنُبٌ",
          "en": "Chapter 8 – The woman sees the blood and she is with sexual impurity"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 2"
        },
        "path": "/books/al-kafi:3:2",
        "titles": {
          "ar": "كِتَابُ الْحَيْضِ",
          "en": "THE BOOK OF MENSTRUATION (HAYDH)"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:3:2:9",
    "titles": {
      "ar": "باب جَامِعٌ فِي الْحَائِضِ وَ الْمُسْتَحَاضَةِ",
      "en": "Chapter 9 – The comprehensive regarding the menstruation (Haydh) and the inter-period bleeding (Istihaaza)"
    },
    "verse_count": 7,
    "verse_start_index": 4158,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/217)"
        ],
        "index": 4159,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/107",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/151",
              "text": "يُونُسَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2425",
              "text": "غَيْرِ وَاحِدٍ سَأَلُوا أَبَا عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2426",
              "text": "الْحَائِضِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2427",
              "text": "السُّنَّةِ"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ غَيْرِ وَاحِدٍ سَأَلُوا أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْحَائِضِ وَ السُّنَّةِ فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:9:1",
        "text": [
          " وَقْتِهِ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) سَنَّ فِي الْحَائِضِ ثَلَاثَ سُنَنٍ بَيَّنَ فِيهَا كُلَّ مُشْكِلٍ لِمَنْ سَمِعَهَا وَ فَهِمَهَا حَتَّى لَا يَدَعَ لِأَحَدٍ مَقَالًا فِيهِ بِالرَّأْيِ ",
          "أَمَّا إِحْدَى السُّنَنِ فَالْحَائِضُ الَّتِي لَهَا أَيَّامٌ مَعْلُومَةٌ قَدْ أَحْصَتْهَا بِلَا اخْتِلَاطٍ عَلَيْهَا ثُمَّ اسْتَحَاضَتْ وَ اسْتَمَرَّ بِهَا الدَّمُ وَ هِيَ فِي ذَلِكَ تَعْرِفُ أَيَّامَهَا وَ مَبْلَغَ عَدَدِهَا فَإِنَّ امْرَأَةً يُقَالُ لَهَا فَاطِمَةُ بِنْتُ أَبِي حُبَيْشٍ اسْتَحَاضَتْ فَاسْتَمَرَّ بِهَا الدَّمُ فَأَتَتْ أُمَّ سَلَمَةَ فَسَأَلَتْ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) عَنْ ذَلِكَ فَقَالَ تَدَعُ الصَّلَاةَ قَدْرَ أَقْرَائِهَا أَوْ قَدْرَ حَيْضِهَا وَ قَالَ إِنَّمَا هُوَ عِرْقٌ وَ أَمَرَهَا أَنْ تَغْتَسِلَ وَ تَسْتَثْفِرَ بِثَوْبٍ وَ تُصَلِّيَ",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذِهِ سُنَّةُ النَّبِيِّ ( صلى الله عليه وآله ) فِي الَّتِي تَعْرِفُ أَيَّامَ أَقْرَائِهَا لَمْ تَخْتَلِطْ عَلَيْهَا أَ لَا تَرَى أَنَّهُ لَمْ يَسْأَلْهَا كَمْ يَوْمٍ هِيَ وَ لَمْ يَقُلْ إِذَا زَادَتْ عَلَى كَذَا يَوْماً فَأَنْتِ مُسْتَحَاضَةٌ وَ إِنَّمَا سَنَّ لَهَا أَيَّاماً مَعْلُومَةً مَا كَانَتْ مِنْ قَلِيلٍ أَوْ كَثِيرٍ بَعْدَ أَنْ تَعْرِفَهَا",
          "وَ كَذَلِكَ أَفْتَى أَبِي ( عليه السلام ) وَ سُئِلَ عَنِ الْمُسْتَحَاضَةِ فَقَالَ إِنَّمَا ذَلِكَ عِرْقٌ غَابِرٌ أَوْ رَكْضَةٌ مِنَ الشَّيْطَانِ فَلْتَدَعِ الصَّلَاةَ أَيَّامَ أَقْرَائِهَا ثُمَّ تَغْتَسِلُ وَ تَتَوَضَّأُ لِكُلِّ صَلَاةٍ قِيلَ وَ إِنْ سَالَ قَالَ وَ إِنْ سَالَ مِثْلَ الْمَثْعَبِ",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَذَا تَفْسِيرُ حَدِيثِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ هُوَ مُوَافِقٌ لَهُ فَهَذِهِ سُنَّةُ الَّتِي تَعْرِفُ أَيَّامَ أَقْرَائِهَا لَا وَقْتَ لَهَا إِلَّا أَيَّامَهَا قَلَّتْ أَوْ كَثُرَتْ",
          "وَ أَمَّا سُنَّةُ الَّتِي قَدْ كَانَتْ لَهَا أَيَّامٌ مُتَقَدِّمَةٌ ثُمَّ اخْتَلَطَ عَلَيْهَا مِنْ طُولِ الدَّمِ فَزَادَتْ وَ نَقَصَتْ حَتَّى أَغْفَلَتْ عَدَدَهَا وَ مَوْضِعَهَا مِنَ الشَّهْرِ فَإِنَّ سُنَّتَهَا غَيْرُ ذَلِكَ وَ ذَلِكَ أَنَّ فَاطِمَةَ بِنْتَ أَبِي حُبَيْشٍ أَتَتِ النَّبِيَّ ( صلى الله عليه وآله ) فَقَالَتْ إِنِّي أُسْتَحَاضُ فَلَا أَطْهُرُ فَقَالَ النَّبِيُّ ( عليه السلام ) لَيْسَ ذَلِكِ بِحَيْضٍ إِنَّمَا هُوَ عِرْقٌ فَإِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَ إِذَا أَدْبَرَتْ فَاغْسِلِي عَنْكِ الدَّمَ وَ صَلِّي وَ كَانَتْ تَغْتَسِلُ فِي كُلِّ صَلَاةٍ وَ كَانَتْ تَجْلِسُ فِي مِرْكَنٍ لِأُخْتِهَا وَ كَانَتْ صُفْرَةُ الدَّمِ تَعْلُو الْمَاءَ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَ مَا تَسْمَعُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَمَرَ هَذِهِ بِغَيْرِ مَا أَمَرَ بِهِ تِلْكَ أَ لَا تَرَاهُ لَمْ يَقُلْ لَهَا دَعِي الصَّلَاةَ أَيَّامَ أَقْرَائِكِ وَ لَكِنْ قَالَ لَهَا إِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَ إِذَا أَدْبَرَتْ فَاغْتَسِلِي وَ صَلِّي فَهَذَا يُبَيِّنُ أَنَّ هَذِهِ امْرَأَةٌ قَدِ اخْتَلَطَ عَلَيْهَا أَيَّامُهَا لَمْ تَعْرِفْ عَدَدَهَا وَ لَا وَقْتَهَا أَ لَا تَسْمَعُهَا تَقُولُ إِنِّي أُسْتَحَاضُ فَلَا أَطْهُرُ ",
          "وَ كَانَ أَبِي يَقُولُ إِنَّهَا اسْتُحِيضَتْ سَبْعَ سِنِينَ فَفِي أَقَلَّ مِنْ هَذَا تَكُونُ الرِّيبَةُ وَ الِاخْتِلَاطُ فَلِهَذَا احْتَاجَتْ إِلَى أَنْ تَعْرِفَ إِقْبَالَ الدَّمِ مِنْ إِدْبَارِهِ وَ تَغَيُّرَ لَوْنِهِ مِنَ السَّوَادِ إِلَى غَيْرِهِ وَ ذَلِكَ أَنَّ دَمَ الْحَيْضِ أَسْوَدُ يُعْرَفُ وَ لَوْ كَانَتْ تَعْرِفُ أَيَّامَهَا مَا احْتَاجَتْ إِلَى مَعْرِفَةِ لَوْنِ الدَّمِ لِأَنَّ السُّنَّةَ فِي الْحَيْضِ أَنْ تَكُونَ الصُّفْرَةُ وَ الْكُدْرَةُ فَمَا فَوْقَهَا فِي أَيَّامِ الْحَيْضِ إِذَا عُرِفَتْ حَيْضاً كُلُّهُ إِنْ كَانَ الدَّمُ أَسْوَدَ أَوْ غَيْرَ ذَلِكَ ",
          "فَهَذَا يُبَيِّنُ لَكَ أَنَّ قَلِيلَ الدَّمِ وَ كَثِيرَهُ أَيَّامَ الْحَيْضِ حَيْضٌ كُلَّهُ إِذَا كَانَتِ الْأَيَّامُ مَعْلُومَةً فَإِذَا جَهِلَتِ الْأَيَّامَ وَ عَدَدَهَا احْتَاجَتْ إِلَى النَّظَرِ حِينَئِذٍ إِلَى إِقْبَالِ الدَّمِ وَ إِدْبَارِهِ وَ تَغَيُّرِ لَوْنِهِ ثُمَّ تَدَعُ الصَّلَاةَ عَلَى قَدْرِ ذَلِكَ وَ لَا أَرَى النَّبِيَّ ( صلى الله عليه وآله ) قَالَ اجْلِسِي كَذَا وَ كَذَا يَوْماً فَمَا زَادَتْ فَأَنْتِ مُسْتَحَاضَةٌ كَمَا لَمْ تُؤْمَرِ الْأُولَى بِذَلِكَ",
          "وَ كَذَلِكَ أَبِي ( عليه السلام ) أَفْتَى فِي مِثْلِ هَذَا وَ ذَاكَ أَنَّ امْرَأَةً مِنْ أَهْلِنَا اسْتَحَاضَتْ فَسَأَلَتْ أَبِي ( عليه السلام ) عَنْ ذَلِكَ فَقَالَ إِذَا رَأَيْتِ الدَّمَ الْبَحْرَانِيَّ فَدَعِي الصَّلَاةَ وَ إِذَا رَأَيْتِ الطُّهْرَ وَ لَوْ سَاعَةً مِنْ نَهَارٍ فَاغْتَسِلِي وَ صَلِّي",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ أَرَى جَوَابَ أَبِي ( عليه السلام ) هَاهُنَا غَيْرَ جَوَابِهِ فِي الْمُسْتَحَاضَةِ الْأُولَى أَ لَا تَرَى أَنَّهُ قَالَ تَدَعُ الصَّلَاةَ أَيَّامَ أَقْرَائِهَا لِأَنَّهُ نَظَرَ إِلَى عَدَدِ الْأَيَّامِ وَ قَالَ هَاهُنَا إِذَا رَأَتِ الدَّمَ الْبَحْرَانِيَّ فَلْتَدَعِ الصَّلَاةَ وَ أَمَرَ هَاهُنَا أَنْ تَنْظُرَ إِلَى الدَّمِ إِذَا أَقْبَلَ وَ أَدْبَرَ وَ تَغَيَّرَ",
          "وَ قَوْلُهُ الْبَحْرَانِيَّ شِبْهُ مَعْنَى قَوْلِ النَّبِيِّ ( صلى الله عليه وآله ) إِنَّ دَمَ الْحَيْضِ أَسْوَدُ يُعْرَفُ وَ إِنَّمَا سَمَّاهُ أَبِي بَحْرَانِيّاً لِكَثْرَتِهِ وَ لَوْنِهِ فَهَذَا سُنَّةُ النَّبِيِّ ( صلى الله عليه وآله ) فِي الَّتِي اخْتَلَطَ عَلَيْهَا أَيَّامُهَا حَتَّى لَا تَعْرِفَهَا وَ إِنَّمَا تَعْرِفُهَا بِالدَّمِ مَا كَانَ مِنْ قَلِيلِ الْأَيَّامِ وَ كَثِيرِهِ ",
          "قَالَ وَ أَمَّا السُّنَّةُ الثَّالِثَةُ فَهِيَ الَّتِي لَيْسَ لَهَا أَيَّامٌ مُتَقَدِّمَةٌ وَ لَمْ تَرَ الدَّمَ قَطُّ وَ رَأَتْ أَوَّلَ مَا أَدْرَكَتْ وَ اسْتَمَرَّ بِهَا فَإِنَّ سُنَّةَ هَذِهِ غَيْرُ سُنَّةِ الْأُولَى وَ الثَّانِيَةِ وَ ذَلِكَ أَنَّ امْرَأَةً يُقَالُ لَهَا حَمْنَةُ بِنْتُ جَحْشٍ أَتَتْ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَتْ إِنِّي اسْتُحِضْتُ حَيْضَةً شَدِيدَةً فَقَالَ لَهَا احْتَشِي كُرْسُفاً فَقَالَتْ إِنَّهُ أَشَدُّ مِنْ ذَلِكَ إِنِّي أَثُجُّهُ ثَجّاً فَقَالَ تَلَجَّمِي وَ تَحَيَّضِي فِي كُلِّ شَهْرٍ فِي عِلْمِ اللَّهِ سِتَّةَ أَيَّامٍ أَوْ سَبْعَةً ثُمَّ اغْتَسِلِي غُسْلًا وَ صُومِي ثَلَاثَةً وَ عِشْرِينَ يَوْماً أَوْ أَرْبَعَةً وَ عِشْرِينَ وَ اغْتَسِلِي لِلْفَجْرِ غُسْلًا وَ أَخِّرِي الظُّهْرَ وَ عَجِّلِي الْعَصْرَ وَ اغْتَسِلِي غُسْلًا وَ أَخِّرِي الْمَغْرِبَ وَ عَجِّلِي الْعِشَاءَ وَ اغْتَسِلِي غُسْلًا ",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) فَأَرَاهُ قَدْ سَنَّ فِي هَذِهِ غَيْرَ مَا سَنَّ فِي الْأُولَى وَ الثَّانِيَةِ وَ ذَلِكَ لِأَنَّ أَمْرَهَا مُخَالِفٌ لِأَمْرِ هَاتَيْكَ أَ لَا تَرَى أَنَّ أَيَّامَهَا لَوْ كَانَتْ أَقَلَّ مِنْ سَبْعٍ وَ كَانَتْ خَمْساً أَوْ أَقَلَّ مِنْ ذَلِكَ مَا قَالَ لَهَا تَحَيَّضِي سَبْعاً فَيَكُونَ قَدْ أَمَرَهَا بِتَرْكِ الصَّلَاةِ أَيَّاماً وَ هِيَ مُسْتَحَاضَةٌ غَيْرُ حَائِضٍ وَ كَذَلِكَ لَوْ كَانَ حَيْضُهَا أَكْثَرَ مِنْ سَبْعٍ وَ كَانَتْ أَيَّامُهَا عَشْراً أَوْ أَكْثَرَ لَمْ يَأْمُرْهَا بِالصَّلَاةِ وَ هِيَ حَائِضٌ ",
          "ثُمَّ مِمَّا يَزِيدُ هَذَا بَيَاناً قَوْلُهُ ( عليه السلام ) لَهَا تَحَيَّضِي وَ لَيْسَ يَكُونُ التَّحَيُّضُ إِلَّا لِلْمَرْأَةِ الَّتِي تُرِيدُ أَنْ تُكَلَّفَ مَا تَعْمَلُ الْحَائِضُ أَ لَا تَرَاهُ لَمْ يَقُلْ لَهَا أَيَّاماً مَعْلُومَةً تَحَيَّضِي أَيَّامَ حَيْضِكِ وَ مِمَّا يُبَيِّنُ هَذَا قَوْلُهُ لَهَا فِي عِلْمِ اللَّهِ لِأَنَّهُ قَدْ كَانَ لَهَا وَ إِنْ كَانَتِ الْأَشْيَاءُ كُلُّهَا فِي عِلْمِ اللَّهِ تَعَالَى",
          "وَ هَذَا بَيِّنٌ وَاضِحٌ أَنَّ هَذِهِ لَمْ تَكُنْ لَهَا أَيَّامٌ قَبْلَ ذَلِكَ قَطُّ وَ هَذِهِ سُنَّةُ الَّتِي اسْتَمَرَّ بِهَا الدَّمُ أَوَّلَ مَا تَرَاهُ أَقْصَى وَقْتِهَا سَبْعٌ وَ أَقْصَى طُهْرِهَا ثَلَاثٌ وَ عِشْرُونَ حَتَّى يَصِيرَ لَهَا أَيَّاماً مَعْلُومَةً فَتَنْتَقِلَ إِلَيْهَا",
          "فَجَمِيعُ حَالَاتِ الْمُسْتَحَاضَةِ تَدُورُ عَلَى هَذِهِ السُّنَنِ الثَّلَاثَةِ لَا تَكَادُ أَبَداً تَخْلُو مِنْ وَاحِدَةٍ مِنْهُنَّ إِنْ كَانَتْ لَهَا أَيَّامٌ مَعْلُومَةٌ مِنْ قَلِيلٍ أَوْ كَثِيرٍ فَهِيَ عَلَى أَيَّامِهَا وَ خَلْقِهَا الَّذِي جَرَتْ عَلَيْهِ لَيْسَ فِيهِ عَدَدٌ مَعْلُومٌ مُوَقَّتٌ غَيْرُ أَيَّامِهَا فَإِنِ اخْتَلَطَتِ الْأَيَّامُ عَلَيْهَا وَ تَقَدَّمَتْ وَ تَأَخَّرَتْ وَ تَغَيَّرَ عَلَيْهَا الدَّمُ أَلْوَاناً فَسُنَّتُهَا إِقْبَالُ الدَّمِ وَ إِدْبَارُهُ وَ تَغَيُّرُ حَالَاتِهِ ",
          "وَ إِنْ لَمْ تَكُنْ لَهَا أَيَّامٌ قَبْلَ ذَلِكَ وَ اسْتَحَاضَتْ أَوَّلَ مَا رَأَتْ فَوَقْتُهَا سَبْعٌ وَ طُهْرُهَا ثَلَاثٌ وَ عِشْرُونَ فَإِنِ اسْتَمَرَّ بِهَا الدَّمُ أَشْهُراً فَعَلَتْ فِي كُلِّ شَهْرٍ كَمَا قَالَ لَهَا فَإِنِ انْقَطَعَ الدَّمُ فِي أَقَلَّ مِنْ سَبْعٍ أَوْ أَكْثَرَ مِنْ سَبْعٍ فَإِنَّهَا تَغْتَسِلُ سَاعَةً تَرَى الطُّهْرَ وَ تُصَلِّي",
          "فَلَا تَزَالُ كَذَلِكَ حَتَّى تَنْظُرَ مَا يَكُونُ فِي الشَّهْرِ الثَّانِي فَإِنِ انْقَطَعَ الدَّمُ لِوَقْتِهِ فِي الشَّهْرِ الْأَوَّلِ سَوَاءً حَتَّى تَوَالَى عَلَيْهَا حَيْضَتَانِ أَوْ ثَلَاثٌ فَقَدْ عُلِمَ الْآنَ أَنَّ ذَلِكَ قَدْ صَارَ لَهَا وَقْتاً وَ خَلْقاً مَعْرُوفاً تَعْمَلُ عَلَيْهِ وَ تَدَعُ مَا سِوَاهُ وَ تَكُونُ سُنَّتَهَا فِيمَا تَسْتَقْبِلُ إِنِ اسْتَحَاضَتْ قَدْ صَارَتْ سُنَّةً إِلَى أَنْ تُحْبَسَ أَقْرَاؤُهَا",
          "وَ إِنَّمَا جُعِلَ الْوَقْتُ أَنْ تَوَالَى عَلَيْهَا حَيْضَتَانِ أَوْ ثَلَاثٌ لِقَوْلِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) لِلَّتِي تَعْرِفُ أَيَّامَهَا دَعِي الصَّلَاةَ أَيَّامَ أَقْرَائِكِ فَعَلِمْنَا أَنَّهُ لَمْ يَجْعَلِ الْقُرْءَ الْوَاحِدَ سُنَّةً لَهَا فَيَقُولَ دَعِي الصَّلَاةَ أَيَّامَ قُرْئِكِ وَ لَكِنْ سَنَّ لَهَا الْأَقْرَاءَ وَ أَدْنَاهُ حَيْضَتَانِ فَصَاعِداً",
          "وَ إِذَا اخْتَلَطَ عَلَيْهَا أَيَّامُهَا وَ زَادَتْ وَ نَقَصَتْ حَتَّى لَا تَقِفَ مِنْهَا عَلَى حَدٍّ وَ لَا مِنَ الدَّمِ عَلَى لَوْنٍ عَمِلَتْ بِإِقْبَالِ الدَّمِ وَ إِدْبَارِهِ وَ لَيْسَ لَهَا سُنَّةٌ غَيْرُ هَذَا لِقَوْلِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِذَا أَقْبَلَتِ الْحَيْضَةُ فَدَعِي الصَّلَاةَ وَ إِذَا أَدْبَرَتْ فَاغْتَسِلِي وَ لِقَوْلِهِ إِنَّ دَمَ الْحَيْضِ أَسْوَدُ يُعْرَفُ كَقَوْلِ أَبِي ( عليه السلام ) إِذَا رَأَيْتِ الدَّمَ الْبَحْرَانِيَّ ",
          "فَإِنْ لَمْ يَكُنِ الْأَمْرُ كَذَلِكَ وَ لَكِنَّ الدَّمَ أَطْبَقَ عَلَيْهَا فَلَمْ تَزَلِ الِاسْتِحَاضَةُ دَارَّةً وَ كَانَ الدَّمُ عَلَى لَوْنٍ وَاحِدٍ وَ حَالَةٍ وَاحِدَةٍ فَسُنَّتُهَا السَّبْعُ وَ الثَّلَاثُ وَ الْعِشْرُونَ لِأَنَّهَا قِصَّتُهَا كَقِصَّةِ حَمْنَةَ حِينَ قَالَتْ إِنِّي أَثُجُّهُ ثَجّاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from someone else, ",
            "‘They asked Abu Abdullah<sup>asws</sup> about the menstruation (<span class=\"iTxt\">Haydh</span>) and the Sunnah during his<sup>saww</sup> time’. So he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> established three Sunnahs between these for every difficulty, and made these to be understood to the extent that he<sup>saww</sup> did not leave for anyone to speak with regards to it with the opinion.",
            "As for the first of the Sunnahs – so it is for the menstruating woman who has known days for her (menstruation (<span class=\"iTxt\">Haydh</span>) and she has counted these without any mix up. Then she has inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), and the blood passes with her, and she is in that having recognised her days, and her number has reached. A woman called Fatima Bin Abu Hubeysh had inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), and the blood passed with her. So she came over to Umm Salma<sup>as</sup>, and she<sup>as</sup> asked Rasool-Allah<sup>saww</sup> about that. So he<sup>saww</sup> said: ‘She should leave the <span class=\"iTxt\">Salaat</span> either of a measurement of her pure days, or a measurement of her menstruating days’. And he<sup>saww</sup> said: ‘But rather it is a perspiration’, and he<sup>saww</sup> ordered her that she should wash, and stuff with a cloth and pray <span class=\"iTxt\">Salaat</span>’.  ",
            "Abu Abdullah<sup>asws</sup> said: ‘This is a Sunnah of the Prophet<sup>saww</sup> regarding the one who recognises the days of her purity, not getting mixed up over it. Do you not see that he<sup>saww</sup> did not ask her how many days these were and he<sup>saww</sup> did not say: ‘When there is an increase upon such and such number of days so you would be in inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>)? And rather, he<sup>saww</sup> established a Sunnah for her known days of whatever was from less or more after having recognised these. ",
            "And similar to that is the verdict my<sup>asws</sup> father<sup>asws</sup> issued, and he<sup>asws</sup> had been asked about the one with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), so he<sup>asws</sup> said: ‘But rather, that is an old perspiration or a run of Satan<sup>la</sup>, so let her leave the <span class=\"iTxt\">Salaat</span> for the (known number of) days of her purity, then she should wash and perform ablution for every <span class=\"iTxt\">Salaat</span>’. It was said, ‘Supposing it flows?’ He<sup>asws</sup> said: ‘And even if it flows like the siphoned water’. ",
            "Abu Abdullah<sup>asws</sup> said: ‘This is the interpretation of the Hadeeth of Rasool-Allah<sup>saww</sup>, and it is in accordance to it. Thus, this is a Sunnah for the one who recognises the days of her purity, there being no timing for her except of her days, be it less or more.",
            "And as for the Sunnah for the one for whom are preceding days, then they get mixed up upon her from the prolongation of the blood, so it increases and reduces until her numbers get disregarded, as well as its placing from the month. So her Sunnah is other than that, and that is because Fatima Bint Abu Hubeysh came over to the Prophet<sup>saww</sup> and said, ‘I am with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), so I am not clean’. So the Prophet<sup>saww</sup> said: ‘That is not with a menstruation (<span class=\"iTxt\">Haydh</span>). But rather, it is a perspiration. So when the menstruation (<span class=\"iTxt\">Haydh</span>) comes, then leave the <span class=\"iTxt\">Salaat</span>, and when it leaves, so wash the blood from yourself and pray <span class=\"iTxt\">Salaat</span>’. And she used to wash during every <span class=\"iTxt\">Salaat</span>, and she used to sit in a washtub of her sister, and the yellowish blood would emerge in the water. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Did you not hear Rasool-Allah<sup>saww</sup> order this with other than what he<sup>saww</sup> had ordered with that (first) one? Do you not see that he<sup>saww</sup> did not tell her to leave the <span class=\"iTxt\">Salaat</span> for the days of her purity, but said to her: ‘When the menstruation (<span class=\"iTxt\">Haydh</span>) comes, so leave the <span class=\"iTxt\">Salaat</span>, and when it goes, so wash and pray <span class=\"iTxt\">Salaat</span>’. So this is clear that this is a woman for whom her days are mixed up and she neither recognises its number nor its timing. Did you not hear her saying, ‘I am with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), so I am not clean’? ",
            "My<sup>asws</sup> father<sup>asws</sup> was saying that she had inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) for seven years, so in less than this would happen to be the doubtful and mixed up. Therefore due to this she was in need to recognise the onset of the blood from its outset, and the change of its colour from the black to something else, and that is because the blood of the menstruation (<span class=\"iTxt\">Haydh</span>) is black, recognisable, and had she recognised her days she would not have been needy to recognising the colour of the blood, because the Sunnah regarding the menstruation (<span class=\"iTxt\">Haydh</span>) is that it happens to be yellow and the brownish. So whatever is above that regarding the days of the menstruation (<span class=\"iTxt\">Haydh</span>), when she recognised a menstruation (<span class=\"iTxt\">Haydh</span>), all of it, even if the blood was black or other than that.",
            "So this is clear for you that whether the blood is little and its days are many, the menstruation (<span class=\"iTxt\">Haydh</span>) is menstruation (<span class=\"iTxt\">Haydh</span>), all of it, when the days were known. So when she does not know of the days, and its number, she would be needy for the examination at the onset of the blood and its outset, and the changing of its colour. Then she would leave the <span class=\"iTxt\">Salaat</span> upon the measurement of that, and I<sup>asws</sup> did not see the Prophet<sup>saww</sup> say: ‘Sit (awaiting) for such and such a number of days, so whatever increases it, then you would be in inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>)’, just as he<sup>saww</sup> did not order the first one with that.",
            "And similar to that is the verdict - my<sup>asws</sup> father<sup>asws</sup> issued in a case similar to this, and that is that the woman from our<sup>asws</sup> family was with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), so she asked my<sup>asws</sup> father about that. So he<sup>asws</sup> said: ‘When you see the sea of blood, so leave the <span class=\"iTxt\">Salaat</span>, and when you see the purity, even though it may be for an hour of the day, so wash and pray <span class=\"iTxt\">Salaat</span>’. ",
            "Abu Abdullah<sup>asws</sup> said: ‘And I<sup>asws</sup> see the answer of my<sup>asws</sup> father<sup>asws</sup> over here to be other than his<sup>asws</sup> answer regarding the one with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), the first one (above). Did you not see that he<sup>asws</sup> said that she should leave the <span class=\"iTxt\">Salaat</span> for the number of days of her pure period because he<sup>asws</sup> looked at the number of the days and said over here: ‘When you see the sea of blood so let her leave the <span class=\"iTxt\">Salaat</span>’, and ordered over there that she should look at the onset of the blood when it comes and leaves, and changes (colour)’. ",
            "And his<sup>asws</sup> words, ‘The sea (of blood), resembles the meaning of the words of the Prophet<sup>saww</sup> that the blood of the menstruation (<span class=\"iTxt\">Haydh</span>) is black, recognisable, and rather it has been named as ‘sea (of blood)’ due to its abundance and its colour. Thus, this is a Sunnah of the Prophet<sup>saww</sup> regarding the one for whom her days are mixed up on her to the extent that she does not recognise them, and rather she recognises by the blood, whatever was from the little (number of) days, and more’.",
            "He<sup>asws</sup> said: ‘And as for the third Sunnah, so it is for the one for whom there are no preceding days, and she does not see the (inter-period) blood at all, and she sees the beginning of what I<sup>asws</sup> mentioned, and it continues with her. So the Sunnah for this is other than the Sunnah for the first and the second (cases), and that is because a woman called Hamnat Bin Jahsh came over to Rasool-Allah<sup>saww</sup> and she said, ‘I tend to menstruate with intense inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>)’. So he<sup>saww</sup> said to her: ‘Insert a cloth’. So she said, ‘It is more intense than that. I experience it as a torrent’. So he<sup>saww</sup> said: ‘Tie it up tightly and you are menstruation (<span class=\"iTxt\">Haydh</span>) during every month in the Knowledge of Allah<sup>azwj</sup>, for six or seven days. Then wash with a washing and Fast the twenty three days, or twenty four days, and wash for the Fajr (<span class=\"iTxt\">Salaat</span>) with a washing, and another for Al-Zohr, and hasten the Asr, and wash with a washing and delay the Maghrib and hasten the Isha (<span class=\"iTxt\">Salaat</span>s), and wash with a washing’.",
            "Abu Abdullah<sup>asws</sup> said: ‘So I<sup>asws</sup> see that he<sup>saww</sup> has established a sunnah regarding this as being other than the Sunnah he<sup>saww</sup> established regarding the first and the second cases, and that is because he<sup>saww</sup> ordered her differently to those two. Do you not see that her days, had they been less than seven, and had been five or less than that, he<sup>saww</sup> would not have told her to consider her menstruation (<span class=\"iTxt\">Haydh</span>) to be for seven days, so he<sup>saww</sup> would have ordered her with the leaving of the <span class=\"iTxt\">Salaat</span> for days and she would be in inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), other than menstruation (<span class=\"iTxt\">Haydh</span>). And similarly, had her menstruation (<span class=\"iTxt\">Haydh</span>) been more than seven (days), and he days had been ten or more, he<sup>saww</sup> would not have ordered her with the <span class=\"iTxt\">Salaat</span> and she is in menstruation (<span class=\"iTxt\">Haydh</span>). ",
            "Then from whatever increases this would clarify his<sup>saww</sup> words to her: ‘You are menstruating’, and there does not happen to be the menstruation (<span class=\"iTxt\">Haydh</span>) except for the woman who want to take the burden of what the menstruating woman does. Do you not see that he<sup>saww</sup> did not say to her: ‘Known number of days are your menstruating days. And from what this clarifies is his<sup>saww</sup> words to her: ‘In the Knowledge of Allah<sup>azwj</sup>’, because it was for her, and even though all the things are in the Knowledge of Allah<sup>azwj</sup> the Exalted.",
            "This, openly clarifies that these did not happen to be her (known) days before that at all, and this is a Sunnah for the one for whom the first blood is continuous. What she saw as the maximum of her duration was seven (days), and the maximum of her purity as twenty three (days) until the days come to be known for her, so she would transfer to it. ",
            "So the entirety of the situations of the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) revolve around these three Sunnahs, almost never being devoid from any one from these. If it was so that for her are a known (number of) days from the less or more, so she would be upon her days (of menstruation (<span class=\"iTxt\">Haydh</span>)), and her mannerisms which she would flow upon is in which there are no known number of days prescribed apart from her (known) days. So if the days get mixed up upon her and they either get preceded or are delayed, and the blood changes its colour upon her, so her Sunnah is based on her onset of the blood and its outset, and the change of its state.",
            "And if there do not happen to be (known) days for her before that, and she has inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), the first of what she sees, so her timing is of seven (days), and her purity is of twenty three (days). But, if the blood continues with her for a month, she would do during the whole month just as it was said for her. So if the blood is cut off in less than seven (days), or more than seven (days), so she would wash the moment she sees the purity and she would pray <span class=\"iTxt\">Salaat</span>. ",
            "So it would not cease to be like that until she sees what happens in the second month. So if the blood gets cut off for its time that it did so during the first month, in the same way until two or three menstruations (<span class=\"iTxt\">Haydh’s</span>) turn around for her, so she has come to know now that, that has come to be a timing for her, and it is a well-known manner that she would work upon, and she would leave what is besides it, and it would happen to be her Sunnah in the future when she has inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), and it has become a Sunnah upon the withholding of her pure period. ",
            "And rather, the timing that was made for her, of two menstruation (<span class=\"iTxt\">Haydhs</span>) or three, is due to the words of Rasool-Allah<sup>saww</sup> for the one who recognises her days: ‘Leave the <span class=\"iTxt\">Salaat</span> based on the days of your pure periods’, so we know that he<sup>saww</sup> did not make the one pure period as a Sunnah for her, so he<sup>saww</sup> was saying to her: ‘Leave the <span class=\"iTxt\">Salaat</span> for the days of your pure period’, but established a Sunnah for her based on pure periods, and the least of that are two menstruation (<span class=\"iTxt\">Haydhs</span>), hereinafter. ",
            "And when her days are mixed up upon her and they increase and decrease until she cannot rely from it upon a limit, nor from the blood upon colour, she would know by the onset of the blood and its outset, and there is no Sunnah for her other than this, due to the words of Rasool-Allah<sup>saww</sup>: ‘When the menstruation (<span class=\"iTxt\">Haydh</span>) comes, so leave the <span class=\"iTxt\">Salaat</span>, and when it leaves, so wash’, and due to his<sup>saww</sup> words: ‘The blood of the menstruation (<span class=\"iTxt\">Haydh</span>) is black, recognisable’, like the words of my<sup>asws</sup> father<sup>asws</sup>: ‘When you see the sea of blood’. ",
            "So if the matter does not happen to be like that, and the blood is wearing down upon her, so the inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) has not ceased its circuit, and the blood would be upon one colour, and its state would be one. Therefore, her Sunnah would be seven (days of menstruation (<span class=\"iTxt\">Haydh</span>)), and twenty three (days of pure period), because her maximum is the maximum of Hamnat when she said, ‘I am experiencing it like a torrent’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Muhammad ibn ‘Isa have narrated from Yunus from more than one person who have said the following: “They asked abu ’Abd Allah, ‘Alayhi al-Salam, about women experiencing Hayd (menses) and the tradition in his time. He (the Imam) said, ‘The Messenger of Allah has established three traditions in which he has explained every difficulty for those who hear and understand them so that no one can say anything of his own opinion about it. 1. “One tradition is about one who experiences Hayd (menses) on certain dates for a known period of time without mix and confusion, but she experiences Istihadah (irregular menses) and blood discharge continues. She knows the dates and number of days of the cycle of her Hayd (menses). A woman called Fatimah bint abu Hubaysh experienced Istihadah (irregular menses) and blood discharge continued. She came to ‘Umm Salamah. She asked the Messenger of Allah about it and he said that she must stop performing Salah (prayer) for a number of days, which is equal to the number of days of her Hayd-free period or the days of her Hayd (menses). He (the Messenger of Allah) said it is a (bleeding) vein. He (the Messenger of Allah) commanded her to take Ghusl (bath) (after passing either one of the two above mentioned number of days, namely, the Hayd (menses) free days or the number of days of her Hayd (menses)) and cover herself by passing her clothes between her legs to the other side and perform Salah (prayer). “Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘This is one tradition that the Holy prophet has established for women who know the date of their Hayd (menses) free period without mix and confusion. It is because he (the Messenger of Allah) did not ask how many days. He (the Messenger of Allah) did not say that if it increases above such number of days you are in the state of experiencing Istihadah (irregular menses). He (the Messenger of Allah) established a tradition for her in the case of known dates of more or less number after her knowing it (dates) exactly. In the same way my father gave the fatwa when he was asked about a woman experiencing Istihadah (irregular menses). He (the Imam) said, ‘It is only a (bleeding) vein or a kick of Satan.’ “She must stop performing Salah (prayer) for number of the days which is equal to the days of her Hayd (menses)-free period, then take Ghusl (bath) and Wudu’ for every Salah (prayer). It then was asked, ‘Even if it (blood discharge) is flowing?’ He (the Imam) said, ‘Yes even if it is like flowing.’ “Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘This is an explanation of Hadith of the Messenger of Allah, it (the explanation) agrees with the Hadith of the Messenger of Allah. This is the tradition about the one who knows the number of days of her Hayd (menses), not the date but only the number, less or more. 2. “This tradition is for one who experiences Hayd (menses) for a number of days but it becomes confused in terms of the number of days due to increase or decrease in such numbers as well as the exact date every month. The tradition for this kind of case is different from the previous one in which one experiences Hayd (menses) during a known number of days and date of every cycle of menses. It is because Fatimah bint abu Hubaysh came to the Holy prophet saying, ‘I continuously experience Hayd (menses) and do not have any menses-free time.’ The Holy prophet, said, ‘That is not Hayd (menses). It is a (bleeding) vein. When Hayd (menses) comes with greater quantity of blood discharge, you must stop performing Salah (prayer); and when it comes with diminished quantity of bleeding, you must take Ghusl (bath), wash the blood clean and perform Salah (prayer).’ “She would sit in a tub that belonged to her sister and yellowish color would rise over the water. Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ’Do you not hear that the Messenger of Allah commanded this woman to do something other than what he (the Messenger of Allah) had commanded the other woman to do.? Do you not see that he (the Messenger of Allah) did not say to her, ‘Stop performing Salah (prayer) during the days of your Hayd (menses) free period,’ but he (the Messenger of Allah) told her, ‘When it comes with increased quantity stop performing Salah (prayer) and when it comes with diminished quantity, take Ghusl (bath) and perform Salah (prayer).’ This explains that the case of this woman is confused in terms of number of days in which she experiences Hayd (menses). She does not know the exact number of days as well as the exact date. Do you not hear her saying, ‘I continuously experience Hayd (menses) and I do not have any Hayd (menses) free condition.’ My father would say that she experienced Hayd (menses) for seven years, so in a lesser time it is a confused condition and mixed one. “For this reason she needed to know the condition of the quantity of blood discharge and its quality in terms of color and so on. Blood discharge because of Hayd (menses) is of distinguishable black color. If she had known the days of her experiencing Hayd (menses) she would not need to know the color of blood discharge; the tradition about Hayd (menses) is that yellowness and thickness and things above this are during the days of Hayd (menses). When such signs are found it is then all Hayd (menses). If the color of blood is black and so on, it all explains that blood discharge of lesser or greater quantity in the days of Hayd (menses) is all Hayd (menses) when the days are exactly known to her. However, if she does not know the exact date and number of days she then needs to know the quantity of blood discharge and changes in its color, and then she stops performing Salah (prayer) accordingly. I do not find the Holy prophet, saying, ‘Sit (wait) for so and so many days and above such days is Istihadah (irregular menses). He (the Messenger of Allah) did not command the other woman in the first case like this. So also my father gave fatwa in a likewise case. Once a woman in our family experienced Hayd (menses) and she asked my father about it. He (my father) said, ‘If you experience a flooding blood discharge, stop performing Salah (prayer). If you experience bleeding-free time even for an hour, take Ghusl (bath) and perform Salah (prayer).’ Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘I find my father’s answer in this case different from his answer in the case of one experiencing Istihadah (irregular menses) mentioned in the first tradition. Consider his saying, ‘Stop performing Salah (prayer) for a period equal to the days of your discharge free period.’ This is because of the number of days. In this case he has said, ‘If you experience flooding blood discharge’ then stop performing Salah (prayer). In this case he commanded to see the quantity in terms of increase and decrease and changes in its color and his saying, ‘flooding discharge’ is similar to the statement of the Holy prophet, ‘Blood discharge because of Hayd (menses) is of distinguishable black color.’ My father has called it flooding discharge because of its greater quantity and color. “This is the tradition the Holy prophet has established for the case of women whose habit is confused in terms of number of days. The way for such women to know is by learning about the quantity and quality of blood discharge. 3. “He (the Imam) said, ‘The third tradition established for Istihadah (irregular menses) and Hayd (menses) is about women who do not have a set pattern for their Hayd (menses); it is a confused pattern and habit. The tradition in such case is different from the first and second traditions. This is because once a woman called Hamnah bint Jahsh came to the Messenger of Allah and said, ‘I have experienced an intense Hayd (menses).’ He (the Messenger of Allah) said, ‘Fill up with cotton.’ She said, ‘It is more intense than can be controlled with cotton. It is flooding.’ He (the Messenger of Allah) said, ‘Harness it tightly and follow the rules for Hayd (menses), according to the knowledge of Allah, for six or seven days. Thereafter, you must take Ghusl (bath) and fast twenty-three days or twenty-four days, then take Ghusl (bath) for the time of dawn (morning Salah (prayer)), one Ghusl (bath) for al-Dhuhr, then perform al-‘Asr Salah (prayer) quickly and another for al-Maghrib and perform al-’Isha’ prayer quickly thereafter and take one more Ghusl (bath).’ Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘I can see that he (the Messenger of Allah) has established in this case a tradition which is different from the traditions for the first and second case of Hayd (menses). It is because the commandment of the Messenger of Allah to her is different from those to the other two women. Consider that if the number of days in her case were less than seven and were it five or less the Messenger of Allah would not command her to consider it Hayd (menses) for seven days. Therefore, he (the Messenger of Allah) would end up commanding her to stop performing Salah (prayer) for certain days when she experienced Istihadah (irregular menses) and not Hayd (menses). So also is the case if her Hayd (menses) was for more than seven days like being ten days or more, he (the Messenger of Allah) would end up commanding her to perform Salah (prayer) when she experienced Hayd (menses). Furthermore what it explains is his words to her, “Follow rules of Hayd (menses) in your condition.” “Following rules of Hayd (menses)” is only for a woman who in fact experiences Hayd (menses). Do you not see that he (the Messenger of Allah) did not say to her to follow the rule of Hayd (menses) for a certain number of days. One more fact that explains this is his words, “according to knowledge of Allah” because it was for her, although all things are in the knowledge of Allah, most High. This explains it clearly that she did not have a pattern in the form of known days before, at all. This is the tradition for one who experiences blood discharge for the first time without stop. The maximum for such Hayd (menses) is seven days and the maximum Hayd-free period is twenty-three days until the pattern of her experiencing Hayd (menses) is established which then is followed. All cases of Istihadah (irregular menses) fall under these three traditions. It all falls under these traditions. If the number of days, more or less, are known, she follows the rules for Hayd (menses) and her habits accordingly when there is no other number and dates other than her days. “That her days become confused because of coming earlier or later and the changes of conditions. The tradition in her case is to find about the quantity and quality, like color of blood and so on, follow that she had no experience in terms of days before and she experiences Hayd (menses) for the first time in which case it (Hayd (menses)) is seven days and the Hayd-free period is twenty-three days. If blood discharge continues for several months, she follows the rule every month as explained for her. If blood discharge stops before the seven days or after more than seven days, she then takes Ghusl (bath) as soon as she finds a Hayd-free time and performs Salah (prayer). She continues to follow such rule until the second month to see if it is in the same pattern and habit as the month before and up to two or three cycles of Hayd (menses), then it means that a distinguishable pattern and habit is established for her. She can follow the rules of Hayd (menses) accordingly. She can now ignore other conditions and this becomes her tradition for future if she experiences Istihadah (irregular menses). “Basing establishment of pattern and habit on the grounds of two or three Hayd (menses) cycle is because of the words of the Messenger of Allah to the one who had known the number of her days that said, ‘Stop performing Salah (prayer) in the days (dates) of your Hayd-free days.’ This explains that one Hayd-free period is not enough to establish a pattern and habit. He (the Messenger of Allah) did not say one Hayd-free period. He set it for her to be three Hayd-free periods. The minimum is two cycles of Hayd-free periods or more. “When days and her pattern and habit are confused because of increase or decrease in number of days and the pattern is lost even in terms of quality and color, she then follows the rules according to the quantity of blood discharge. She does not have other traditions to follow except this because of the words of the Messenger of Allah, ‘When blood discharge is increased, stop performing Salah (prayer), and when it decreases take Ghusl (bath).’ Also because of the words of the Messenger of Allah, ‘Blood of Hayd (menses) is distinguishably of black color.’ It is like the statement of my father, ‘When you experience flooding blood discharge.’ If this is not applicable and blood discharge continues, it is Istihadah (irregular menses) when the color of blood is of one kind and one condition, in this case the tradition to follow is seven days (of Hayd (menses)) and twenty-three days of Hayd-free period. It is because her case is like the case of Hamnah who said, ‘Blood discharge from me is flooding.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/223)"
        ],
        "index": 4160,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/132",
              "text": "حَمَّادِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/142",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ حَمَّادِ بْنِ عِيسَى وَ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:9:2",
        "text": [
          " الْمُسْتَحَاضَةُ تَنْظُرُ أَيَّامَهَا فَلَا تُصَلِّ فِيهَا وَ لَا يَقْرَبْهَا بَعْلُهَا فَإِذَا جَازَتْ أَيَّامُهَا وَ رَأَتِ الدَّمَ يَثْقُبُ الْكُرْسُفَ اغْتَسَلَتْ لِلظُّهْرِ وَ الْعَصْرِ تُؤَخِّرُ هَذِهِ وَ تُعَجِّلُ هَذِهِ وَ لِلْمَغْرِبِ وَ الْعِشَاءِ غُسْلًا تُؤَخِّرُ هَذِهِ وَ تُعَجِّلُ هَذِهِ وَ تَغْتَسِلُ لِلصُّبْحِ وَ تَحْتَشِي وَ تَسْتَثْفِرُ وَ لَا تُحَيِّي وَ تَضُمُّ فَخِذَيْهَا فِي الْمَسْجِدِ وَ سَائِرُ جَسَدِهَا خَارِجٌ وَ لَا يَأْتِيهَا بَعْلُهَا فِي أَيَّامِ قُرْئِهَا وَ إِنْ كَانَ الدَّمُ لَا يَثْقُبُ الْكُرْسُفَ تَوَضَّأَتْ وَ دَخَلَتِ الْمَسْجِدَ وَ صَلَّتْ كُلَّ صَلَاةٍ بِوُضُوءٍ وَ هَذِهِ يَأْتِيهَا بَعْلُهَا إِلَّا فِي أَيَّامِ حَيْضِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Hammad Bin Isa and Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) would look at her days, so she would neither pray <span class=\"iTxt\">Salaat</span> in them, nor would she go near her husband. So when her days exceed and she sees the blood, she should insert a cloth and wash for the Zoh and Al-Asr (<span class=\"iTxt\">Salaat</span>s), delaying this one and hastening that one; and for Al-Maghrib and Al-Isha, she would wash, delaying this one and hastening that one, and she should wash for the morning (<span class=\"iTxt\">Salaat</span>), and she would stuff a cloth and she would not bend and spread her thighs in the Masjid and make her body to be outside; and she should not go to her husband during the (regular) days of her purity. And if it was such that the blood cannot be held by the cloth, she should perform ablution before entering the Masjid and pray (<span class=\"iTxt\">Salaat</span>), each <span class=\"iTxt\">Salaat</span> being with one ablution. And this one can go to her husband except during the days of her menstruation (<span class=\"iTxt\">Haydh</span>)’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Hammad ibn ‘Isa and ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One experiencing Istihadah (irregular menses) must wait to complete the number of days of the pattern of her habit of experiencing Hayd (menses) and in such times she must not perform Salah (prayer) or go close to her husband. When such days are passed but blood discharge continues, she then must place a piece of cotton inside urethra. She must take Ghusl (bath) for al-Dhuhr and al-‘Asr Salah (prayer) with sometimes delay in that (al-Dhuhr) and earlier in this (al-‘Asr) and another Ghusl (bath) for al-Maghrib and al-‘Isha’ with sometimes delay for that and earlier for this. She must take a Ghusl (bath) for morning with urethra filled with cotton; she must not bend down and must keep her thighs close to each other when sitting, with other parts of her body kept out. Her husband must not go close to her during her time of Hayd (menses) free period. If blood discharge penetrates through the piece of cotton, she must take one Wudu’ to enter Masjid, and take Wudu’ for each Salah (prayer). In this case her husband can go close to her except in the days of her Hayd (menses).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/225)"
        ],
        "index": 4161,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/248",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2428",
              "text": "الْفَضْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/603",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1099",
              "text": "مُحَمَّدٍ الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدٌ عَنِ الْفَضْلِ عَنْ صَفْوَانَ عَنْ مُحَمَّدٍ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:9:3",
        "text": [
          " سَأَلْتُهُ عَنِ الْمَرْأَةِ تُسْتَحَاضُ فَقَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) سُئِلَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنِ الْمَرْأَةِ تُسْتَحَاضُ فَأَمَرَهَا أَنْ تَمْكُثَ أَيَّامَ حَيْضِهَا لَا تُصَلِّ فِيهَا ثُمَّ تَغْتَسِلَ وَ تَسْتَدْخِلَ قُطْنَةً وَ تَسْتَثْفِرَ بِثَوْبٍ ثُمَّ تُصَلِّيَ حَتَّى يَخْرُجَ الدَّمُ مِنْ وَرَاءِ الثَّوْبِ قَالَ تَغْتَسِلُ الْمَرْأَةُ الدَّمِيَّةُ بَيْنَ كُلِّ صَلَاتَيْنِ وَ الِاسْتِذْفَارُ أَنْ تَطَيَّبَ وَ تَسْتَجْمِرَ بِالدُّخْنَةِ وَ غَيْرِ ذَلِكَ وَ الِاسْتِثْفَارُ أَنْ تَجْعَلَ مِثْلَ ثَفْرِ الدَّابَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad, from Al Fazl, from Safwan, from Muhammad Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the woman with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>). So he<sup>asws</sup> said: ‘Abu Ja’far<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> was asked about the woman with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>), so he<sup>asws</sup> ordered her that she should wait for the (regular) days of her menstruation (<span class=\"iTxt\">Haydh</span>), not praying <span class=\"iTxt\">Salaat</span> during these. Then she should wash and she would insert cotton, and she would stuff with a cloth. Then she would pray <span class=\"iTxt\">Salaat</span> until the blood comes out from other side of the cloth’. He<sup>asws</sup> said: ‘The bleeding woman would wash between every two <span class=\"iTxt\">Salaat</span>s, and replace the cloth,  and apply perfume and burn incense, and other than that, and the stuffing (cloth) must be like a belt to harness animals’."
          ],
          "en.sarwar": [
            "3. Muhammad has narrated from al-Fadl from Safwan from Muhammad al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who experiences Istihadah. He (the Imam) said that the Messenger of Allah was asked about a woman who experienced Istihadah. He (the Messenger of Allah) told her to wait for a number of days equal to the days of her Hayd (menses) in which she must not perform Salah (prayer). She then must take Ghusl (bath) and place cotton, then secure it in place with a piece of cloth; then perform Salah (prayer) until blood comes out from the other side of the cloth.’ He (the Imam) then said, ‘A bleeding woman must take Ghusl (bath) between every two Salah (prayer) and replace cotton and cloth, use perfume and burn incense. The piece of cloth must be like a belt to harness animals.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/226)"
        ],
        "index": 4162,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/104",
              "text": "مُحَمَّدِ بْنِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/305",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:9:4",
        "text": [
          " قَالَ الْمُسْتَحَاضَةُ إِذَا ثَقَبَ الدَّمُ الْكُرْسُفَ اغْتَسَلَتْ لِكُلِّ صَلَاتَيْنِ وَ لِلْفَجْرِ غُسْلًا وَ إِنْ لَمْ يَجُزِ الدَّمُ الْكُرْسُفَ فَعَلَيْهَا الْغُسْلُ كُلَّ يَوْمٍ مَرَّةً وَ الْوُضُوءُ لِكُلِّ صَلَاةٍ وَ إِنْ أَرَادَ زَوْجُهَا أَنْ يَأْتِيَهَا فَحِينَ تَغْتَسِلُ هَذَا إِنْ كَانَ دَمُهَا عَبِيطاً وَ إِنْ كَانَتْ صُفْرَةً فَعَلَيْهَا الْوُضُوءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Usman Bin Isa, from Sama’at who said, ",
            "‘He<sup>asws</sup> said: ‘If the bloods seeps through the cotton pad, she should wash for every two <span class=\"iTxt\">Salaat</span>s, and a washing for Al-Fajr (<span class=\"iTxt\">Salaat</span>); and if the blood does not exceed the cotton pad, so upon her is the washing of once every day, and the ablution for every <span class=\"iTxt\">Salaat</span>. And if her husband wants to go to her, so this is where she should wash. This is for if her blood was black; and if it was yellow, so upon her is the ablution’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “He (the Imam), ‘Alayhi al-Salam, has said, ‘In the case of Istihadah, if blood finds its way outthrough the cotton, she must take Ghusl (bath) for every two Salah (prayer) and one more Ghusl (bath) for the morning Salah (prayer). If blood does not come out through the cotton, then she must take one Ghusl (bath) every day and Wudu 5 for every Salah (prayer). If her husband wants to come to her, he must do so after her Ghusl (bath). This is when blood is of black color but if it is yellow, then she must take Wudu’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/227)"
        ],
        "index": 4163,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:9:5",
        "text": [
          " الْمُسْتَحَاضَةُ تَغْتَسِلُ عِنْدَ صَلَاةِ الظُّهْرِ فَتُصَلِّي الظُّهْرَ وَ الْعَصْرَ ثُمَّ تَغْتَسِلُ عِنْدَ الْمَغْرِبِ فَتُصَلِّي الْمَغْرِبَ وَ الْعِشَاءَ ثُمَّ تَغْتَسِلُ عِنْدَ الصُّبْحِ فَتُصَلِّي الْفَجْرَ وَ لَا بَأْسَ أَنْ يَأْتِيَهَا بَعْلُهَا إِذَا شَاءَ إِلَّا أَيَّامَ حَيْضِهَا فَيَعْتَزِلُهَا بَعْلُهَا ",
          "قَالَ وَ قَالَ لَمْ تَفْعَلْهُ امْرَأَةٌ قَطُّ احْتِسَاباً إِلَّا عُوفِيَتْ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>) should wash during <span class=\"iTxt\">Salaat</span> Al-Zohr, so she would pray Al-Zohr and Al-Asr. Then she should wash during <span class=\"iTxt\">Salaat</span> Al-Maghrib, so she would pray Al-Maghrib and Al-Isha. Then she should wash during the morning <span class=\"iTxt\">Salaat</span>, so she would pray Al-Fajr. And there is no problem if her husband were to come to her whenever he so desires to, except for the days of her menstruation (<span class=\"iTxt\">Haydh</span>), so she would isolate herself from her husband’. ",
            "He (the narrator) said, ‘And he<sup>asws</sup> said: ‘A woman would not do so at all, except that she would regain good health from that’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ’Abd Allah ibn af-Mughirah from ’Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A woman experiencing Istihadah must take Ghusl (bath) for Salah (prayer) of al-Dhuhr to perform Salah (prayer) of al-Dhuhr and al-‘Asr, then take Ghusl (bath) near al-Maghrib to perform Salah (prayer) of al-Maghrib and al-Tsha’, then take Ghusl (bath) near the morning for Salah (prayer) of the morning. It is not harmful if her husband comes to her if he likes. Only in the days when she experiences Hayd (menses) he must stay away from her.’ He (the Imam), said, ‘Any woman who follows this instruction for the sake of reward from Allah enjoys good health.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (13/228)"
        ],
        "index": 4164,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/121",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/351",
              "text": "أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:9:6",
        "text": [
          " قُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِذَا مَكَثَتِ الْمَرْأَةُ عَشَرَةَ أَيَّامٍ تَرَى الدَّمَ ثُمَّ طَهُرَتْ فَمَكَثَتْ ثَلَاثَةَ أَيَّامٍ طَاهِرَةً ثُمَّ رَأَتِ الدَّمَ بَعْدَ ذَلِكَ أَ تُمْسِكُ عَنِ الصَّلَاةِ قَالَ لَا هَذِهِ مُسْتَحَاضَةٌ تَغْتَسِلُ وَ تَسْتَدْخِلُ قُطْنَةً بَعْدَ قُطْنَةٍ وَ تَجْمَعُ بَيْنَ الصَّلَاتَيْنِ بِغُسْلٍ وَ يَأْتِيهَا زَوْجُهَا إِنْ أَرَادَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazl Bin Shazaan, from Safwaan Bin Yahya, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! When the woman waits for ten days and sees the blood, then she becomes clean, and she awaits for three days as clean, then she sees the blood after that. Should she withhold from the <span class=\"iTxt\">Salaat</span>?’ He<sup>asws</sup> said: ‘No. This is woman with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>). She should wash and insert a cotton (pad) after cotton (pad), and she would gather between the two <span class=\"iTxt\">Salaat</span>s with one washing, and her husband can come to her if he so intends to’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from Safwan ibn Yahya who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, if a woman waits for ten days experiencing blood discharge, then she becomes clean; and after three discharge-free days experiences blood discharge again, is she required to stop performing Salah (prayer)? He (the Imam) said, ‘No, she is Mustahadah. She must place cotton one piece after the other piece, perform two Salah (prayer) together one after the other with one Ghusl (bath) and her husband can come to her if he wants.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/228)"
        ],
        "index": 4165,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2429",
              "text": "دَاوُدَ مَوْلَى أَبِي الْمَغْرَاءِ الْعِجْلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1148",
              "text": "أَخْبَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ دَاوُدَ مَوْلَى أَبِي الْمَغْرَاءِ الْعِجْلِيِّ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:3:2:9:7",
        "text": [
          " سَأَلْتُهُ عَنِ الْمَرْأَةِ تَحِيضُ ثُمَّ يَمْضِي وَقْتُ طُهْرِهَا وَ هِيَ تَرَى الدَّمَ قَالَ فَقَالَ تَسْتَظْهِرُ بِيَوْمٍ إِنْ كَانَ حَيْضُهَا دُونَ عَشَرَةِ أَيَّامٍ وَ إِنِ اسْتَمَرَّ الدَّمُ فَهِيَ مُسْتَحَاضَةٌ وَ إِنِ انْقَطَعَ الدَّمُ اغْتَسَلَتْ وَ صَلَّتْ ",
          "قَالَ قُلْتُ لَهُ فَالْمَرْأَةُ يَكُونُ حَيْضُهَا سَبْعَةَ أَيَّامٍ أَوْ ثَمَانِيَةَ أَيَّامٍ حَيْضُهَا دَائِمٌ مُسْتَقِيمٌ ثُمَّ تَحِيضُ ثَلَاثَةَ أَيَّامٍ ثُمَّ يَنْقَطِعُ عَنْهَا الدَّمُ فَتَرَى الْبَيَاضَ لَا صُفْرَةً وَ لَا دَماً قَالَ تَغْتَسِلُ وَ تُصَلِّي قُلْتُ تَغْتَسِلُ وَ تُصَلِّي وَ تَصُومُ ثُمَّ يَعُودُ الدَّمُ قَالَ إِذَا رَأَتِ الدَّمَ أَمْسَكَتْ عَنِ الصَّلَاةِ وَ الصِّيَامِ ",
          "قُلْتُ فَإِنَّهَا تَرَى الدَّمَ يَوْماً وَ تَطْهُرُ يَوْماً قَالَ فَقَالَ إِذَا رَأَتِ الدَّمَ أَمْسَكَتْ وَ إِذَا رَأَتِ الطُّهْرَ صَلَّتْ فَإِذَا مَضَتْ أَيَّامُ حَيْضِهَا وَ اسْتَمَرَّ بِهَا الطُّهْرُ صَلَّتْ فَإِذَا رَأَتِ الدَّمَ فَهِيَ مُسْتَحَاضَةٌ قَدِ انْتَظَمَتْ لَكَ أَمْرُهَا كُلُّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Dawood, a slave of Abu Al Maghra Al Ijaly, from the one who informed him, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the woman who menstruates, then the time of the purity passes by, and she sees the blood. So he<sup>asws</sup> said: ‘She should memorise the day, if her menstruation (<span class=\"iTxt\">Haydh</span>) is less of than ten days; and if the blood continues, so she is a woman with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>); and if the blood cuts off, she should wash and pray <span class=\"iTxt\">Salaat</span>’.",
            "He (the narrator) said, ‘I said, ‘So (what about) the woman whose menstruation (<span class=\"iTxt\">Haydh</span>) happens to be of seven days or eight days, her menstruation (<span class=\"iTxt\">Haydh</span>) being constant, even, then she menstruates for three days, then the blood is cut off from her, so she sees the whiteness, not yellowness, and no blood?’ He<sup>asws</sup> said: ‘She should wash and pray <span class=\"iTxt\">Salaat</span>’. I said, ‘Supposing she washes and prays <span class=\"iTxt\">Salaat</span>, and Fasts, then the blood returns?’ He<sup>asws</sup> said: ‘If she sees the blood, she would withhold from the <span class=\"iTxt\">Salaat</span> and the Fasts’. ",
            "I said, ‘Supposing she sees the blood one day and is pure one day?’ He (the narrator) said, ‘So he<sup>asws</sup> said: ‘When she sees the blood, she should withhold (from the <span class=\"iTxt\">Salaat</span>), and when she sees the purity, she should pray <span class=\"iTxt\">Salaat</span>. So when the days of her menstruation (<span class=\"iTxt\">Haydh</span>) pass by and the purity continues with her, she should pray <span class=\"iTxt\">Salaat</span>. So when she sees the blood, then she is with inter-period bleeding (<span class=\"iTxt\">Istihaaza</span>). I<sup>asws</sup> have organized for you, all of her matters’."
          ],
          "en.sarwar": [
            "7. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Dawud Mawla’ abu al-Mighra’ al-‘Ijliy from those who narrated to him who have said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a woman who experiences Hayd (menses), then the time for her al-Dhuhr Salah (prayer) comes when she finds bleeding. He (the Imam) said, ‘She must examine by means of the day to see if it stops before ten days. If it continued after ten days it, then is because of Istihadah (not Hayd (menses). If bleeding stops (before ten days) she must take Ghusl (bath) and perform Salah (prayer ). 5 I then asked, ‘If a woman whose Hayd (menses) is seven days or eight days all the time and straight then she experiences Hayd (menses) for three days, then bleeding stops, then she finds white discharge not yellow, nor blood . 5 He (the Imam) said, ‘She must take Ghusl (bath) and perform Salah (prayer ) 5 I then said that she performs Salah (prayer) and fasts but bleeding comes again. He (the Imam) said, ‘When she finds blood she must stop Salah (prayer) and fasting . 5 I then said that she finds blood one day and one day finds no blood. He (the Imam) said, ‘When she finds blood she must stop Salah (prayer) and fasting and when she does not find blood, she performs Salah (prayer) and when the number of the days of her Hayd (menses) are complete and bleeding stops, she must perform Salah (prayer). If she finds blood it is then because of Istihadah. I have organized all of her affairs for you.” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:3:2:9",
  "kind": "verse_list"
}