{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:6:7",
        "titles": {
          "ar": "كتاب الْأَشْرِبَةِ",
          "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:6:7:13",
        "titles": {
          "ar": "باب أَصْلِ تَحْرِيمِ الْخَمْرِ",
          "en": "Chapter 13 – Origin of the Prohibition of the wine"
        }
      }
    ],
    "index": 1881,
    "local_index": 13,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:6:7:14",
        "titles": {
          "ar": "باب أَنَّ الْخَمْرَ لَمْ تَزَلْ مُحَرَّمَةً",
          "en": "Chapter 14 – The wine will never cease to be Prohibited"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:6:7:12",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب مَا يُتَّخَذُ مِنْهُ</span> الْخَمْرُ",
          "en": "Chapter 12 – What the wine is taken from"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:6:7",
        "titles": {
          "ar": "كتاب الْأَشْرِبَةِ",
          "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:7:13",
    "titles": {
      "ar": "باب أَصْلِ تَحْرِيمِ الْخَمْرِ",
      "en": "Chapter 13 – Origin of the Prohibition of the wine"
    },
    "verse_count": 4,
    "verse_start_index": 12102,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول بسندي ه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/247)"
        ],
        "index": 12103,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3474",
              "text": "خَالِدِ بْنِ جَرِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/818",
              "text": "أَبِي الرَّبِيعِ الشَّامِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ خَالِدِ بْنِ جَرِيرٍ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:13:1",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَصْلِ الْخَمْرِ كَيْفَ كَانَ بَدْءُ حَلَالِهَا وَ حَرَامِهَا وَ مَتَى اتُّخِذَ الْخَمْرَ فَقَالَ إِنَّ آدَمَ ( عليه السلام ) لَمَّا هَبَطَ مِنَ الْجَنَّةِ اشْتَهَى مِنْ ثِمَارِهَا فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ قَضِيبَيْنِ مِنْ عِنَبٍ فَغَرَسَهُمَا فَلَمَّا أَنْ أَوْرَقَا وَ أَثْمَرَا وَ بَلَغَا جَاءَ إِبْلِيسُ لَعَنَهُ اللَّهُ فَحَاطَ عَلَيْهِمَا حَائِطاً فَقَالَ آدَمُ ( عليه السلام ) مَا حَالُكَ يَا مَلْعُونُ فَقَالَ إِبْلِيسُ إِنَّهُمَا لِي فَقَالَ لَهُ كَذَبْتَ ",
          "فَرَضِيَا بَيْنَهُمَا بِرُوحِ الْقُدُسِ فَلَمَّا انْتَهَيَا إِلَيْهِ قَصَّ عَلَيْهِ آدَمُ ( عليه السلام ) قِصَّتَهُ وَ أَخَذَ رُوحُ الْقُدُسِ ضِغْثاً مِنْ نَارٍ وَ رَمَى بِهِ عَلَيْهِمَا وَ الْعِنَبُ فِي أَغْصَانِهِمَا حَتَّى ظَنَّ آدَمُ ( عليه السلام ) أَنَّهُ لَمْ يَبْقَ مِنْهُمَا شَيْ‏ءٌ وَ ظَنَّ إِبْلِيسُ لَعَنَهُ اللَّهُ مِثْلَ ذَلِكَ ",
          "قَالَ فَدَخَلَتِ النَّارُ حَيْثُ دَخَلَتْ وَ قَدْ ذَهَبَ مِنْهُمَا ثُلُثَاهُمَا وَ بَقِيَ الثُّلُثُ فَقَالَ الرُّوحُ أَمَّا مَا ذَهَبَ مِنْهُمَا فَحَظُّ إِبْلِيسَ لَعَنَهُ اللَّهُ وَ مَا بَقِيَ فَلَكَ يَا آدَمُ .",
          "الْحَسَنُ بْنُ مَحْبُوبٍ عَنْ خَالِدِ بْنِ نَافِعٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and a number of our companions, from Ahmad Bin Muhammad and Sahl Bin Ziyad, altogether from Ibn Mahboub, from Khalid Bin Jareer, from Abu Al Rabie Al Shamy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the origin of the wine, how did its permissibility begin, and its Prohibition, and when was the wine taken?’ So he<sup>asws</sup> said: ‘When Adam<sup>as</sup> descended from the Paradise, he<sup>asws</sup> desired from its fruits. So Allah<sup>azwj</sup> Mighty and Majestic Sent down two branches of grapes unto him<sup>as</sup>. So he<sup>as</sup> planted these. So when it grew leaves, and fruits, and became big, Iblees<sup>la</sup> may Allah<sup>azwj</sup> Curse him<sup>la</sup>, came over. So he<sup>la</sup> built a wall over these. So Adam<sup>as</sup> said: ‘What is your<sup>la</sup> state, O Accursed?’ So Iblees<sup>la</sup> said, ‘These two are mine<sup>la</sup>’. So he<sup>as</sup> said: ‘You<sup>la</sup> are lying!’ ",
            "So they both agreed for the Holy Spirit to (decide) between them. So when they both ended up to it, Adam<sup>as</sup> related his<sup>as</sup> story to him, and the Holy Spirit took some fire and threw it upon both (trees), and the grapes were in their branches, to the extent that Adam<sup>as</sup> thought that there would not remain anything from these, and Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>, thought similar to that. ",
            "He<sup>asws</sup> said: ‘So the fire entered wherever it tends to enter, and two thirds from these two (trees) had gone away (incinerated), and there remained a third. So the (Holy) Spirit said: ‘As for what has gone from these two, so it is the share of Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>, and whatever remains, so it is for you<sup>as</sup>, O Adam<sup>as</sup>’. ",
            "Al-Hassan Bin Mahboub, from Khalid Bin Nafi’n, from Abu Abdullah<sup>asws</sup> – similar to it’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and a number of our people have narrated from Ahmad ibn Muhammad and Sahl ibn Ziyad all from ibn Mahbub from Khalid ibn Jarir from abu al-Rabi’ al-Shamiy who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the origin of wine and how in the beginning it was lawful and its unlawfulness and when it was found. He (the Imam) said, ‘When Adam, ‘Alayhi al- Salam, descended from the garden (paradises) he desired its fruits; and Allah, most Majestic, most Glorious, sent him two twigs of grape vine which he planted. When they grew leaves and fruits came out and ripened, Satan, may Allah condemn him built a wall around them. Adam, ‘Alayhi al-Salam asked how is your condition, O condemned one?’ He said, ‘They are for me.’ He said, ‘You are lying.’ They agreed to go for Judgment before the Holy spirit. When they arrived before him, Adam, ‘Alayhi al-Salam told his side of the story. The holy spirit took a certain amount of fire and threw it on them, when there were grapes on their branches. Adam, ‘Alayhi al-Salam thought that nothing is left from them and so also thought Satan, may Allah condemn him.’ He (the Imam) said, ‘The fire worked as it did but two-third were gone and one-third was left. The Holy Spirit said, ‘Whatever is gone is the share of Iblis, may Allah condemn him, and what is left is the share of Adam, ‘Alayhi al-Salam.’” Al-Hassan ibn Mahbub has narrated from Khalid ibn Nafi’ from abu ‘Abd Allah, ‘Alayhi al-Salam, has narrated a similar Hadith. "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/247)"
        ],
        "index": 12104,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/9",
              "text": "عَلِيُّ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/433",
              "text": "صَالِحِ بْنِ أَبِي حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "الْحُسَيْنِ بْنِ يَزِيدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/407",
              "text": "إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنِ الْحُسَيْنِ بْنِ يَزِيدَ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ إِبْرَاهِيمَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:13:2",
        "text": [
          " إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمَّا أَهْبَطَ آدَمَ ( عليه السلام ) أَمَرَهُ بِالْحَرْثِ وَ الزَّرْعِ وَ طَرَحَ إِلَيْهِ غَرْساً مِنْ غُرُوسِ الْجَنَّةِ فَأَعْطَاهُ النَّخْلَ وَ الْعِنَبَ وَ الزَّيْتُونَ وَ الرُّمَّانَ فَغَرَسَهَا لِيَكُونَ لِعَقِبِهِ وَ ذُرِّيَّتِهِ",
          "فَأَكَلَ هُوَ مِنْ ثِمَارِهَا فَقَالَ لَهُ إِبْلِيسُ لَعَنَهُ اللَّهُ يَا آدَمُ مَا هَذَا الْغَرْسُ الَّذِي لَمْ أَكُنْ أَعْرِفُهُ فِي الْأَرْضِ وَ قَدْ كُنْتُ فِيهَا قَبْلَكَ ائْذَنْ لِي آكُلْ مِنْهَا شَيْئاً فَأَبَى آدَمُ ( عليه السلام ) أَنْ يَدَعَهُ",
          "فَجَاءَ إِبْلِيسُ عِنْدَ آخِرِ عُمْرِ آدَمَ ( عليه السلام ) وَ قَالَ لِحَوَّاءَ إِنَّهُ قَدْ أَجْهَدَنِي الْجُوعُ وَ الْعَطَشُ فَقَالَتْ لَهُ حَوَّاءُ فَمَا الَّذِي تُرِيدُ قَالَ أُرِيدُ أَنْ تُذِيقِينِي مِنْ هَذِهِ الثِّمَارِ فَقَالَتْ حَوَّاءُ إِنَّ آدَمَ ( عليه السلام ) عَهِدَ إِلَيَّ أَنْ لَا أُطْعِمَكَ شَيْئاً مِنْ هَذَا الْغَرْسِ لِأَنَّهُ مِنَ الْجَنَّةِ وَ لَا يَنْبَغِي لَكَ أَنْ تَأْكُلَ مِنْهُ شَيْئاً",
          "فَقَالَ لَهَا فَاعْصِرِي فِي كَفِّي شَيْئاً مِنْهُ فَأَبَتْ عَلَيْهِ فَقَالَ ذَرِينِي أَمَصَّهُ وَ لَا آكُلْهُ فَأَخَذَتْ عُنْقُوداً مِنْ عِنَبٍ فَأَعْطَتْهُ فَمَصَّهُ وَ لَمْ يَأْكُلْ مِنْهُ لِمَا كَانَتْ حَوَّاءُ قَدْ أَكَّدَتْ عَلَيْهِ فَلَمَّا ذَهَبَ يَعَضُّ عَلَيْهِ جَذَبَتْهُ حَوَّاءُ مِنْ فِيهِ فَأَوْحَى اللَّهُ تَبَارَكَ وَ تَعَالَى إِلَى آدَمَ ( عليه السلام ) أَنَّ الْعِنَبَ قَدْ مَصَّهُ عَدُوِّي وَ عَدُوُّكَ إِبْلِيسُ وَ قَدْ حَرَّمْتُ عَلَيْكَ مِنْ عَصِيرَةِ الْخَمْرِ مَا خَالَطَهُ نَفَسُ إِبْلِيسَ ",
          "فَحُرِّمَتِ الْخَمْرُ لِأَنَّ عَدُوَّ اللَّهِ إِبْلِيسَ مَكَرَ بِحَوَّاءَ حَتَّى مَصَّ الْعِنَبَ وَ لَوْ أَكَلَهَا لَحُرِّمَتِ الْكَرْمَةُ مِنْ أَوَّلِهَا إِلَى آخِرِهَا وَ جَمِيعُ ثَمَرِهَا وَ مَا يَخْرُجُ مِنْهَا",
          "ثُمَّ إِنَّهُ قَالَ لِحَوَّاءَ فَلَوْ أَمْصَصْتِنِي شَيْئاً مِنْ هَذَا التَّمْرِ كَمَا أَمْصَصْتِنِي مِنَ الْعِنَبِ فَأَعْطَتْهُ تَمْرَةً فَمَصَّهَا وَ كَانَتِ الْعِنَبُ وَ التَّمْرَةُ أَشَدَّ رَائِحَةً وَ أَزْكَى مِنَ الْمِسْكِ الْأَذْفَرِ وَ أَحْلَى مِنَ الْعَسَلِ فَلَمَّا مَصَّهُمَا عَدُوُّ اللَّهِ إِبْلِيسُ لَعَنَهُ اللَّهُ ذَهَبَتْ رَائِحَتُهُمَا وَ انْتَقَصَتْ حَلَاوَتُهُمَا",
          "قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ إِنَّ إِبْلِيسَ لَعَنَهُ اللَّهُ ذَهَبَ بَعْدَ وَفَاةِ آدَمَ ( عليه السلام ) فَبَالَ فِي أَصْلِ الْكَرْمَةِ وَ النَّخْلَةِ فَجَرَى الْمَاءُ عَلَى عُرُوقِهِمَا مِنْ بَوْلِ عَدُوِّ اللَّهِ فَمِنْ ثَمَّ يَخْتَمِرُ الْعِنَبُ وَ التَّمْرُ فَحَرَّمَ اللَّهُ عَزَّ وَ جَلَّ عَلَى ذُرِّيَّةِ آدَمَ ( عليه السلام ) كُلَّ مُسْكِرٍ لِأَنَّ الْمَاءَ جَرَى بِبَوْلِ عَدُوِّ اللَّهِ فِي النَّخْلَةِ وَ الْعِنَبِ وَ صَارَ كُلُّ مُخْتَمِرٍ خَمْراً لِأَنَّ الْمَاءَ اخْتَمَرَ فِي النَّخْلَةِ وَ الْكَرْمَةِ مِنْ رَائِحَةِ بَوْلِ عَدُوِّ اللَّهِ إِبْلِيسَ لَعَنَهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Al Husayn Bin Yazeed, from Ali Bin Abu Hamza, from Ibrahim, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘When Allah<sup>azwj</sup> Mighty and Majestic Caused Adam<sup>as</sup> to descend, Commanded him<sup>as</sup> with the ploughing and the planting and Forwarded to him<sup>as</sup> plants from the plants of the Paradise. So He<sup>azwj</sup> Gave him<sup>as</sup> the palm tree, and the grapes, and the olives, and the pomegranate. So he<sup>as</sup> planted these for it to be for his<sup>as</sup> offspring. ",
            "So he<sup>as</sup> ate from its fruits, so Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>, said to him<sup>as</sup>, ‘O Adam<sup>as</sup>! What is this plant which I<sup>la</sup> do not happen to recognise it in the earth, and I<sup>la</sup> was here before you<sup>as</sup>, and was not Permitted to eat anything from these?’ So Adam<sup>la</sup> refused to invite him<sup>la</sup>. ",
            "So Iblees<sup>la</sup> came over at the end of the lifetime of Adam<sup>as</sup> and said to Hawwa<sup>as</sup>, ‘The hunger and the thirst has exhausted me<sup>la</sup>’. So she<sup>as</sup> said: ‘So what is it which you<sup>la</sup> want?’ He<sup>la</sup> said, ‘I<sup>la</sup> want you<sup>as</sup> to make me<sup>la</sup> taste from these fruits’. So Hawwa<sup>as</sup> said: ‘Adam<sup>as</sup> has made me<sup>as</sup> vow that I<sup>as</sup> would not feed you<sup>la</sup> anything from these plants because these are from the Paradise, and it is not befitting for you<sup>la</sup> that you<sup>la</sup> should be eating from it’. ",
            "So he<sup>la</sup> said to her<sup>as</sup>, ‘So squeeze its juice in my<sup>la</sup> palm, something from it’. But she<sup>as</sup> refused to him<sup>la</sup>. So he<sup>la</sup> said, ‘Allow me<sup>la</sup> to suck from it and I<sup>la</sup> will not eat it’. So she<sup>as</sup> took a cluster of grapes and gave it to him<sup>la</sup>. So he<sup>la</sup> sucked it, and did not eat from it. When Hawwa<sup>as</sup> was assured over it, he<sup>la</sup> went on to bite it, and Hawwa<sup>as</sup> seized it from his<sup>la</sup> mouth. So Allah<sup>azwj</sup> Blessed and High Revealed unto Adam<sup>as</sup>: “The grapes have been sucked by My<sup>azwj</sup> enemy and your<sup>as</sup> enemy Iblees<sup>la</sup>, and I<sup>azwj</sup> have Prohibited upon you<sup>as</sup> from the wine juice what the breath of Iblees<sup>la</sup> had been mixed with”.",
            "Thus, the Prohibition of the wine is because Iblees<sup>la</sup> the enemy of Allah<sup>azwj</sup> had plotted against Hawwa<sup>as</sup> until he<sup>la</sup> sucked the grapes, and had he<sup>la</sup> eaten it, the grapes would have been Prohibited from its beginning to its end, and the entirety of its fruits, and whatever comes out from it’. ",
            "Then he<sup>la</sup> said to Hawwa<sup>as</sup>, ‘If only you<sup>as</sup> would let me<sup>la</sup> suck from these dates just as you<sup>as</sup> let me<sup>la</sup> suck from the grapes’. So she<sup>as</sup> gave him a date. So he<sup>la</sup> touched it, and the grapes and the dates used to be more intensely aromatic and pure than the Al-Azfar musk, and sweeter than the honey. So when Iblees<sup>la</sup> the enemy of Allah<sup>azwj</sup> touched it, both their aromas and their sweetness was reduced’.",
            "Abu Abdullah<sup>asws</sup> said: ‘Then Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>, after the passing away of Adam<sup>as</sup> went and urinated in the roots of the grapes and the palm tree. So the water flowed upon its veins from the urine of the enemy of Allah<sup>azwj</sup>. So from then onwards, the grapes and the dates produced wine. So Allah<sup>azwj</sup> Mighty and Majestic Prohibited upon the offspring of Adam<sup>as</sup>, every intoxicant, because the water flowed by the urine of the enemy of Allah<sup>azwj</sup> in the palm tree and the grapes, and every fermented is wine, because the water fermented in the palm tree and the grape from the smell of the urine of the enemy of Allah<sup>azwj</sup>, Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad has narrated from Salih ibn abu Hammad from af-Husayn ibn Yazid from Ali ibn abu Hamzah from Ibrahim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When Allah, most Majestic, most Glorious, made Adam, ‘Alayhi al-Salam to descend, He commanded him to farm and plant and threw to him a plant from the plant of the garden (paradises). He gave him palm trees, grape vines, olives and pomegranates. He planted them for his offspring and descendents. He ate from its fruits. Iblis, may Allah condemn him, asked, ‘What are these plantations, O Adam, which I did not know of on earth even though I was here before you? Will you allow me to eat from them something?’ Adam, ‘Alayhi al-Salam did not allow him. Iblis came during the end of the life of Adam, ‘Alayhi al-Salam, to Eve saying, ‘I am in a very bad condition because of hunger and thirst.’ Eve asked, ‘What do you want?’ He said, ‘I want you to allow me taste these fruits.’ She said, ‘Adam, ‘Alayhi al-Salam, has made me to promise not to feed you anything from these plantations because it is from the garden (paradises) and it is not proper for you to eat anything from them. He said to her, ‘Squeeze something from them on my palm.’ She refused. He said, ‘Allow me to suck but I will not eat.’ She took one bunch of grapes and gave it to him who sucked but did not eat from it because Eve had stressed on him not to eat. When he was about to bite Eve pulled it out from his mouth and Allah, most Blessed, most High, revealed to Adam, ‘Alayhi al-Salam that My enemy and your enemy, Iblis, has sucked the grape and the juice of wine is unlawful for you which is mixed with the breath of Iblis. Wine became unlawful because of the enemy of Allah, Iblis deceived Eve until he sucked the grape, but if he would eat, grapes would have become unlawful from the beginning to end and all of its fruits and what comes out of it. He then said to Eve, ‘I wish you to allow me to suck from this date as you allowed me to suck the grape. She gave him one date and he sucked it. Grapes and dates had strong smells, finer than musk al -Adhfar (sweet smelling) and sweeter than honey. When the condemned enemy of Allah, Iblis sucked them, their fragrance went away and sweetness reduced.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Iblis, may Allah condemn him, went after the death of Adam, ‘Alayhi al-Salam, and urinated on the root of grape vines and palm trees. Water flowed in their veins of the urine of Iblis, the enemy of Allah; and thereafter grape and dates ferment. Allah, most Majestic, most Glorious, has made it unlawful for the offspring of Adam, ‘Alayhi al-Salam, all intoxicating things because water carried the urine of the enemy of Allah in the palm tree and grape vines. Every fermenting thing becomes wine because water fermented in the palm tree and grape vines and it is because of the urine of the enemy of Allah, Iblis, may Allah condemn him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/249)"
        ],
        "index": 12105,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/251",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/220",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ أَبِي نَصْرٍ عَنْ أَبَانٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:13:3",
        "text": [
          " لَمَّا هَبَطَ نُوحٌ ( عليه السلام ) مِنَ السَّفِينَةِ غَرَسَ غَرْساً وَ كَانَ فِيمَا غَرَسَ ( عليه السلام ) الْحَبَلَةُ ثُمَّ رَجَعَ إِلَى أَهْلِهِ فَجَاءَ إِبْلِيسُ لَعَنَهُ اللَّهُ فَقَلَعَهَا ثُمَّ إِنَّ نُوحاً ( عليه السلام ) عَادَ إِلَى غَرْسِهِ فَوَجَدَهُ عَلَى حَالِهِ وَ وَجَدَ الْحَبَلَةَ قَدْ قُلِعَتْ وَ وَجَدَ إِبْلِيسَ لَعَنَهُ اللَّهُ عِنْدَهَا ",
          "فَأَتَاهُ جَبْرَئِيلُ ( عليه السلام ) فَأَخْبَرَهُ أَنَّ إِبْلِيسَ لَعَنَهُ اللَّهُ قَلَعَهَا فَقَالَ نُوحٌ لِإِبْلِيسَ مَا دَعَاكَ إِلَى قَلْعِهَا فَوَ اللَّهِ مَا غَرَسْتُ غَرْساً أَحَبَّ إِلَيَّ مِنْهَا وَ وَ اللَّهِ لَا أَدَعُهَا حَتَّى أَغْرِسَهَا فَقَالَ إِبْلِيسُ وَ أَنَا وَ اللَّهِ لَا أَدَعُهَا حَتَّى أَقْلَعَهَا ",
          "فَقَالَ لَهُ اجْعَلْ لِي مِنْهَا نَصِيباً قَالَ فَجَعَلَ لَهُ مِنْهَا الثُّلُثَ فَأَبَى أَنْ يَرْضَى فَجَعَلَ لَهُ النِّصْفَ فَأَبَى أَنْ يَرْضَى فَأَبَى نُوحٌ ( عليه السلام ) أَنْ يَزِيدَهُ فَقَالَ جَبْرَئِيلُ ( عليه السلام ) لِنُوحٍ يَا رَسُولَ اللَّهِ أَحْسِنْ فَإِنَّ مِنْكَ الْإِحْسَانَ فَعَلِمَ نُوحٌ ( عليه السلام ) أَنَّهُ قَدْ جَعَلَ لَهُ عَلَيْهَا سُلْطَاناً فَجَعَلَ نُوحٌ ( عليه السلام ) لَهُ الثُّلُثَيْنِ ",
          "فَقَالَ أَبُو جَعْفَرٍ ( عليه السلام ) فَإِذَا أَخَذْتَ عَصِيراً فَاطْبُخْهُ حَتَّى يَذْهَبَ الثُّلُثَانِ وَ كُلْ وَ اشْرَبْ فَذَاكَ نَصِيبُ الشَّيْطَانِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ahmad Bin Muhammad Bin Abu Nasr, from Aban, from Zurara, ",
            "Abu Ja’far<sup>asws</sup> has said: ‘When Noah<sup>as</sup> descended from the ship, planted some plants, and among what he<sup>as</sup> planted was a vine (of grapes). Then he<sup>as</sup> returned to his<sup>as</sup> family. So Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>, came over and uprooted it. Then Noah<sup>as</sup> repeated planting it, but he<sup>as</sup> (later) found it to be upon its state and the vine had been uprooted, and found Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup> by it. ",
            "So Jibraeel<sup>la</sup> came to him<sup>as</sup> and informed him<sup>as</sup> that Iblees<sup>la</sup> had uprooted it. So Noah<sup>as</sup> said to Iblees<sup>la</sup>: ‘What called you to uproot it, for, by Allah<sup>azwj</sup>, I<sup>as</sup> did not plant a plant which was more beloved to me than it, and by Allah<sup>azwj</sup>, I<sup>as</sup> will not leave it until I<sup>as</sup> plant it’. So Iblees<sup>la</sup> said, ‘And I<sup>la</sup>, by Allah<sup>azwj</sup>, will not leave it until I<sup>la</sup> uproot it’. ",
            "He<sup>la</sup> said to him<sup>as</sup>, ‘Make a share for me<sup>la</sup> from it’. So he<sup>as</sup> made a third from it to be for him<sup>la</sup>. But he<sup>la</sup> refused to agree. So he<sup>as</sup> made half of it to be for him<sup>la</sup>. But, he<sup>la</sup> refused to agree. So Noah<sup>as</sup> refused to increase it. So Jibraeel<sup>la</sup> said to Noah<sup>as</sup>: ‘O Rasool<sup>as</sup> of Allah<sup>azwj</sup>! Do a favour, for the favours are from you<sup>as</sup>’. So Noah<sup>as</sup> came to know that he (Jibraeel<sup>as</sup>) had made an authorisation for him<sup>as</sup>. So Noah<sup>as</sup> made two-thirds to be for him<sup>la</sup>.",
            "So Abu Ja’far<sup>asws</sup> said: ‘So whenever you take juice, so cook (boil) it until two-thirds of it goes away, and eat and drink, for that (evaporated two-thirds) is the share of the Satan<sup>la</sup>’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from Ahmad ibn Muhammad from ibn abu Nasr from Aban from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘When Noah, ‘Alayhi al-Salam, disembarked from the ark, he established a plantation and of the things that he planted was a vine of grapes. He went back to his family and Iblis, may he be condemned, uprooted it. Noah, ‘Alayhi al-Salam, went to his plantation. He found everything in its condition except the grape vine that was uprooted. He found Iblis, may he be condemned, nearby. Jibril ‘Alayhi al-Salam, came and informed him that Iblis, may he be condemned, has uprooted it. Noah asked Iblis, ‘What made you to uproot it? None of my plantations is more beloved to me than this. I by Allah will not allow it without being planted? Iblis said, ‘I, by Allah, will not allow it to grow without my uprooting? He asked Noah to give him a share? He (the Imam) said, ‘Noah then gave him a share of one-third but he rejected. He gave him one-half and he rejected. Noah also refused to increase but Jibril ‘Alayhi al-Salam said to Noah, ‘O Messenger of Allah, you should do him a favor because it comes from you? Noah then noticed that the authority over it is given to him so Noah, ‘Alayhi al-Salam left two-thirds for him? Abu Ja‘far, ‘Alayhi al- Salam, has said, ‘If you have grape juice; boil it until two-thirds of it evaporates; then eat and drink and that (which is gone evaporated) is the share of Satan?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/249)"
        ],
        "index": 12106,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/727",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/118",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1776",
              "text": "سَعِيدِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ يَسَارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:13:4",
        "text": [
          " إِنَّ إِبْلِيسَ لَعَنَهُ اللَّهُ نَازَعَ نُوحاً ( عليه السلام ) فِي الْكَرْمِ فَأَتَاهُ جَبْرَئِيلُ ( عليه السلام ) فَقَالَ إِنَّ لَهُ حَقّاً فَأَعْطِهِ فَأَعْطَاهُ الثُّلُثَ فَلَمْ يَرْضَ إِبْلِيسُ ثُمَّ أَعْطَاهُ النِّصْفَ فَلَمْ يَرْضَ فَطَرَحَ جَبْرَئِيلُ نَاراً فَأَحْرَقَتِ الثُّلُثَيْنِ وَ بَقِيَ الثُّلُثُ فَقَالَ مَا أَحْرَقَتِ النَّارُ فَهُوَ نَصِيبُهُ وَ مَا بَقِيَ فَهُوَ لَكَ يَا نُوحُ حَلَالٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Usman Bin Isa, from Saeed Bin Yassar, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘Iblees<sup>la</sup>, may Allah<sup>azwj</sup> Curse him<sup>la</sup>, disputed with Noah<sup>as</sup> regarding the grapes. So Jibraeel<sup>as</sup> came to him<sup>as</sup> and said: ‘There is a right for him<sup>la</sup>, so give him<sup>la</sup>’. So he<sup>as</sup> gave him the one-third. But Iblees<sup>la</sup> did not agree. Then he<sup>as</sup> gave him<sup>la</sup> the half, but he<sup>la</sup> did not agree. So Jibraeel<sup>as</sup> threw the fire, and two-thirds was incinerated, and there remained the one-third. So he<sup>as</sup> said: ‘Whatever the fire incinerated, so it is his<sup>la</sup> share, and whatever remains, so it is Permissible for you<sup>as</sup>, O Noah<sup>as</sup>!"
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash‘ariy has narrated from al-Hassan ibn Ali al-Kufiy from ‘Uthman ibn ‘Isa from Sa‘id ibn Yasar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Iblis, may Allah condemned him, disputed with Noah, ‘Alayhi al-Salam about the grape vine and Jibril, ‘Alayhi al-Salam, came and said, ‘He has a right, so give him? He gave him one-third but he did not agree. He gave one-half but he did not agree. Jibril then threw a fire, which burnt two-thirds and one-third was left. He said, ‘Whatever fire has burnt is his share and what has remained, O Noah, is lawful for you?” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:7:13",
  "kind": "verse_list"
}