{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 7"}, "path": "/books/al-kafi:6:7", "titles": {"ar": "كتاب الْأَشْرِبَةِ", "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "}}, {"indexed_titles": {"en": "Chapter 20"}, "path": "/books/al-kafi:6:7:20", "titles": {"ar": "باب تَحْرِيمِ الْخَمْرِ فِي الْكِتَابِ", "en": "Chapter 20 – Prohibition of the wine in the Book (Holy Quran)"}}], "index": 1879, "local_index": 20, "part_type": "Chapter", "path": "/books/al-kafi:6:7:20", "titles": {"ar": "باب تَحْرِيمِ الْخَمْرِ فِي الْكِتَابِ", "en": "Chapter 20 – Prohibition of the wine in the Book (Holy Quran)"}, "verse_count": 1, "verse_start_index": 12151, "verses": [{"index": 12152, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:7:20:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ بَعْضِ أَصْحَابِنَا وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ سَأَلَ الْمَهْدِيُّ أَبَا الْحَسَنِ ( عليه السلام ) عَنِ الْخَمْرِ هَلْ هِيَ مُحَرَّمَةٌ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ فَإِنَّ النَّاسَ إِنَّمَا يَعْرِفُونَ النَّهْيَ عَنْهَا وَ لَا يَعْرِفُونَ التَّحْرِيمَ لَهَا فَقَالَ لَهُ أَبُو الْحَسَنِ ( عليه السلام ) بَلْ هِيَ مُحَرَّمَةٌ فِي كِتَابِ اللَّهِ عَزَّ وَ جَلَّ يَا أَمِيرَ الْمُؤْمِنِينَ\nفَقَالَ لَهُ فِي أَيِّ مَوْضِعٍ هِيَ مُحَرَّمَةٌ فِي كِتَابِ اللَّهِ جَلَّ اسْمُهُ يَا أَبَا الْحَسَنِ فَقَالَ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ قُلْ إِنَّما حَرَّمَ رَبِّيَ الْفَواحِشَ ما ظَهَرَ مِنْها وَ ما بَطَنَ وَ الْإِثْمَ وَ الْبَغْيَ بِغَيْرِ الْحَقِّ فَأَمَّا قَوْلُهُ ما ظَهَرَ مِنْها يَعْنِي الزِّنَا الْمُعْلَنَ وَ نَصْبَ الرَّايَاتِ الَّتِي كَانَتْ تَرْفَعُهَا الْفَوَاجِرُ لِلْفَوَاحِشِ فِي الْجَاهِلِيَّةِ\nوَ أَمَّا قَوْلُهُ عَزَّ وَ جَلَّ وَ ما بَطَنَ يَعْنِي مَا نَكَحَ مِنَ الْآبَاءِ لِأَنَّ النَّاسَ كَانُوا قَبْلَ أَنْ يُبْعَثَ النَّبِيُّ ( صلى الله عليه وآله ) إِذَا كَانَ لِلرَّجُلِ زَوْجَةٌ وَ مَاتَ عَنْهَا تَزَوَّجَهَا ابْنُهُ مِنْ بَعْدِهِ إِذَا لَمْ تَكُنْ أُمَّهُ فَحَرَّمَ اللَّهُ عَزَّ وَ جَلَّ ذَلِكَ\nوَ أَمَّا الْإِثْمُ فَإِنَّهَا الْخَمْرَةُ بِعَيْنِهَا وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي مَوْضِعٍ آخَرَ يَسْئَلُونَكَ عَنِ الْخَمْرِ وَ الْمَيْسِرِ قُلْ فِيهِما إِثْمٌ كَبِيرٌ وَ مَنافِعُ لِلنَّاسِ فَأَمَّا الْإِثْمُ فِي كِتَابِ اللَّهِ فَهِيَ الْخَمْرَةُ وَ الْمَيْسِرُ وَ إِثْمُهُمَا أَكْبَرُ كَمَا قَالَ اللَّهُ تَعَالَى \nقَالَ فَقَالَ الْمَهْدِيُّ يَا عَلِيَّ بْنَ يَقْطِينٍ هَذِهِ وَ اللَّهِ فَتْوَى هَاشِمِيَّةٌ قَالَ قُلْتُ لَهُ صَدَقْتَ وَ اللَّهِ يَا أَمِيرَ الْمُؤْمِنِينَ الْحَمْدُ لِلَّهِ الَّذِي لَمْ يُخْرِجْ هَذَا الْعِلْمَ مِنْكُمْ أَهْلَ الْبَيْتِ قَالَ فَوَ اللَّهِ مَا صَبَرَ الْمَهْدِيُّ أَنْ قَالَ لِي صَدَقْتَ يَا رَافِضِيُّ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from one of our companions and Ali Bin Ibrahim, from his father, altogether, from Al Hassan Bin Ali Bin Abu Hamza, from his father, from Ali Bin Yaqteen who said, \n‘Al-Mahdy (Al-Mansour the caliph) asked Abu Al-Hassan<sup>asws</sup> about the wine, ‘Is it a Prohibition in the Book of Allah<sup>azwj</sup> Mighty and Majestic, as the people, rather, are recognising the prevention from it and are not understanding the Prohibition of it’. So Abu Al-Hassan<sup>asws</sup> said to him: ‘But it is a Prohibition in the Book of Allah<sup>azwj</sup> Mighty and Majestic, O commander of the faithful!’ \nSo he said to him<sup>asws</sup>, ‘Which place is it Prohibited in the Book of Allah<sup>azwj</sup>, Majestic is His<sup>azwj</sup> Name, O Abu Al Hassan<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘The Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[7:33] Say: But rather, My Lord has only Prohibited the immoralities, whatever is apparent from it as well as those that are concealed, and sin and rebellion without right</span>. So as for His<sup>azwj</sup> Words ‘<span class=\"ibTxt\">whatever is apparent from it</span>’ it Means the adultery committed openly, and the establishment of the flags which the immoral were raising for the immoralities during the Pre-Islamic period’.\nAnd as for the Words of the Mighty and Majestic, <span class=\"ibTxt\">as well as those that are concealed</span>, it Means what the forefathers had married, because the people, before the Sending of the Prophet<sup>saww</sup>, when the man had a wife and he died from her, the son used to marry her from after him, when she did not happen to be his mother. So Allah<sup>azwj</sup> Mighty and Majestic Prohibited that.\nAnd as for <span class=\"ibTxt\">and sin</span>, so there are the wines exactly, and Allah<sup>azwj</sup> Mighty and Majestic had Said in another place <span class=\"ibTxt\">[2:219] They ask you about the wine and the gambling. Say: In both of them there is a great sin and profit for the people</span>. So as for the sin in the Book of Allah<sup>azwj</sup>, so it is the wine and the gambling, and the sins of these two is greater, just as Allah<sup>azwj</sup> the High has Said’. \nHe (the narrator) said, ‘So Al-Mahdy said, ‘O Ali Bin Yaqteen! By Allah<sup>azwj</sup>, these are Hashimite <span class=\"iTxt\">Fatwas</span>’. He (the narrator) said, ‘I said to him, ‘You speak the truth, by Allah<sup>azwj</sup>, O commander of the faithful! The Praise is for Allah<sup>azwj</sup> Whom did not Take away this Knowledge from you, the People<sup>asws</sup> of the Household’. He (the narrator) said, ‘So, by Allah<sup>azwj</sup>, Al-Mahdy could not be patient and he said to me, ‘You speak the truth, of ‘Rafizy’ (rejector)’."}]}]}, "index": "al-kafi:6:7:20", "kind": "verse_list"}