{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:6:7",
        "titles": {
          "ar": "كتاب الْأَشْرِبَةِ",
          "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:6:7:21",
        "titles": {
          "ar": "باب أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَرَّمَ كُلَّ مُسْكِرٍ قَلِيلَهُ وَ كَثِيرَهُ",
          "en": "Chapter 21 – Rasool-Allahsaww prohibited every intoxicant, a little or a lot"
        }
      }
    ],
    "index": 1889,
    "local_index": 21,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:7:21",
    "titles": {
      "ar": "باب أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَرَّمَ كُلَّ مُسْكِرٍ قَلِيلَهُ وَ كَثِيرَهُ",
      "en": "Chapter 21 – Rasool-Allahsaww prohibited every intoxicant, a little or a lot"
    },
    "verse_count": 17,
    "verse_start_index": 12163,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/265)"
        ],
        "index": 12164,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ كُلَيْبٍ الصَّيْدَاوِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ خَطَبَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ فِي خُطْبَتِهِ كُلُّ مُسْكِرٍ حَرَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Kuleyb Al Saydawi who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> addressed (the people) so he<sup>saww</sup> said in his<sup>saww</sup> sermon: ‘Every intoxicant is Prohibited’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Kulayb al-Saydawiy who has said the following: “I once heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, addressed the people in which he (the Messenger of Allah) said, “Every intoxicating liquor is unlawful for consumption.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/265)"
        ],
        "index": 12165,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ خَالِدِ بْنِ جَرِيرٍ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ حَرَّمَ الْخَمْرَ بِعَيْنِهَا فَقَلِيلُهَا وَ كَثِيرُهَا حَرَامٌ كَمَا حَرَّمَ الْمَيْتَةَ وَ الدَّمَ وَ لَحْمَ الْخِنْزِيرِ وَ حَرَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الشَّرَابَ مِنْ كُلِّ مُسْكِرٍ وَ مَا حَرَّمَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَدْ حَرَّمَهُ اللَّهُ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Khalid Bin Jareyr, from Abu Al Rabie Al Shamy who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Prohibited the wine particularly, therefore a little of it or a lot of it, is Prohibited, just as the dead, and the blood, and the flesh of the swine is Prohibited; and Rasool-Allah<sup>saww</sup> Prohibited the drinks from every intoxicant; and whatever Rasool-Allah<sup>saww</sup> prohibited, so it is Prohibited by Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from ibn Mahbub from Khalid ibn Jarir from abu al-Rabi’ al-Shamiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Allah, most Majestic, most Glorious, has made the very substance of wine unlawful, in a small or large quantity. It is unlawful just as dead animals, blood and pork are unlawful. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, made wine unlawful and all intoxicating liquor. Whatever the Messenger of Allah has made unlawful, Allah, most Majestic, most Glorious, also has made it unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/266)"
        ],
        "index": 12166,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:3",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ وَ كُلُّ مُسْكِرٍ خَمْرٌ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ahmad Bin Al Hassan Al Maysami, form Abdul Rahman Bin Zayd Bin Aslam, from his father, from Ata’a Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited and every intoxicant is (classified as) wine (<span class=\"iTxt\">Khamr</span>)’."
          ],
          "en.sarwar": [
            "3. Humayd ibn Ziyad has narrated from has narrated from al-Hassan ibn Muhammad ibn Sama‘ah from Ahmad ibn al-Hassan al- Mithamiy from ‘Abd al-Rahman ibn Zayd ibn Aslam from his father from ‘Ata’ ibn Yasar who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘All intoxicating liquor is unlawful and every intoxicating liquor is wine.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/266)"
        ],
        "index": 12167,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ رَجُلًا مِنْ بَنِي عَمِّي وَ هُوَ رَجُلٌ مِنْ صُلَحَاءِ مَوَالِيكَ أَمَرَنِي أَنْ أَسْأَلَكَ عَنِ النَّبِيذِ فَأَصِفَهُ لَكَ فَقَالَ ( عليه السلام ) لَهُ أَنَا أَصِفُهُ لَكَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ فَمَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ قَالَ قُلْتُ فَقَلِيلُ الْحَرَامِ يُحِلُّهُ كَثِيرُ الْمَاءِ فَرَدَّ عَلَيْهِ بِكَفِّهِ مَرَّتَيْنِ لَا لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muawiya Bin Wahab who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man from the Clan of Umayya, and he is a man from your righteous friends, has instructed me that I should ask you<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so I should described it to you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> shall describe it for you. Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited, therefore whatever, if a lot of it intoxicates, so a little of it is prohibited’. I said, ‘So the little of it is Prohibited, so would it be Permissible if most of it is the water?’ So he<sup>asws</sup> responded to it with his<sup>asws</sup> palm twice: ‘No! No!’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Mu‘awiyah ibn Wahab who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that a man of the virtuous ones among your followers has asked me to ask you about al-Nabidh (wine) so I can describe it for him from you. He (the Imam) said, ‘I describe it for you as the Messenger of Allah has said, ‘Every intoxicating liquor is unlawful and whatever in a large quantity is intoxicating liquor, it in a small amount is unlawful.’ I then asked, ‘Can a large quantity of water make a small quantity of what is unlawful as lawful?’ He (the Imam) then shook his hand like moving back something with the palm of his hand twice, saying, ‘No, no.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/266)"
        ],
        "index": 12168,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:5",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ النَّبِيذِ فَقَالَ حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ الْخَمْرَ بِعَيْنِهَا وَ حَرَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنَ الْأَشْرِبَةِ كُلَّ مُسْكِرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Al Jabbar, from Muhammad Bin Ismail, from Ali Bin Al Noman, from Muhammad Bin Marwan, from Al Fuzayl Bin Yasaar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Prohibited the wine exactly, and Rasool-Allah<sup>saww</sup> prohibited from the drinks of every intoxicant’."
          ],
          "en.sarwar": [
            "5. Abu Ali af-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Muhammad ibn ’Isma‘il from Ali ibn al-Nu’man from Muhammad ibn Marwan from al-Fudayl ibn Yasar who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about al-Nabidh. He (the Imam) said, ‘Allah, most Majestic, most Glorious, had made the very substance of wine unlawful and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has made every intoxicating liquor unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/266)"
        ],
        "index": 12169,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:6",
        "text": [
          "عَنْهُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ كُلَيْبٍ الْأَسَدِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ النَّبِيذِ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) خَطَبَ النَّاسَ فَقَالَ فِي خُطْبَتِهِ أَيُّهَا النَّاسُ أَلَا إِنَّ كُلَّ مُسْكِرٍ حَرَامٌ أَلَا وَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Muhammad Bin Abul Jaaabbar, from Safwan Bin Yahya, from Kuleyb Al Asady who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> addressed the people, so he<sup>saww</sup> said in his<sup>saww</sup> sermon: ‘O you people! Indeed! Every intoxicant is Prohibited. Indeed! And whatever, a lot of it were to intoxicate, so a little of it is Prohibited’."
          ],
          "en.sarwar": [
            "6. It is narrated from the narrator of the previous Hadith from Muhammad ibn ‘Abd Jabbar from Safwan ibn Yahya from Kulayb al- Asadiy who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about al-Nabidh. He (the Imam) said that once the Messenger of Allah addressed the people and said, £ 0 people, all intoxicating liquor is unlawful. You must take notice that whatever in large quantity is intoxicating liquor, it in a small quantity also is unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/267)"
        ],
        "index": 12170,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ صَفْوَانَ الْجَمَّالِ قَالَ كُنْتُ مُبْتَلًى بِالنَّبِيذِ مُعْجَباً بِهِ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ أَصِفُ لَكَ النَّبِيذَ قَالَ فَقَالَ لِي بَلْ أَنَا أَصِفُهُ لَكَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ وَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ فَقُلْتُ لَهُ هَذَا نَبِيذُ السِّقَايَةِ بِفِنَاءِ الْكَعْبَةِ فَقَالَ لِي لَيْسَ هَكَذَا كَانَتِ السِّقَايَةُ إِنَّمَا السِّقَايَةُ زَمْزَمُ ",
          "أَ فَتَدْرِي مَنْ أَوَّلُ مَنْ غَيَّرَهَا قَالَ قُلْتُ لَا قَالَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ كَانَتْ لَهُ حَبَلَةٌ أَ فَتَدْرِي مَا الْحَبَلَةُ قُلْتُ لَا قَالَ الْكَرْمُ فَكَانَ يُنْقِعُ الزَّبِيبَ غُدْوَةً وَ يَشْرَبُونَهُ بِالْعَشِيِّ وَ يُنْقِعُهُ بِالْعَشِيِّ وَ يَشْرَبُونَهُ مِنَ الْغَدِ يُرِيدُ بِهِ أَنْ يَكْسِرَ غِلَظَ الْمَاءِ عَنِ النَّاسِ وَ إِنَّ هَؤُلَاءِ قَدْ تَعَدَّوْا فَلَا تَشْرَبْهُ وَ لَا تَقْرَبْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Safwan Al Jammal who said, ",
            "‘I was indulging with <span class=\"iTxt\">Al-Nabeez</span>, being fascinated by it. So I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I shall describe <span class=\"iTxt\">Al-Nabeez</span> to you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘But, I<sup>asws</sup> shall describe it for you. Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited, and whatever a lot of it were to intoxicate, so a little of it is Prohibited’. So I said to him<sup>asws</sup>, ‘This <span class=\"iTxt\">Nabeez</span> which was served from drinking in the courtyard of the Kabah?’ So he<sup>asws</sup> said to me: ‘It is not like this. The drink, which was served, rather was the drink of Zamzam. ",
            "So do you know who was the first one to change it?’ I said, ‘No’. Al-Abbas Bin Abdul Muttalib. There was <span class=\"iTxt\">Al-Habla</span> for him. Do you know what is <span class=\"iTxt\">Al-Habla</span>?’ I said, ‘No’. He<sup>asws</sup> said: ‘The grape vine. So he used to press the raisins in the morning to be drunk in the evening, and he would press it at evening and would be drunk in the morning, intending by it to reduce the hardness of the water from the people, and that they have exceeded, therefore neither drink it nor go near it’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Safwan al-Jammal who has said the following: “I liked al-Nabidh a great deal and I said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, I want to describe al-Nabidh before you.’ He (the Imam) said, ‘No, allow me to describe it for you. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Every intoxicating liquor is unlawful and whatever in large quantity is intoxicating liquor, it in a small quantity is also unlawful.’” I then asked, ‘What is this al-Nabidh for drinking in the courtyard of al-Ka‘bah?’ He (the Imam) said to me, ‘This was not the drinking place. The drinking place is Zamzam. Do you know who first changed it?’ I replied, ‘No’ He (the Imam) said, ‘Al-‘Abbas ibn ‘Abd al-Muttalib had a Habalah. Do you know what a Habalah is?’ I replied, ‘No, I do not know.’ He (the Imam) said, ‘It is grapes. He would soak raisins in the morning for them to drink it in the evening and soak it in the evening for them to drink in the morning. It was done to reduce the thickness of water for people but these people have crossed the limits so do not drink or go near it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/267)"
        ],
        "index": 12171,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ التَّمْرِ وَ الزَّبِيبِ يُطْبَخَانِ لِلنَّبِيذِ فَقَالَ لَا وَ قَالَ كُلُّ مُسْكِرٍ حَرَامٌ وَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ وَ قَالَ لَا يَصْلُحُ فِي النَّبِيذِ الْخَمِيرَةُ وَ هِيَ الْعَكَرَةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked him<sup>asws</sup> about the dates and the raising both being cooked for <span class=\"iTxt\">Al-Nabeez</span>. So he<sup>asws</sup> said: ‘No’. And he<sup>asws</sup> said: ‘Every intoxicant is Prohibited’. And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Everything which the more of it intoxicates, so the less of it is Prohibited’. And he<sup>asws</sup> said: ‘It is not correct regarding <span class=\"iTxt\">Al-Nabeez</span>, the yeast, and it is the turbid’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ‘Uthman ibn ‘Isa from Sama‘ah who has said the following: “I once asked him (the Imam), ‘Alayhi al-Salam, if dates and raisins can be cooked for al-Nabidh. He (the Imam) said, ‘No.’ He (the Imam) said, ‘All intoxicating liquor is unlawful and the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “Whatever in large quantity is intoxicating liquor, it in a small quantity is also unlawful.’” He (the Imam) said, ‘Al-Khamirah (yeast) which is murky is not proper for al-Nabidh.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/267)"
        ],
        "index": 12172,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ ابْتَدَأَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَوْماً مِنْ غَيْرِ أَنْ أَسْأَلَهُ فَقَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ قَالَ قُلْتُ أَصْلَحَكَ اللَّهُ كُلُّهُ حَرَامٌ فَقَالَ نَعَمْ الْجُرْعَةُ مِنْهُ حَرَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl Bin Yasaar who said, ",
            "‘Abu Abdullah<sup>asws</sup> initiated me one day from without me having asked him<sup>asws</sup>, so he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited’. I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! All of it is Prohibited?’ So he<sup>asws</sup> said: ‘Yes, (even) one dosage from it is prohibited’."
          ],
          "en.sarwar": [
            "9. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah from al-Fudayl ibn Yasar who has said the following: “One day abu ‘Abd Allah, ‘Alayhi al-Salam, initiating from himself and without my asking said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, all intoxicating liquor is unlawful.’ I then asked saying, ‘I pray to Allah to keep you well, is all of it unlawful?’ He (the Imam) said, ‘Yes, even one sip is unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/268)"
        ],
        "index": 12173,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:10",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ جَمِيعاً عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حَرَّمَ اللَّهُ الْخَمْرَةَ قَلِيلَهَا وَ كَثِيرَهَا كَمَا حَرَّمَ الْمَيْتَةَ وَ الدَّمَ وَ لَحْمَ الْخِنْزِيرِ وَ حَرَّمَ النَّبِيُّ ( صلى الله عليه وآله ) مِنَ الْأَشْرِبَةِ الْمُسْكِرَ وَ مَا حَرَّمَ النَّبِيُّ ( صلى الله عليه وآله ) فَقَدْ حَرَّمَهُ اللَّهُ عَزَّ وَ جَلَّ وَ قَالَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhamad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed and Muhammad Bin Ismail, altogether from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Prohibited the wine, a little of it and a lot of it, just as He<sup>azwj</sup> Prohibited the dead, and the blood, and flesh of the swine; and the Prophet<sup>saww</sup> prohibited from drinking the intoxicants, and whatever the Prophet<sup>saww</sup> prohibited, so Allah<sup>azwj</sup> Mighty and Majestic has Prohibited it’. And he<sup>asws</sup> said: ‘Whatever a lot of it intoxicates, so a little of it is prohibited’."
          ],
          "en.sarwar": [
            "10. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id and Muhammad ibn ’Isma‘il all from Muhammad ibn al-Fudayl from abu al-Sabbah al-Kinaniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Allah has made wine unlawful, regardless of its being a small or large quantity as He has made dead animals, blood and pork unlawful. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, of drinks, has made intoxicating liquor unlawful. Whatever the Messenger of Allah has made unlawful Allah, most Majestic, most Glorious, has also made unlawful’, and he (the Imam) said, ‘Whatever in large quantity is intoxicating liquor, it is unlawful in small quantity also.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/268)"
        ],
        "index": 12174,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ اسْتَأْذَنْتُ لِبَعْضِ أَصْحَابِنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ عَنِ النَّبِيذِ فَقَالَ حَلَالٌ فَقَالَ أَصْلَحَكَ اللَّهُ إِنَّمَا سَأَلْتُكَ عَنِ النَّبِيذِ الَّذِي يُجْعَلُ فِيهِ الْعَكَرُ فَيَغْلِي حَتَّى يُسْكِرَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ ",
          "فَقَالَ الرَّجُلُ أَصْلَحَكَ اللَّهُ فَإِنَّ مَنْ عِنْدَنَا بِالْعِرَاقِ يَقُولُونَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) إِنَّمَا عَنَى بِذَلِكَ الْقَدَحَ الَّذِي يُسْكِرُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ فَقَالَ لَهُ الرَّجُلُ فَأَكْسِرُهُ بِالْمَاءِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا وَ مَا لِلْمَاءِ أَنْ يُحَلِّلَ الْحَرَامَ اتَّقِ اللَّهَ عَزَّ وَ جَلَّ وَ لَا تَشْرَبْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘I sought permission for one of our companions to Abu Abdullah<sup>asws</sup>, so he asked him<sup>asws</sup> about <span class=\"iTxt\">Al Nabeez</span>, so he<sup>asws</sup> said: ‘Permissible’. So he said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! But rather I ask you<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span> in which the residue is made to be, so it boils until it intoxicates’. So he<sup>asws</sup> said: ‘So Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited’. ",
            "So the man said, ‘May Allah<sup>azwj</sup> keep you<sup>asws</sup> well! So there are ones with us at Al-Iraq who are saying that Rasool-Allah<sup>saww</sup>, rather meant by that the cup which intoxicates’. So Abu Abdullah<sup>asws</sup> said: ‘Whatever a lot of it were to intoxicate, so a little of it is Prohibited’. So the man said to himasws, ‘Supposing most of it is the water?’ So Abu Abdullah<sup>asws</sup> said: ‘No, and it is not for the water that is should make Permissible (that which is) Prohibited. Fear Allah<sup>azwj</sup> Mighty and Majestic and do not drink it’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘ Abd af-Rahman ibn al-Hajj aj who has said the following: “I once asked for permission from abu ‘Abd Allah, ‘Alayhi al-Salam, for a certain person of our people and he asked him (the Imam) about al-Nabidh. He (the Imam) said, ‘It is lawful.’ He said, ‘I pray to Allah to keep you well, I asked about al-Nabidh which is placed in al-‘Akr (murky) to boil until it becomes intoxicating.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said that the Messenger of Allah has said, ‘All intoxicating liquor is unlawful.’ He said, ‘I pray to Allah to keep you well, among us in Iraq they say that the Messenger of Allah thereby meant the cup that is intoxicating liquor.’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Whatever is intoxicating liquor in large quantity, it is unlawful in small quantity also.’ He (the man) then said, ‘Can I break it (intoxicating effect) with water?’ Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘No, how can water make lawful what is unlawful? Have fear of Allah, most Majestic, most Glorious, and do not drink it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/268)"
        ],
        "index": 12175,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:12",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانٍ قَالَ سَمِعْتُ رَجُلًا يَقُولُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي النَّبِيذِ فَإِنَّ أَبَا مَرْيَمَ يَشْرَبُهُ وَ يَزْعُمُ أَنَّكَ أَمَرْتَ بِشُرْبِهِ فَقَالَ مَعَاذَ اللَّهِ عَزَّ وَ جَلَّ أَنْ أَكُونَ آمُرُ بِشُرْبِ مُسْكِرٍ وَ اللَّهِ إِنَّهُ لَشَيْ‏ءٌ مَا اتَّقَيْتُ فِيهِ سُلْطَاناً وَ لَا غَيْرَهُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ فَمَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hanan who said, ",
            "‘I heard a man saying to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding <span class=\"iTxt\">Al-Nabeez</span>, for Abu Maryam is drinking it, and he claims that you<sup>asws</sup> have ordered with the drinking of it’. So he<sup>asws</sup> said: ‘I seek Refuge with Allah<sup>azwj</sup> Mighty and Majestic that I<sup>asws</sup> would be ordering with the drinking of an intoxicant. By Allah<sup>azwj</sup>! It is for something what I<sup>asws</sup> fear the authorities with regards to it, and not something else. Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited, therefore whatever a lot of it were to intoxicate, so a little of it is Prohibited’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from Hanan who has said the following: “I once heard a man asking abu ‘Abd Allah, ‘Alayhi al-Salam, about al-Nabidh and that abu Maryam drinks it and that he thinks he (the Imam) has commanded him to drink it. He (the Imam) said, ‘I seek protection with Allah, most Majestic, most Glorious, against commanding to drink intoxicating liquor. This by Allah is something about which I do not fear (Taqiyah, use caution before) the Sultan or people other than the Sultan. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘All intoxicating liquor is unlawful. What is intoxicating in large quantity, it is unlawful in small quantity also.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/268)"
        ],
        "index": 12176,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:13",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عَمْرِو بْنِ مَرْوَانَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ هَؤُلَاءِ رُبَّمَا حَضَرْتُ مَعَهُمُ الْعَشَاءَ فَيَجِيئُونَ بِالنَّبِيذِ بَعْدَ ذَلِكَ فَإِنْ أَنَا لَمْ أَشْرَبْهُ خِفْتُ أَنْ يَقُولُوا فُلَانِيٌّ فَكَيْفَ أَصْنَعُ فَقَالَ اكْسِرْهُ بِالْمَاءِ قُلْتُ فَإِذَا أَنَا كَسَرْتُهُ بِالْمَاءِ أَشْرَبُهُ قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Abdul Hameed, from Yunus Bin Yaqoub, from Amro Bin Marwan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup> that they (people), sometimes I am present with them for dinner so they are coming with <span class=\"iTxt\">Al-Nabeez</span> after that. So if I do not drink, I fear that they would be saying, ‘So and so (A Shia)’. So how shall I deal with it?’ So he<sup>asws</sup> said: ‘Break it with the water’. I said, ‘So when I break it with the water, can I drink it (<span class=\"iTxt\">Al Nabeez</span>)?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "13. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn ‘Abd al-Hamid from Yunus ibn Ya‘qub from ‘Amr ibn Marwan who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I may go with these people for dinner and they bring al-Nabidh thereafter. If I do not drink I fear they may say, ‘He is of so and so (Ja‘fariy). What must I do in such case?’ He (the Imam) said, ‘You can break it with water.’ I then asked, ‘When I break it with water can I then drink it?’ He (the Imam) said, ‘No, you cannot drink.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/269)"
        ],
        "index": 12177,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:14",
        "text": [
          "سَهْلُ بْنُ زِيَادٍ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبِي خِدَاشٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَبْدَةَ النَّيْسَابُورِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْقَدَحُ مِنَ النَّبِيذِ وَ الْقَدَحُ مِنَ الْخَمْرِ سَوَاءٌ فَقَالَ نَعَمْ سَوَاءٌ قُلْتُ فَالْحَدُّ فِيهِمَا سَوَاءٌ فَقَالَ سَوَاءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Sahl Bin Ziyad, from Ali Bin Ma’bad, from Al Hassan Bin Ali, from Abu Kihdash, from Ali Bin Ismai, from Muhammad Bin Ababda Al Nayshapoyri who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The cup of <span class=\"iTxt\">Al-Nabeez</span>, and the cup of the wine are equal?’ So he<sup>asws</sup> said: ‘Yes, equal’. I said, ‘So the legal penalty (<span class=\"iTxt\">Hadd</span>) with regards to the both of them is the same?’ So he<sup>asws</sup> said: ‘Same’."
          ],
          "en.sarwar": [
            "14. Sahl ibn Ziyad has narrated from Ali ibn Ma’bad from al-Hassan ibn Ali from abu Khidash from Ali ibn ’Isma‘il from Muhammad ibn ‘Abdah al-Naysaburiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, if a cup of wine and a cup of al-Nabidh are equal. He (the Imam) said, ‘Yes, they are equal.’ I then asked if the penalty is also the same. He (the Imam) said, ‘It is equal.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/269)"
        ],
        "index": 12178,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:15",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي الْمَغْرَاءِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَرَى فِي قَدَحٍ مِنْ مُسْكِرٍ يُصَبُّ عَلَيْهِ الْمَاءُ حَتَّى تَذْهَبَ عَادِيَتُهُ وَ يَذْهَبَ سُكْرُهُ فَقَالَ لَا وَ اللَّهِ وَ لَا قَطْرَةٌ تَقْطُرُ مِنْهُ فِي حُبٍّ إِلَّا أُهَرِيقَ ذَلِكَ الْحُبُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ali Bin Al Hakam, from Abu Al Magra, from Umar Bin Hanzala who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is your<sup>asws</sup> view regarding a cup of an intoxicant upon which the water is poured, its normality goes away, and its intoxication goes away’. So he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>, and there is no drop which drops into a container except that container must be emptied’."
          ],
          "en.sarwar": [
            "15. A number of our people have narrated from Sahl ibn Ziyad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from Ali ibn al-Hakam from abu al-Mighra’ from ‘Umar ibn Hanzalah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a cup of intoxicating liquor on which water is poured until its bad effect is gone and also its intoxicating effect. He (the Imam) said, ‘No, by Allah, even if one drop of it is dropped in a hub (a large water container) the whole hub must be thrown out.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف كالموثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/269)"
        ],
        "index": 12179,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:16",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ يَزِيدَ بْنِ خَلِيفَةَ وَ هُوَ رَجُلٌ مِنْ بَنِي الْحَارِثِ بْنِ كَعْبٍ قَالَ سَمِعْتُهُ يَقُولُ أَتَيْتُ الْمَدِينَةَ وَ زِيَادُ بْنُ عُبَيْدِ اللَّهِ الْحَارِثِيُّ عَلَيْهَا فَاسْتَأْذَنْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلْتُ عَلَيْهِ وَ سَلَّمْتُ عَلَيْهِ وَ تَمَكَّنْتُ مِنْ مَجْلِسِي قَالَ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي رَجُلٌ مِنْ بَنِي الْحَارِثِ بْنِ كَعْبٍ وَ قَدْ هَدَانِي اللَّهُ عَزَّ وَ جَلَّ إِلَى مَحَبَّتِكُمْ وَ مَوَدَّتِكُمْ أَهْلَ الْبَيْتِ قَالَ فَقَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ كَيْفَ اهْتَدَيْتَ إِلَى مَوَدَّتِنَا أَهْلَ الْبَيْتِ فَوَ اللَّهِ إِنَّ مَحَبَّتَنَا فِي بَنِي الْحَارِثِ بْنِ كَعْبٍ لَقَلِيلٌ ",
          "قَالَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّ لِي غُلَاماً خُرَاسَانِيّاً وَ هُوَ يَعْمَلُ الْقِصَارَةَ وَ لَهُ هَمْشَهْرِيجُونَ أَرْبَعَةٌ وَ هُمْ يَتَدَاعَوْنَ كُلَّ جُمُعَةٍ فَيَقَعُ الدَّعْوَةُ عَلَى رَجُلٍ مِنْهُمْ فَيُصِيبُ غُلَامِي كُلَّ خَمْسِ جُمَعٍ جُمُعَةٌ فَيَجْعَلُ لَهُمُ النَّبِيذَ وَ اللَّحْمَ قَالَ ثُمَّ إِذَا فَرَغُوا مِنَ الطَّعَامِ وَ اللَّحْمِ جَاءَ بِإِجَّانَةٍ فَمَلَأَهَا نَبِيذاً ثُمَّ جَاءَ بِمِطْهَرَةٍ فَإِذَا نَاوَلَ إِنْسَاناً مِنْهُمْ قَالَ لَهُ لَا تَشْرَبْ حَتَّى تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ فَاهْتَدَيْتُ إِلَى مَوَدَّتِكُمْ بِهَذَا الْغُلَامِ",
          "قَالَ فَقَالَ لِي اسْتَوْصِ بِهِ خَيْراً وَ أَقْرِئْهُ مِنِّي السَّلَامَ وَ قُلْ لَهُ يَقُولُ لَكَ جَعْفَرُ بْنُ مُحَمَّدٍ انْظُرْ شَرَابَكَ هَذَا الَّذِي تَشْرَبُهُ فَإِنْ كَانَ يُسْكِرُ كَثِيرُهُ فَلَا تَقْرَبَنَّ قَلِيلَهُ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ كُلُّ مُسْكِرٍ حَرَامٌ وَ قَالَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ",
          "قَالَ فَجِئْتُ إِلَى الْكُوفَةِ وَ أَقْرَأْتُ الْغُلَامَ السَّلَامَ مِنْ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) قَالَ فَبَكَى ثُمَّ قَالَ لِي اهْتَمَّ بِي جَعْفَرُ بْنُ مُحَمَّدٍ ( عليه السلام ) حَتَّى يُقْرِئُنِي السَّلَامَ قَالَ قُلْتُ نَعَمْ وَ قَدْ قَالَ لِي قُلْ لَهُ انْظُرْ شَرَابَكَ هَذَا الَّذِي تَشْرَبُهُ فَإِنْ كَانَ يُسْكِرُ كَثِيرُهُ فَلَا تَقْرَبَنَّ قَلِيلَهُ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ كُلُّ مُسْكِرٍ حَرَامٌ وَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ وَ قَدْ أَوْصَانِي بِكَ فَاذْهَبْ فَأَنْتَ حُرٌّ لِوَجْهِ اللَّهِ تَعَالَى قَالَ فَقَالَ الْغُلَامُ وَ اللَّهِ إِنَّهُ لَشَرَابٌ مَا يَدْخُلُ جَوْفِي مَا بَقِيتُ فِي الدُّنْيَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, and Ali Bin Ibrahim, from his father, from Hanan Bin Sudeyr, from Yazeed Bin Khalifa , and he is a man from the Clan of Al Haris Bin Ka’ab who said, ",
            "‘I heard him saying, ‘I went to Al-Medina and Ziyad Bin Ubeyd Al-Harisy was over it (the governor). So I sought permission to Abu Abdullah<sup>asws</sup>, and I went over to him<sup>asws</sup>, and greeted him<sup>asws</sup>, and managed to sit in my (normal) place. So I said to Abu Abdullah<sup>asws</sup>, ‘I am a man from the Clan of Al-Haris Bin Ka’ab, and Allah<sup>azwj</sup> Mighty and Majestic has Guided me to your<sup>asws</sup> love and cordiality for you<sup>asws</sup>, the People<sup>asws</sup> of the Household’. So Abu Abdullah<sup>asws</sup> said to me: ‘And how have you been Guided to our<sup>asws</sup> cordiality, the People<sup>asws</sup> of the Household, for by Allah<sup>azwj</sup>, our<sup>asws</sup> love in the Clan of Al-Haris Bin Ka’ab, is scarce’.",
            "He (the narrator) said, ‘So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! There is a slave of mine, from Khurasan, and he is a bleacher and for him are four fellow countrymen, and they tend to invite each other every Friday. So the invitation occurs upon a man from them, and the turn comes to my slave every five Fridays. So he makes <span class=\"iTxt\">Al-Nabeez</span> for them, and the meat. He said that when they are free from the meal and the meat, he comes with a bowl and fills it with <span class=\"iTxt\">Al-Nabeez</span>. Then he comes with a clean jug. So when a person from them takes it, it is said to him, ‘Do not drink it until you send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> (<span class=\"iTxt\">Salawaat</span>)’. Thus I was guided towards your<sup>asws</sup> loved by this slave’.",
            "He (the narrator) said, ‘So he<sup>saww</sup> said to me: ‘Iasws advise you to be good with him and convey the greetings from me<sup>asws</sup>, and say to him that Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> is saying to you: ‘Consider this drink which you are drinking, for if a lot of it were to intoxicate, so do not go near the little of it, for Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited’, and said: ‘Whatever a lot of it intoxicates, so a little of it is prohibited’.",
            "He (the narrator) said, ‘So I went to Al-Kufa and I conveyed the slave, the greetings from Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>. So he wept, then said to me, ‘Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> attached such importance to me to the extent that he<sup>asws</sup> conveyed the greetings to me?’ I said, ‘Yes, and he<sup>asws</sup> has told to me to tell you: ‘Consider this drink of yours which you are drinking it, for if it was such that a lot of it were to intoxicate, so do not go near a little of it, for Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited, and whatever a lot of it intoxicates, so a little of it is prohibited’, and he<sup>asws</sup> advised me regarding you. Therefore go, for you are free for the Face of Allah<sup>azwj</sup> the High’. So the slave said, ‘By Allah<sup>azwj</sup>! It is a drink which will not enter inside me for as long as I remain in the world’."
          ],
          "en.sarwar": [
            "16. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il and Ali ibn Ibrahim has narrated from his father from Hanan ibn Sadir from Yazid ibn Khalifah and he is a man from banu al-Harith ibn Ka‘b who has said the following: “I once went to al-Madinah when Ziyad ibn ‘Ubayd Allah al-Harithiy was the governor. I asked permission to visit abu ‘ Abd Allah, ‘Alayhi al-Salam. I then visited and offered him (the Imam) the greeting of peace and took my place. I then said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I am from banu al-Harith ibn Ka‘b and Allah, most Majestic, most Glorious, has granted me guidance to your love and affection toward Ah/ al-Bayt. He (the narrator) has said that abu ‘Abd Allah, ‘Alayhi al-Salam, then asked, ‘How were you guided to love of Ahl al- Bayt? By Allah our love in banu al-Harith ibn Ka‘b is very little.’ He (the narrator) has said that I then said, ‘I pray to Allah to keep my soul in service for your cause, I have a Khurasaniy slave. He works as bleacher and he has four fellows from his town. They invite each other every Friday to the place of one of them. In every five Fridays, my slave has one day and he prepares al-Nabidh and meat for them. When they finish food and meat he brings a bowl and fills it with al-Nabidh, then brings a jug, when one of them wants to drink he is told not to drink until he says, ‘O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’ I received guidance to loving you because of this slave. He (the narrator) has said that he (the Imam) said to me, ‘Give him good advice, convey my greeting of peace to him and say to him, ‘Ja‘far ibn Muhammad says to you, “You must look into the drink that you drink. If a large quantity of it is intoxicating liquor then do not go close to its small quantity also; the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘All intoxicating liquor is unlawful.’ He (the Messenger of Allah) said, ‘Whatever is intoxicating liquor in large quantity, it in a small quantity is also unlawful.”” He (the narrator) has said that I went to al-Kufah and conveyed the greeting of peace to him from Ja‘far ibn Muhammad, ‘Alayhi al-Salam. He wept and asked me, ‘Did Ja‘far ibn Muhammad pay this much attention to me? He (the Imam) offered to me the greeting of peace! ’ I then said, ‘Yes, he (the Imam) did and he (the Imam) instructed me to inform you that you must look to the drink which you drink. If it is intoxicating liquor in large quantity, then do not go near to its small quantity; the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “All intoxicating liquor is unlawful and whatever is intoxicating liquor in large quantity is unlawful in small quantity also.” He (the Imam) has recommended me to be good to you. Therefore, I set you free. You can go free for the sake of Allah, most High.’ The slave then said, ‘It is the kind of drink that will never go in my belly as long as I live in this world.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/270)"
        ],
        "index": 12180,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:21:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ كُلَيْبِ بْنِ مُعَاوِيَةَ قَالَ كَانَ أَبُو بَصِيرٍ وَ أَصْحَابُهُ يَشْرَبُونَ النَّبِيذَ يَكْسِرُونَهُ بِالْمَاءِ فَحَدَّثْتُ بِذَلِكَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لِي وَ كَيْفَ صَارَ الْمَاءُ يُحَلِّلُ الْمُسْكِرَ مُرْهُمْ لَا يَشْرَبُوا مِنْهُ قَلِيلًا وَ لَا كَثِيراً قُلْتُ إِنَّهُمْ يَذْكُرُونَ أَنَّ الرِّضَا مِنْ آلِ مُحَمَّدٍ يُحِلُّهُ لَهُمْ فَقَالَ وَ كَيْفَ كَانَ يُحِلُّونَ آلُ مُحَمَّدٍ ( عليه السلام ) الْمُسْكِرَ وَ هُمْ لَا يَشْرَبُونَ مِنْهُ قَلِيلًا وَ لَا كَثِيراً فَأَمْسِكُوا عَنْ شُرْبِهِ ",
          "فَاجْتَمَعْنَا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ إِنَّ ذَا جَاءَنَا عَنْكَ بِكَذَا وَ كَذَا فَقَالَ ( عليه السلام ) صَدَقَ يَا أَبَا مُحَمَّدٍ إِنَّ الْمَاءَ لَا يُحَلِّلُ الْمُسْكِرَ فَلَا تَشْرَبُوا مِنْهُ قَلِيلًا وَ لَا كَثِيراً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahy, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Kuleyb Bin Muawiya who said, ",
            "‘Abu Baseer and his companions were drinking <span class=\"iTxt\">Al Nabeez</span>, breaking it with the water. So I discussed that with Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘And how can the water make Permissible the Prohibited intoxicant. Do not be drinking from it, neither a little nor a lot’. I said, ‘They are mentioning that the approval of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> makes it Permissible for them’. So he<sup>asws</sup> said: ‘And how could the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> have Permitted the intoxicant, and they<sup>asws</sup> are not drinking from it, neither a little nor a lot? Refrain from drinking it’. ",
            "So we gathered in the presence of Abu Abdullah<sup>asws</sup>, and Abu Baseer said to him<sup>asws</sup>, ‘They have come to us from you<sup>asws</sup> with such and such’. So he<sup>asws</sup> said: ‘True, O Abu Muhammad! The water cannot make permissible the intoxicant, therefore do not drink from it, neither a little nor a lot’."
          ],
          "en.sarwar": [
            "17. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from Kulayb ibn Mu‘awiyah has said the following: “Abu Basir and his friends drank al-Nabidh and they broke it with water. I mentioned it before abu ‘Abd Allah, ‘Alayhi al-Salam, and he (the Imam) said to me, ‘How can water make intoxicating liquor lawful? Command them not to drink from it in large or small quantities.’ I then said that they say, ‘The approval of the family of Muhammad makes it lawful for them.’ He (the Imam) said, ‘Why should family of Muhammad make intoxicating liquor lawful when they do not drink it in large or small quantities? You must refrain from drinking it.’ We then came together before abu ‘Abd Allah, ‘Alayhi al-Salam, and abu Basir said, ‘This has come to us from you as such and such.’ He (the Imam, ‘Alayhi al-Salam ) said, ‘You must accept it as true, O abu Muhammad, water does not make intoxicating liquor lawful. You must not drink it in large or small quantities.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:7:21",
  "kind": "verse_list"
}