{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 7"}, "path": "/books/al-kafi:6:7", "titles": {"ar": "كتاب الْأَشْرِبَةِ", "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "}}, {"indexed_titles": {"en": "Chapter 21"}, "path": "/books/al-kafi:6:7:21", "titles": {"ar": "باب أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَرَّمَ كُلَّ مُسْكِرٍ قَلِيلَهُ وَ كَثِيرَهُ", "en": "Chapter 21 – Rasool-Allahsaww prohibited every intoxicant, a little or a lot"}}], "index": 1880, "local_index": 21, "part_type": "Chapter", "path": "/books/al-kafi:6:7:21", "titles": {"ar": "باب أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَرَّمَ كُلَّ مُسْكِرٍ قَلِيلَهُ وَ كَثِيرَهُ", "en": "Chapter 21 – Rasool-Allahsaww prohibited every intoxicant, a little or a lot"}, "verse_count": 17, "verse_start_index": 12152, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 12153, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ كُلَيْبٍ الصَّيْدَاوِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ خَطَبَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ فِي خُطْبَتِهِ كُلُّ مُسْكِرٍ حَرَامٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Kuleyb Al Saydawi who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> addressed (the people) so he<sup>saww</sup> said in his<sup>saww</sup> sermon: ‘Every intoxicant is Prohibited’."]}}, {"index": 12154, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ خَالِدِ بْنِ جَرِيرٍ عَنْ أَبِي الرَّبِيعِ الشَّامِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ حَرَّمَ الْخَمْرَ بِعَيْنِهَا فَقَلِيلُهَا وَ كَثِيرُهَا حَرَامٌ كَمَا حَرَّمَ الْمَيْتَةَ وَ الدَّمَ وَ لَحْمَ الْخِنْزِيرِ وَ حَرَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الشَّرَابَ مِنْ كُلِّ مُسْكِرٍ وَ مَا حَرَّمَهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَدْ حَرَّمَهُ اللَّهُ عَزَّ وَ جَلَّ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Khalid Bin Jareyr, from Abu Al Rabie Al Shamy who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Prohibited the wine particularly, therefore a little of it or a lot of it, is Prohibited, just as the dead, and the blood, and the flesh of the swine is Prohibited; and Rasool-Allah<sup>saww</sup> Prohibited the drinks from every intoxicant; and whatever Rasool-Allah<sup>saww</sup> prohibited, so it is Prohibited by Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 12155, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:3", "text": ["حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ أَسْلَمَ عَنْ أَبِيهِ عَنْ عَطَاءِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ وَ كُلُّ مُسْكِرٍ خَمْرٌ."], "translations": {"en.hubeali": ["Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ahmad Bin Al Hassan Al Maysami, form Abdul Rahman Bin Zayd Bin Aslam, from his father, from Ata’a Bin Yasaar, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited and every intoxicant is (classified as) wine (<span class=\"iTxt\">Khamr</span>)’."]}}, {"index": 12156, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ مُعَاوِيَةَ بْنِ وَهْبٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ رَجُلًا مِنْ بَنِي عَمِّي وَ هُوَ رَجُلٌ مِنْ صُلَحَاءِ مَوَالِيكَ أَمَرَنِي أَنْ أَسْأَلَكَ عَنِ النَّبِيذِ فَأَصِفَهُ لَكَ فَقَالَ ( عليه السلام ) لَهُ أَنَا أَصِفُهُ لَكَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ فَمَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ قَالَ قُلْتُ فَقَلِيلُ الْحَرَامِ يُحِلُّهُ كَثِيرُ الْمَاءِ فَرَدَّ عَلَيْهِ بِكَفِّهِ مَرَّتَيْنِ لَا لَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Muawiya Bin Wahab who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man from the Clan of Umayya, and he is a man from your righteous friends, has instructed me that I should ask you<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so I should described it to you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> shall describe it for you. Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited, therefore whatever, if a lot of it intoxicates, so a little of it is prohibited’. I said, ‘So the little of it is Prohibited, so would it be Permissible if most of it is the water?’ So he<sup>asws</sup> responded to it with his<sup>asws</sup> palm twice: ‘No! No!’."]}}, {"index": 12157, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:5", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ مُحَمَّدِ بْنِ مَرْوَانَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ النَّبِيذِ فَقَالَ حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ الْخَمْرَ بِعَيْنِهَا وَ حَرَّمَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنَ الْأَشْرِبَةِ كُلَّ مُسْكِرٍ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Al Jabbar, from Muhammad Bin Ismail, from Ali Bin Al Noman, from Muhammad Bin Marwan, from Al Fuzayl Bin Yasaar, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Prohibited the wine exactly, and Rasool-Allah<sup>saww</sup> prohibited from the drinks of every intoxicant’."]}}, {"index": 12158, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:6", "text": ["عَنْهُ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ كُلَيْبٍ الْأَسَدِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ النَّبِيذِ فَقَالَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) خَطَبَ النَّاسَ فَقَالَ فِي خُطْبَتِهِ أَيُّهَا النَّاسُ أَلَا إِنَّ كُلَّ مُسْكِرٍ حَرَامٌ أَلَا وَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ."], "translations": {"en.hubeali": ["From him, from Muhammad Bin Abul Jaaabbar, from Safwan Bin Yahya, from Kuleyb Al Asady who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> addressed the people, so he<sup>saww</sup> said in his<sup>saww</sup> sermon: ‘O you people! Indeed! Every intoxicant is Prohibited. Indeed! And whatever, a lot of it were to intoxicate, so a little of it is Prohibited’."]}}, {"index": 12159, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ صَفْوَانَ الْجَمَّالِ قَالَ كُنْتُ مُبْتَلًى بِالنَّبِيذِ مُعْجَباً بِهِ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) جُعِلْتُ فِدَاكَ أَصِفُ لَكَ النَّبِيذَ قَالَ فَقَالَ لِي بَلْ أَنَا أَصِفُهُ لَكَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ وَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ فَقُلْتُ لَهُ هَذَا نَبِيذُ السِّقَايَةِ بِفِنَاءِ الْكَعْبَةِ فَقَالَ لِي لَيْسَ هَكَذَا كَانَتِ السِّقَايَةُ إِنَّمَا السِّقَايَةُ زَمْزَمُ ", "أَ فَتَدْرِي مَنْ أَوَّلُ مَنْ غَيَّرَهَا قَالَ قُلْتُ لَا قَالَ الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ كَانَتْ لَهُ حَبَلَةٌ أَ فَتَدْرِي مَا الْحَبَلَةُ قُلْتُ لَا قَالَ الْكَرْمُ فَكَانَ يُنْقِعُ الزَّبِيبَ غُدْوَةً وَ يَشْرَبُونَهُ بِالْعَشِيِّ وَ يُنْقِعُهُ بِالْعَشِيِّ وَ يَشْرَبُونَهُ مِنَ الْغَدِ يُرِيدُ بِهِ أَنْ يَكْسِرَ غِلَظَ الْمَاءِ عَنِ النَّاسِ وَ إِنَّ هَؤُلَاءِ قَدْ تَعَدَّوْا فَلَا تَشْرَبْهُ وَ لَا تَقْرَبْهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Safwan Al Jammal who said, ", "‘I was indulging with <span class=\"iTxt\">Al-Nabeez</span>, being fascinated by it. So I said to Abu Abdullah<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! I shall describe <span class=\"iTxt\">Al-Nabeez</span> to you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘But, I<sup>asws</sup> shall describe it for you. Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited, and whatever a lot of it were to intoxicate, so a little of it is Prohibited’. So I said to him<sup>asws</sup>, ‘This <span class=\"iTxt\">Nabeez</span> which was served from drinking in the courtyard of the Kabah?’ So he<sup>asws</sup> said to me: ‘It is not like this. The drink, which was served, rather was the drink of Zamzam. ", "So do you know who was the first one to change it?’ I said, ‘No’. Al-Abbas Bin Abdul Muttalib. There was <span class=\"iTxt\">Al-Habla</span> for him. Do you know what is <span class=\"iTxt\">Al-Habla</span>?’ I said, ‘No’. He<sup>asws</sup> said: ‘The grape vine. So he used to press the raisins in the morning to be drunk in the evening, and he would press it at evening and would be drunk in the morning, intending by it to reduce the hardness of the water from the people, and that they have exceeded, therefore neither drink it nor go near it’."]}}, {"index": 12160, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:8", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنِ التَّمْرِ وَ الزَّبِيبِ يُطْبَخَانِ لِلنَّبِيذِ فَقَالَ لَا وَ قَالَ كُلُّ مُسْكِرٍ حَرَامٌ وَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ وَ قَالَ لَا يَصْلُحُ فِي النَّبِيذِ الْخَمِيرَةُ وَ هِيَ الْعَكَرَةُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Sama’at who said, ", "‘I asked him<sup>asws</sup> about the dates and the raising both being cooked for <span class=\"iTxt\">Al-Nabeez</span>. So he<sup>asws</sup> said: ‘No’. And he<sup>asws</sup> said: ‘Every intoxicant is Prohibited’. And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Everything which the more of it intoxicates, so the less of it is Prohibited’. And he<sup>asws</sup> said: ‘It is not correct regarding <span class=\"iTxt\">Al-Nabeez</span>, the yeast, and it is the turbid’."]}}, {"index": 12161, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:9", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ عَنِ الْفُضَيْلِ بْنِ يَسَارٍ قَالَ ابْتَدَأَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَوْماً مِنْ غَيْرِ أَنْ أَسْأَلَهُ فَقَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ قَالَ قُلْتُ أَصْلَحَكَ اللَّهُ كُلُّهُ حَرَامٌ فَقَالَ نَعَمْ الْجُرْعَةُ مِنْهُ حَرَامٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina, from Al Fuzayl Bin Yasaar who said, ", "‘Abu Abdullah<sup>asws</sup> initiated me one day from without me having asked him<sup>asws</sup>, so he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited’. I said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! All of it is Prohibited?’ So he<sup>asws</sup> said: ‘Yes, (even) one dosage from it is prohibited’."]}}, {"index": 12162, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:10", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ جَمِيعاً عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) حَرَّمَ اللَّهُ الْخَمْرَةَ قَلِيلَهَا وَ كَثِيرَهَا كَمَا حَرَّمَ الْمَيْتَةَ وَ الدَّمَ وَ لَحْمَ الْخِنْزِيرِ وَ حَرَّمَ النَّبِيُّ ( صلى الله عليه وآله ) مِنَ الْأَشْرِبَةِ الْمُسْكِرَ وَ مَا حَرَّمَ النَّبِيُّ ( صلى الله عليه وآله ) فَقَدْ حَرَّمَهُ اللَّهُ عَزَّ وَ جَلَّ وَ قَالَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ."], "translations": {"en.hubeali": ["Muhamad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Husayn Bin Saeed and Muhammad Bin Ismail, altogether from Muhammad Bin Al Fuzayl, from Abu Al Sabbah Al Kinany who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Prohibited the wine, a little of it and a lot of it, just as He<sup>azwj</sup> Prohibited the dead, and the blood, and flesh of the swine; and the Prophet<sup>saww</sup> prohibited from drinking the intoxicants, and whatever the Prophet<sup>saww</sup> prohibited, so Allah<sup>azwj</sup> Mighty and Majestic has Prohibited it’. And he<sup>asws</sup> said: ‘Whatever a lot of it intoxicates, so a little of it is prohibited’."]}}, {"index": 12163, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:11", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ اسْتَأْذَنْتُ لِبَعْضِ أَصْحَابِنَا عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَسَأَلَهُ عَنِ النَّبِيذِ فَقَالَ حَلَالٌ فَقَالَ أَصْلَحَكَ اللَّهُ إِنَّمَا سَأَلْتُكَ عَنِ النَّبِيذِ الَّذِي يُجْعَلُ فِيهِ الْعَكَرُ فَيَغْلِي حَتَّى يُسْكِرَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ ", "فَقَالَ الرَّجُلُ أَصْلَحَكَ اللَّهُ فَإِنَّ مَنْ عِنْدَنَا بِالْعِرَاقِ يَقُولُونَ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) إِنَّمَا عَنَى بِذَلِكَ الْقَدَحَ الَّذِي يُسْكِرُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ فَقَالَ لَهُ الرَّجُلُ فَأَكْسِرُهُ بِالْمَاءِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا وَ مَا لِلْمَاءِ أَنْ يُحَلِّلَ الْحَرَامَ اتَّقِ اللَّهَ عَزَّ وَ جَلَّ وَ لَا تَشْرَبْهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, ", "‘I sought permission for one of our companions to Abu Abdullah<sup>asws</sup>, so he asked him<sup>asws</sup> about <span class=\"iTxt\">Al Nabeez</span>, so he<sup>asws</sup> said: ‘Permissible’. So he said, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! But rather I ask you<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span> in which the residue is made to be, so it boils until it intoxicates’. So he<sup>asws</sup> said: ‘So Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited’. ", "So the man said, ‘May Allah<sup>azwj</sup> keep you<sup>asws</sup> well! So there are ones with us at Al-Iraq who are saying that Rasool-Allah<sup>saww</sup>, rather meant by that the cup which intoxicates’. So Abu Abdullah<sup>asws</sup> said: ‘Whatever a lot of it were to intoxicate, so a little of it is Prohibited’. So the man said to himasws, ‘Supposing most of it is the water?’ So Abu Abdullah<sup>asws</sup> said: ‘No, and it is not for the water that is should make Permissible (that which is) Prohibited. Fear Allah<sup>azwj</sup> Mighty and Majestic and do not drink it’."]}}, {"index": 12164, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:12", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانٍ قَالَ سَمِعْتُ رَجُلًا يَقُولُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي النَّبِيذِ فَإِنَّ أَبَا مَرْيَمَ يَشْرَبُهُ وَ يَزْعُمُ أَنَّكَ أَمَرْتَ بِشُرْبِهِ فَقَالَ مَعَاذَ اللَّهِ عَزَّ وَ جَلَّ أَنْ أَكُونَ آمُرُ بِشُرْبِ مُسْكِرٍ وَ اللَّهِ إِنَّهُ لَشَيْ‏ءٌ مَا اتَّقَيْتُ فِيهِ سُلْطَاناً وَ لَا غَيْرَهُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ فَمَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Hanan who said, ", "‘I heard a man saying to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding <span class=\"iTxt\">Al-Nabeez</span>, for Abu Maryam is drinking it, and he claims that you<sup>asws</sup> have ordered with the drinking of it’. So he<sup>asws</sup> said: ‘I seek Refuge with Allah<sup>azwj</sup> Mighty and Majestic that I<sup>asws</sup> would be ordering with the drinking of an intoxicant. By Allah<sup>azwj</sup>! It is for something what I<sup>asws</sup> fear the authorities with regards to it, and not something else. Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited, therefore whatever a lot of it were to intoxicate, so a little of it is Prohibited’."]}}, {"index": 12165, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:13", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْحَمِيدِ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ عَمْرِو بْنِ مَرْوَانَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ هَؤُلَاءِ رُبَّمَا حَضَرْتُ مَعَهُمُ الْعَشَاءَ فَيَجِيئُونَ بِالنَّبِيذِ بَعْدَ ذَلِكَ فَإِنْ أَنَا لَمْ أَشْرَبْهُ خِفْتُ أَنْ يَقُولُوا فُلَانِيٌّ فَكَيْفَ أَصْنَعُ فَقَالَ اكْسِرْهُ بِالْمَاءِ قُلْتُ فَإِذَا أَنَا كَسَرْتُهُ بِالْمَاءِ أَشْرَبُهُ قَالَ لَا ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Abdul Hameed, from Yunus Bin Yaqoub, from Amro Bin Marwan who said, ", "‘I said to Abu Abdullah<sup>asws</sup> that they (people), sometimes I am present with them for dinner so they are coming with <span class=\"iTxt\">Al-Nabeez</span> after that. So if I do not drink, I fear that they would be saying, ‘So and so (A Shia)’. So how shall I deal with it?’ So he<sup>asws</sup> said: ‘Break it with the water’. I said, ‘So when I break it with the water, can I drink it (<span class=\"iTxt\">Al Nabeez</span>)?’ He<sup>asws</sup> said: ‘No’."]}}, {"index": 12166, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:14", "text": ["سَهْلُ بْنُ زِيَادٍ عَنْ عَلِيِّ بْنِ مَعْبَدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبِي خِدَاشٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ عَبْدَةَ النَّيْسَابُورِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الْقَدَحُ مِنَ النَّبِيذِ وَ الْقَدَحُ مِنَ الْخَمْرِ سَوَاءٌ فَقَالَ نَعَمْ سَوَاءٌ قُلْتُ فَالْحَدُّ فِيهِمَا سَوَاءٌ فَقَالَ سَوَاءٌ ."], "translations": {"en.hubeali": ["Sahl Bin Ziyad, from Ali Bin Ma’bad, from Al Hassan Bin Ali, from Abu Kihdash, from Ali Bin Ismai, from Muhammad Bin Ababda Al Nayshapoyri who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘The cup of <span class=\"iTxt\">Al-Nabeez</span>, and the cup of the wine are equal?’ So he<sup>asws</sup> said: ‘Yes, equal’. I said, ‘So the legal penalty (<span class=\"iTxt\">Hadd</span>) with regards to the both of them is the same?’ So he<sup>asws</sup> said: ‘Same’."]}}, {"index": 12167, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:15", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي الْمَغْرَاءِ عَنْ عُمَرَ بْنِ حَنْظَلَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَرَى فِي قَدَحٍ مِنْ مُسْكِرٍ يُصَبُّ عَلَيْهِ الْمَاءُ حَتَّى تَذْهَبَ عَادِيَتُهُ وَ يَذْهَبَ سُكْرُهُ فَقَالَ لَا وَ اللَّهِ وَ لَا قَطْرَةٌ تَقْطُرُ مِنْهُ فِي حُبٍّ إِلَّا أُهَرِيقَ ذَلِكَ الْحُبُّ ."], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ali Bin Al Hakam, from Abu Al Magra, from Umar Bin Hanzala who said, ", "‘I said to Abu Abdullah<sup>asws</sup>, ‘What is your<sup>asws</sup> view regarding a cup of an intoxicant upon which the water is poured, its normality goes away, and its intoxication goes away’. So he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>, and there is no drop which drops into a container except that container must be emptied’."]}}, {"index": 12168, "local_index": 16, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:16", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَنَانِ بْنِ سَدِيرٍ عَنْ يَزِيدَ بْنِ خَلِيفَةَ وَ هُوَ رَجُلٌ مِنْ بَنِي الْحَارِثِ بْنِ كَعْبٍ قَالَ سَمِعْتُهُ يَقُولُ أَتَيْتُ الْمَدِينَةَ وَ زِيَادُ بْنُ عُبَيْدِ اللَّهِ الْحَارِثِيُّ عَلَيْهَا فَاسْتَأْذَنْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَدَخَلْتُ عَلَيْهِ وَ سَلَّمْتُ عَلَيْهِ وَ تَمَكَّنْتُ مِنْ مَجْلِسِي قَالَ فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي رَجُلٌ مِنْ بَنِي الْحَارِثِ بْنِ كَعْبٍ وَ قَدْ هَدَانِي اللَّهُ عَزَّ وَ جَلَّ إِلَى مَحَبَّتِكُمْ وَ مَوَدَّتِكُمْ أَهْلَ الْبَيْتِ قَالَ فَقَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ كَيْفَ اهْتَدَيْتَ إِلَى مَوَدَّتِنَا أَهْلَ الْبَيْتِ فَوَ اللَّهِ إِنَّ مَحَبَّتَنَا فِي بَنِي الْحَارِثِ بْنِ كَعْبٍ لَقَلِيلٌ ", "قَالَ فَقُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّ لِي غُلَاماً خُرَاسَانِيّاً وَ هُوَ يَعْمَلُ الْقِصَارَةَ وَ لَهُ هَمْشَهْرِيجُونَ أَرْبَعَةٌ وَ هُمْ يَتَدَاعَوْنَ كُلَّ جُمُعَةٍ فَيَقَعُ الدَّعْوَةُ عَلَى رَجُلٍ مِنْهُمْ فَيُصِيبُ غُلَامِي كُلَّ خَمْسِ جُمَعٍ جُمُعَةٌ فَيَجْعَلُ لَهُمُ النَّبِيذَ وَ اللَّحْمَ قَالَ ثُمَّ إِذَا فَرَغُوا مِنَ الطَّعَامِ وَ اللَّحْمِ جَاءَ بِإِجَّانَةٍ فَمَلَأَهَا نَبِيذاً ثُمَّ جَاءَ بِمِطْهَرَةٍ فَإِذَا نَاوَلَ إِنْسَاناً مِنْهُمْ قَالَ لَهُ لَا تَشْرَبْ حَتَّى تُصَلِّيَ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ فَاهْتَدَيْتُ إِلَى مَوَدَّتِكُمْ بِهَذَا الْغُلَامِ", "قَالَ فَقَالَ لِي اسْتَوْصِ بِهِ خَيْراً وَ أَقْرِئْهُ مِنِّي السَّلَامَ وَ قُلْ لَهُ يَقُولُ لَكَ جَعْفَرُ بْنُ مُحَمَّدٍ انْظُرْ شَرَابَكَ هَذَا الَّذِي تَشْرَبُهُ فَإِنْ كَانَ يُسْكِرُ كَثِيرُهُ فَلَا تَقْرَبَنَّ قَلِيلَهُ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ كُلُّ مُسْكِرٍ حَرَامٌ وَ قَالَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ", "قَالَ فَجِئْتُ إِلَى الْكُوفَةِ وَ أَقْرَأْتُ الْغُلَامَ السَّلَامَ مِنْ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) قَالَ فَبَكَى ثُمَّ قَالَ لِي اهْتَمَّ بِي جَعْفَرُ بْنُ مُحَمَّدٍ ( عليه السلام ) حَتَّى يُقْرِئُنِي السَّلَامَ قَالَ قُلْتُ نَعَمْ وَ قَدْ قَالَ لِي قُلْ لَهُ انْظُرْ شَرَابَكَ هَذَا الَّذِي تَشْرَبُهُ فَإِنْ كَانَ يُسْكِرُ كَثِيرُهُ فَلَا تَقْرَبَنَّ قَلِيلَهُ فَإِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ كُلُّ مُسْكِرٍ حَرَامٌ وَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ وَ قَدْ أَوْصَانِي بِكَ فَاذْهَبْ فَأَنْتَ حُرٌّ لِوَجْهِ اللَّهِ تَعَالَى قَالَ فَقَالَ الْغُلَامُ وَ اللَّهِ إِنَّهُ لَشَرَابٌ مَا يَدْخُلُ جَوْفِي مَا بَقِيتُ فِي الدُّنْيَا ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, and Ali Bin Ibrahim, from his father, from Hanan Bin Sudeyr, from Yazeed Bin Khalifa , and he is a man from the Clan of Al Haris Bin Ka’ab who said, ", "‘I heard him saying, ‘I went to Al-Medina and Ziyad Bin Ubeyd Al-Harisy was over it (the governor). So I sought permission to Abu Abdullah<sup>asws</sup>, and I went over to him<sup>asws</sup>, and greeted him<sup>asws</sup>, and managed to sit in my (normal) place. So I said to Abu Abdullah<sup>asws</sup>, ‘I am a man from the Clan of Al-Haris Bin Ka’ab, and Allah<sup>azwj</sup> Mighty and Majestic has Guided me to your<sup>asws</sup> love and cordiality for you<sup>asws</sup>, the People<sup>asws</sup> of the Household’. So Abu Abdullah<sup>asws</sup> said to me: ‘And how have you been Guided to our<sup>asws</sup> cordiality, the People<sup>asws</sup> of the Household, for by Allah<sup>azwj</sup>, our<sup>asws</sup> love in the Clan of Al-Haris Bin Ka’ab, is scarce’.", "He (the narrator) said, ‘So I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! There is a slave of mine, from Khurasan, and he is a bleacher and for him are four fellow countrymen, and they tend to invite each other every Friday. So the invitation occurs upon a man from them, and the turn comes to my slave every five Fridays. So he makes <span class=\"iTxt\">Al-Nabeez</span> for them, and the meat. He said that when they are free from the meal and the meat, he comes with a bowl and fills it with <span class=\"iTxt\">Al-Nabeez</span>. Then he comes with a clean jug. So when a person from them takes it, it is said to him, ‘Do not drink it until you send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> (<span class=\"iTxt\">Salawaat</span>)’. Thus I was guided towards your<sup>asws</sup> loved by this slave’.", "He (the narrator) said, ‘So he<sup>saww</sup> said to me: ‘Iasws advise you to be good with him and convey the greetings from me<sup>asws</sup>, and say to him that Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> is saying to you: ‘Consider this drink which you are drinking, for if a lot of it were to intoxicate, so do not go near the little of it, for Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is prohibited’, and said: ‘Whatever a lot of it intoxicates, so a little of it is prohibited’.", "He (the narrator) said, ‘So I went to Al-Kufa and I conveyed the slave, the greetings from Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>. So he wept, then said to me, ‘Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup> attached such importance to me to the extent that he<sup>asws</sup> conveyed the greetings to me?’ I said, ‘Yes, and he<sup>asws</sup> has told to me to tell you: ‘Consider this drink of yours which you are drinking it, for if it was such that a lot of it were to intoxicate, so do not go near a little of it, for Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited, and whatever a lot of it intoxicates, so a little of it is prohibited’, and he<sup>asws</sup> advised me regarding you. Therefore go, for you are free for the Face of Allah<sup>azwj</sup> the High’. So the slave said, ‘By Allah<sup>azwj</sup>! It is a drink which will not enter inside me for as long as I remain in the world’."]}}, {"index": 12169, "local_index": 17, "part_type": "Hadith", "path": "/books/al-kafi:6:7:21:17", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ كُلَيْبِ بْنِ مُعَاوِيَةَ قَالَ كَانَ أَبُو بَصِيرٍ وَ أَصْحَابُهُ يَشْرَبُونَ النَّبِيذَ يَكْسِرُونَهُ بِالْمَاءِ فَحَدَّثْتُ بِذَلِكَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لِي وَ كَيْفَ صَارَ الْمَاءُ يُحَلِّلُ الْمُسْكِرَ مُرْهُمْ لَا يَشْرَبُوا مِنْهُ قَلِيلًا وَ لَا كَثِيراً قُلْتُ إِنَّهُمْ يَذْكُرُونَ أَنَّ الرِّضَا مِنْ آلِ مُحَمَّدٍ يُحِلُّهُ لَهُمْ فَقَالَ وَ كَيْفَ كَانَ يُحِلُّونَ آلُ مُحَمَّدٍ ( عليه السلام ) الْمُسْكِرَ وَ هُمْ لَا يَشْرَبُونَ مِنْهُ قَلِيلًا وَ لَا كَثِيراً فَأَمْسِكُوا عَنْ شُرْبِهِ ", "فَاجْتَمَعْنَا عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ أَبُو بَصِيرٍ إِنَّ ذَا جَاءَنَا عَنْكَ بِكَذَا وَ كَذَا فَقَالَ ( عليه السلام ) صَدَقَ يَا أَبَا مُحَمَّدٍ إِنَّ الْمَاءَ لَا يُحَلِّلُ الْمُسْكِرَ فَلَا تَشْرَبُوا مِنْهُ قَلِيلًا وَ لَا كَثِيراً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahy, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Kuleyb Bin Muawiya who said, ", "‘Abu Baseer and his companions were drinking <span class=\"iTxt\">Al Nabeez</span>, breaking it with the water. So I discussed that with Abu Abdullah<sup>asws</sup>, so he<sup>asws</sup> said to me: ‘And how can the water make Permissible the Prohibited intoxicant. Do not be drinking from it, neither a little nor a lot’. I said, ‘They are mentioning that the approval of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> makes it Permissible for them’. So he<sup>asws</sup> said: ‘And how could the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup> have Permitted the intoxicant, and they<sup>asws</sup> are not drinking from it, neither a little nor a lot? Refrain from drinking it’. ", "So we gathered in the presence of Abu Abdullah<sup>asws</sup>, and Abu Baseer said to him<sup>asws</sup>, ‘They have come to us from you<sup>asws</sup> with such and such’. So he<sup>asws</sup> said: ‘True, O Abu Muhammad! The water cannot make permissible the intoxicant, therefore do not drink from it, neither a little nor a lot’."]}}]}, "index": "al-kafi:6:7:21", "kind": "verse_list"}