{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:6:7",
        "titles": {
          "ar": "كتاب الْأَشْرِبَةِ",
          "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:6:7:23",
        "titles": {
          "ar": "باب مَنِ اضْطُرَّ إِلَى الْخَمْرِ لِلدَّوَاءِ أَوْ لِلْعَطَشِ أَوْ لِلتَّقِيَّةِ",
          "en": "Chapter 23 – The one who is desperate to the wine for the medication, or for the thirst, or for the dissimulation"
        }
      }
    ],
    "index": 1891,
    "local_index": 23,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:6:7:24",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب النَّبِيذِ</span>",
          "en": "Chapter 24 – Al-Nabeez (Raisins soaked overnight)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:6:7:22",
        "titles": {
          "ar": "باب أَنَّ الْخَمْرَ إِنَّمَا حُرِّمَتْ لِفِعْلِهَا فَمَا فَعَلَ فِعْلَ الْخَمْرِ فَهُوَ خَمْرٌ",
          "en": "Chapter 22 - The wine, rather has been Prohibited due to its effects, so whatever affects with the effects of the wine, so it is wine"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:6:7",
        "titles": {
          "ar": "كتاب الْأَشْرِبَةِ",
          "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:7:23",
    "titles": {
      "ar": "باب مَنِ اضْطُرَّ إِلَى الْخَمْرِ لِلدَّوَاءِ أَوْ لِلْعَطَشِ أَوْ لِلتَّقِيَّةِ",
      "en": "Chapter 23 – The one who is desperate to the wine for the medication, or for the thirst, or for the dissimulation"
    },
    "verse_count": 12,
    "verse_start_index": 12185,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/272)"
        ],
        "index": 12186,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/75",
              "text": "مُحَمَّدُ بْنُ الْحَسَنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/18",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4163",
              "text": "إِبْرَاهِيمَ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2755",
              "text": "عَبْدِ اللَّهِ بْنِ وَضَّاحٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/156",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ الْحَسَنِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ إِبْرَاهِيمَ بْنِ خَالِدٍ عَنْ عَبْدِ اللَّهِ بْنِ وَضَّاحٍ عَنْ أَبِي بَصِيرٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:1",
        "text": [
          " دَخَلَتْ أُمُّ خَالِدٍ الْعَبْدِيَّةُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ أَنَا عِنْدَهُ فَقَالَتْ جُعِلْتُ فِدَاكَ إِنَّهُ يَعْتَرِينِي قَرَاقِرُ فِي بَطْنِي [فَسَأَلَتْهُ عَنْ أَعْلَالِ النِّسَاءِ وَ قَالَتْ] وَ قَدْ وَصَفَ لِي أَطِبَّاءُ الْعِرَاقِ النَّبِيذَ بِالسَّوِيقِ وَ قَدْ وَقَفْتُ وَ عَرَفْتُ كَرَاهَتَكَ لَهُ فَأَحْبَبْتُ أَنْ أَسْأَلَكَ عَنْ ذَلِكَ فَقَالَ لَهَا وَ مَا يَمْنَعُكِ عَنْ شُرْبِهِ قَالَتْ قَدْ قَلَّدْتُكَ دِينِي فَأَلْقَى اللَّهَ عَزَّ وَ جَلَّ حِينَ أَلْقَاهُ فَأُخْبِرُهُ أَنَّ جَعْفَرَ بْنَ مُحَمَّدٍ ( عليه السلام ) أَمَرَنِي وَ نَهَانِي ",
          "فَقَالَ يَا أَبَا مُحَمَّدٍ أَلَا تَسْمَعُ إِلَى هَذِهِ الْمَرْأَةِ وَ هَذِهِ الْمَسَائِلِ لَا وَ اللَّهِ لَا آذَنُ لَكِ فِي قَطْرَةٍ مِنْهُ وَ لَا تَذُوقِي مِنْهُ قَطْرَةً فَإِنَّمَا تَنْدَمِينَ إِذَا بَلَغَتْ نَفْسُكِ هَاهُنَا وَ أَوْمَأَ بِيَدِهِ إِلَى حَنْجَرَتِهِ يَقُولُهَا ثَلَاثاً أَ فَهِمْتِ قَالَتْ نَعَمْ ثُمَّ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا يَبُلُّ الْمِيلَ يُنَجِّسُ حُبّاً مِنْ مَاءٍ يَقُولُهَا ثَلَاثاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Hassan, from one of our companions, from Ibrahim Bin Khalid, from Abdullah Bin Wazza, from Abu Baseer who said, ",
            "‘Umm Khalid Al-Abdiyat came over to Abu Abdullah<sup>asws</sup> and I was in his<sup>asws</sup> presence. So she said, ‘May I be sacrificed for you<sup>asws</sup>! The growling in my stomach is squeezing me’, so she asked  about the pains of the women and she said, ‘The physicians of Al-Iraq have prescribed <span class=\"iTxt\">Al-Nabeez</span> with <span class=\"iTxt\">Al-Suweyq</span>, but I paused for I do recognise your<sup>asws</sup> dislike for it, therefore I would like to ask you<sup>asws</sup> about that’. So he<sup>asws</sup> said to her: ‘And what prevents you from drinking it?’ She said, ‘<span style=\"text-decoration: underline\">I have emulated you</span><sup style=\"text-decoration: underline\">asws</sup><span style=\"text-decoration: underline\"> in my Religion (</span><span style=\"font-style: italic; text-decoration: underline\">Taqleed</span><span style=\"text-decoration: underline\">), so when I meet Allah</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\"> Mighty and Majestic, whenever I do meet Him</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\">, so I can tell Him</span><sup style=\"text-decoration: underline\">azwj</sup><span style=\"text-decoration: underline\"> that Ja’far</span><sup style=\"text-decoration: underline\">asws</sup><span style=\"text-decoration: underline\"> Bin Muhammad</span><sup style=\"text-decoration: underline\">asws</sup><span style=\"text-decoration: underline\"> had ordered me and forbade me</span>’. ",
            "So he<sup>asws</sup> said: ‘O Abu Muhammad! Did you listen to this lady and this question? No, by Allah<sup>azwj</sup>, I<sup>asws</sup> do not allow for you with regards to one drop from it, and do not taste from it one drop, for you would be regretful when your soul reaches over here’ – and he<sup>asws</sup> gestured by his<sup>asws</sup> hand to his<sup>asws</sup> throat, saying it to her three (times): ‘Did you understand?’ She said, ‘Yes’. Then Abu Abdullah<sup>asws</sup> said: ‘What dampens the needle, dirties a container of water’ – saying it to her three (times)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn al-Hassan has narrated from certain persons of our people from Ibrahim ibn Khalid from ‘Abd Allah ibn Waddah from abu Basir who has said the following: “Once I was with abu ‘Abd Allah, ‘Alayhi al-Salam when the mother of Khalid al-‘Abdiyah visited him (the Imam). She said, ‘I pray to Allah to keep my soul in service for your cause. I have a growling condition in my belly [I asked a women with such condition about it and she said] the physicians of Iraq have prescribed for her al-Nabidh with sawiq; but I have learned and I know that you dislike it and I like to ask you about it. He (the Imam) asked, ‘What stops you from drinking it?’ She replied, ‘I have taken upon myself to follow your instructions in matters of my religion so upon my meeting with Allah, most Majestic, most Glorious, I will be able to tell Him that Ja‘far ibn Muhammad commanded and prohibited me.’ He (the Imam) asked, ‘O abu Muhammad, do you hear this woman and these issues? No, by Allah, I will not give you permission, not even for one drop of it and you must not taste even one drop of it because you, otherwise, will regret when the soul reaches here’, pointing to his throat, ‘Did you understand?’ She replied, ‘Yes, I understand? He (the Imam) then said, ‘A small amount of it (wine) that can hardly moisten an applicator of kohl (eyeliner) to the eye can make a whole hub (a large water container) filthy? He (the Imam) said it three times?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/273)"
        ],
        "index": 12187,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "عُمَرَ بْنِ أُذَيْنَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:2",
        "text": [
          " كَتَبْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَسْأَلُهُ عَنِ الرَّجُلِ يُبْعَثُ لَهُ الدَّوَاءُ مِنْ رِيحِ الْبَوَاسِيرِ فَيَشْرَبُهُ بِقَدْرِ أُسْكُرُّجَةٍ مِنْ نَبِيذٍ صُلْبٍ لَيْسَ يُرِيدُ بِهِ اللَّذَّةَ وَ إِنَّمَا يُرِيدُ بِهِ الدَّوَاءَ فَقَالَ لَا وَ لَا جُرْعَةً ثُمَّ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَمْ يَجْعَلْ فِي شَيْ‏ءٍ مِمَّا حَرَّمَ شِفَاءً وَ لَا دَوَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umyer, from Umar Bin Azina who said, ",
            "‘I wrote to Abu Abdullah<sup>asws</sup> asking him<sup>asws</sup> about the man whom the medication for the wind of the hemorrhoids is sent to, so he drinks a dosage from <span class=\"iTxt\">Nabeez</span>, not intending the pleasure by it, and rather intending the cure by it’. So he<sup>asws</sup> said: ‘No, and not a single dosage’. Then he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic did not Make a healing to be in anything from what He<sup>azwj</sup> Prohibited, nor a medication’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ‘Udhaynah who has said the following: “I once wrote to abu ‘Abd Allah, ‘Alayhi al-Salam, and asked about a man to whom a medicine for curing hemorrhoid gases is sent to drink in an amount that in the form of hard al-Nabidh makes one drunk. He does not drink it for pleasure but as medicine? He (the Imam) said, ‘No, not even one sip of it is lawful? He (the Imam) then said, ‘Allah, most Majestic, most Glorious, has not placed any cure as medicine in what He has prohibited?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/273)"
        ],
        "index": 12188,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/89",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:3",
        "text": [
          " أَخْبَرَنِي أَبِي قَالَ كُنْتُ عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ لَهُ رَجُلٌ إِنَّ بِي جُعِلْتُ فِدَاكَ أَرْيَاحَ الْبَوَاسِيرِ وَ لَيْسَ يُوَافِقُنِي إِلَّا شُرْبُ النَّبِيذِ قَالَ فَقَالَ لَهُ مَا لَكَ وَ لِمَا حَرَّمَ اللَّهُ عَزَّ وَ جَلَّ وَ رَسُولُهُ ( صلى الله عليه وآله ) يَقُولُ لَهُ ذَلِكَ ثَلَاثاً عَلَيْكَ بِهَذَا الْمَرِيسِ الَّذِي تَمْرُسُهُ بِالْعَشِيِّ وَ تَشْرَبُهُ بِالْغَدَاةِ وَ تَمْرُسُهُ بِالْغَدَاةِ وَ تَشْرَبُهُ بِالْعَشِيِّ فَقَالَ لَهُ هَذَا يَنْفُخُ الْبَطْنَ ",
          "قَالَ لَهُ فَأَدُلُّكَ عَلَى مَا هُوَ أَنْفَعُ لَكَ مِنْ هَذَا عَلَيْكَ بِالدُّعَاءِ فَإِنَّهُ شِفَاءٌ مِنْ كُلِّ دَاءٍ قَالَ فَقُلْنَا لَهُ فَقَلِيلُهُ وَ كَثِيرُهُ حَرَامٌ فَقَالَ نَعَمْ قَلِيلُهُ وَ كَثِيرُهُ حَرَامٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat who said, ",
            "‘My father informed me that he was in the presence of Abu Abdullah<sup>asws</sup>, so a man said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! With me is the hemorrhoids, and nothing is compatible with me except for drinking <span class=\"iTxt\">Al-Nabeez</span>’. So he<sup>asws</sup> said to him: ‘What is it to you and what Allah<sup>azwj</sup> Mighty and Majestic and His<sup>azwj</sup> Rasool<sup>saww</sup> have Prohibited?’ – saying it to him thrice. ‘Upon you is with this <span class=\"iTxt\">Al-Mareys</span> which is squeezed in the evening and drunk in the morning, and squeezed in the morning and drunk at evening’. So he said to him<sup>asws</sup>, ‘This bloats (expands) the belly’. ",
            "He<sup>asws</sup> said to him: ‘So I<sup>asws</sup> shall point you upon what it better for you than this. It is upon you with the supplication, for it is a healing from every illness’. So we said to him<sup>asws</sup>, ‘So a little of it and a lot of it is Prohibited?’ So he<sup>asws</sup> said: ‘Yes, a little of it and a lot of it, is Prohibited’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Asbat who has said the following: “My father has informed me that he once was with abu ‘Abd Allah, ‘Alayhi al-Salam, when a man said to him (the Imam), ‘I pray to Allah to keep my soul in service for your cause, (I suffer from the) gases of hemorrhoids. Nothing suits me except drinking al-Nabidh? He (the narrator) has said that he (the Imam) said, ‘What do you have to do with what Allah, most Majestic, most Glorious, and the Messenger of Allah have made unlawful?’ He (the Imam) said it three times. He (the Imam) then said, ‘You must use this immersed (dates) which is immersed in water in the evening to drink in the morning and immersed in the morning to drink in the evening? He said, ‘This causes bloating in the belly? He (the Imam) said, ‘I can guide you to what is more beneficial than this. You must pray because it is cure for all illnesses? He (the narrator) has said that we then asked him (the Imam), ‘Is all of it, small and large quantities unlawful?’ He (the Imam) said, ‘Yes, it is unlawful in large quantity as well as in small quantity?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/274)"
        ],
        "index": 12189,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/170",
              "text": "صَفْوَانَ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/217",
              "text": "ابْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنِ ابْنِ مُسْكَانَ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:4",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ دَوَاءٍ عُجِنَ بِالْخَمْرِ فَقَالَ لَا وَ اللَّهِ مَا أُحِبُّ أَنْ أَنْظُرَ إِلَيْهِ فَكَيْفَ أَتَدَاوَى بِهِ إِنَّهُ بِمَنْزِلَةِ شَحْمِ الْخِنْزِيرِ أَوْ لَحْمِ الْخِنْزِيرِ وَ إِنَّ أُنَاساً لَيَتَدَاوَوْنَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Ibn Muskan, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a medicine kneaded with the wine. So he<sup>asws</sup> said: ‘No, by Allah<sup>azwj</sup>! I<sup>asws</sup> do not (even) like looking at it, so how can I<sup>asws</sup> cure by it. It is as the status of the fat of the swine or flesh of the swine, and the people are curing themselves with it’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from ibn Muskan from al-Halabiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a medicine which is made in dough with wine. He (the Imam) said, ‘No, by Allah I do not like to look at it, so how will I use it as medicine? It is like the fat of pork or flesh of pork. Why then certain people use it as medicine?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/274)"
        ],
        "index": 12190,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/129",
              "text": "مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/410",
              "text": "الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4164",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَمِيدِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1525",
              "text": "عَمْرٍو"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4165",
              "text": "ابْنِ الْحُرِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ وَ الْحُسَيْنِ بْنِ سَعِيدٍ جَمِيعاً عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَمِيدِ عَنْ عَمْرٍو عَنِ ابْنِ الْحُرِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:5",
        "text": [
          " دَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيَّامَ قَدِمَ الْعِرَاقَ فَقَالَ لِيَ ادْخُلْ عَلَى إِسْمَاعِيلَ بْنِ جَعْفَرٍ فَإِنَّهُ شَاكٍ فَانْظُرْ مَا وَجَعُهُ وَ صِفْ لِي شَيْئاً مِنْ وَجَعِهِ الَّذِي يَجِدُ ",
          "قَالَ فَقُمْتُ مِنْ عِنْدِهِ فَدَخَلْتُ عَلَى إِسْمَاعِيلَ فَسَأَلْتُهُ عَنْ وَجَعِهِ الَّذِي يَجِدُ فَأَخْبَرَنِي بِهِ فَوَصَفْتُ لَهُ دَوَاءً فِيهِ نَبِيذٌ فَقَالَ إِسْمَاعِيلُ النَّبِيذُ حَرَامٌ وَ إِنَّا أَهْلَ بَيْتٍ لَا نَسْتَشْفِي بِالْحَرَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid and Al Husayn Bin Saeed altogether, from Al Nazar Bin Suweyd, from Al Husayn Bin Abdullah, from Abdullah Bin Abdul Hameed, from Amro, from Ibn Al Hurr who said, ",
            "‘I went over to Abu Abdullah<sup>asws</sup> in the days he<sup>asws</sup> had proceeded to Al-Iraq, so he<sup>asws</sup> said to me: ‘Go to Ismail Bin Ja’far, for he is complaining. Look at what is paining him and describe to me something from his pains which he finds’. ",
            "He (the narrator) said, ‘So I stood up from his<sup>asws</sup> presence and I went over to Ismail. So I asked him about his pain which he finds. So he informed me with it, and a cure had been prescribed for him in which was <span class=\"iTxt\">Nabeez</span>. So he<sup>asws</sup> said: ‘O Ismail! <span class=\"iTxt\">Al-Nabeez</span> is Prohibited, and we<sup>asws</sup> the People<sup>asws</sup> of the Household do not cure with the Prohibited (substances)’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid and al-Husayn ibn Sa‘id all from al- Nadr ibn Suwayd from al-Husayn ibn ‘Abd Allah ibn ‘Abd al-Hamid from ‘Amr from ibn al-Jumhur who has said the following: “I once visited abu ‘Abd Allah, ‘Alayhi al-Salam, during the days that he had come to Iraq. He (the Imam) told me to visit ’Isma‘il ibn Ja‘far because he complains and see what kind of pain has made him suffer then describe for him (the Imam) the pain he feels. I then left him (the Imam) to see Tsma‘il and asked him about his pain that he felt. He explained it to me and I prescribed a medicine in which al-Nabidh existed. Tsma‘il said, ‘Al-Nabidh is unlawful and I belong to a family who do not use unlawful things as medicine.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/274)"
        ],
        "index": 12191,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/964",
              "text": "مُحَمَّدِ بْنِ أَحْمَدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/115",
              "text": "يَعْقُوبَ بْنِ يَزِيدَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/780",
              "text": "مُحَمَّدِ بْنِ الْحَسَنِ الْمِيثَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/142",
              "text": "مُعَاوِيَةَ بْنِ عَمَّارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:6",
        "text": [
          " سَأَلَ رَجُلٌ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ دَوَاءٍ عُجِنَ بِالْخَمْرِ نَكْتَحِلُ مِنْهَا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا جَعَلَ اللَّهُ عَزَّ وَ جَلَّ فِيمَا حَرَّمَ شِفَاءً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Muhammad Bin Ahmad, from Yaqoub Bin Yazeed, from Muhammad Bin Al Hassan Al Maysami, from Muawiya Bin Ammar who said, ",
            "‘A man asked Abu Abdullah<sup>asws</sup> about a cure kneaded with the wine, can we apply it in the eyes (like kohl) from it?’ So Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic has not Made a healing to be in a Prohibition’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Muhammad ibn Ahmad from Ya‘qub ibn Yazid from Muhammad ibn al-Hassan al- Mithamiy from Mu‘awiyah ibn ‘Ammar who has said the following: “A man once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a medicine which is made into dough to be used as Kohl (eyeliner) for the eyes. Abu ‘Abd Allah, ‘Alayhi al-Salam, said, ‘Allah, most Majestic, most Glorious, has not placed cures in things that He has made unlawful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل ومجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/274)"
        ],
        "index": 12192,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/422",
              "text": "مَرْوَكِ بْنِ عُبَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/134",
              "text": "رَجُلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مَرْوَكِ بْنِ عُبَيْدٍ عَنْ رَجُلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:7",
        "text": [
          " مَنِ اكْتَحَلَ بِمِيلٍ مِنْ مُسْكِرٍ كَحَلَهُ اللَّهُ عَزَّ وَ جَلَّ بِمِيلٍ مِنْ نَارٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Marwak Bin Ubeyd, from a man, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who applies (in the eyes) with a needle from an intoxicant, Allah<sup>azwj</sup> Mighty and Majestic would Apply (in his eyes) a needle from Fire’."
          ],
          "en.sarwar": [
            "7. It is narrated from the narrator of the previous Hadith from Ahmad ibn Muhammad from Marwak ibn ‘Ubayd from a man who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one uses intoxicating things as eye medicine with an applicator of medicine to the eye Allah, most Majestic, most Glorious, will apply as such with an applicator of fire.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/274)"
        ],
        "index": 12193,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/232",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2665",
              "text": "الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ الْأَرَّجَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4166",
              "text": "مَالِكٍ الْمِسْمَعِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4167",
              "text": "قَائِدِ بْنِ طَلْحَةَ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْحُسَيْنِ بْنِ عَبْدِ اللَّهِ الْأَرَّجَانِيِّ عَنْ مَالِكٍ الْمِسْمَعِيِّ عَنْ قَائِدِ بْنِ طَلْحَةَ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:8",
        "text": [
          "هُ سَأَلَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ النَّبِيذِ يُجْعَلُ فِي الدَّوَاءِ فَقَالَ لَا لَيْسَ يَنْبَغِي لِأَحَدٍ أَنْ يَسْتَشْفِيَ بِالْحَرَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al nazar Bin Suweyd, from Al Husayn Bin Abdullah Al Arjany, from Malik Al Mismaiy, ",
            "(It has been narrated) from Qaid Bin Talha who asked Abu Abdullah<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span> made to be in the medication. So he<sup>asws</sup> said: ‘No. it is no befitting for anyone that he should heal with the prohibited (substances)’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from al-Nadr ibn Suwayd from al- Husayn ibn ‘Abd Allah al-Arjaniy from Malik al-Misma‘iy from Qayed ibn Talhah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about al-Nabidh which is placed in medicine. He (the Imam) said, ‘No, it is not proper for one to seek cure from unlawful things.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالموثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/275)"
        ],
        "index": 12194,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1819",
              "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/434",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/448",
              "text": "عِدَّةٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/89",
              "text": "عَلِيِّ بْنِ أَسْبَاطٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/613",
              "text": "عَلِيِّ بْنِ جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1223",
              "text": "أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ جَعْفَرٍ عَنْ أَخِيهِ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:9",
        "text": [
          " سَأَلْتُهُ عَنِ الْكُحْلِ يُعْجَنُ بِالنَّبِيذِ أَ يَصْلُحُ ذَلِكَ فَقَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ahmad Bin Abu Abdullah, from a number of our companions, from Ali Bin Asbaat, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup>, from his brother<sup>asws</sup> Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the kohl kneaded with <span class=\"iTxt\">Al-Nabeez</span>, is that correct (to apply in the eyes)?’ So he<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "9. Ali ibn Muhammad ibn Bandar has narrated from Ahmad ibn abu ‘Abd Allah from a number of our people from Ali ibn Asbat from Ali ibn Ja‘far who has said the following: “I once asked my brother, abu al-Hassan ‘Alayhi al-Salam, about kohl made into dough with al- Nabidh; if it is proper. He (the Imam) said, ‘No, it is not proper.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/275)"
        ],
        "index": 12195,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/355",
              "text": "ابْنِ رِئَابٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنِ الْحَلَبِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:10",
        "text": [
          " سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنْ دَوَاءٍ يُعْجَنُ بِخَمْرٍ فَقَالَ مَا أُحِبُّ أَنْ أَنْظُرَ إِلَيْهِ وَ لَا أَشَمَّهُ فَكَيْفَ أَتَدَاوَى بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from Ibn Raib, from Al Halby who said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about a medication kneaded with wine. So he<sup>asws</sup> said: ‘I<sup>asws</sup> do not like to (even) look at it, nor smelling it, so how can I<sup>asws</sup> cure by it?’"
          ],
          "en.sarwar": [
            "10. A number of our people have narrated from Sahl ibn Ziyad from ibn Mahbub from ibn Ri’ab from al-Halabiy who has said the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about a medicine which is made into dough with wine. He (the Imam) said, ‘I do not like to look at it or smell it; so why should I use it as medicine?”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/275)"
        ],
        "index": 12196,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/678",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/117",
              "text": "عُثْمَانَ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1604",
              "text": "سَعِيدِ بْنِ يَسَارٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْكُوفِيِّ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:11",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَيْسَ فِي شُرْبِ النَّبِيذِ تَقِيَّةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali Al Kufy, from Usman Bin Isa, from Saeed Bin Yasaar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘There is no dissimulation (applicable) regarding drinking <span class=\"iTxt\">Al-Nabeez</span>’."
          ],
          "en.sarwar": [
            "11. Abu Ali al-Ash‘ariy has narrated from al-Hassan ibn Ali al-Kufiy from ‘Uthman ibn ‘Isa from Sa‘id ibn Yasar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘There is no Taqiyah (maintaining caution because of fear) in the case of al-Nabidh (wine).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/275)"
        ],
        "index": 12197,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/190",
              "text": "حَرِيزٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/191",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/212",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ زُرَارَةَ عَنْ غَيْرِ وَاحِدٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:23:12",
        "text": [
          " قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) فِي الْمَسْحِ عَلَى الْخُفَّيْنِ تَقِيَّةٌ قَالَ لَا يُتَّقَى فِي ثَلَاثَةٍ قُلْتُ وَ مَا هُنَّ قَالَ شُرْبُ الْخَمْرِ أَوْ قَالَ شُرْبُ الْمُسْكِرِ وَ الْمَسْحُ عَلَى الْخُفَّيْنِ وَ مُتْعَةُ الْحَجِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad, from Hareyz, from Zurara, from someone else who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup> regarding the wiping (<span class=\"iTxt\">Masaah</span> in the ablution) upon the two socks, in dissimulation, so he<sup>asws</sup> said: ‘There is no dissimulation with regards to three (matters)’. I said, ‘And what are these?’ He<sup>asws</sup> said: ‘Drinking the wine’, or said, ‘Drinking the intoxicants, and the wiping (<span class=\"iTxt\">Masaah</span> in the ablution) upon the two socks, and <span class=\"iTxt\">Mut’aa</span> of Al-Hajj’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from Hammad from Hariz from Zurarah from more than one person who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about wiping on slippers because of Taqiyah (caution due to fear). He (the Imam) said, ‘There is no Taqiyah (caution because of fear) in three things.’ I then asked, ‘What are they?’ He (the Imam) said, ‘It is drinking wine,’ or he said, ‘Drinking intoxicating liquor, wiping on slippers and Mut‘ah (advantage) of al-Hajj.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:7:23",
  "kind": "verse_list"
}