{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 7"}, "path": "/books/al-kafi:6:7", "titles": {"ar": "كتاب الْأَشْرِبَةِ", "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "}}, {"indexed_titles": {"en": "Chapter 24"}, "path": "/books/al-kafi:6:7:24", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب النَّبِيذِ</span>", "en": "Chapter 24 – Al-Nabeez (Raisins soaked overnight)"}}], "index": 1883, "local_index": 24, "part_type": "Chapter", "path": "/books/al-kafi:6:7:24", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب النَّبِيذِ</span>", "en": "Chapter 24 – Al-Nabeez (Raisins soaked overnight)"}, "verse_count": 7, "verse_start_index": 12186, "verses": [{"index": 12187, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:7:24:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ حَنَانِ بْنِ سَدِيرٍ قَالَ سَمِعْتُ رَجُلًا وَ هُوَ يَقُولُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي النَّبِيذِ فَإِنَّ أَبَا مَرْيَمَ يَشْرَبُهُ وَ يَزْعُمُ أَنَّكَ أَمَرْتَهُ بِشُرْبِهِ فَقَالَ صَدَقَ أَبُو مَرْيَمَ سَأَلَنِي عَنِ النَّبِيذِ فَأَخْبَرْتُهُ أَنَّهُ حَلَالٌ وَ لَمْ يَسْأَلْنِي عَنِ الْمُسْكِرِ \nقَالَ ثُمَّ قَالَ ( عليه السلام ) إِنَّ الْمُسْكِرَ مَا اتَّقَيْتُ فِيهِ أَحَداً سُلْطَاناً وَ لَا غَيْرَهُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ وَ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ \nفَقَالَ لَهُ الرَّجُلُ جُعِلْتُ فِدَاكَ هَذَا النَّبِيذُ الَّذِي أَذِنْتَ لِأَبِي مَرْيَمَ فِي شُرْبِهِ أَيُّ شَيْ‏ءٍ هُوَ فَقَالَ أَمَّا أَبِي ( عليه السلام ) فَإِنَّهُ كَانَ يَأْمُرُ الْخَادِمَ فَيَجِي‏ءُ بِقَدَحٍ وَ يَجْعَلُ فِيهِ زَبِيباً وَ يَغْسِلُهُ غَسْلًا نَقِيّاً ثُمَّ يَجْعَلُهُ فِي إِنَاءٍ ثُمَّ يَصُبُّ عَلَيْهِ ثَلَاثَةً مِثْلَهُ أَوْ أَرْبَعَةً مَاءً ثُمَّ يَجْعَلُهُ بِاللَّيْلِ وَ يَشْرَبُهُ بِالنَّهَارِ وَ يَجْعَلُهُ بِالْغَدَاةِ وَ يَشْرَبُهُ بِالْعَشِيِّ وَ كَانَ يَأْمُرُ الْخَادِمَ بِغَسْلِ الْإِنَاءِ فِي كُلِّ ثَلَاثَةِ أَيَّامٍ كَيْلَا يَغْتَلِمَ فَإِنْ كُنْتُمْ تُرِيدُونَ النَّبِيذَ فَهَذَا النَّبِيذُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Hanaan Bin Sudeyr who said, \n‘I heard a man and he was saying to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding <span class=\"iTxt\">Al-Nabeez</span>, for Abu Maryam is drinking it and he is claiming that you<sup>asws</sup> ordered him with drinking it?’ So he<sup>asws</sup> said: ‘Abu Maryam spoke the truth. He asked me<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so I<sup>asws</sup> informed him that it is Permissible, and he did not ask me about the intoxicant’. \nHe (the narrator) said, ‘Then he<sup>asws</sup> said: ‘For the intoxicants, there is no dissimulation in it for anyone, neither from the authorities nor someone else. Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited, and whatever a lot of it intoxicates so a little of it is Prohibited’. \nSo the man said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! This <span class=\"iTxt\">Al-Nabeez</span> which you<sup>asws</sup> are permitting for Abu Maryam with regards to drinking it, which thing is it?’ So he<sup>asws</sup> said: ‘As for my<sup>asws</sup> father<sup>asws</sup>, he<sup>asws</sup> had ordered the servant, so he came with a cup, and he<sup>asws</sup> made raisins to be in it, and washed it with a washing, clean. Then he<sup>asws</sup> made it to be in a vessel, then poured water over it the like of three or four times of it. Then he<sup>asws</sup> made it at night and he<sup>asws</sup> would drink it at daytime, and he<sup>asws</sup> made it at daytime and he<sup>asws</sup> would drink it in the evening. And he<sup>asws</sup> used to order the servant with washing the vessel every three days, perhaps it would have stained. Thus, if you all are wanting <span class=\"iTxt\">Al-Nabeez</span>, so this is <span class=\"iTxt\">Al-Nabeez</span>’."}]}, {"index": 12188, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:7:24:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ وَ مُحَمَّدُ بْنُ جَعْفَرٍ أَبُو الْعَبَّاسِ الْكُوفِيُّ عَنْ مُحَمَّدِ بْنِ خَالِدٍ جَمِيعاً عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ مَنْصُورٍ قَالَ حَدَّثَنِي أَيُّوبُ بْنُ رَاشِدٍ قَالَ سَمِعْتُ أَبَا الْبِلَادِ يَسْأَلُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ النَّبِيذِ فَقَالَ لَا بَأْسَ بِهِ فَقَالَ إِنَّهُ يُوضَعُ فِيهِ الْعَكَرُ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِئْسَ الشَّرَابُ وَ لَكِنِ انْبِذُوهُ غُدْوَةً وَ اشْرَبُوهُ بِالْعَشِيِّ قَالَ فَقَالَ جُعِلْتُ فِدَاكَ هَذَا يُفْسِدُ بُطُونَنَا قَالَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَفْسَدُ لِبَطْنِكَ أَنْ تَشْرَبَ مَا لَا يَحِلُّ لَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam and Muhammad Bin Ismail and Muhammad Bin Ja’far Abu Al Abbas Al Kufy, from Muhammad Bin Khalid, altogether from Sayf Bin Umeyra, from Mansour who said that it was narrated to him from Ayoub Bin Rashid who said, \n‘I heard Abu Al-Balaad asking Abu Abdullah<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so he<sup>asws</sup> said: ‘There is no problem with it’. So he said, ‘A residue (of an intoxicant) is placed in it’. So Abu Abdullah<sup>asws</sup> said: ‘Evil is the drink, but soak (raisins) in the morning and drink it at evening’. So he said, ‘May I be sacrificed for you<sup>asws</sup>! This tends to spoil our bellies’. So Abu Abdullah<sup>asws</sup> said: ‘The spoiling for your belly is that you drink what is not Permissible for you’."}]}, {"index": 12189, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:7:24:3", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ مُحَمَّدِ بْنِ عَلِيٍّ الْهَمَذَانِيِّ عَنْ عَلِيِّ بْنِ عَبْدِ اللَّهِ الْحَنَّاطِ عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنِ الْكَلْبِيِّ النَّسَّابَةِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ النَّبِيذِ فَقَالَ حَلَالٌ قُلْتُ إِنَّا نَنْبِذُهُ فَنَطْرَحُ فِيهِ الْعَكَرَ وَ مَا سِوَى ذَلِكَ فَقَالَ ( عليه السلام ) شَهْ شَهْ تِلْكَ الْخَمْرَةُ الْمُنْتِنَةُ \nقَالَ قُلْتُ جُعِلْتُ فِدَاكَ فَأَيَّ نَبِيذٍ تَعْنِي فَقَالَ إِنَّ أَهْلَ الْمَدِينَةِ شَكَوْا إِلَى النَّبِيِّ ( صلى الله عليه وآله ) تَغَيُّرَ الْمَاءِ وَ فَسَادَ طَبَائِعِهِمْ فَأَمَرَهُمْ أَنْ يَنْبِذُوا فَكَانَ الرَّجُلُ مِنْهُمْ يَأْمُرُ خَادِمَهُ أَنْ يَنْبِذَ لَهُ فَيَعْمِدَ إِلَى كَفٍّ مِنْ تَمْرٍ فَيُلْقِيَهُ فِي الشَّنِّ فَمِنْهُ شُرْبُهُ وَ مِنْهُ طَهُورُهُ \nفَقُلْتُ وَ كَمْ كَانَ عَدَدُ التَّمَرَاتِ الَّتِي كَانَتْ تُلْقَى قَالَ مَا يَحْمِلُ الْكَفُّ قُلْتُ وَاحِدَةً وَ اثْنَتَيْنِ فَقَالَ ( عليه السلام ) رُبَّمَا كَانَتْ وَاحِدَةً وَ رُبَّمَا كَانَتِ اثْنَتَيْنِ فَقُلْتُ وَ كَمْ كَانَ يَسَعُ الشَّنُّ مَاءً مَا بَيْنَ الْأَرْبَعِينَ إِلَى الثَّمَانِينَ إِلَى مَا فَوْقَ ذَلِكَ قَالَ فَقُلْتُ بِالْأَرْطَالِ فَقَالَ أَرْطَالٍ بِمِكْيَالِ الْعِرَاقِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad and a number of our companions, from Sahl Bin Ziyad, altogether from Muhammad Bin Ali Al Hamdany, from Ali Bin Abdullah Al Hannat, from Sama’at Bin Mihran, from Al Kalby Al Nasaba who said, \n‘I asked Abu Abdullah<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span>, so he<sup>asws</sup> said: ‘Permissible’. I said, ‘I soak it, so I place the residue (of an intoxicant) in it, and what is besides that’. So he<sup>asws</sup> said: ‘Shh! Shh! That is the rotten wine’. \nHe (the narrator) said, ‘I said, ‘May I be sacrificed for you<sup>asws</sup>, so which <span class=\"iTxt\">Nabeez</span> do you<sup>asws</sup> mean’. So he<sup>asws</sup> said: ‘The people of Al-Medina complained to the Prophet<sup>saww</sup> of the changed water and spoiling of their health. So he<sup>saww</sup> ordered them that they should be drinking <span class=\"iTxt\">Nabeez</span>. So the man from them was instructing his servant that he should make <span class=\"iTxt\">Nabeez</span> for him, so he would extend his handful of dates, so he would cast these in the container. So from it, he would be drinking, and from it he would be purifying’. \nSo I said, ‘And how much was the number of the dates which was cast?’ He<sup>asws</sup> said: ‘Whatever a palm could gather’. I said, ‘One and two?’ So he<sup>asws</sup> said: ‘Sometimes it was one, and sometimes it was two’. So I said, ‘And how much was the capacity of the container of water?’ (He<sup>asws</sup> said): ‘What is between forty to eighty, to what is above that?’ So I said, ‘By the <span class=\"iTxt\">Ratls</span> (A unit of measurement)?’ So he<sup>asws</sup> said: ‘<span class=\"iTxt\">Ratls</span> by the measurement of Al-Iraq’."}]}, {"index": 12190, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:7:24:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ عَنْ أَبِيهِ عَنْ غَيْرِ وَاحِدٍ حَضَرَ مَعَهُ قَالَ كُنْتُ عِنْدَ أَبِي جَعْفَرٍ ( عليه السلام ) فَقُلْتُ يَا جَارِيَةُ اسْقِينِي مَاءً فَقَالَ لَهَا اسْقِيهِ مِنْ نَبِيذِي فَجَاءَتْنِي بِنَبِيذٍ مِنْ بُسْرٍ فِي قَدَحٍ مِنْ صُفْرٍ قَالَ فَقُلْتُ إِنَّ أَهْلَ الْكُوفَةِ لَا يَرْضَوْنَ بِهَذَا قَالَ فَمَا نَبِيذُهُمْ قُلْتُ لَهُ يَجْعَلُونَ فِيهِ الْقَعْوَةَ قَالَ وَ مَا الْقَعْوَةُ قُلْتُ الدَّاذِيُّ قَالَ وَ مَا الدَّاذِيُّ فَقُلْتُ ثُفْلُ التَّمْرِ قَالَ يَضْرَى بِهِ الْإِنَاءُ حَتَّى يَهْدِرَ النَّبِيذُ فَيَغْلِيَ ثُمَّ يُسْكِرَ فَيُشْرَبُ فَقَالَ هَذَا حَرَامٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Ibrahim Bin Abu Al Balaad, from his father, from someone else who was present with him who said, \n‘I was in the presence of Abu Ja’far<sup>asws</sup>, so I said, ‘O maid, get me a drink of water’. So he<sup>asws</sup> said to her: ‘Give him a drink of my<sup>asws</sup> <span class=\"iTxt\">Nabeez</span>. So she came to me with <span class=\"iTxt\">Nabeez</span> of partially-ripened dates in a brass cup. So I said, ‘The people of Al-Kufa are not happy with this’. He<sup>asws</sup> said: ‘So what is their <span class=\"iTxt\">Nabeez</span>?’ I said to him<sup>asws</sup>, ‘They are making Al-Qa’wa to be in it’. He<sup>asws</sup> said: ‘And what is Al-Qa’wa?’ I said, ‘Al-Daazy’. He<sup>asws</sup> said: ‘And what is A- Daazy?’ So I said, ‘Pressed dates. The vessel is stained by it until <span class=\"iTxt\">Al-Nabeez</span> ferments, then it intoxicates, so he drinks it’. So he<sup>asws</sup> said: ‘This is Prohibited’."}]}, {"index": 12191, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:7:24:5", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنْ إِبْرَاهِيمَ بْنِ أَبِي الْبِلَادِ قَالَ دَخَلْتُ عَلَى أَبِي جَعْفَرِ بْنِ الرِّضَا ( عليه السلام ) فَقُلْتُ لَهُ إِنِّي أُرِيدُ أَنْ أُلْصِقَ بَطْنِي بِبَطْنِكَ فَقَالَ هَاهُنَا يَا أَبَا إِسْمَاعِيلَ وَ كَشَفَ عَنْ بَطْنِهِ وَ حَسَرْتُ عَنْ بَطْنِي وَ أَلْزَقْتُ بَطْنِي بِبَطْنِهِ ثُمَّ أَجْلَسَنِي وَ دَعَا بِطَبَقٍ فِيهِ زَبِيبٌ فَأَكَلْتُ ثُمَّ أَخَذَ فِي الْحَدِيثِ فَشَكَا إِلَيَّ مَعِدَتَهُ وَ عَطِشْتُ فَاسْتَقَيْتُ مَاءً فَقَالَ يَا جَارِيَةُ اسْقِيهِ مِنْ نَبِيذِي \nفَجَاءَتْنِي بِنَبِيذٍ مَرِيسٍ فِي قَدَحٍ مِنْ صُفْرٍ فَشَرِبْتُهُ فَوَجَدْتُهُ أَحْلَى مِنَ الْعَسَلِ فَقُلْتُ لَهُ هَذَا الَّذِي أَفْسَدَ مَعِدَتَكَ قَالَ فَقَالَ لِي هَذَا تَمْرٌ مِنْ صَدَقَةِ النَّبِيِّ ( صلى الله عليه وآله ) يُؤْخَذُ غُدْوَةً فَيُصَبُّ عَلَيْهِ الْمَاءُ فَتَمْرُسُهُ الْجَارِيَةُ وَ أَشْرَبُهُ عَلَى أَثَرِ الطَّعَامِ وَ سَائِرَ نَهَارِي فَإِذَا كَانَ اللَّيْلُ أَخَذَتْهُ الْجَارِيَةُ فَسَقَتْهُ أَهْلَ الدَّارِ \nفَقُلْتُ لَهُ إِنَّ أَهْلَ الْكُوفَةِ لَا يَرْضَوْنَ بِهَذَا فَقَالَ وَ مَا نَبِيذُهُمْ قَالَ قُلْتُ يُؤْخَذُ التَّمْرُ فَيُنَقَّى وَ يُلْقَى عَلَيْهِ الْقَعْوَةُ قَالَ وَ مَا الْقَعْوَةُ قُلْتُ الدَّاذِيُّ قَالَ وَ مَا الدَّاذِيُّ قُلْتُ حَبٌّ يُؤْتَى بِهِ مِنَ الْبَصْرَةِ فَيُلْقَى فِي هَذَا النَّبِيذِ حَتَّى يَغْلِيَ وَ يُسْكِرَ ثُمَّ يُشْرَبُ فَقَالَ ذَاكَ حَرَامٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad, from Ibrahim Bin Abu al Balaad who said, \n‘I went over to Abu Ja’far<sup>asws</sup> Bin Al-Reza<sup>asws</sup>, so I said to him<sup>asws</sup>, ‘I want that my belly touches your<sup>asws</sup> belly’. So he<sup>asws</sup> said: ‘Over here, O Abu Ismail’, and he<sup>asws</sup> uncovered his<sup>asws</sup> belly and I uncovered from my belly, and my belly and his<sup>asws</sup> belly touched. Then he<sup>asws</sup> made me sit and called for a platter in which were raisings. So I ate, then he<sup>asws</sup> started discussing, so he<sup>asws</sup> complained to me about his<sup>asws</sup> stomach, and I was thirsty, so I asked for water. So he<sup>asws</sup> said : ‘O Maid! Give him a drink from my<sup>asws</sup> <span class=\"iTxt\">Nabeez</span>’. \nSo she came to me with <span class=\"iTxt\">Nabeez</span> of partially-ripened dates in a yellow cup. So I drank it and found it to be sweeter than the honey. So I said to him<sup>asws</sup>, ‘This is which spoils your<sup>asws</sup> stomach’. So he<sup>asws</sup> said to me: ‘These dates are from the donation of the Prophet<sup>saww</sup>. It is taken in the morning, and water is poured over it, and the maid soaks it, and I drink it upon the effects of the meal, and rest of my<sup>asws</sup> day. So when it was the night, the maid takes it, so she gives it to the people of the house to drink’.\nSo I said to him<sup>asws</sup>, ‘The people of Al-Kufa are not happy with this’. So he<sup>asws</sup> said: ‘And what is their <span class=\"iTxt\">Nabeez</span>?’ I said, ‘They take the dates, and they clean them and cast Al-Qa’wa over it’. He<sup>asws</sup> said: ‘And what is Al-Qa’wa?’ I said, ‘Al-Daazy’. He<sup>asws</sup> said: ‘And what is Al-Baazy?’ I said, ‘A grain which they come with from Al-Basra, so it is cast into this <span class=\"iTxt\">Al-Nabeez</span> until it boil and it intoxicates. Then they drink it’. So he<sup>asws</sup> said: ‘That is Prohibited’."}]}, {"index": 12192, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:7:24:6", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ اسْتَأْذَنْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) لِبَعْضِ أَصْحَابِنَا فَسَأَلَهُ عَنِ النَّبِيذِ فَقَالَ حَلَالٌ فَقَالَ أَصْلَحَكَ اللَّهُ إِنَّمَا سَأَلْتُ عَنِ النَّبِيذِ الَّذِي يُجْعَلُ فِيهِ الْعَكَرُ فَيَغْلِي حَتَّى يُسْكِرَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) كُلُّ مُسْكِرٍ حَرَامٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, form Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, \n‘I sought permission to Abu Abdullah<sup>asws</sup> for one of our companions, so he asked him<sup>asws</sup> about <span class=\"iTxt\">Al-Nabeez</span> saying, ‘May Allah<sup>azwj</sup> Keep you<sup>asws</sup> well! But rather, I ask you about <span class=\"iTxt\">Al-Nabeez</span> in which the residue is made to be, so it boils until it intoxicates’. So Abu Abdullah<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said: ‘Every intoxicant is Prohibited’."}]}, {"index": 12193, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:7:24:7", "text": "مُحَمَّدُ بْنُ الْحَسَنِ وَ عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ جَمِيعاً عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ عَنْ أَبِيهِ ( عليه السلام ) قَالَ قَدِمَ عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) مِنَ الْيَمَنِ قَوْمٌ فَسَأَلُوهُ عَنْ مَعَالِمِ دِينِهِمْ فَأَجَابَهُمْ فَخَرَجَ الْقَوْمُ بِأَجْمَعِهِمْ فَلَمَّا سَارُوا مَرْحَلَةً قَالَ بَعْضُهُمْ لِبَعْضٍ نَسِينَا أَنْ نَسْأَلَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) عَمَّا هُوَ أَهَمُّ إِلَيْنَا ثُمَّ نَزَلَ الْقَوْمُ ثُمَّ بَعَثُوا وَفْداً لَهُمْ \nفَأَتَى الْوَفْدُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ الْقَوْمَ بَعَثُوا بِنَا إِلَيْكَ يَسْأَلُونَكَ عَنِ النَّبِيذِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ مَا النَّبِيذُ صِفُوهُ لِي فَقَالُوا يُؤْخَذُ مِنَ التَّمْرِ فَيُنْبَذُ فِي إِنَاءٍ ثُمَّ يُصَبُّ عَلَيْهِ الْمَاءُ حَتَّى يَمْتَلِئَ وَ يُوقَدُ تَحْتَهُ حَتَّى يَنْطَبِخَ فَإِذَا انْطَبَخَ أَخَذُوهُ فَأَلْقَوْهُ فِي إِنَاءٍ آخَرَ ثُمَّ صَبُّوا عَلَيْهِ مَاءً ثُمَّ يُمْرَسُ ثُمَّ صَفَّوْهُ بِثَوْبٍ ثُمَّ يُلْقَى فِي إِنَاءٍ ثُمَّ يُصَبُّ عَلَيْهِ مِنْ عَكَرِ مَا كَانَ قَبْلَهُ ثُمَّ يَهْدِرُ وَ يَغْلِي ثُمَّ يَسْكُنُ عَلَى عَكَرَةٍ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَا هَذَا قَدْ أَكْثَرْتَ أَ فَيُسْكِرُ قَالَ نَعَمْ قَالَ فَكُلُّ مُسْكِرٍ حَرَامٌ \nقَالَ فَخَرَجَ الْوَفْدُ حَتَّى انْتَهَوْا إِلَى أَصْحَابِهِمْ فَأَخْبَرُوهُمْ بِمَا قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ الْقَوْمُ ارْجِعُوا بِنَا إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) حَتَّى نَسْأَلَهُ عَنْهَا شِفَاهاً وَ لَا يَكُونَ بَيْنَنَا وَ بَيْنَهُ سَفِيرٌ فَرَجَعَ الْقَوْمُ جَمِيعاً فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ أَرْضَنَا أَرْضٌ دَوِّيَّةٌ وَ نَحْنُ قَوْمٌ نَعْمَلُ الزَّرْعَ وَ لَا نَقْوَى عَلَى الْعَمَلِ إِلَّا بِالنَّبِيذِ فَقَالَ لَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) صِفُوهُ لِي فَوَصَفُوهُ لَهُ كَمَا وَصَفَ أَصْحَابُهُمْ فَقَالَ لَهُمْ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ فَيُسْكِرُ فَقَالُوا نَعَمْ فَقَالَ كُلُّ مُسْكِرٍ حَرَامٌ وَ حَقٌّ عَلَى اللَّهِ أَنْ يَسْقِيَ شَارِبَ كُلِّ مُسْكِرٍ مِنْ طِينَةِ خَبَالٍ أَ فَتَدْرُونَ مَا طِينَةُ خَبَالٍ قَالُوا لَا قَالَ صَدِيدُ أَهْلِ النَّارِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Al Hassan and Ali Bin Muhammad Bin Bundar, altogether, from Ibrahim Bin Is’haq, from Abdullah Bin Hammad, \n(It has been narrated) from Muhammad son of Ja’far<sup>asws</sup>, from his father<sup>asws</sup> having said: ‘A group of people came over to Rasool-Allah<sup>saww</sup> from Al-Yemen. So they asked him<sup>saww</sup> for the information of their Religion, and he<sup>saww</sup> answered them. So the whole of the group went out. So when they had ascended their rides, some of them said to the others, ‘We forgot to ask Rasool-Allah<sup>saww</sup> about what was important to us’. Then the group descended, and sent a delegation of theirs.\nSo the delegation came over to Rasool-Allah<sup>saww</sup>, so they said, ‘O Rasool-Allah<sup>saww</sup>! The group has sent us to you<sup>saww</sup> to ask about <span class=\"iTxt\">Al-Nabeez</span>’. So Rasool-Allah<sup>saww</sup> said: ‘And what is <span class=\"iTxt\">Al-Nabeez</span>. Describe it to me<sup>saww</sup>’. So they said, ‘Some dates are taken and placed in a vessel, then water is poured over it until it is filled, and fir is ignited beneath it until it is cooked. So when it is cooked, it is taken and cast into another vessel. Then water is poured over it, then it is pressed, then filtered with a cloth, then it is cast into a vessel, then the residue from before is poured over it, then it rises and boils, then settles upon the residue’. So Rasool-Allah<sup>saww</sup> said: ‘O you! You have exceeded. Does it intoxicate?’ He said, ‘Yes’. He<sup>saww</sup> said: ‘So every intoxicant is Prohibited’.\nSo the delegation went out until they ended up to their companions and informed them with what Rasool-Allah<sup>saww</sup> had said. So the group said, ‘Return with us to Rasool-Allah<sup>saww</sup> until we ask him<sup>saww</sup> about it verbally and there does not happen to be an ambassador between us and him<sup>saww</sup>’. So the whole group returned and said, ‘O Rasool-Allah<sup>saww</sup>! Our land is a land of insects and we are a people of the plantations, and we are not strong upon the work except by the <span class=\"iTxt\">Nabeez</span>’. So Rasool-Allah<sup>saww</sup> said to them: ‘Describe it to me<sup>saww</sup>’. So they described it to him<sup>saww</sup> just as their companions had described it. So Rasool-Allah<sup>saww</sup> said to them: ‘Does it intoxicate?’ So they said, ‘Yes’. So he<sup>saww</sup> said: ‘Every intoxicant is Prohibited, and it is a right upon Allah<sup>azwj</sup> that He<sup>azwj</sup> should Quench every drinker of the intoxicant from the essence of <span class=\"iTxt\">Khabaal</span>. Do you all know what is the essence of <span class=\"iTxt\">Khabaal</span>?’ They said, ‘No’. He<sup>saww</sup> said: ‘Pus of the inhabitants of the Fire’."}]}]}, "index": "al-kafi:6:7:24", "kind": "verse_list"}