{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 7"}, "path": "/books/al-kafi:6:7", "titles": {"ar": "كتاب الْأَشْرِبَةِ", "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "}}, {"indexed_titles": {"en": "Chapter 31"}, "path": "/books/al-kafi:6:7:31", "titles": {"ar": "باب صِفَةِ الشَّرَابِ الْحَلَالِ", "en": "Chapter 31 – Description of the Permissible drink"}}], "index": 1890, "local_index": 31, "part_type": "Chapter", "path": "/books/al-kafi:6:7:31", "titles": {"ar": "باب صِفَةِ الشَّرَابِ الْحَلَالِ", "en": "Chapter 31 – Description of the Permissible drink"}, "verse_count": 4, "verse_start_index": 12229, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 12230, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:7:31:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ عَلِيِّ بْنِ الْحَسَنِ أَوْ عَنْ رَجُلٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ بْنِ فَضَّالٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى السَّابَاطِيِّ قَالَ وَصَفَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْمَطْبُوخَ كَيْفَ يُطْبَخُ حَتَّى يَصِيرَ حَلَالًا فَقَالَ لِي ( عليه السلام ) خُذْ رُبُعاً مِنْ زَبِيبٍ وَ تُنَقِّيهِ وَ صُبَّ عَلَيْهِ اثْنَيْ عَشَرَ رِطْلًا مِنْ مَاءٍ ثُمَّ أَنْقِعْهُ لَيْلَةً فَإِذَا كَانَ أَيَّامُ الصَّيْفِ وَ خَشِيتَ أَنْ يَنِشَّ جَعَلْتَهُ فِي تَنُّورٍ مَسْجُورٍ قَلِيلًا حَتَّى لَا يَنِشَّ ثُمَّ تَنْزِعُ الْمَاءَ مِنْهُ كُلَّهُ حَتَّى إِذَا أَصْبَحْتَ صَبَبْتَ عَلَيْهِ مِنَ الْمَاءِ بِقَدْرِ مَا يَغْمُرُهُ ثُمَّ تُغْلِيهِ حَتَّى تَذْهَبَ حَلَاوَتُهُ ", "ثُمَّ تَنْزِعُ مَاءَهُ الْآخَرَ فَتَصُبُّ عَلَيْهِ الْمَاءَ الْأَوَّلَ ثُمَّ تَكِيلُهُ كُلَّهُ فَتَنْظُرُ كَمِ الْمَاءُ ثُمَّ تَكِيلُ ثُلُثَهُ فَتَطْرَحُهُ فِي الْإِنَاءِ الَّذِي تُرِيدُ أَنْ تَطْبُخَهُ فِيهِ وَ تَصُبُّ بِقَدْرِ مَا يَغْمُرُهُ مَاءً وَ تُقَدِّرُهُ بِعُودٍ وَ تَجْعَلُ قَدْرَهُ قَصَبَةً أَوْ عُوداً فَتَحُدُّهَا عَلَى قَدْرِ مُنْتَهَى الْمَاءِ ثُمَّ تُغْلِي الثُّلُثَ الْأَخِيرَ حَتَّى يَذْهَبَ الْمَاءُ الْبَاقِي ثُمَّ تُغْلِيهِ بِالنَّارِ وَ لَا تَزَالُ تُغْلِيهِ حَتَّى يَذْهَبَ الثُّلُثَانِ وَ يَبْقَى الثُّلُثُ ", "ثُمَّ تَأْخُذُ لِكُلِّ رُبُعٍ رِطْلًا مِنَ الْعَسَلِ فَتُغْلِيهِ حَتَّى تَذْهَبَ رَغْوَةُ الْعَسَلِ وَ تَذْهَبَ غِشَاوَةُ الْعَسَلِ فِي الْمَطْبُوخِ ثُمَّ تَضْرِبُهُ بِعُودٍ ضَرْباً شَدِيداً حَتَّى يَخْتَلِطَ وَ إِنْ شِئْتَ أَنْ تُطَيِّبَهُ بِشَيْ‏ءٍ مِنْ زَعْفَرَانٍ أَوْ بِشَيْ‏ءٍ مِنْ زَنْجَبِيلٍ فَافْعَلْ ثُمَّ اشْرَبْهُ وَ إِنْ أَحْبَبْتَ أَنْ يَطُولَ مَكْثُهُ عِنْدَكَ فَرَوِّقْهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ali Bin Al Hassan, or from a man, from Ali Bin Al Hassan Bin Fazzal, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Bin Musa Al Sabaty who said, ", "‘Abu Abdullah<sup>asws</sup> described the cooked (raisins) to me, how it is to be cooked until it comes to be Permissible, so he<sup>asws</sup> said to me: ‘Take a quarter of raisins and clean them, and pour twelve <span class=\"iTxt\">ratls</span> (units of measurement) of water over it, then soak it overnight. So when it were the days of summer and you fear that it would simmer, keep it in an oven, a little full until it does not simmer. Then remove all of the water from it until when it is the morning, pour a measurement of water upon it sufficient to soak it. Then boil it until its sweetness is gone.", "The remove the last water and pour the first water over it, then measure whole of it. So look at how much water there is, then measure a third of it and place it in the vessel which you intend to cook it, and pour a measurement of water which would submerge it, and measure it with a cane and make its measurement with a cane or a stick, so limit it upon the measure of when the water ends up to. Then boil the other third until the remaining water evaporates. Then boil it by the fire and do not cease to boil it until the two-thirds evaporates and there remains the third. ", "Then take for every quarter of a <span class=\"iTxt\">ratl</span> of the honey, so boil it until its foam goes away and the mist of the honey goes away in the cooking. Then stir it with the stick with an intense stirring until it mixes up, and if you so desire to you can aromatise it with something from the saffron or with something from the ginger, so do it. Then drink it and if you would like its remaining to be prolonged with you, so keep it clean’."]}}, {"index": 12231, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:7:31:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارٍ السَّابَاطِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سُئِلَ عَنِ الزَّبِيبِ كَيْفَ طَبْخُهُ حَتَّى يُشْرَبَ حَلَالًا فَقَالَ تَأْخُذُ رُبُعاً مِنْ زَبِيبٍ فَتُنَقِّيهِ ثُمَّ تَطْرَحُ عَلَيْهِ اثْنَيْ عَشَرَ رِطْلًا مِنْ مَاءٍ ثُمَّ تُنْقِعُهُ لَيْلَةً فَإِذَا كَانَ مِنَ الْغَدِ نَزَعْتَ سُلَافَتَهُ ثُمَّ تَصُبُّ عَلَيْهِ مِنَ الْمَاءِ قَدْرَ مَا يَغْمُرُهُ ثُمَّ تُغْلِيهِ بِالنَّارِ غَلْيَةً ثُمَّ تَنْزِعُ مَاءَهُ فَتَصُبُّهُ عَلَى الْمَاءِ الْأَوَّلِ", "ثُمَّ تَطْرَحُهُ فِي إِنَاءٍ وَاحِدٍ جَمِيعاً ثُمَّ تُوقِدُ تَحْتَهُ النَّارَ حَتَّى يَذْهَبَ ثُلُثَاهُ وَ يَبْقَى الثُّلُثُ وَ تَحْتَهُ النَّارُ ثُمَّ تَأْخُذُ رِطْلًا مِنْ عَسَلٍ فَتُغْلِيهِ بِالنَّارِ غَلْيَةً وَ تَنْزِعُ رَغْوَتَهُ ثُمَّ تَطْرَحُهُ عَلَى الْمَطْبُوخِ ثُمَّ تَضْرِبُهُ حَتَّى يَخْتَلِطَ بِهِ وَ اطْرَحْ فِيهِ إِنْ شِئْتَ زَعْفَرَاناً وَ إِنْ شِئْتَ تُطَيِّبُهُ بِزَنْجَبِيلٍ قَلِيلٍ هَذَا ", "قَالَ فَإِذَا أَرَدْتَ أَنْ تَقْسِمَهُ أَثْلَاثاً لِتَطْبُخَهُ فَكِلْهُ بِشَيْ‏ءٍ وَاحِدٍ حَتَّى تَعْلَمَ كَمْ هُوَ ثُمَّ اطْرَحْ عَلَيْهِ الْأَوَّلَ فِي الْإِنَاءِ الَّذِي تُغْلِيهِ فِيهِ ثُمَّ تَجْعَلُ فِيهِ مِقْدَاراً وَ حُدَّهُ حَيْثُ يَبْلُغُ الْمَاءُ ثُمَّ اطْرَحِ الثُّلُثَ الْآخَرَ ثُمَّ حُدَّهُ حَيْثُ يَبْلُغُ الْمَاءُ ثُمَّ تَطْرَحُ الثُّلُثَ الْأَخِيرَ ثُمَّ حُدَّهُ حَيْثُ يَبْلُغُ الْآخَرُ ثُمَّ تُوقِدُ تَحْتَهُ بِنَارٍ لَيِّنَةٍ حَتَّى يَذْهَبَ ثُلُثَاهُ وَ يَبْقَى ثُلُثُهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaq Bin Sadaqa, from Ammar Al Sabatany, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the raisins, how to cook it until its drink is Permissible. So he<sup>asws</sup> said: ‘Take a quarter of raisins, so clean these. Then pour twelve <span class=\"iTxt\">ratls</span> (units of measurement) of water over it, then soak it overnight. So when it is the morning, remove its foam, then pour sufficient water over it to submerge it. Then boil it by the fire with a boiling. Then remove its water and pour over it the first water. ", "Then place it all in one vessel, then light a fire beneath it until two-thirds of it evaporates and there remains the third, and under it is the fire. Then take a <span class=\"iTxt\">ratl</span> (unit of measurement) of honey and boil it by the fire with a boiling, and remove its foam. Then place it upon the cooking, then stir it until it is mixed, and place in it, if you so desire to, saffron, and if you so desire to aromatise it by a little ginger’.", "He<sup>asws</sup> said: ‘So if you want to divide it into three in order to cook it, so measure it with one thing until you know how much it is. Then place over it the first in the vessel which it is boiled in, then you should make a measurement and its mark where the water reaches. Then place the other third, then mark it where the water reaches. Then place the other third, then mark it when the last reaches. Then ignite a small fire beneath it (low heat) until two-thirds of it evaporates and there remains one-third of it’."]}}, {"index": 12232, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:7:31:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ مُوسَى بْنِ الْحَسَنِ عَنِ السَّيَّارِيِّ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَمَّنْ أَخْبَرَهُ عَنْ إِسْمَاعِيلَ بْنِ الْفَضْلِ الْهَاشِمِيِّ قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَرَاقِرَ تُصِيبُنِي فِي مَعِدَتِي وَ قِلَّةَ اسْتِمْرَائِي الطَّعَامَ فَقَالَ لِي لِمَ لَا تَتَّخِذُ نَبِيذاً نَشْرَبُهُ نَحْنُ وَ هُوَ يُمْرِئُ الطَّعَامَ وَ يَذْهَبُ بِالْقَرَاقِرِ وَ الرِّيَاحِ مِنَ الْبَطْنِ قَالَ فَقُلْتُ لَهُ صِفْهُ لِي جُعِلْتُ فِدَاكَ ", "فَقَالَ لِي تَأْخُذُ صَاعاً مِنْ زَبِيبٍ فَتُنَقِّي حَبَّهُ وَ مَا فِيهِ ثُمَّ تَغْسِلُ بِالْمَاءِ غَسْلًا جَيِّداً ثُمَّ تُنْقِعُهُ فِي مِثْلِهِ مِنَ الْمَاءِ أَوْ مَا يَغْمُرُهُ ثُمَّ تَتْرُكُهُ فِي الشِّتَاءِ ثَلَاثَةَ أَيَّامٍ بِلَيَالِيهَا وَ فِي الصَّيْفِ يَوْماً وَ لَيْلَةً فَإِذَا أَتَى عَلَيْهِ ذَلِكَ الْقَدْرُ صَفَّيْتَهُ وَ أَخَذْتَ صَفْوَتَهُ وَ جَعَلْتَهُ فِي إِنَاءٍ وَ أَخَذْتَ مِقْدَارَهُ بِعُودٍ ثُمَّ طَبَخْتَهُ طَبْخاً رَفِيقاً حَتَّى يَذْهَبَ ثُلُثَاهُ وَ يَبْقَى ثُلُثُهُ ", "ثُمَّ تَجْعَلُ عَلَيْهِ نِصْفَ رِطْلِ عَسَلٍ وَ تَأْخُذُ مِقْدَارَ الْعَسَلِ ثُمَّ تَطْبُخُهُ حَتَّى تَذْهَبَ تِلْكَ الزِّيَادَةُ ثُمَّ تَأْخُذُ زَنْجَبِيلًا وَ خُولِنْجَاناً وَ دَارَصِينِيَّ وَ الزَّعْفَرَانَ وَ قَرَنْفُلًا وَ مَصْطَكَى وَ تَدُقُّهُ وَ تَجْعَلُهُ فِي خِرْقَةٍ رَقِيقَةٍ وَ تَطْرَحُهُ فِيهِ وَ تُغْلِيهِ مَعَهُ غَلْيَةً ثُمَّ تُنْزِلُهُ فَإِذَا بَرَدَ صَفَّيْتَهُ وَ أَخَذْتَ مِنْهُ عَلَى غَدَائِكَ وَ عَشَائِكَ ", "قَالَ فَفَعَلْتُ فَذَهَبَ عَنِّي مَا كُنْتُ أَجِدُهُ وَ هُوَ شَرَابٌ طَيِّبٌ لَا يَتَغَيَّرُ إِذَا بَقِيَ إِنْ شَاءَ اللَّهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Musa Bin Al Hassan, from Al Sayyari, from Muhammad Bin Al Husayn, from the one who informed him, from Ismail Bin Al Fazl Al Hashimy who said, ", "‘I complained to Abu Abdullah<sup>asws</sup> of the rumbling and the winds in my stomach, and the scarcity of my digestion of the food’. So he<sup>asws</sup> said to me: ‘Why do you not take <span class=\"iTxt\">Nabeez</span> which we<sup>asws</sup> drink and it digests the food and removes the rumbling and the winds from the belly?’ So I said to him<sup>asws</sup>, ‘Describe it for me, may I be sacrificed for you<sup>asws</sup>’. ", "So he<sup>asws</sup> said to me: ‘Take a <span class=\"iTxt\">Sa’a</span> (a unit of measurement - four handfuls) of raisins, so clean its seeds and whatever is in it, then wash it with water with a renewed washing. Then soak it in similar from the water or whatever submerges it. Then leave it in the winter for three days and nights, and in the summer, for one day and one night. So when that times comes up so you take it and make it to be in a vessel, and take its measurement with a stick. Then cook it gently until two-thirds of it goes away and there remains one-third of it. ", "Then make half a <span class=\"iTxt\">ratl</span> (unit of measurement) of honey to be upon it, and take a measurement of the honey. Then cook it until that increment evaporates. Then take ginger and Alpinia (a plant), and cinnamon, and the saffron, and cloves, and mastic resin, and pound these and make these to be in a thin rag, and place it in is and boil it with it with a boiling. Then take it off. So when it has cooled, clean it and take from it upon your lunch and your dinner’. ", "He (the narrator) said, ‘So I did it, and it removed from me what I had, and it was an aromatic drink. It will not change, when it remains (for a while), Allah<sup>azwj</sup> Willing’."]}}, {"index": 12233, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:7:31:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ عَنِ السَّيَّارِيِّ عَمَّنْ ذَكَرَهُ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ شَكَوْتُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) بَعْضَ الْوَجَعِ وَ قُلْتُ إِنَّ الطَّبِيبَ وَصَفَ لِي شَرَاباً آخُذُ الزَّبِيبَ وَ أَصُبُّ عَلَيْهِ الْمَاءَ لِلْوَاحِدِ اثْنَيْنِ ثُمَّ أَصُبُّ عَلَيْهِ الْعَسَلَ ثُمَّ أَطْبُخُهُ حَتَّى يَذْهَبَ ثُلُثَاهُ وَ يَبْقَى الثُّلُثُ فَقَالَ أَ لَيْسَ حُلْواً قُلْتُ بَلَى قَالَ اشْرَبْهُ وَ لَمْ أُخْبِرْهُ كَمِ الْعَسَلُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Abdullah Bin Ja’far, from Al Sayyari, from the one who mentioned it, from Is’haq Bin Ammar who said, ", "‘I complained to Abu Abdullah<sup>asws</sup> of some pain, and I said, ‘The physician has prescribed a drink for me – take the raisins and pour water upon it, two to one. Then pour honey upon it, then cook it until two-thirds of it evaporates and there remains the third’. So he<sup>asws</sup> said: ‘Is it not sweet?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘Drink it’. (He the narrator said), ‘And I did not inform him how much the honey was’."]}}]}, "index": "al-kafi:6:7:31", "kind": "verse_list"}