{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:6:7",
        "titles": {
          "ar": "كتاب الْأَشْرِبَةِ",
          "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:6:7:34",
        "titles": {
          "ar": "باب الْخَمْرِ تُجْعَلُ خَلًّا",
          "en": "Chapter 34 – The wine made into vinegar"
        }
      }
    ],
    "index": 1902,
    "local_index": 34,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 35"
        },
        "path": "/books/al-kafi:6:7:35",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 35 – The Miscellaneous"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:6:7:33",
        "titles": {
          "ar": "باب الْأَوَانِي يَكُونُ فِيهَا الْخَمْرُ ثُمَّ يُجْعَلُ فِيهَا الْخَلُّ أَوْ يُشْرَبُ بِهَا",
          "en": "Chapter 33 – The utensils in which happens to be the wine, then the vinegar is made to be in it, or is drunk by it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 7"
        },
        "path": "/books/al-kafi:6:7",
        "titles": {
          "ar": "كتاب الْأَشْرِبَةِ",
          "en": "<a id=\"_Toc452729926\"></a>THE BOOK OF DRINKS "
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:7:34",
    "titles": {
      "ar": "باب الْخَمْرِ تُجْعَلُ خَلًّا",
      "en": "Chapter 34 – The wine made into vinegar"
    },
    "verse_count": 4,
    "verse_start_index": 12249,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/295)"
        ],
        "index": 12250,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:34:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنِ ابْنِ بُكَيْرٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْخَمْرِ يُصْنَعُ فِيهَا الشَّيْ‏ءُ حَتَّى تُحَمِّضَ قَالَ إِذَا كَانَ الَّذِي صُنِعَ فِيهَا هُوَ الْغَالِبُ عَلَى مَا صُنِعَ فِيهِ فَلَا بَأْسَ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Khalid, from Ibn Bukeyr, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the wine, something is done in it until it acidifies. He<sup>asws</sup> said: ‘If that which was done in it, it overcame upon what was made in it, so there is no problem with it’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn Khalid from ibn Bukayr from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about wine to which something is done until it is turned sour. He (the Imam) said, ’If what is done in it (the wine) overwhelms it, then is not harmful/” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/296)"
        ],
        "index": 12251,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:34:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ وَ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْخَمْرِ الْعَتِيقَةِ تُجْعَلُ خَلًّا قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, and Ibn Bukeyr, from Zurara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘I asked him<sup>asws</sup> about the old (wine) turned into vinegar. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil ibn Darraj and ibn Bukayr from Zurarah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about al- ‘Atiqah (old) wine which is turned into vinegar. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (22/296)"
        ],
        "index": 12252,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:34:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ ابْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَأْخُذُ الْخَمْرَ فَيَجْعَلُهَا خَلًّا قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhamad Bin Isa, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Ibn Bukeyr, from Ubeyd Bin Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who took the wine and made it into vinegar. He<sup>asws</sup> said: ‘There is no problem’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from ibn Bukayr from ‘Ubayd ibn Zurarah who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who takes wine and turns it into vinegar. He (the Imam) said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (2/296)"
        ],
        "index": 12253,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:7:34:4",
        "text": [
          "عَنْهُ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنْ عَبْدِ اللَّهِ بْنِ بُكَيْرٍ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْخَمْرِ تُجْعَلُ خَلًّا قَالَ لَا بَأْسَ إِذَا لَمْ يُجْعَلْ فِيهَا مَا يَغْلِبُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Fazalat Bin Ayoub, from Abdullah Bin Bukeyr, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the wine made into vinegar. He<sup>asws</sup> said: ‘No problem if one does not make to be in it, what overwhelms it’."
          ],
          "en.sarwar": [
            "4. It is narrated from the narrator of the previous Hadith from Fadalah ibn Ayyub from ‘Abd Allah ibn Bukayr from abu Basir who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about wine which is turned into vinegar. He (the Imam) said, ‘It is not harmful if one has not placed in it what overwhelms it.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:7:34",
  "kind": "verse_list"
}