{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 1"
        },
        "path": "/books/al-kafi:5:1:1",
        "titles": {
          "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ فَضْلِ الْجِهَادِ</span>",
          "en": "Chapter 1 – Merits of the Jihad"
        }
      }
    ],
    "index": 1181,
    "local_index": 1,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:5:1:2",
        "titles": {
          "ar": "باب جِهَادِ الرَّجُلِ وَ الْمَرْأَةِ ",
          "en": "Chapter 2 – Jihad of the man and the woman"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:1",
    "titles": {
      "ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>َابُ فَضْلِ الْجِهَادِ</span>",
      "en": "Chapter 1 – Merits of the Jihad"
    },
    "verse_count": 15,
    "verse_start_index": 8150,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/320)"
        ],
        "index": 8151,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/197",
              "text": "عُمَرَ بْنِ أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عُمَرَ بْنِ أَبَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:1",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْخَيْرُ كُلُّهُ فِي السَّيْفِ وَ تَحْتَ ظِلِّ السَّيْفِ وَ لَا يُقِيمُ النَّاسَ إِلَّا السَّيْفُ وَ السُّيُوفُ مَقَالِيدُ الْجَنَّةِ وَ النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Umar Bin Aban, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The goodness, all of it is in the sword, and beneath the shadow of the sword; and nothing can straighten the people except for the sword, and the swords are the keys of the Paradise and the Fire’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ‘Umar ibn Aban from abu ‘Abd Allah ‘Alayhi al-Salam, who has said the following: “The Messenger of Allah has said, ‘All good things are with the sword, under the shadow (protection) of sword and people cannot be improved without the sword. Swords are the key to paradise or hellfire.’” "
          ]
        }
      },
      {
        "index": 8152,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِلْجَنَّةِ بَابٌ يُقَالُ لَهُ بَابُ الْمُجَاهِدِينَ يَمْضُونَ إِلَيْهِ فَإِذَا هُوَ مَفْتُوحٌ وَ هُمْ مُتَقَلِّدُونَ بِسُيُوفِهِمْ وَ الْجَمْعُ فِي الْمَوْقِفِ وَ الْمَلَائِكَةُ تُرَحِّبُ بِهِمْ ",
          "ثُمَّ قَالَ فَمَنْ تَرَكَ الْجِهَادَ أَلْبَسَهُ اللَّهُ عَزَّ وَ جَلَّ ذُلًّا وَ فَقْراً فِي مَعِيشَتِهِ وَ مَحْقاً فِي دِينِهِ إِنَّ اللَّهَ عَزَّ وَ جَلَّ أَغْنَى أُمَّتِي بِسَنَابِكِ خَيْلِهَا وَ مَرَاكِزِ رِمَاحِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘For the Paradise there is a door called ‘<span class=\"iTxt\">Al-Mujahideen</span>’ (The Combatants). They would be going to it, so it be open and they would be collared with their swords, and the troops would be in the Pausing Station, and the Angels would be welcoming them’.",
            "Then he<sup>saww</sup> said: ‘So the one who neglects the Jihad, Allah<sup>azwj</sup> Mighty and Majestic would Clothe him with disgrace and poverty in his living, and Obliterate (remove) his Religion. May Allah<sup>azwj</sup> Mighty and Majestic Make my<sup>saww</sup> community to be self-sufficient by the hooves of its cavalry horses and the points of its spears’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father, from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘In paradise there is a door which is called ‘the door of people serving in the army’. They walk to it and it is open and they have their swords fixed on them ready and in place. The angels welcome them.’ He then said, ‘Whoever ignores joining the army, Allah, the Most Majestic, the Most Glorious, dresses him up with humiliation, poverty and his religion is destroyed. Allah, the Most Majestic, the Most Glorious, makes my followers self-sufficient through the hooves of their horses and the points of their spears.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/321)"
        ],
        "index": 8153,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1517",
              "text": "بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِإِسْنَادِهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:3",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله  ) خُيُولُ الْغُزَاةِ فِي الدُّنْيَا خُيُولُهُمْ فِي الْجَنَّةِ وَ إِنَّ أَرْدِيَةَ الْغُزَاةِ لَسُيُوفُهُمْ ",
          "وَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) أَخْبَرَنِي جَبْرَئِيلُ ( عليه السلام ) بِأَمْرٍ قَرَّتْ بِهِ عَيْنِي وَ فَرِحَ بِهِ قَلْبِي قَالَ يَا مُحَمَّدُ مَنْ غَزَا مِنْ أُمَّتِكَ فِي سَبِيلِ اللَّهِ فَأَصَابَهُ قَطْرَةٌ مِنَ السَّمَاءِ أَوْ صُدَاعٌ كَتَبَ اللَّهُ عَزَّ وَ جَلَّ لَهُ شَهَادَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, (it is) narrated, ‘Rasool-Allah<sup>saww</sup> said: ‘The cavalry horses of the combatants in the world would be their horses in the Paradise, and that the robes of the combatants are their swords’. ",
            "And the Prophet<sup>saww</sup> said: ‘Jibraeel<sup>as</sup> informed me<sup>saww</sup> of a matter by which my<sup>saww</sup> eyes were delighted and my<sup>saww</sup> heart was happy with it. He<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! The one from your<sup>saww</sup> community who fights in the Way of Allah<sup>azwj</sup>, so a drop from the sky were to hit him, or a headache, Allah<sup>azwj</sup> Mighty and Majestic would Write the martyrdom for him’’."
          ],
          "en.sarwar": [
            "3. Through the chains of his narrator Ali ibn Ibrahim has narrated the following: “The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘The horses of the people serving in the army are their horses in paradise, and the gowns of the fighters for the cause of Allah are their swords. The Holy Prophet has said, ‘ Jibril (Gabriel) has told me something which has made my eyes and heart delightful, “O Muhammad, whoever of your followers fights for the cause of Allah, thereafter even if a drop from the sky falls on him or he experiences a flu, Allah, the Most Majestic, the Most Glorious, lists him as a martyr.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/321)"
        ],
        "index": 8154,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ بَعْضِ أَصْحَابِهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:4",
        "text": [
          " كَتَبَ أَبُو جَعْفَرٍ ( عليه السلام ) فِي رِسَالَةٍ إِلَى بَعْضِ خُلَفَاءِ بَنِي أُمَيَّةَ وَ مِنْ ذَلِكَ مَا ضَيَّعَ الْجِهَادَ الَّذِي فَضَّلَهُ اللَّهُ عَزَّ وَ جَلَّ عَلَى الْأَعْمَالِ وَ فَضَّلَ عَامِلَهُ عَلَى الْعُمَّالِ تَفْضِيلًا فِي الدَّرَجَاتِ وَ الْمَغْفِرَةِ وَ الرَّحْمَةِ لِأَنَّهُ ظَهَرَ بِهِ الدِّينُ وَ بِهِ يُدْفَعُ عَنِ الدِّينِ وَ بِهِ اشْتَرَى اللَّهُ مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَ أَمْوَالَهُمْ بِالْجَنَّةِ بَيْعاً مُفْلِحاً مُنْجِحاً اشْتَرَطَ عَلَيْهِمْ فِيهِ حِفْظَ الْحُدُودِ ",
          "وَ أَوَّلُ ذَلِكَ الدُّعَاءُ إِلَى طَاعَةِ اللَّهِ عَزَّ وَ جَلَّ مِنْ طَاعَةِ الْعِبَادِ وَ إِلَى عِبَادَةِ اللَّهِ مِنْ عِبَادَةِ الْعِبَادِ وَ إِلَى وَلَايَةِ اللَّهِ مِنْ وَلَايَةِ الْعِبَادِ",
          "فَمَنْ دُعِيَ إِلَى الْجِزْيَةِ فَأَبَى قُتِلَ وَ سُبِيَ أَهْلُهُ وَ لَيْسَ الدُّعَاءُ مِنْ طَاعَةِ عَبْدٍ إِلَى طَاعَةِ عَبْدٍ مِثْلِهِ وَ مَنْ أَقَرَّ بِالْجِزْيَةِ لَمْ يُتَعَدَّ عَلَيْهِ وَ لَمْ تُخْفَرْ ذِمَّتُهُ وَ كُلِّفَ دُونَ طَاقَتِهِ",
          "وَ كَانَ الْفَيْ‏ءُ لِلْمُسْلِمِينَ عَامَّةً غَيْرَ خَاصَّةٍ وَ إِنْ كَانَ قِتَالٌ وَ سَبْيٌ سِيرَ فِي ذَلِكَ بِسِيرَتِهِ وَ عُمِلَ فِي ذَلِكَ بِسُنَّتِهِ مِنَ الدِّينِ",
          "ثُمَّ كَلَّفَ الْأَعْمَى وَ الْأَعْرَجَ الَّذِينَ لَا يَجِدُونَ مَا يُنْفِقُونَ عَلَى الْجِهَادِ بَعْدَ عُذْرِ اللَّهِ عَزَّ وَ جَلَّ إِيَّاهُمْ وَ يُكَلِّفُ الَّذِينَ يُطِيقُونَ مَا لَا يُطِيقُونَ",
          "وَ إِنَّمَا كَانُوا أَهْلَ مِصْرٍ يُقَاتِلُونَ مَنْ يَلِيهِ يُعْدَلُ بَيْنَهُمْ فِي الْبُعُوثِ فَذَهَبَ ذَلِكَ كُلُّهُ حَتَّى عَادَ النَّاسُ رَجُلَيْنِ أَجِيرٌ مُؤْتَجِرٌ بَعْدَ بَيْعِ اللَّهِ وَ مُسْتَأْجِرٌ صَاحِبَهُ غَارِمٌ وَ بَعْدَ عُذْرِ اللَّهِ وَ ذَهَبَ الْحَجُّ فَضُيِّعَ وَ افْتَقَرَ النَّاسُ فَمَنْ أَعْوَجُ مِمَّنْ عَوَّجَ هَذَا وَ مَنْ أَقْوَمُ مِمَّنْ أَقَامَ هَذَا فَرَدَّ الْجِهَادَ عَلَى الْعِبَادِ وَ زَادَ الْجِهَادَ عَلَى الْعِبَادِ إِنَّ ذَلِكَ خَطَأٌ عَظِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from one of his companions who said, ",
            "‘Abu Ja’far<sup>asws</sup> wrote in a message to one of the caliphs of the Clan of Umayya: ‘And from that is what he wasted of the Jihad which Allah<sup>azwj</sup> Mighty and Majestic has Preferred over the (rest of the) deeds, and Preferred its performer over (the rest of the) performers with a Preference in the Levels, and the Forgiveness, and the Mercy, because by it the Religion is Manifested, and by it the Religion is defended, and by it Allah<sup>azwj</sup> has Bought from the Believers, their own selves and their wealth by the Paradise, a benefit, a success, a salvation, and Stiuplated upon them with regards to it, preservation of the Limits.",
            "And the first of that (Stipulation) is the calling to the obedience to Allah<sup>azwj</sup> Mighty and Majestic from the obedience to the servants of Allah<sup>azwj</sup>, and to the worship of Allah<sup>azwj</sup> from the worship of the servants, and to the <span class=\"iTxt\">Wilayah</span> of Allah<sup>azwj</sup> from the <span class=\"iTxt\">Wilayah</span> of the servants. ",
            "So the one to whom taxation is claimed for and he refuses, would be killed and his family would be made captives, and there is no calling from obedience to a servant to the obedience of a servant like it. And the one who accepts with the (payment of) taxation, there would be no exceeding upon him, and would not be shamed for his responsibilities, and he would be encumber with less than his strength.",
            "And the war booty would be for the Muslims in general other than special (groups). And if there was killing and there are captives, the conduct with regards to that would be by his<sup>saww</sup> conduct, and the dealings regarding that would be by his<sup>saww</sup> Sunnah from the Religion. ",
            "Then he (the caliph) encumbered (taxed) the blind and the lame, those who could not find what they could spend upon the Jihad after Allah<sup>azwj</sup> Mighty and Majestic had Excused them, and he encumbered (taxed) those who were unable to afford what they were asked to pay. ",
            "And rather, the people of the city were doing justice between those who were fighting around them, so all of that has gone away to the extent that the people have returned two men with a wages of one after him having sold (his services to) Allah<sup>azwj</sup> and employed his companion by fining him after Allah<sup>azwj</sup> had Excused him. ",
            "And the Hajj was taken and wasted and the people were impoverished. So who is more crooked than the one of this crookedness, and who is more straight than the one who straightened this.  So he imposed the Jihad upon the servants while cutting-off the expenses of the Jihad upon the servants, in that being a grievous error’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from certain individuals of his people who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, once wrote in a letter to a certain individual of the Amawide rulers the following: “Of his neglectfulness one example is his disregard of the duty of Jihad (serving in the army) which Allah, the Most Majestic, the Most Glorious, has given preference over all other good deeds. He (Allah) has given preference to those serving in the army over the doers of good deeds a very clear preference in matters of high positions, their receiving forgiveness and mercifulness. This is because by serving in the army religion is supported to become public and it is defended thereby as well. By means of Jihad (a person’s serving in the army) Allah has purchased believers’ souls and property as their payment for paradise which is a gainful bargain indeed. He (Allah) has set upon them the condition of their abiding by the rules of armed engagement. Of such rules is calling to the obedience of Allah, the Most Majestic, the Most Glorious, instead of obedience to people (servants of Allah), to the worship of Allah instead of worshipping other servants of Allah and to accept guardianship of Allah instead of seeking guardianship of the servants of Allah. Those who are asked to pay taxes but refuse are executed and their families are taken into custody. “There is no calling of servants of Allah to the obedience of other servants of Allah. Those who agree to pay taxes are not violated, their covenant is safe guarded, and is not burdened beyond what he can afford. “The properties captured from the enemies belong to all Muslims and not to a particular group. If an armed confrontation takes place and people are captured, the whole issue is dealt with according to his (the Holy Prophet’s) dealings and traditions which are of religion’s rules in such issues. He (the particular ruler) then placed the burden of serving in the army upon such people as those with disabilities like blind or lame and those who do not have the means to serve in the army, after being excused by Allah, the Most Majestic, the Most Glorious, and those who cannot afford. The residents of a city are required to fight only the nearby enemy with fairness and justice exercised in issues of mobilization. All such laws were disregarded and people are made to live in one of the two conditions: To live like the person who offers a certain service but instead of receiving wages is made to pay, although Allah has already purchased his services; and a person who asks to rent or hire an item but the party of other side of his contract is bankrupt and indebted, although Allah has excused him. He has ignored al-Hajj in disregard and people are left in poverty. Who then is more crooked than this that has made such straightforward laws seem crooked and who is more straightforward than him who properly follows them? Instead he has made people to serve in the army (unduly) and has made such a service an extra burden and this is a great mistake and sin.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/323)"
        ],
        "index": 8155,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/42",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/622",
              "text": "عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3285",
              "text": "حَيْدَرَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ حَيْدَرَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:5",
        "text": [
          " الْجِهَادُ أَفْضَلُ الْأَشْيَاءِ بَعْدَ الْفَرَائِضِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of his companions, from Abdullah Bin Abdul Rahman Al Asamma, from Haydara, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Jihad is the most superior of the things (deeds) after (fulfilling) the Obligations’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from certain individuals of his people from ‘Abd Allah ibn ‘Abd al-Rahman al-Asamm from Haydarah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Jihad (serving in the army) is the most virtuous task except obligatory (prayers) matters.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/323)"
        ],
        "index": 8156,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/3286",
              "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3287",
              "text": "جَعْفَرِ بْنِ عَبْدِ اللَّهِ الْعَلَوِيِّ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1870",
              "text": "أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/391",
              "text": "عَلِيِّ بْنِ الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3288",
              "text": "إِسْمَاعِيلَ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " جَمِيعاً عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3289",
              "text": "أَبِي رَوْحٍ فَرَجِ بْنِ قُرَّةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/278",
              "text": "مَسْعَدَةَ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ حَدَّثَنِي "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3290",
              "text": "ابْنُ أَبِي لَيْلَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3291",
              "text": "أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَحْمَدُ بْنُ مُحَمَّدِ بْنِ سَعِيدٍ عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ الْعَلَوِيِّ وَ أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنْ عَلِيِّ بْنِ الْعَبَّاسِ عَنْ إِسْمَاعِيلَ بْنِ إِسْحَاقَ جَمِيعاً عَنْ أَبِي رَوْحٍ فَرَجِ بْنِ قُرَّةَ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ قَالَ حَدَّثَنِي ابْنُ أَبِي لَيْلَى عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:6",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ أَمَّا بَعْدُ فَإِنَّ الْجِهَادَ بَابٌ مِنْ أَبْوَابِ الْجَنَّةِ فَتَحَهُ اللَّهُ لِخَاصَّةِ أَوْلِيَائِهِ وَ سَوَّغَهُمْ كَرَامَةً مِنْهُ لَهُمْ وَ نِعْمَةٌ ذَخَرَهَا",
          "وَ الْجِهَادُ هُوَ لِبَاسُ التَّقْوَى وَ دِرْعُ اللَّهِ الْحَصِينَةُ وَ جُنَّتُهُ الْوَثِيقَةُ فَمَنْ تَرَكَهُ رَغْبَةً عَنْهُ أَلْبَسَهُ اللَّهُ ثَوْبَ الذُّلِّ وَ شَمِلَهُ الْبَلَاءُ وَ فَارَقَ الرِّضَا وَ دُيِّثَ بِالصَّغَارِ وَ الْقَمَاءَةِ وَ ضُرِبَ عَلَى قَلْبِهِ بِالْأَسْدَادِ وَ أُدِيلَ الْحَقُّ مِنْهُ بِتَضْيِيعِ الْجِهَادِ وَ سِيمَ الْخَسْفَ وَ مُنِعَ النَّصَفَ",
          "أَلَا وَ إِنِّي قَدْ دَعَوْتُكُمْ إِلَى قِتَالِ هَؤُلَاءِ الْقَوْمِ لَيْلًا وَ نَهَاراً وَ سِرّاً وَ إِعْلَاناً وَ قُلْتُ لَكُمْ اغْزُوهُمْ قَبْلَ أَنْ يَغْزُوكُمْ فَوَ اللَّهِ مَا غُزِيَ قَوْمٌ قَطُّ فِي عُقْرِ دَارِهِمْ إِلَّا ذَلُّوا فَتَوَاكَلْتُمْ وَ تَخَاذَلْتُمْ حَتَّى شُنَّتْ عَلَيْكُمُ الْغَارَاتُ وَ مُلِكَتْ عَلَيْكُمُ الْأَوْطَانُ هَذَا أَخُو غَامِدٍ قَدْ وَرَدَتْ خَيْلُهُ الْأَنْبَارَ وَ قَتَلَ حَسَّانَ بْنَ حَسَّانَ الْبَكْرِيَّ وَ أَزَالَ خَيْلَكُمْ عَنْ مَسَالِحِهَا",
          "وَ قَدْ بَلَغَنِي أَنَّ الرَّجُلَ مِنْهُمْ كَانَ يَدْخُلُ عَلَى الْمَرْأَةِ الْمُسْلِمَةِ وَ الْأُخْرَى الْمُعَاهَدَةِ فَيَنْتَزِعُ حِجْلَهَا وَ قُلْبَهَا وَ قَلَائِدَهَا وَ رِعَاثَهَا مَا تُمْنَعُ مِنْهُ إِلَّا بِالِاسْتِرْجَاعِ وَ الِاسْتِرْحَامِ ثُمَّ انْصَرَفُوا وَافِرِينَ مَا نَالَ رَجُلًا مِنْهُمْ كَلْمٌ وَ لَا أُرِيقَ لَهُ دَمٌ فَلَوْ أَنَّ امْرَأً مُسْلِماً مَاتَ مِنْ بَعْدِ هَذَا أَسَفاً مَا كَانَ بِهِ مَلُوماً بَلْ كَانَ عِنْدِي بِهِ جَدِيراً",
          "فَيَا عَجَباً عَجَباً وَ اللَّهِ يَمِيثُ الْقَلْبَ وَ يَجْلِبُ الْهَمَّ مِنِ اجْتِمَاعِ هَؤُلَاءِ عَلَى بَاطِلِهِمْ وَ تَفَرُّقِكُمْ عَنْ حَقِّكُمْ فَقُبْحاً لَكُمْ وَ تَرَحاً حِينَ صِرْتُمْ غَرَضاً يُرْمَى يُغَارُ عَلَيْكُمْ وَ لَا تُغِيرُونَ وَ تُغْزَوْنَ وَ لَا تَغْزُونَ وَ يُعْصَى اللَّهُ وَ تَرْضَوْنَ",
          "فَإِذَا أَمَرْتُكُمْ بِالسَّيْرِ إِلَيْهِمْ فِي أَيَّامِ الْحَرِّ قُلْتُمْ هَذِهِ حَمَارَّةُ الْقَيْظِ أَمْهِلْنَا حَتَّى يُسَبَّخَ عَنَّا الْحَرُّ وَ إِذَا أَمَرْتُكُمْ بِالسَّيْرِ إِلَيْهِمْ فِي الشِّتَاءِ قُلْتُمْ هَذِهِ صَبَارَّةُ الْقُرِّ أَمْهِلْنَا حَتَّى يَنْسَلِخَ عَنَّا الْبَرْدُ كُلُّ هَذَا فِرَاراً مِنَ الْحَرِّ وَ الْقُرِّ فَإِذَا كُنْتُمْ مِنَ الْحَرِّ وَ الْقُرِّ تَفِرُّونَ فَأَنْتُمْ وَ اللَّهِ مِنَ السَّيْفِ أَفَرُّ",
          "يَا أَشْبَاهَ الرِّجَالِ وَ لَا رِجَالَ حُلُومُ الْأَطْفَالِ وَ عُقُولُ رَبَّاتِ الْحِجَالِ لَوَدِدْتُ أَنِّي لَمْ أَرَكُمْ وَ لَمْ أَعْرِفْكُمْ مَعْرِفَةً وَ اللَّهِ جَرَّتْ نَدَماً وَ أَعْقَبَتْ ذَمّاً قَاتَلَكُمُ اللَّهُ لَقَدْ مَلَأْتُمْ قَلْبِي قَيْحاً وَ شَحَنْتُمْ صَدْرِي غَيْظاً وَ جَرَّعْتُمُونِي نُغَبَ التَّهْمَامِ أَنْفَاساً وَ أَفْسَدْتُمْ عَلَيَّ رَأْيِي بِالْعِصْيَانِ وَ الْخِذْلَانِ حَتَّى لَقَدْ قَالَتْ قُرَيْشٌ إِنَّ ابْنَ أَبِي طَالِبٍ رَجُلٌ شُجَاعٌ وَ لَكِنْ لَا عِلْمَ لَهُ بِالْحَرْبِ لِلَّهِ أَبُوهُمْ وَ هَلْ أَحَدٌ مِنْهُمْ أَشَدُّ لَهَا مِرَاساً وَ أَقْدَمُ فِيهَا مَقَاماً مِنِّي لَقَدْ نَهَضْتُ فِيهَا وَ مَا بَلَغْتُ الْعِشْرِينَ وَ هَا أَنَا قَدْ ذَرَّفْتُ عَلَى السِّتِّينَ وَ لَكِنْ لَا رَأْيَ لِمَنْ لَا يُطَاعُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Bin Saeed, from Ja’far Bin Abdullah Al Alawy, and Ahmad Bin Muhammad Al Kufy, from Ali Bin Al Abbas, from Ismail Bin Is’haq, altogether from Abu Rawh Faraj Bin Qurra, from Mas’ada Bin Sada who said, ‘Ibn Abu layli narrated to me, from Abu Abdul Rahman Al Sulmy who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘However, the Jihad is a door from the doors of the Paradise, Allah<sup>azwj</sup> having Opened it for His<sup>azwj</sup> special friends, and Justified for them the prestige from it, and Bounties which are in His<sup>azwj</sup> Treasures. ",
            "And the Jihad, it is a clothing of piety and a fortified armour of Allah<sup>azwj</sup> and His<sup>azwj</sup> strong shield. So the one who neglects it, turning away from it, Allah<sup>azwj</sup> would Clothe him with the clothes of the humiliation and the afflictions would engulf him, and the Pleasure (of Allah<sup>azwj</sup>) would Depart, and he would be killed by the small and the irrelevant matters, and he would be hit upon his heart by the barriers, and the truth would be blocked from him by the wasting of the Jihad, the lowliness engulfs him, and the justice is denied.",
            "Indeed! And I<sup>asws</sup> have invited you all to the fighting of these people night and day, and secretly and openly, and I<sup>asws</sup> said to you all: ‘Battle them before they attack you!’, for by Allah<sup>azwj</sup>, never have a people been attacked at all in the doorsteps of their houses except they were humiliated. But, you were complacent and showed cowardice until they launched the raids upon you, and possessed the homelands against you. This brother of Ghamid (Muawiya’s assassin), his cavalry has entered Al-Anbar and killed Hassan Bin Hassan Al-Bakry (governor appointed by Amir Al-Momineen<sup>asws</sup>), and your cavalry was removed from its positions.",
            "And it has reached me that the men from them came upon the Muslim women and the women under the responsibility, so they snatched their anklets, and their ear-rings, and their necklaces, and their ornaments what they could not prevent from except by the saying of ‘To Allah<sup>azwj</sup> is the return’, and the begging for the mercy. Then they dispersed, and it is dismaying what the men from them attained without sustaining any injuries or shedding any blood. So if the Muslim man were to die of regret from after this, he would not be blamed for it, but with me<sup>asws</sup> he would be worthy. ",
            "So how astonishing, how astonishing! By Allah<sup>azwj</sup>, the heart melts and the flesh is aroused from their gathering upon their falsehood, and your scattering upon your truth. So, ugly it is for you and a distress where you were purposely thrown with your self-esteem upon you and you did not have any self-esteem, and they attacked you and you did not counter them, and you disobeyed Allah<sup>azwj</sup> and you are pleased.",
            "So whenever I<sup>asws</sup> order you with the marching against them in the days of heat, you say, ‘This is sweltering heat. Bear with us until the heat passes from us’. And whenever I<sup>asws</sup> order you with the marching against them in the winter, you say, ‘This is severely cold. Bear with us until the cold withdraws from us’. All this is fleeing the heat and the cold. So when you are fleeing from the heat and the cold, so you are, by Allah<sup>azwj</sup>, fleeing from the swords.",
            "O resemblers of the men and who are not men, bearing the minds of the children and the intellects of the maidens! I<sup>asws</sup> wish I<sup>asws</sup> had never seen you and had never known you! By Allah<sup>azwj</sup>! Remorse and sorrow has flowed. May Allah<sup>azwj</sup> Kill you all, for you have reacted to my<sup>asws</sup> advice with illmanners, and loaded my<sup>asws</sup> chest with fury and have made me<sup>asws</sup> to swallow sorrow with every breath, and you have spoilt upon me<sup>asws</sup> my<sup>asws</sup> decisions with the disobedience and the abandonment to the extent that the Qureysh said, ‘The son<sup>asws</sup> of Abu Talib<sup>as</sup> is a brave man, but he<sup>asws</sup> has no knowledge with him<sup>asws</sup> for the war. ",
            "For the Sake of Allah<sup>azwj</sup>, their fathers (know), and is there anyone from them more intense for it in strength, and from before, in standing for it than myself<sup>asws</sup>? I<sup>asws</sup> got up for it and I<sup>asws</sup> had not reached the twenties (years of age), and at the moment I<sup>asws</sup> have exceeded upon sixty, but there is no view for the one who has no obedience’."
          ],
          "en.sarwar": [
            "6. Ahmad ibn Muhammad ibn Sa‘id has narrated from Ja’far ibn ‘Abd Allah al-‘Alawiy and Ahmad ibn Muhammad al-Kufiy from Ali ibn al-‘Abbas, from Isma’il ibn Ishaq, all from abu Faraj ibn Qurrah, who has narrated from Mas’adah ibn Sadaqah. He has said that narrated to him ibn abu Layla’ from abu ‘Abd al-Rahman al-Sullamiy who has said that Amir al-Mu’minin, ‘Alayhi al-Salam, has said who has said the following: “Thereafter, (my praising Allah) you must take notice that Jihad (serving in the army) is one of the doors to paradise. Allah has opened it for His special friends whom He has made to deserve it through His generosity toward them and a bounty, which He has stored. Jihad is the garment of piety and it is Allah’s invincible gown and strong shield. If one ignores it in disregard Allah dresses him up in humiliation. Misfortune engulfs him, small and worthless issues humiliate him and barriers block his heart. Truth moves away from him due to his disregard of Jihad. Hardship disturbs him and he is denied justice. I certainly have been asking you days and nights, privately and in public to fight those people (supporters of Mu‘awiyah), saying, ‘Attack them before they do so. By Allah, a people attacked in their own territory are always humiliated.’ You kept postponing my calls in betrayal until attacks were launched upon you and territories were captured. It is the brother of Ghamid (Sufyan ibn ‘Awf, Mu‘awiyah’s hit-man) whose troops have entered al-Anbar and have murdered Hassan ibn Hassan al-Bakriy (the governor appointed by Amir al-Mu’minin). Your troops were dislodged from their fortifications. I am informed that their men violate Muslimah women as well as tax-payers’ women, took away their bracelets, earrings and their other ornaments and they had no means of defense against them except begging for mercy and saying ‘to Allah we return.’ They then left with plenty of wealth and none of them suffered any injuries or lost a single drop of blood. If a Muslim would die in sorrow and anguish due to this tragedy he should not be blamed and in my opinion it is worthwhile of him. It indeed is shocking, by Allah, it is shocking. It causes the heart to melt and fills it up with sorrow to see how those people are united around their falsehood and your suffering discord despite your having the truth with you. It is a shame and a disgrace that despite your being their target of attack, you do not counter-attack them. They fight you but you do not fight. Allah is disobeyed and you condone such disobedience. When I command you to march against the enemy during summer you say, ‘It is very hot. Give us time until the heat is reduced.’ When I command you to march against them during winter, you say, Tt is very cold. Give us time until the cold season is over.’ All of such excuses are just to run away from hot and cold elements. If you run away from hot and cold seasons, from swords, by Allah, you will run away much faster. O you, who look like a man, you are not a man of courage. You in wish-fullness are like children and your power of reason is like that of the house- maidens. I wish I had not seen you and had not know you at all. It by Allah has brought only regret and sorrow. I wish Allah fights against you for filling up my heart with sadness as if it is filled with puss and my chest with anguish as if you have made me breathe blows of sorrow with every breath. You have turned my decision to no effect due to your disobedience and betrayal, so much so that Quraysh says, The son of abu Talib is a brave man but he does not know how to fight a war.’ One should for the sake of Allah, judge what they say. Has anyone among them dealt with wars with greater intensity than the way I have dealt with them or has anyone among them been involved with wars for such a long time as I have been facing wars? I stood firm in wars when I was not yet in my twenties and now I am in my sixties but one who is not obeyed has no opinion.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/329)"
        ],
        "index": 8157,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَلِيِّ بْنِ الْحَكَمِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3292",
              "text": "أَبِي حَفْصٍ الْكَلْبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي حَفْصٍ الْكَلْبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:7",
        "text": [
          " إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ رَسُولَهُ بِالْإِسْلَامِ إِلَى النَّاسِ عَشْرَ سِنِينَ فَأَبَوْا أَنْ يَقْبَلُوا حَتَّى أَمَرَهُ بِالْقِتَالِ فَالْخَيْرُ فِي السَّيْفِ وَ تَحْتَ السَّيْفِ وَ الْأَمْرُ يَعُودُ كَمَا بَدَأَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abu Hafs Al Kalby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Sent His<sup>azwj</sup> Rasool<sup>saww</sup> with Al-Islam to the people. For ten years they refused to accept until He<sup>azwj</sup> Commanded him<sup>saww</sup> with the fighting. Thus, the goodness is in the sword, and beneath the sword, and the matter will return just as it had begun’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from abu Hafs al-Kalbiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the Most Majestic, the Most Glorious, sent His Messenger with al-Islam to people. For ten years no one accepted al-Islam. Thereafter He commanded him to fight back. Goodness is with the sword and under the sword. The matter one day will return to how it was in the beginning (Allah’s religion will become powerful as it was in the times of the Holy Prophet).” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/329)"
        ],
        "index": 8158,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/130",
              "text": "أَبِي الْبَخْتَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:8",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ جَبْرَئِيلَ أَخْبَرَنِي بِأَمْرٍ قَرَّتْ بِهِ عَيْنِي وَ فَرِحَ بِهِ قَلْبِي قَالَ يَا مُحَمَّدُ مَنْ غَزَا غَزَاةً فِي سَبِيلِ اللَّهِ مِنْ أُمَّتِكَ فَمَا أَصَابَهُ قَطْرَةٌ مِنَ السَّمَاءِ أَوْ صُدَاعٌ إِلَّا كَانَتْ لَهُ شَهَادَةً يَوْمَ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Abu Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Jibraeel<sup>as</sup> informed me<sup>saww</sup> with such a matter, my<sup>saww</sup> eyes were delighted by it, and my<sup>saww</sup> heart was happy by it. He<sup>as</sup> said: ‘O Muhammad<sup>saww</sup>! The one from your<sup>saww</sup> community who battles is a battle in the Way of Allah<sup>azwj</sup>, so no drop would hit him from the sky or a headache except that there would be (status of) martyrdom for him on the Day of Judgement’."
          ],
          "en.sarwar": [
            "8. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from abu al-Bakhtariy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘ Jibril informed me of something and it brought delightfulness to my eyes and happiness to my heart. He said, “O Muhammad, anyone of your followers who fights the enemy for the cause of Allah, even if a drop of rain falls on him from the sky or he experiences a headache, he will, on the Day of Judgment, receive for it a reward equal to that for martyrdom.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/330)"
        ],
        "index": 8159,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:9",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ بَلَّغَ رِسَالَةَ غَازٍ كَانَ كَمَنْ أَعْتَقَ رَقَبَةً وَ هُوَ شَرِيكُهُ فِي ثَوَابِ غَزْوَتِهِ "
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, said, ",
            "‘Rasool-Allah<sup>saww</sup> said: ‘The one who delivers a message of a combatant is like the one who freed a neck and he would be his participant in the Rewards of his battle’."
          ],
          "en.sarwar": [
            "9. Through the same chain of narrators as that of the previous Hadith the following is narrated: “One for conveying the message of a fighter for the cause of Allah, receives a reward equal to that for setting free a slave and will have a share in the reward for his fighting for the cause of Allah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/330)"
        ],
        "index": 8160,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:10",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) مَنِ اغْتَابَ مُؤْمِناً غَازِياً أَوْ آذَاهُ أَوْ خَلَفَهُ فِي أَهْلِهِ بِسُوءٍ نُصِبَ لَهُ يَوْمَ الْقِيَامَةِ فَيَسْتَغْرِقُ حَسَنَاتِهِ ثُمَّ يُرْكَسُ فِي النَّارِ إِذَا كَانَ الْغَازِي فِي طَاعَةِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘The one who backbites a Believer combatant, or harms him, or behind him in his family with evil, (Scale) would be set up for him on the Day of Judgement, so his Rewards would be drowned, then he would be responded to be in the Fire, when the combatant was in the obedience of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father, from al-Nawfaliy from al-Sakuniy from abu ‘Abd Allah, ‘Alayhi al-Salam, who has said the following: “If one back-bites a believing person who is fighting for the cause of Allah or troubles the fighter’s family in his absence by evil manners, he will, on the Day of Judgment, be brought to justice. All of his good deeds will become invalid and he will then be sent into hell, if the fighter has fought in obedience to Allah, the Most Majestic, the Most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/330)"
        ],
        "index": 8161,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " رَفَعَهُ قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:11",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَرَضَ الْجِهَادَ وَ عَظَّمَهُ وَ جَعَلَهُ نَصْرَهُ وَ نَاصِرَهُ وَ اللَّهِ مَا صَلَحَتْ دُنْيَا وَ لَا دِينٌ إِلَّا بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Obligated the Jihad and Magnified it, and Made it as His<sup>azwj</sup> Victory and His<sup>azwj</sup> Helper. By Allah<sup>azwj</sup>! Neither the world nor the Religion can be correct except by it’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from ibn Mahbub in a marfu’ the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘Allah, the Most Majestic, the Most Glorious, has made Jihad obligatory, considered it great and has made it His victory (support) and supporter. By Allah, the worldly affairs as well as religious affairs are never enhanced without Jihad.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/330)"
        ],
        "index": 8162,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/277",
              "text": "هَارُونَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/278",
              "text": "مَسْعَدَةَ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:12",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) اغْزُوا تُورِثُوا أَبْنَاءَكُمْ مَجْداً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘Fight battles, for your children to inherit glory’."
          ],
          "en.sarwar": [
            "12. Ali ibn Ibrahim has narrated from his father from Harun ibn Muslim from Mas’adah ibn Sadaqah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘Fight (for the cause of Allah) and leave glory as your legacy for your children.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/330)"
        ],
        "index": 8163,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " أَنَّ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ أَنَّ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:13",
        "text": [
          " أَبَا دُجَانَةَ الْأَنْصَارِيَّ اعْتَمَّ يَوْمَ أُحُدٍ بِعِمَامَةٍ لَهُ وَ أَرْخَى عَذَبَةَ الْعِمَامَةِ بَيْنَ كَتِفَيْهِ حَتَّى جَعَلَ يَتَبَخْتَرُ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ هَذِهِ لَمِشْيَةٌ يُبْغِضُهَا اللَّهُ عَزَّ وَ جَلَّ إِلَّا عِنْدَ الْقِتَالِ فِي سَبِيلِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, that, ",
            "‘Abu Dajjana Al-Ansary wore a turban on the Day of Ohad and loosened his turban to be between his shoulders until he started swaggering (boasteful). So Rasool-Allah<sup>saww</sup> said: ‘This is the walking which Allah<sup>azwj</sup> Mighty and Majestic Hates, except during the fighting in the Way of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "13. Through the same chain of narrators the following is narrated: “On the day of ‘Uhud, abu Dujanah al-Ansariy wore his turban and left one end hanging between his shoulders on his back and began walking as if puffed up with pride. The Messenger of Allah said, ‘This is a kind of walking that Allah, the Most Majestic, the Most Glorious, dislikes very much except during fighting for the cause of Allah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/331)"
        ],
        "index": 8164,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:14",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) جَاهِدُوا تَغْنَمُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Do Jihad, you would acquire’."
          ],
          "en.sarwar": [
            "14. Ali has narrated from father, from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah has said, ‘You must do Jihad; you will benefit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/331)"
        ],
        "index": 8165,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/457",
              "text": "الْحَجَّالِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/463",
              "text": "ثَعْلَبَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1663",
              "text": "مَعْمَرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ عَنْ مَعْمَرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:1:15",
        "text": [
          " الْخَيْرُ كُلُّهُ فِي السَّيْفِ وَ تَحْتَ السَّيْفِ وَ فِي ظِلِّ السَّيْفِ ",
          "قَالَ وَ سَمِعْتُهُ يَقُولُ إِنَّ الْخَيْرَ كُلَّ الْخَيْرِ مَعْقُودٌ فِي نَوَاصِي الْخَيْلِ إِلَى يَوْمِ الْقِيَامَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hajjal, form Sa’alba, from Ma’mar, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The goodness, all of it is in the sword, and beneath the sword, and in the shade of the sword’. ",
            "He (the narrator) said, ‘And I heard him<sup>asws</sup> saying: ‘The goodness, all the goodness is tied to the foreheads of the cavalry horses up to the Day of Judgement’."
          ],
          "en.sarwar": [
            "15. “Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn al-Hajjal from Tha’labah from Mu’ammar form abu Ja‘far, ‘Alayhi al-Salam, who has said the following: “All goodness is in the sword, under the sword and under the shadow of the sword.” “I heard him saying, ‘Goodness, all of it, is tied to the forehead of the horses (and it remains so) up to the Day of Judgment (horses of the fighters for the cause of Allah).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:1",
  "kind": "verse_list"
}