{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:5:1", "titles": {"ar": "كِتَابُ الْجِهَادِ", "en": "THE BOOK OF JIHAD"}}, {"indexed_titles": {"en": "Chapter 10"}, "path": "/books/al-kafi:5:1:10", "titles": {"ar": "باب ", "en": "Chapter 10 – A Chapter"}}], "index": 1189, "local_index": 10, "part_type": "Chapter", "path": "/books/al-kafi:5:1:10", "titles": {"ar": "باب ", "en": "Chapter 10 – A Chapter"}, "verse_count": 5, "verse_start_index": 8193, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8194, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:1:10:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ طَلْحَةَ بْنِ زَيْدٍ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ كَانَ أَبِي ( عليه السلام ) يَقُولُ إِنَّ لِلْحَرْبِ حُكْمَيْنِ إِذَا كَانَتِ الْحَرْبُ قَائِمَةً لَمْ تَضَعْ أَوْزَارَهَا وَ لَمْ يُثْخَنْ أَهْلُهَا فَكُلُّ أَسِيرٍ أُخِذَ فِي تِلْكَ الْحَالِ فَإِنَّ الْإِمَامَ فِيهِ بِالْخِيَارِ إِنْ شَاءَ ضَرَبَ عُنُقَهُ وَ إِنْ شَاءَ قَطَعَ يَدَهُ وَ رِجْلَهُ مِنْ خِلَافٍ بِغَيْرِ حَسْمٍ وَ تَرَكَهُ يَتَشَحَّطُ فِي دَمِهِ حَتَّى يَمُوتَ ", "وَ هُوَ قَوْلُ اللَّهِ عَزَّ وَ جَلَّ إِنَّما جَزاءُ الَّذِينَ يُحارِبُونَ اللَّهَ وَ رَسُولَهُ وَ يَسْعَوْنَ فِي الْأَرْضِ فَساداً أَنْ يُقَتَّلُوا أَوْ يُصَلَّبُوا أَوْ تُقَطَّعَ أَيْدِيهِمْ وَ أَرْجُلُهُمْ مِنْ خِلافٍ أَوْ يُنْفَوْا مِنَ الْأَرْضِ ذلِكَ لَهُمْ خِزْيٌ فِي الدُّنْيا وَ لَهُمْ فِي الْآخِرَةِ عَذابٌ عَظِيمٌ أَ لَا تَرَى أَنَّ الْمُخَيَّرَ الَّذِي خَيَّرَ اللَّهُ الْإِمَامَ عَلَى شَيْ‏ءٍ وَاحِدٍ وَ هُوَ الْكُفْرُ وَ لَيْسَ هُوَ عَلَى أَشْيَاءَ مُخْتَلِفَةٍ ", "فَقُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَوْلُ اللَّهِ عَزَّ وَ جَلَّ أَوْ يُنْفَوْا مِنَ الْأَرْضِ قَالَ ذَلِكَ الطَّلَبُ أَنْ تَطْلُبَهُ الْخَيْلُ حَتَّى يَهْرُبَ فَإِنْ أَخَذَتْهُ الْخَيْلُ حُكِمَ عَلَيْهِ بِبَعْضِ الْأَحْكَامِ الَّتِي وَصَفْتُ لَكَ ", "وَ الْحُكْمُ الْآخَرُ إِذَا وَضَعَتِ الْحَرْبُ أَوْزَارَهَا وَ أُثْخِنَ أَهْلُهَا فَكُلُّ أَسِيرٍ أُخِذَ فِي تِلْكَ الْحَالِ فَكَانَ فِي أَيْدِيهِمْ فَالْإِمَامُ فِيهِ بِالْخِيَارِ إِنْ شَاءَ مَنَّ عَلَيْهِمْ فَأَرْسَلَهُمْ وَ إِنْ شَاءَ فَادَاهُمْ أَنْفُسَهُمْ وَ إِنْ شَاءَ اسْتَعْبَدَهُمْ فَصَارُوا عَبِيداً ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Yahya, from Talha Bin Zayd who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘My<sup>asws</sup> father<sup>asws</sup> was saying that for the war are two decisions. When the war was established and its end had not yet come, and its people have not been defeated, so each prisoner taken during that state, so the Imam<sup>asws</sup> would be with a choice regarding them. If he<sup>asws</sup> so desires to he<sup>asws</sup> strikes his neck, and if he<sup>asws</sup> so desires to he<sup>asws</sup> cuts off his hand and his leg from opposite sides without stopping (the bleeding) and leave him drenched in his blood until he dies. ", "And these are the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[5:33] But rather, the Recompense of those who wage war against Allah and His Rasool and strive to make mischief in the land is only this, that they should be murdered or crucified or their hands and their feet should be cut off on opposite sides or they should be banished from the land; this shall be as a disgrace for them in this world, and in the Hereafter they shall have a grievous Punishment</span>’. Do you not see that the alternatives which Allah<sup>azwj</sup> has Granted the Imam<sup>asws</sup> upon one thing, and it is the Infidelity, and it is not upon different things’. ", "So I said to Abu Abdullah<sup>asws</sup>, ‘(What about) the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">or they should be banished from the land</span>’?’ He<sup>asws</sup> said: ‘That is the seeking, the pursuit of the cavalry until he escapes. So if the cavalry seizes him, a judgement would be passed upon him with the Judgements which have been Described for you.", "And the other decision is when the war comes to an end and its people are defeated, so every prisoner taken during that state, so he would be in their hands. So the Imam<sup>asws</sup>, with regard to it would be with the choice, if he<sup>asws</sup> so desires to, favours upon them so sends them (back home), and if he<sup>asws</sup> so desires to he<sup>asws</sup> lets them ransom their own selves, and if he<sup>asws</sup> so desires to, he<sup>asws</sup> can enslave them, so they would become slaves’."]}}, {"index": 8195, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:1:10:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الطَّائِفَتَيْنِ مِنَ الْمُؤْمِنِينَ إِحْدَاهُمَا بَاغِيَةٌ وَ الْأُخْرَى عَادِلَةٌ فَهَزَمَتِ الْعَادِلَةُ الْبَاغِيَةَ فَقَالَ لَيْسَ لِأَهْلِ الْعَدْلِ أَنْ يَتْبَعُوا مُدْبِراً وَ لَا يَقْتُلُوا أَسِيراً وَ لَا يُجْهِزُوا عَلَى جَرِيحٍ وَ هَذَا إِذَا لَمْ يَبْقَ مِنْ أَهْلِ الْبَغْيِ أَحَدٌ وَ لَمْ يَكُنْ لَهُمْ فِئَةٌ  يَرْجِعُونَ إِلَيْهَا فَإِذَا كَانَ لَهُمْ فِئَةٌ يَرْجِعُونَ إِلَيْهَا فَإِنَّ أَسِيرَهُمْ يُقْتَلُ وَ مُدْبِرَهُمْ يُتْبَعُ وَ جَرِيحَهُمْ يُجْهَزُ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Suleyman Al Minqary, from Hafs Bin Giyas who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about two groups of the believers, one of them rebellious and the other one just, and the just one defeats the rebellious. So he<sup>asws</sup> said: ‘It is not for the just group that they should puruse the fleers, nor kill the prisoners, nor attack the wounded; and this is when there does not remain anyone from the rebellious people, and there does not happen to be a group they can return to. So if there was a group for them to be returning to, so its prisoners would be killed, and its fleers would be pursued, and their wounded would be attacked’."]}}, {"index": 8196, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:1:10:3", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ أَبِي حَمْزَةَ الثُّمَالِيِّ قَالَ قُلْتُ لِعَلِيِّ بْنِ الْحُسَيْنِ ( صلوات الله عليه ) إِنَّ عَلِيّاً ( عليه السلام ) سَارَ فِي أَهْلِ الْقِبْلَةِ بِخِلَافِ سِيرَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي أَهْلِ الشِّرْكِ قَالَ فَغَضِبَ ثُمَّ جَلَسَ ثُمَّ قَالَ سَارَ وَ اللَّهِ فِيهِمْ بِسِيرَةِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَوْمَ الْفَتْحِ ", "إِنَّ عَلِيّاً ( عليه السلام ) كَتَبَ إِلَى مَالِكٍ وَ هُوَ عَلَى مُقَدِّمَتِهِ يَوْمَ الْبَصْرَةِ بِأَنْ لَا يَطْعُنَ فِي غَيْرِ مُقْبِلٍ وَ لَا يَقْتُلَ مُدْبِراً وَ لَا يُجِيزَ عَلَى جَرِيحٍ وَ مَنْ أَغْلَقَ بَابَهُ فَهُوَ آمِنٌ ", "فَأَخَذَ الْكِتَابَ فَوَضَعَهُ بَيْنَ يَدَيْهِ عَلَى الْقَرَبُوسِ مِنْ قَبْلِ أَنْ يَقْرَأَهُ ثُمَّ قَالَ اقْتُلُوا فَقَتَلَهُمْ حَتَّى أَدْخَلَهُمْ سِكَكَ الْبَصْرَةِ ثُمَّ فَتَحَ الْكِتَابَ فَقَرَأَهُ ثُمَّ أَمَرَ مُنَادِياً فَنَادَى بِمَا فِي الْكِتَابِ ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad Al Ashary, from Moala Bin Muhammad, from Al Washa, from Aban Bin usman, from Abu Hamza Al Sumaly who said, ", "‘I said to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> that Ali<sup>asws</sup> dealt among the people of the Qiblah (Muslims) with opposite to the way of Rasool-Allah<sup>saww</sup> among the people of the Polytheism’. So he<sup>asws</sup> got angered, then said: ‘By Allah<sup>azwj</sup>! He<sup>asws</sup> dealt among them with the way of Rasool-Allah<sup>saww</sup> on the day of the victory. ", "Ali<sup>asws</sup> wrote to Maalik, and he was at the forefront on the day of Al-Basra, that he would not thrust among the ones who are not facing him, nor would he kill a fleeing one, nor would he attack upon the injured, and the one who locks his door, so he is safe. ", "So he (Maalik) took the letter and placed it in front of him upon the saddle before reading it, then said, ‘Fight’. So they fought them until they made them enter the markets of Al-Basra. Then he opened the letter, so he read it, then ordered a caller, so he called out with was was in the letter’."]}}, {"index": 8197, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:1:10:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَسِيرَةُ عَلِيٍّ ( عليه السلام ) فِي أَهْلِ الْبَصْرَةِ كَانَتْ خَيْراً لِشِيعَتِهِ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ إِنَّهُ عَلِمَ أَنَّ لِلْقَوْمِ دَوْلَةً فَلَوْ سَبَاهُمْ لَسُبِيَتْ شِيعَتُهُ ", "قُلْتُ فَأَخْبِرْنِي عَنِ الْقَائِمِ ( عليه السلام ) يَسِيرُ بِسِيرَتِهِ قَالَ لَا إِنَّ عَلِيّاً ( صلوات الله عليه ) سَارَ فِيهِمْ بِالْمَنِّ لِلْعِلْمِ مِنْ دَوْلَتِهِمْ وَ إِنَّ الْقَائِمَ عَجَّلَ اللَّهُ فَرَجَهُ يَسِيرُ فِيهِمْ بِخِلَافِ تِلْكَ السِّيرَةِ لِأَنَّهُ لَا دَوْلَةَ لَهُمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, form Ismail Bin Marrar, from Yunus, from Abu Bakr Al Hazramy who said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘The way of Ali<sup>asws</sup> among the people of Al-Basra was what was better for his<sup>asws</sup> Shiah from what the sun emerges upon. He<sup>asws</sup> knew that for the people there would be a government (in the future), if he<sup>asws</sup> were to make them captives, they would make captives of his<sup>asws</sup> Shiah’. ", "I said, ‘So inform me about Al-Qaim<sup>asws</sup>, would his<sup>asws</sup> way be his<sup>asws</sup> (Ali<sup>asws</sup>’s) way?’ He<sup>asws</sup> said: ‘No. Ali<sup>asws</sup> dealt among them with the favours due to the knowledge of their government, and Al-Qaim<sup>asws</sup>, may Allah<sup>azwj</sup> Hasten his<sup>asws</sup> appearance, would deal among them with opposite to that manner because there would be no government for them (afterwards)’."]}}, {"index": 8198, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:1:10:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ عُذَافِرٍ عَنْ عُقْبَةَ بْنِ بَشِيرٍ عَنْ عَبْدِ اللَّهِ بْنِ شَرِيكٍ عَنْ أَبِيهِ قَالَ لَمَّا هُزِمَ النَّاسُ يَوْمَ الْجَمَلِ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَا تَتْبَعُوا مُوَلِّياً وَ لَا تُجِيزُوا عَلَى جَرِيحٍ وَ مَنْ أَغْلَقَ بَابَهُ فَهُوَ آمِنٌ", "فَلَمَّا كَانَ يَوْمُ صِفِّينَ قَتَلَ الْمُقْبِلَ وَ الْمُدْبِرَ وَ أَجَازَ عَلَى جَرِيحٍ فَقَالَ أَبَانُ بْنُ تَغْلِبَ لِعَبْدِ اللَّهِ بْنِ شَرِيكٍ هَذِهِ سِيرَتَانِ مُخْتَلِفَتَانِ فَقَالَ إِنَّ أَهْلَ الْجَمَلِ قَتَلَ طَلْحَةَ وَ الزُّبَيْرَ وَ إِنَّ مُعَاوِيَةَ كَانَ قَائِماً بِعَيْنِهِ وَ كَانَ قَائِدَهُمْ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Muhammad Bin Uzafar, from Uqba Bin Bashir, from Abdullah Bin Shareek, form his father who said, ", "‘When the people were defeated on the Day of the Camel, Amir Al-Momineen<sup>asws</sup> said: ‘Do not pursue the fleers, nor attack upon the injured; and the one who locks his door, so he is secure’. ", "So when it was the Day of Siffeen, the facing ones and the fleeing ones were killed and the injured were attacked, so Aban Bin Taghlub said to Abdullah Bin Shareek, ‘These are two opposite ways’. So he said, ‘The people of the Camel killed Talha and Al-Zubeyr, and Muawiya was standing personally, and he was their leader’."]}}]}, "index": "al-kafi:5:1:10", "kind": "verse_list"}