{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:5:1:14",
        "titles": {
          "ar": "باب الدُّعَاءِ إِلَى الْإِسْلَامِ قَبْلَ الْقِتَالِ",
          "en": "Chapter 14 – The calling to Al-Islam before the fighting"
        }
      }
    ],
    "index": 1194,
    "local_index": 14,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:14",
    "titles": {
      "ar": "باب الدُّعَاءِ إِلَى الْإِسْلَامِ قَبْلَ الْقِتَالِ",
      "en": "Chapter 14 – The calling to Al-Islam before the fighting"
    },
    "verse_count": 2,
    "verse_start_index": 8206,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/365)"
        ],
        "index": 8207,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:14:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ قَالَ دَخَلَ رِجَالٌ مِنْ قُرَيْشٍ عَلَى عَلِيِّ بْنِ الْحُسَيْنِ ( صلوات الله عليه ) فَسَأَلُوهُ كَيْفَ الدَّعْوَةُ إِلَى الدِّينِ قَالَ تَقُولُ بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ أَدْعُوكُمْ إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ إِلَى دِينِهِ وَ جِمَاعُهُ أَمْرَانِ أَحَدُهُمَا مَعْرِفَةُ اللَّهِ عَزَّ وَ جَلَّ وَ الْآخَرُ الْعَمَلُ بِرِضْوَانِهِ",
          "وَ إِنَّ مَعْرِفَةَ اللَّهِ عَزَّ وَ جَلَّ أَنْ يُعْرَفَ بِالْوَحْدَانِيَّةِ وَ الرَّأْفَةِ وَ الرَّحْمَةِ وَ الْعِزَّةِ وَ الْعِلْمِ وَ الْقُدْرَةِ وَ الْعُلُوِّ عَلَى كُلِّ شَيْ‏ءٍ وَ أَنَّهُ النَّافِعُ الضَّارُّ الْقَاهِرُ لِكُلِّ شَيْ‏ءٍ الَّذِي لَا تُدْرِكُهُ الْأَبْصَارُ وَ هُوَ يُدْرِكُ الْأَبْصَارَ وَ هُوَ اللَّطِيفُ الْخَبِيرُ وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ وَ أَنَّ مَا جَاءَ بِهِ هُوَ الْحَقُّ مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ وَ مَا سِوَاهُ هُوَ الْبَاطِلُ فَإِذَا أَجَابُوا إِلَى ذَلِكَ فَلَهُمْ مَا لِلْمُسْلِمِينَ وَ عَلَيْهِمْ مَا عَلَى الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Qasim Bin Muhammad, from Al Minqary, from Sufyan Bin Uyayna, from Al Zahry who said, ",
            "‘A man from Qureysh came over to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, so he asked him<sup>asws</sup> how the calling to the Religion is to be. He<sup>asws</sup> said: ‘You should be saying, ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful. I hereby call you all to Allah<sup>azwj</sup> Mighty and Majestic, and to His<sup>azwj</sup> Religion’, and the whole of it is of two matters, one of them being the recognition of Allah<sup>azwj</sup> Mighty and Majestic, and the other one acting in accordance with His<sup>azwj</sup> Pleasure. ",
            "The recognition of Allah<sup>azwj</sup> Mighty and Majestic is that he recognises by the Oneness, and the Compassion, and the Mercy, and the Honour, and the Knowledge, and the Power, and the Exaltedness over everything, and that He<sup>azwj</sup> Benefits and Punishes, the Dominant over everything, the visions cannot visualise Him<sup>azwj</sup> and He<sup>azwj</sup> Sees all, and He<sup>azwj</sup> is the Gentle, the All Knowing, and that Muhammad<sup>saww</sup> is His<sup>azwj</sup> servant and His<sup>azwj</sup> Rasool<sup>saww</sup>, and that whatever he<sup>saww</sup> came with, it is the Truth from the Presence of Allah<sup>azwj</sup> Mighty and Majestic, and whatever is besides it is the falsity. So when they respond to that, then for them would be what is for the Muslims, and upon them would be whatever is upon the Muslims’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father, from af-Qasim ibn Muhammad from af-Minqariy from Sufyan ibn ‘ Uyaynah from al- Zuhriy who has said the following: “Once a group of men of Quraysh came to see Ali ibn al-Husayn, ‘Alayhi al-Salam, and asked him about how to call to religion. He (the Imam) replied, ‘You should say, “In the name of Allah, the Beneficent, the Merciful. I call you to Allah, the Most Majestic, the Most Glorious, and to His religion.” The main points in it are two issues. (1) It is to acknowledge the existence of Allah, the Most Majestic, the Most Glorious. (2) It is to act according to what pleases Him. Acknowledgement of the existence of Allah, the Most Majestic, the Most Glorious, comes from knowing that He is one, kind, merciful, Majestic, all-Knowing, powerful and that He is high above all things and that He can benefit and cause harm and that He is dominant over all things. No eye is able to see Him but He is aware of all eyes and He is the subtle and aware. Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, is His servant and His Messenger and that what he has brought is truly from Allah, the Most Majestic, the Most Glorious, and all things beside Him are destructible. If they agreed, they then will able to have whatever the Muslims can have and they will be held responsible for whatever Muslims are held responsible.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/366)"
        ],
        "index": 8208,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:14:2",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ شَمُّونٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ مِسْمَعِ بْنِ عَبْدِ الْمَلِكِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لَمَّا وَجَّهَنِي رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِلَى الْيَمَنِ قَالَ يَا عَلِيُّ لَا تُقَاتِلْ أَحَداً حَتَّى تَدْعُوَهُ إِلَى الْإِسْلَامِ وَ ايْمُ اللَّهِ لَأَنْ يَهْدِيَ اللَّهُ عَزَّ وَ جَلَّ عَلَى يَدَيْكَ رَجُلًا خَيْرٌ لَكَ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ وَ غَرَبَتْ وَ لَكَ وَلَاؤُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Hassan Bin Shamoun, from Abdullah Bin Abdul Rahman, from Misma’a Bin Abdul Malik, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘When Rasool-Allah<sup>saww</sup> directed me<sup>asws</sup> to Al-Yemen, he<sup>saww</sup> said: ‘O Ali<sup>asws</sup>! Do not face anyone (in battle) until you<sup>asws</sup> call him to Al-Islam, and I<sup>saww</sup> swear by Allah<sup>azwj</sup>, if Allah<sup>azwj</sup> Mighty and Majestic were to Guide one man upon your<sup>asws</sup> hands, it would be better for you<sup>asws</sup> than what the sun emerges upon and set, and for him would be your<sup>asws</sup> <span class=\"iTxt\">Wilayah</span>’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Hassan from ‘ Abd Allah ibn ‘Abd al-Rahman from Misma’ ibn ‘Abd al-Malik who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Amir al-Mu’minin, ‘Alayhi al-Salam, has said, ‘When the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, instructed me to go to Yemen he said to me, “O Ali, you must not fight anyone before calling him to al-Islam. I swear by Allah, Allah’s guiding only one man (to the right path) is better for you than all things on which the sun shines or sets, and to you will belong his guardianship and legacy.’”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:14",
  "kind": "verse_list"
}