{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:5:1:15",
        "titles": {
          "ar": "باب مَا كَانَ يُوصِي أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِهِ عِنْدَ الْقِتَالِ",
          "en": "Chapter 15 – What Amir Al-Momineen<sup>asws</sup> advised with during the fighting"
        }
      }
    ],
    "index": 1195,
    "local_index": 15,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:5:1:16",
        "titles": {
          "ar": "باب",
          "en": "Chapter 16 – A Chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:5:1:14",
        "titles": {
          "ar": "باب الدُّعَاءِ إِلَى الْإِسْلَامِ قَبْلَ الْقِتَالِ",
          "en": "Chapter 14 – The calling to Al-Islam before the fighting"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:15",
    "titles": {
      "ar": "باب مَا كَانَ يُوصِي أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِهِ عِنْدَ الْقِتَالِ",
      "en": "Chapter 15 – What Amir Al-Momineen<sup>asws</sup> advised with during the fighting"
    },
    "verse_count": 5,
    "verse_start_index": 8208,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/366)"
        ],
        "index": 8209,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي حَمْزَةَ عَنْ عَقِيلٍ الْخُزَاعِيِّ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) كَانَ إِذَا حَضَرَ الْحَرْبَ يُوصِي لِلْمُسْلِمِينَ بِكَلِمَاتٍ فَيَقُولُ تَعَاهَدُوا الصَّلَاةَ وَ حَافِظُوا عَلَيْهَا وَ اسْتَكْثِرُوا مِنْهَا وَ تَقَرَّبُوا بِهَا فَإِنَّهَا كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَاباً مَوْقُوتاً وَ قَدْ عَلِمَ ذَلِكَ الْكُفَّارُ حِينَ سُئِلُوا ما سَلَكَكُمْ فِي سَقَرَ قالُوا لَمْ نَكُ مِنَ  الْمُصَلِّينَ وَ قَدْ عَرَفَ حَقَّهَا مَنْ طَرَقَهَا وَ أُكْرِمَ بِهَا مِنَ الْمُؤْمِنِينَ الَّذِينَ لَا يَشْغَلُهُمْ عَنْهَا زَيْنُ مَتَاعٍ وَ لَا قُرَّةُ عَيْنٍ مِنْ مَالٍ وَ لَا وَلَدٍ",
          "يَقُولُ اللَّهُ عَزَّ وَ جَلَّ رِجالٌ لا تُلْهِيهِمْ تِجارَةٌ وَ لا بَيْعٌ عَنْ ذِكْرِ اللَّهِ وَ إِقامِ الصَّلاةِ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مُنْصِباً لِنَفْسِهِ بَعْدَ الْبُشْرَى لَهُ بِالْجَنَّةِ مِنْ رَبِّهِ فَقَالَ عَزَّ وَ جَلَّ وَ أْمُرْ أَهْلَكَ بِالصَّلاةِ وَ اصْطَبِرْ عَلَيْها الْآيَةَ فَكَانَ يَأْمُرُ بِهَا أَهْلَهُ وَ يُصَبِّرُ عَلَيْهَا نَفْسَهُ",
          "ثُمَّ إِنَّ الزَّكَاةَ جُعِلَتْ مَعَ الصَّلَاةِ قُرْبَاناً لِأَهْلِ الْإِسْلَامِ عَلَى أَهْلِ الْإِسْلَامِ وَ مَنْ لَمْ يُعْطِهَا طَيِّبَ النَّفْسِ بِهَا يَرْجُو بِهَا مِنَ الثَّمَنِ مَا هُوَ أَفْضَلُ مِنْهَا فَإِنَّهُ جَاهِلٌ بِالسُّنَّةِ مَغْبُونُ الْأَجْرِ ضَالُّ الْعُمُرِ طَوِيلُ النَّدَمِ بِتَرْكِ أَمْرِ اللَّهِ عَزَّ وَ جَلَّ وَ الرَّغْبَةِ عَمَّا عَلَيْهِ صَالِحُو عِبَادِ اللَّهِ",
          "يَقُولُ اللَّهُ عَزَّ وَ جَلَّ وَ مَنْ... يَتَّبِعْ غَيْرَ سَبِيلِ الْمُؤْمِنِينَ نُوَلِّهِ ما تَوَلَّى مِنَ الْأَمَانَةِ فَقَدْ خَسِرَ مَنْ لَيْسَ مِنْ أَهْلِهَا وَ ضَلَّ عَمَلُهُ عُرِضَتْ عَلَى السَّمَاوَاتِ الْمَبْنِيَّةِ وَ الْأَرْضِ الْمِهَادِ وَ الْجِبَالِ الْمَنْصُوبَةِ فَلَا أَطْوَلَ وَ لَا أَعْرَضَ وَ لَا أَعْلَى وَ لَا أَعْظَمَ لَوِ امْتَنَعْنَ مِنْ طُولٍ أَوْ عَرْضٍ أَوْ عِظَمٍ أَوْ قُوَّةٍ أَوْ عِزَّةٍ امْتَنَعْنَ وَ لَكِنْ أَشْفَقْنَ مِنَ الْعُقُوبَةِ",
          "ثُمَّ إِنَّ الْجِهَادَ أَشْرَفُ الْأَعْمَالِ بَعْدَ الْإِسْلَامِ وَ هُوَ قِوَامُ الدِّينِ وَ الْأَجْرُ فِيهِ عَظِيمٌ مَعَ الْعِزَّةِ وَ الْمَنَعَةِ وَ هُوَ الْكَرَّةُ فِيهِ الْحَسَنَاتُ وَ الْبُشْرَى بِالْجَنَّةِ بَعْدَ الشَّهَادَةِ وَ بِالرِّزْقِ غَداً عِنْدَ الرَّبِّ وَ الْكَرَامَةِ  يَقُولُ اللَّهُ عَزَّ وَ جَلَّ وَ لا تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ الْآيَةَ",
          "ثُمَّ إِنَّ الرُّعْبَ وَ الْخَوْفَ مِنْ جِهَادِ الْمُسْتَحِقِّ لِلْجِهَادِ وَ الْمُتَوَازِرِينَ عَلَى الضَّلَالِ ضَلَالٌ فِي الدِّينِ وَ سَلْبٌ لِلدُّنْيَا مَعَ الذُّلِّ وَ الصَّغَارِ وَ فِيهِ اسْتِيجَابُ النَّارِ بِالْفِرَارِ مِنَ الزَّحْفِ عِنْدَ حَضْرَةِ الْقِتَالِ يَقُولُ اللَّهُ عَزَّ وَ جَلَّ يا أَيُّهَا الَّذِينَ آمَنُوا إِذا لَقِيتُمُ الَّذِينَ كَفَرُوا زَحْفاً فَلا تُوَلُّوهُمُ الْأَدْبارَ",
          "فَحَافِظُوا عَلَى أَمْرِ اللَّهِ عَزَّ وَ جَلَّ فِي هَذِهِ الْمَوَاطِنِ الَّتِي الصَّبْرُ عَلَيْهَا كَرَمٌ وَ سَعَادَةٌ وَ نَجَاةٌ فِي الدُّنْيَا وَ الْآخِرَةِ مِنْ فَظِيعِ الْهَوْلِ وَ الْمَخَافَةِ فَإِنَّ اللَّهَ عَزَّ وَ جَلَّ لَا يَعْبَأُ بِمَا الْعِبَادُ مُقْتَرِفُونَ لَيْلَهُمْ وَ نَهَارَهُمْ لَطُفَ بِهِ عِلْماً وَ كُلُّ ذَلِكَ فِي كِتابٍ لا يَضِلُّ رَبِّي وَ لا يَنْسى",
          "فَاصْبِرُوا وَ صَابِرُوا وَ اسْأَلُوا النَّصْرَ وَ وَطِّنُوا أَنْفُسَكُمْ عَلَى الْقِتَالِ وَ اتَّقُوا اللَّهَ عَزَّ وَ جَلَّ فَإِنَّ اللَّهَ مَعَ الَّذِينَ اتَّقَوْا وَ الَّذِينَ هُمْ مُحْسِنُونَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Abu Hamza, from Aqeel Al Khuzai’e that, ",
            "‘Amir Al-Momineen<sup>asws</sup>, whenever the war presented itself, advised the Muslims with certain words, so he<sup>asws</sup> was saying: ‘Be committed to the Prayer and be maintained upon it, and be frequent from it, and get closer (to Allah<sup>azwj</sup>) by it, <span class=\"ibTxt\">[4:103] surely Prayer is a timed ordinance for the Believers</span>. And the Infidels knew that where they would be asked (in the Hereafter) <span class=\"ibTxt\">[74:42] What has brought you into Hell? [74:43] They shall say: We were not of those who Praying ones</span>. So they have recognised its rightfulness from its neglect. And the Believers have been Honoured by it those who are not too pre-occupied from it by the adornments of the belonging, nor delight of the eyes from wealth, nor children.",
            "Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[24:37] Men whom neither merchandise nor selling diverts from the Remembrance of Allah and the keeping up of Prayer</span>. And Rasool-Allah<sup>saww</sup> has linked it to himself<sup>saww</sup> after the good news for him with the Paradise from his<sup>saww</sup> Lord<sup>azwj</sup>. So Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[20:132] And enjoin Prayer upon your family, and be constant at it</span> – the Verse. Thus he<sup>saww</sup> used to order his<sup>saww</sup> family with it and would be patient upon it himself<sup>saww</sup>. ",
            "Then the <span class=\"iTxt\">Zakat</span> was Made to be with the Prayer as an offering for the people of Al-Islam, upon the people of Al Islam, and the one who does not give it to clean the self by it, hoping by it from the price what is better than it, so he is ignorant of the Sunnah, and would have cheated himself of the Recompense, having strayed in the affairs, and be of intense regret, by neglecting the Command of Allah<sup>azwj</sup> Mighty and Majestic, and the turning away from what the righteous servants of Allah<sup>azwj</sup> are upon. ",
            "Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[4:115] And whoever (is hostile to the Rasool after the Guidance has become manifest to him), and follows other than the way of the Believers, We will Turn him to that to which he has (himself) turned </span>away from the safety, so he has incurred loss, the one is not rightful of it, and his deeds would be lost. It (Wilayah) was presented upon the clear skies and the flat land and the entrenched mountains. Thus, there was nothing longer, nor flatter, nor higher, nor greater. Had there been for the entrustment anything longer, or flatter, or greater, or stronger, or more honourable, they would have been entrusted, but they were concerned about the Punishment.",
            "Then the Jihad is the noblest of the deeds after Al-Islam, and it is a foundation of the Religion, and the Recompense regarding it is great, along with the honour, and the Strength, and it is the campaign where are the Rewards and the good news of the Paradise after the martyrdom and with the sustenance tomorrow in the Presence of the Lord<sup>azwj</sup> and the Prestige. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[3:169] And reckon not those who are killed in Allah's Way (as dead; but, they are alive (and) are being provided sustenance from their Lord)</span>.",
            "The awe and the fear from the Jihad which is due to the Jihad, and being harmonious upon the straying, is straying in the Religion, and the spoilage for the world along with the humiliation and the lowliness, and in it is being Obligated the Fire due to the fleeing from the army during the inception of the fighting. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[8:15] O you who believe! When you meet those who disbelieve marching for war, then turn not your backs to them</span>. ",
            "Therefore be maintained upon the Command of Allah<sup>azwj</sup> Mighty and Majestic in these places which the observance of the patience upon it is an honour, and a happiness, and a salvation in the world and in the Hereafter from terrible horrors and the fears, for Allah<sup>azwj</sup> Mighty and Majestic does not Care with what the servants are committing during their nights and their days, (although) being Knowledgeable of its subtleties (sensitivities), and all of that is in a Book. My Lord<sup>azwj</sup> neither gets confused nor does He<sup>azwj</sup> forget.  ",
            "Therefore, be patient and endure, and ask for the victory and resign yourselves for the fighting, and fear Allah<sup>azwj</sup> Mighty and Majestic, for Allah<sup>azwj</sup> is with those who fear and those who are doing good deeds’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from certain individuals of his people from abu Hamzah from ‘Aqil al-Khuza’iy who has said the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, during a war recommended the Muslims with these words: ‘You must perform your Salat (prayer) regularly, preserve it, perform it very often and seek thereby nearness to Allah. It was made obligatory for the believing people. The unbelievers found out when they were asked, “What has led to Saqar?” (74:46) They replied, “We were not of those who performed Salat (prayer).” The believing people who do not become disturbed because of worldly attractions, delightfulness of their eyes because of wealth and children realize its significance and know its proper time to be performed and think of it as very graceful. Allah, the Most Majestic, the Most Glorious, has said, “There are men who do not become disturbed because of business and trade when they speak of Allah and performing Salat (prayer).” The Messenger of Allah after receiving the glad news of paradise had fixed himself in performing Salat (prayer). Allah, the Most Majestic, the Most Glorious, has said, “Command your family to perform Salat (prayer) and exercise patience during Salat (prayer).” (20:132) ‘He would command his family to perform Salat (prayer) and himself would exercise patience during performing Salat (prayer). Thereafter Zakat along with Salat (prayer) is made a means of getting nearer to Allah for the people of al-Islam and upon the people of al-Islam. One who does not perform it with his soul delighted and then expects to receive a reward better than Salat (prayer) he is ignorant of the Sunnah, suffers loss in matters of his reward and his life ends in confusion. He remains regretful because of disregarding the command of Allah, the Most Majestic, the Most Glorious, and not paying attention to what the virtuous servants of Allah had great inclinations. Allah, the Most Majestic, the Most Glorious, has said, “We turn away whoever follows a path other than that of the believing people, to whatever he loves.” (4:115) ‘Thereafter is keeping of trust. One who is not a person of trust suffers a great loss and his deeds become confused. It was introduced to the well established heavens, well stretched earth and well fixed mountains. Other things are not taller, wider, higher and greater than them. If tallness, wideness, greatness, power and majesty were needed to refuse they could use them. They feared punishment, thus refused to accept the trust. Thereafter is Jihad. It is the noblest one of the deeds after al-Islam. It is the pillar of religion. The reward for it is great with majesty and highness. It is an opportunity in which there is goodness and glad news of paradise after martyrdom and sustenance with the Lord and honor. ‘Allah, the Most Majestic, the Most Glorious, has said, “You must not think of those who are murdered for the cause of Allah as dead. . . .” (3:169) Fear and fright of doing Jihad, when there is demand for Jihad, and supporting to cause confusion is straying in religion, losses in the worldly matters, humiliation and lowliness. In it there is reason to deserve hellfire because of fleeing during advancing against the enemy and fighting. Allah, the Most Majestic, the Most Glorious, has said, “O believers, when you face the unbelievers during and advancing against the enemy you must not turn your backs to them.” (8: 15) ‘You must observe the commandments of Allah, the Most Majestic, the Most Glorious, in such conditions and exercise patience therein. It is honor, salvation and safety in this world and in the next world, which is full of frightening matters and fear. Allah, the Most Majestic, the Most Glorious, is not concerned about what the servant commits during the nights and days although His knowledge of their activities is subtle. All of these are in the book. My Lord does not become confused and forget. You must exercise patience, encourage others to exercise patience and ask Allah for help. You must settle your souls upon fighting. Maintain piety before Allah, the Most Majestic, the Most Glorious. Allah is with those who maintain piety and those who do good deeds.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/369)"
        ],
        "index": 8210,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:15:2",
        "text": [
          "وَ فِي حَدِيثِ يَزِيدَ بْنِ إِسْحَاقَ عَنْ أَبِي صَادِقٍ قَالَ سَمِعْتُ عَلِيّاً ( عليه السلام ) يُحَرِّضُ النَّاسَ فِي ثَلَاثَةِ مَوَاطِنَ الْجَمَلِ وَ صِفِّينَ وَ يَوْمِ النَّهَرِ يَقُولُ عِبَادَ اللَّهِ اتَّقُوا اللَّهَ وَ غُضُّوا الْأَبْصَارَ وَ اخْفِضُوا الْأَصْوَاتَ وَ أَقِلُّوا الْكَلَامَ وَ وَطِّنُوا أَنْفُسَكُمْ عَلَى الْمُنَازَلَةِ وَ الْمُجَادَلَةِ وَ الْمُبَارَزَةِ وَ الْمُنَاضَلَةِ وَ الْمُنَابَذَةِ وَ الْمُعَانَقَةِ وَ الْمُكَادَمَةِ وَ فَاثْبُتُوا وَ اذْكُرُوا اللَّهَ كَثِيراً لَعَلَّكُمْ تُفْلِحُونَ... وَ لا تَنازَعُوا فَتَفْشَلُوا وَ تَذْهَبَ رِيحُكُمْ وَ اصْبِرُوا إِنَّ اللَّهَ مَعَ الصَّابِرِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in a Hadeeth of Yazeed Bin Is’haq, from Abu Sadiq who said, ",
            "‘I heard Ali<sup>asws</sup> calling the people in three places – The (battles of the) Camel, and Siffeen and the day of Al-Nahr (Battle of Naharwaan), saying: ‘Servants of Allah<sup>azwj</sup>! Fear Allah<sup>azwj</sup> and lower your eyes, and minimise your voices, and lessen your speeches, and resign yourselves upon the confrontation, and the arguments, and the duelling, and the struggling, and the clasping, and the advancing; and mention Allah<sup>azwj</sup> a lot so that you may be successful, and do not dispute for you would become weary and your strength would depart, and be patient for <span class=\"ibTxt\">[2:153] surely Allah is with the patient</span>’."
          ],
          "en.sarwar": [
            "2. In the Hadith of ibn Ishaq the following is narrated from abu Sadiq who has said the following: “I heard Ali, ‘Alayhi al-Salam, encourage people during three battle places. They were the battle of al- Jamal, Siffin and al-Nahrawan. He spoke to people and said, ‘Servants of Allah, you must maintain piety before Allah and cast down your eyes, lower your voices, reduce your speeches, settle your soul on walking in the arena of war to do your best. Face the enemy, make best use of your weapons, strive to win, close up on to the enemy, force your enemy to flee and stay steadfast. Speak of Allah very often, perhaps you succeed. You must not quarrel among yourselves lest you fail and will be humiliated. Exercise patience; Allah is with those who exercise patience.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/370)"
        ],
        "index": 8211,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:15:3",
        "text": [
          "وَ فِي حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ جُنْدَبٍ عَنْ أَبِيهِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( صلوات الله عليه ) كَانَ يَأْمُرُ فِي كُلِّ مَوْطِنٍ لَقِينَا فِيهِ عَدُوَّنَا فَيَقُولُ لَا تُقَاتِلُوا الْقَوْمَ حَتَّى يَبْدَءُوكُمْ فَإِنَّكُمْ بِحَمْدِ اللَّهِ عَلَى حُجَّةٍ وَ تَرْكُكُمْ إِيَّاهُمْ حَتَّى يَبْدَءُوكُمْ حُجَّةٌ لَكُمْ أُخْرَى فَإِذَا هَزَمْتُمُوهُمْ فَلَا تَقْتُلُوا مُدْبِراً وَ لَا تُجْهِزُوا عَلَى جَرِيحٍ وَ لَا تَكْشِفُوا عَوْرَةً وَ لَا تُمَثِّلُوا بِقَتِيلٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in a Hadeeth of Abdul Rahman Bin Jundab, from his father that, ",
            "‘Amir Al-Momineen<sup>asws</sup> used to order in every place which we met our enemies, so he<sup>asws</sup> was saying: ‘Do not fight a people until they initiate (the battle), for you all are, by the Praise of Allah<sup>azwj</sup>, upon a valid Cause. Leave them until they begin, thereby being another cause for you (to fight). So when you defeat them, so neither kill the fleer, nor attack the wounded, nor uncover any nakedness, nor mutilate the killed ones’."
          ],
          "en.sarwar": [
            "3. In Hadith narrated from ‘Abd al-Rahman ibn Jundab from his father who has said the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, in every battlefield we faced our enemies issued his commandments and said, ‘You must not fight the people before they attack you; you by the grace of Allah possess authority and good cause. Your allowing them to attack you first is another valid point in support of the good cause. When you defeat them you must not pursue the fleeing, you must not hurt the wounded and you must not expose anyone’s privacy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/371)"
        ],
        "index": 8212,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:15:4",
        "text": [
          "وَ فِي حَدِيثِ مَالِكِ بْنِ أَعْيَنَ قَالَ حَرَّضَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) النَّاسَ بِصِفِّينَ فَقَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ دَلَّكُمْ عَلى تِجارَةٍ تُنْجِيكُمْ مِنْ عَذابٍ أَلِيمٍ وَ تُشْفِي بِكُمْ عَلَى الْخَيْرِ الْإِيمَانِ بِاللَّهِ وَ الْجِهَادِ فِي سَبِيلِ اللَّهِ وَ جَعَلَ ثَوَابَهُ مَغْفِرَةً لِلذَّنْبِ وَ مَساكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ",
          "وَ قَالَ عَزَّ وَ جَلَّ إِنَّ اللَّهَ يُحِبُّ الَّذِينَ يُقاتِلُونَ فِي سَبِيلِهِ صَفًّا كَأَنَّهُمْ بُنْيانٌ مَرْصُوصٌ فَسَوُّوا صُفُوفَكُمْ كَالْبُنْيَانِ الْمَرْصُوصِ فَقَدِّمُوا الدَّارِعَ وَ أَخِّرُوا الْحَاسِرَ وَ عَضُّوا عَلَى النَّوَاجِدِ فَإِنَّهُ أَنْبَأُ لِلسُّيُوفِ عَلَى الْهَامِ وَ الْتَوُوا عَلَى أَطْرَافِ الرِّمَاحِ فَإِنَّهُ أَمْوَرُ لِلْأَسِنَّةِ وَ غُضُّوا الْأَبْصَارَ فَإِنَّهُ أَرْبَطُ لِلْجَأْشِ وَ أَسْكَنُ لِلْقُلُوبِ وَ أَمِيتُوا الْأَصْوَاتَ فَإِنَّهُ أَطْرَدُ لِلْفَشَلِ وَ أَوْلَى بِالْوَقَارِ وَ لَا تَمِيلُوا بِرَايَاتِكُمْ وَ لَا تُزِيلُوهَا وَ لَا تَجْعَلُوهَا إِلَّا مَعَ شُجْعَانِكُمْ فَإِنَّ الْمَانِعَ لِلذِّمَارِ وَ الصَّابِرَ عِنْدَ نُزُولِ الْحَقَائِقِ هُمْ أَهْلُ الْحِفَاظِ",
          "وَ لَا تُمَثِّلُوا بِقَتِيلٍ وَ إِذَا وَصَلْتُمْ إِلَى رِجَالِ الْقَوْمِ فَلَا تَهْتِكُوا سِتْراً وَ لَا تَدْخُلُوا دَاراً وَ لَا تَأْخُذُوا شَيْئاً مِنْ أَمْوَالِهِمْ إِلَّا مَا وَجَدْتُمْ فِي عَسْكَرِهِمْ وَ لَا تُهَيِّجُوا امْرَأَةً بِأَذًى وَ إِنْ شَتَمْنَ أَعْرَاضَكُمْ وَ سَبَبْنَ أُمَرَاءَكُمْ وَ صُلَحَاءَكُمْ فَإِنَّهُنَّ ضِعَافُ الْقُوَى وَ الْأَنْفُسِ وَ الْعُقُولِ وَ قَدْ كُنَّا نُؤْمَرُ بِالْكَفِّ عَنْهُنَّ وَ هُنَّ مُشْرِكَاتٌ وَ إِنْ كَانَ الرَّجُلُ لَيَتَنَاوَلُ الْمَرْأَةَ فَيُعَيَّرُ بِهَا وَ عَقِبُهُ مِنْ بَعْدِهِ ",
          "وَ اعْلَمُوا أَنَّ أَهْلَ الْحِفَاظِ هُمُ الَّذِينَ يَحُفُّونَ بِرَايَاتِهِمْ وَ يَكْتَنِفُونَهَا وَ يَصِيرُونَ حِفَافَيْهَا وَ وَرَاءَهَا وَ أَمَامَهَا وَ لَا يُضَيِّعُونَهَا لَا يَتَأَخَّرُونَ عَنْهَا فَيُسَلِّمُوهَا وَ لَا يَتَقَدَّمُونَ عَلَيْهَا فَيُفْرِدُوهَا",
          "رَحِمَ اللَّهُ امْرَأً وَاسَى أَخَاهُ بِنَفْسِهِ وَ لَمْ يَكِلْ قِرْنَهُ إِلَى أَخِيهِ فَيَجْتَمِعَ قِرْنُهُ وَ قِرْنُ أَخِيهِ فَيَكْتَسِبَ بِذَلِكَ اللَّائِمَةَ وَ يَأْتِيَ بِدَنَاءَةٍ وَ كَيْفَ لَا يَكُونُ كَذَلِكَ وَ هُوَ يُقَاتِلُ الِاثْنَيْنِ وَ هَذَا مُمْسِكٌ يَدَهُ قَدْ خَلَّى قِرْنَهُ عَلَى أَخِيهِ هَارِباً مِنْهُ يَنْظُرُ إِلَيْهِ وَ هَذَا فَمَنْ يَفْعَلْهُ يَمْقُتْهُ اللَّهُ فَلَا تَعَرَّضُوا لِمَقْتِ اللَّهِ عَزَّ وَ جَلَّ فَإِنَّمَا مَمَرُّكُمْ إِلَى اللَّهِ وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ لَنْ يَنْفَعَكُمُ الْفِرارُ إِنْ فَرَرْتُمْ مِنَ الْمَوْتِ أَوِ الْقَتْلِ وَ إِذاً لا تُمَتَّعُونَ إِلَّا قَلِيلًا",
          "وَ ايْمُ اللَّهِ لَئِنْ فَرَرْتُمْ مِنْ سُيُوفِ الْعَاجِلَةِ لَا تَسْلَمُونَ مِنْ سُيُوفِ الْآجِلَةِ فَاسْتَعِينُوا بِالصَّبْرِ وَ الصِّدْقِ فَإِنَّمَا يَنْزِلُ النَّصْرُ بَعْدَ الصَّبْرِ فَجَاهِدُوا فِي اللَّهِ حَقَّ جِهَادِهِ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ",
          "وَ قَالَ ( عليه السلام ) حِينَ مَرَّ بِرَايَةٍ لِأَهْلِ الشَّامِ أَصْحَابُهَا لَا يَزُولُونَ عَنْ مَوَاضِعِهِمْ فَقَالَ ( عليه السلام ) إِنَّهُمْ لَنْ يَزُولُوا عَنْ مَوَاقِفِهِمْ دُونَ طَعْنٍ دِرَاكٍ يَخْرُجُ مِنْهُ النَّسِيمُ وَ ضَرْبٍ يَفْلِقُ الْهَامَ وَ يُطِيحُ الْعِظَامَ وَ يَسْقُطُ مِنْهُ الْمَعَاصِمُ وَ الْأَكُفُّ حَتَّى تَصَدَّعَ جِبَاهُهُمْ بِعَمْدِ الْحَدِيدِ وَ تَنَثَّرَ حَوَاجِبُهُمْ عَلَى الصُّدُورِ وَ الْأَذْقَانِ أَيْنَ أَهْلُ الصَّبْرِ وَ طُلَّابُ الْأَجْرِ ",
          "فَسَارَتْ إِلَيْهِ عِصَابَةٌ مِنَ الْمُسْلِمِينَ فَعَادَتْ مَيْمَنَتُهُ إِلَى مَوْقِفِهَا وَ مَصَافِّهَا وَ كَشَفَتْ مَنْ بِإِزَائِهَا فَأَقْبَلَ حَتَّى انْتَهَى إِلَيْهِمْ وَ قَالَ ( عليه السلام ) إِنِّي قَدْ رَأَيْتُ جَوْلَتَكُمْ وَ انْحِيَازَكُمْ عَنْ صُفُوفِكُمْ تَحُوزُكُمُ الْجُفَاةُ وَ الطُّغَاةُ وَ أَعْرَابُ أَهْلِ الشَّامِ وَ أَنْتُمْ لَهَامِيمُ الْعَرَبِ وَ السَّنَامُ الْأَعْظَمُ وَ عُمَّارُ اللَّيْلِ بِتِلَاوَةِ الْقُرْآنِ وَ دَعْوَةِ أَهْلِ الْحَقِّ إِذْ ضَلَّ الْخَاطِئُونَ ",
          "فَلَوْ لَا إِقْبَالُكُمْ بَعْدَ إِدْبَارِكُمْ وَ كَرُّكُمْ بَعْدَ انْحِيَازِكُمْ لَوَجَبَ عَلَيْكُمْ مَا يَجِبُ عَلَى الْمُوَلِّي يَوْمَ الزَّحْفِ دُبُرَهُ وَ كُنْتُمْ فِيمَا أَرَى مِنَ الْهَالِكِينَ وَ لَقَدْ هَوَّنَ عَلَيَّ بَعْضَ وَجْدِي وَ شَفَى بَعْضَ حَاجِ صَدْرِي إِذَا رَأَيْتُكُمْ حُزْتُمُوهُمْ كَمَا حَازُوكُمْ فَأَزَلْتُمُوهُمْ عَنْ مَصَافِّهِمْ كَمَا أَزَالُوكُمْ وَ أَنْتُمْ تَضْرِبُونَهُمْ بِالسُّيُوفِ حَتَّى رَكِبَ أَوَّلُهُمْ آخِرَهُمْ كَالْإِبِلِ الْمَطْرُودَةِ الْهِيمِ",
          "الْآنِّ فَاصْبِرُوا نَزَلَتْ عَلَيْكُمُ السَّكِينَةُ وَ ثَبَّتَكُمُ اللَّهُ بِالْيَقِينِ وَ لْيَعْلَمِ الْمُنْهَزِمُ بِأَنَّهُ مُسْخِطُ رَبِّهِ وَ مُوبِقُ نَفْسِهِ إِنَّ فِي الْفِرَارِ مَوْجِدَةَ اللَّهِ وَ الذُّلَّ اللَّازِمَ وَ الْعَارَ الْبَاقِيَ وَ فَسَادَ الْعَيْشِ عَلَيْهِ وَ إِنَّ الْفَارَّ لَغَيْرُ مَزِيدٍ فِي عُمُرِهِ وَ لَا مَحْجُوزٍ بَيْنَهُ وَ بَيْنَ يَوْمِهِ وَ لَا يَرْضَى رَبُّهُ وَ لَمَوْتُ الرَّجُلِ مَحْقاً قَبْلَ إِتْيَانِ هَذِهِ الْخِصَالِ خَيْرٌ مِنَ الرِّضَا بِالتَّلْبِيسِ بِهَا وَ الْإِقْرَارِ عَلَيْهَا ",
          "وَ فِي كَلَامٍ لَهُ آخَرَ وَ إِذَا لَقِيتُمْ هَؤُلَاءِ الْقَوْمَ غَداً فَلَا تُقَاتِلُوهُمْ حَتَّى يُقَاتِلُوكُمْ فَإِذَا بَدَءُوا بِكُمْ فَانْهُدُوا إِلَيْهِمْ وَ عَلَيْكُمُ السَّكِينَةَ وَ الْوَقَارَ وَ عَضُّوا عَلَى الْأَضْرَاسِ فَإِنَّهُ أَنْبَأُ لِلسُّيُوفِ عَنِ الْهَامِ وَ غُضُّوا الْأَبْصَارَ وَ مُدُّوا جِبَاهَ الْخُيُولِ وَ وُجُوهَ الرِّجَالِ وَ أَقِلُّوا الْكَلَامَ فَإِنَّهُ أَطْرَدُ لِلْفَشَلِ وَ أَذْهَبُ بِالْوَهَلِ وَ وَطِّنُوا أَنْفُسَكُمْ عَلَى الْمُبَارَزَةِ وَ الْمُنَازَلَةِ وَ الْمُجَادَلَةِ وَ اثْبُتُوا وَ اذْكُرُوا اللَّهَ عَزَّ وَ جَلَّ كَثِيراً",
          "فَإِنَّ الْمَانِعَ لِلذِّمَارِ عِنْدَ نُزُولِ الْحَقَائِقِ هُمْ أَهْلُ الْحِفَاظِ الَّذِينَ يَحُفُّونَ بِرَايَاتِهِمْ وَ يَضْرِبُونَ حَافَتَيْهَا وَ أَمَامَهَا وَ إِذَا حَمَلْتُمْ فَافْعَلُوا فِعْلَ رَجُلٍ وَاحِدٍ وَ عَلَيْكُمْ بِالتَّحَامِي فَإِنَّ الْحَرْبَ سِجَالٌ لَا يَشُدُّونَ عَلَيْكُمْ كَرَّةً بَعْدَ فَرَّةٍ وَ لَا حَمْلَةً بَعْدَ جَوْلَةٍ وَ مَنْ أَلْقَى إِلَيْكُمُ السَّلَمَ فَاقْبَلُوا مِنْهُ وَ اسْتَعِينُوا بِالصَّبْرِ فَإِنَّ بَعْدَ الصَّبْرِ النَّصْرَ مِنَ اللَّهِ عَزَّ وَ جَلَّ  إِنَّ الْأَرْضَ لِلَّهِ يُورِثُها مَنْ يَشاءُ مِنْ عِبادِهِ وَ الْعاقِبَةُ لِلْمُتَّقِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And in a Hadeeth of Maalik Bin Ayn who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> called the people at (the battle of) Siffeen, so he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Pointed you all to be upon a trade which would salvage you from the Painful Punishment, and Heal you to be upon the goodness of the belief in Allah<sup>azwj</sup> and the Jihad in the Way of Allah<sup>azwj</sup>, and Made its Rewards to be Forgiveness of the sins, and goodly dwellings in the Gardens of Eden’.",
            "And the Mighty and Majestic Said <span class=\"ibTxt\">[61:4] Surely Allah loves those who fight in His way in rows as if they were a solid structure</span>. Therefore, even out your rows to be like a solid structure. So place the armoured ones in front and the unarmoured to be next, and grit your teeth for it is stronger for the swords upon the heads (of the enemies), and be quick in launching the sides of the spears for it is more violent for the spikes, and lower your eyes for it is linked to the composure and a tranquillity for the hearts, and deaden your voices for it drives out the failure and closer with the dignity. Neither incline your flags nor let them fall, and do not make these to be with any except for your bravest ones, for the defenders of the honour and the patient during the descent of the realities, they are the protecting people. ",
            "And do not mutilate the killed ones, and whenever you arrive to the men of the people, so do not tear down a veil, nor enter a house, and do not take anything from their wealth except what you find among their soldiers, and do not agitate a woman with harm. And if they (women) insult your honour and swear at your leaders and your righteous ones, so (it is because) they are weak of strength, and soul, and intellect. And we have been ordered with the restraining from them, and they were Polytheist women, and if the man had grabbed the woman, so he would be reproached for it, and his posterity (descendants) from after him.",
            "And know, that the defenders, they are those who are holding firmly their flags, and they are surrounding it, and going by its sides, and behind it, and in front of it, and they are not losing it nor are they staying back from it. So they are safeguarding it and are not moving ahead of it nor are they getting separated from it. ",
            "May Allah<sup>azwj</sup> have Mercy on a man who consoles his brother by himself and does not get weary of being paired to his brother. So his head meets the head of his brother, and he acquires the blame and becomes lowly. And how can he not become like that, and he was fighting as two, and this one restrains his hand, so he has isolated his pair upon his brother, fleeing from him looking on at him and this. So the one who does it, Allah<sup>azwj</sup> would Abhor him. Therefore, do not expose yourselves to the Loathing of Allah<sup>azwj</sup> Mighty and Majestic. But rather, you all would be making your way to Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\">[33:16] Say: Fleeing shall not benefit you if you flee from death or killing, and (if you do) you will not be enjoying except for a little while</span>.",
            "And I<sup>asws</sup> swear by Allah<sup>azwj</sup>, if you were to flee from the swords of the present, you would not be safe from the swords of the future. Therefore, seek assistance with the patient and the truthfulness, for rather the victory would descend upon who are the patience. So fight for Allah<sup>azwj</sup> which a deserving Jihad, and there is no strength except with Allah<sup>azwj</sup>’. ",
            "And he<sup>asws</sup> said when he<sup>asws</sup> passed by a flag of the people of Syria whose owners were not moving from their places, so he<sup>asws</sup> said: ‘They would not be moving from their places without the stabbing of your armour which would extract the soul, and a strike which splits the head and breaks the bones, and the wrists and the palms fall off, until their foreheads are cracked with the force of the iron, and their eyelids scatter upon their chests and the chins. Where are the people and the seekers of the Recompense?’",
            "So a band of Muslims marched, and its right wing returned back to its place and its centre wing, and exposed those facing them. So he<sup>asws</sup> returned until he<sup>asws</sup> ended up to them, and said: ‘I<sup>asws</sup> had seen your visitation and your retreating from your ranks giving an opportunity to the unjust and the tyrants, and the Bedouins of the people of Syria, and you are the top ones of the Arabs, and the great peak, and enduring ones of the night by the recitation of the Quran and the callers from the people of the Truth when the erroneous go astray.",
            "Had it not been for your facing them after your turning your backs on them, and your regrouping after your retreating, there would have Obligated upon you what gets Obligated upon the turner of his back on the day of the battle, and you would be in what I<sup>asws</sup> view as the destroyed ones. And it is comforting upon me<sup>asws</sup> part of what I<sup>asws</sup> find, and a healing for part of the concerns of my<sup>asws</sup> chest, when I<sup>asws</sup> saw you defeating them just as they had defeated you (beforehand), and you dislodged them from their rows just as they had dislodged you (beforehand), and you were striking them with the swords to the extent that their first ones rode upon their last ones like the camel driven away.",
            "As for now, so be patient and tranquillity would descend upon you, and Allah<sup>azwj</sup> will Affirm you with the conviction, and the defeated one would know that he has Angered his Lord<sup>azwj</sup> and would rebuke himself. In the fleeing is the Fury of Allah<sup>azwj</sup>, and the humiliation is necessitated, and the remaining stigma, and spoiling of the life over it. And the fleer is without an increase in his age, and there is no barrier between him and between his day (of death), nor would his Lord<sup>azwj</sup> be Pleased with him, and for a death to come to the man before he indulges in such characteristics is better than the pleasure of being clothed by these (characteristics) and agreeing over it’.",
            "And in another speech of his<sup>asws</sup>: ‘And when you meet these people (in battle) tomorrow, so do not fight them until they fight you. So when they initiate (the fighting) with you, then break them down and upon you would be tranquillity and the dignity. And grit your teeth for it is strength for the swords on the heads (of the enemies), and lower your eyes, and keep your eyes upon the foreheads of the cavalry horses and the forces of the men. And minimise your speech for it drives away the failure, and resign yourselves upon the duelling, and the confrontation, and the argumentation, and be steadfast and mention Allah<sup>azwj</sup> Mighty and Majestic frequently. ",
            "So the defenders of the honour during the descent of the realities, they are the protecting people whom are surrounding their flag, and the they are striking around it, and in front of it, and when you are carrying it, so do the deed of one man (in unison), and upon you is being protective (of each other), for the war is a competition. Do not let yourselves be pulled by an attack after the fleeing, nor an advance after a retreat. And the one who throws (down the weapons) to you for the peace, so accept it from him, and seek Assistance by the patience, for after the patience is the Consideration from Allah<sup>azwj</sup> Mighty and Majestic. <span class=\"ibTxt\">[7:128] surely the earth is Allah's; He Causes such of His servants to inherit it as He so Desires, and the end is for those who are pious</span>’."
          ],
          "en.sarwar": [
            "4. In a Hadith from Malik ibn A’yan the following is narrated: “In the battle of Siffin, Amir al-Mu’minin, ‘Alayhi al-Salam, encouraging people said, ‘Allah, the Most Majestic, the Most Glorious, has shown you a bargain and a deal which will save you from the painful torment. Belief in Allah and Jihad for the cause of Allah bring you very close to goodness. He makes your reward to be forgiveness of your sins and fine dwellings in paradise of Eden. Allah, the Most Majestic, the Most Glorious, has said, “Allah certainly loves those who fight for His cause and stand firm as solid and strong structures.” (61:4) ‘You must form yourselves in straight lines like solid and strong structures. Allow those with coats of arms to be in front and those without it to be the next. You must fix your back-teeth against each other; it makes the sword strike harder on the head of the enemy. Launch your spears, they move swiftly. Look with a lower angle; it ties down excitement and relaxes the heart. Silence voices; it keeps failure away and it is better for dignity. You must not allow your banners to incline and you must not remove them. You must not allow anyone other than brave people to carry them. The defenders of what is very important, who can exercise patience in difficult conditions, deserve to be the protectors. You must not mutilate those who are killed, and when you reach the men of the enemy you must not expose privacies, you must not enter any house, you must not take anything of their properties except what you find with their army. You must not disturb any woman with mistreatment; and if they use bad words against your honor, men, virtuous ones among you, it is because they suffer from physical, psychological and intellectual weakness. We were ordered to hold our hands back from them and they were pagan women. If a man would take upon women this would remain a flaw in him and in his descendants after him. You must take notice, people capable of protecting important matters deserve to carry the banner to provide it protection and others walk on the sides, behind and in front of them, and they must not lose sight of it (the banner) and must not remain far behind nor must they go far ahead to become separated. I pray to Allah to grant blessings to one who cooperates with his brother (in faith) with his person. One should not leave his peer against his brother so that his peer and his brother fight. This brings regret and humiliation. This inevitably becomes his (enemy’s) fight against two people if he holds his hands back and has left his peer alone against his brother and has run away. He just looks to him and this one. If one does it he has angered Allah. You must not expose yourselves to the anger of Allah, the Most Majestic, the Most Glorious. “Running away does not benefit you even if you run away from death, or from being killed, because thereafter you will not benefit more than very little.” (33:16) I swear by Allah, if you run away from the swords nearby, you will not escape from the swords later on. You must seek help by exercising patience and truthfulness. Victory comes only after exercising patience. You must do Jihad for the cause of Allah, the way Jihad should be done and there is no power without Allah.’ “He (the Imam), ‘Alayhi al-Salam, passed by the banner of the people of al-Sham and found them holding their position. He said, ‘They will not move from their position without a blow which is hard and expels the soul out, and a blow that splits the skull, crushes the bones and makes the arms and the hands to fall off so that their forehead is crushed by the iron bars, their eyebrows scatter over their chest and chin. Where are people of patience and seekers of reward?’ A group of the Muslims marched to them. The right flank of this group returned back to the center and exposed those opposite to them. He, ‘Alayhi al-Salam, moved forward until he reached them and said, ‘I saw your attack and retreat away from your positioned lines. It was your moving that provided a chance for the unjust and tyrants of al-Sham. You are the top most among Arab and the great peak, the beauty of the nights because of your recitations of the Holy Quran and the callers from among the people of the truth, while the sinners are lost. Were it not for your advance after your retreat and your regrouping after giving way to the enemy, you could have become subject to what those fleeing from the enemy during an advancing operation need to face for turning their backs to the enemy. I would find you of those being destroyed. My concerns are to a small degree reduced and my chest to a small degree is comforted. This happened when I saw you gain the ground over them as they had against you and you were able to remove them from their positions as they had done to you. I saw you strike them with your sword until their first line was toppled over the last line like the camel driven away. You must exercise patience. Comfort has come upon you and Allah has made you steadfast with certainty, so that the defeated notice that he is making his Lord angry. He hates his own self. In fleeing from the battle there is the anger of Allah, the inevitable humiliation, and a remaining stigma and destruction of ways of one’s living. There is no increase in the longevity of life of the fleeing person, no barrier between him and his day of death, and his Lord does not become happy with him. One’s death with truthfulness before achieving such characteristics is better than remaining with them and dwelling upon them.’ “In another of his speech he, ‘Alayhi al-Salam, has said, ‘When you face these people (the enemy) tomorrow do not fight them before they attack you. When they attack you then rise against them. You must remain calm and dignified. You must fix your backside teeth against the teeth of opposite side. It delivers a harder hit on the skulls. Keep your eyes lower and look at the foreheads of the horses and the faces of men. Reduce your speech; it keeps failure and argumentations away. You must settle your souls up facing the enemy openly, to advance and to attack. You must remain steadfast and speak of Allah, the Most Majestic, the Most Glorious, very often. One who protects what is important in difficult times is of the protecting people who keep their banner on the side and others walk on its sides and in front. When you attack do it with such coordination as if it is one man’s attack. You must be protective; war is bitter. You must not allow them (enemy) to attack you after retreat or to advance to you after an unpredictable move. If one surrenders, accept it from him. Seek help from exercising patience; victory from Allah, the Most Majestic, the Most Glorious, follows exercising patience. Allah’s servants will inherit the earth and the good end belongs to those who maintain piety before Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/377)"
        ],
        "index": 8213,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:15:5",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ الْكُوفِيُّ عَنِ ابْنِ جُمْهُورٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ الْأَصَمِّ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) لِأَصْحَابِهِ إِذَا لَقِيتُمْ عَدُوَّكُمْ فِي الْحَرْبِ فَأَقِلُّوا الْكَلَامَ وَ اذْكُرُوا اللَّهَ عَزَّ وَ جَلَّ وَ لَا تُوَلُّوهُمُ الْأَدْبَارَ فَتُسْخِطُوا اللَّهَ تَبَارَكَ وَ تَعَالَى وَ تَسْتَوْجِبُوا غَضَبَهُ وَ إِذَا رَأَيْتُمْ مِنْ إِخْوَانِكُمُ الْمَجْرُوحَ وَ مَنْ قَدْ نُكِّلَ بِهِ أَوْ مَنْ قَدْ طَمِعَ عَدُوُّكُمْ فِيهِ فَقُوهُ بِأَنْفُسِكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Al Kufy, from Ibn Jamhour, from his father, from Muhammad Bin Sinan, from Mufazzal Bin Umar, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, ",
            "and from Abdullah Bin Abdul Rahman Al Asamma, from Hareyz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said to his<sup>asws</sup> companions: ‘Whenever you meet your enemies during the war, so minimise your speech, and mention Allah<sup>azwj</sup> Mighty and Majestic frequently, and do not turn back on them, for Allah<sup>azwj</sup> Blessed and High would be Angered, and His<sup>azwj</sup> Anger would be Obligated upon you. And whenever you see one of your brethren been injured, or being tortured, or one who has been captured by your enemies therein, so protect him with yourself (life)’."
          ],
          "en.sarwar": [
            "5. Ahmad ibn Muhammad al-Kufiy has narrated from ibn Jumhur from his father from Muhammad ibn Sinan from Mufaddai ibn ‘Umar Aiso ‘Abd Allah ibn ‘Abd al-Rahman al-Asamm has narrated from Hariz from Muhammad ibn Muslim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Amir al-Mu’minin, ‘Alayhi al-Salam, has said to his companions, ‘When you face the enemy during a war you must reduce your speech, remember Allah, the Most Majestic, the Most Glorious, very often. You must not turn your backs to them; Allah, the most Blessed, the most High, becomes angry with you and you will become subject to His anger. If you see one of your brother wounded or one who is captured by the enemy or the enemy is about to harm him, you must protect him with your persons.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:15",
  "kind": "verse_list"
}