{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:5:1:16",
        "titles": {
          "ar": "باب",
          "en": "Chapter 16 – A Chapter"
        }
      }
    ],
    "index": 1196,
    "local_index": 16,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:5:1:17",
        "titles": {
          "ar": "باب أَنَّهُ لَا يَحِلُّ لِلْمُسْلِمِ أَنْ يَنْزِلَ دَارَ الْحَرْبِ",
          "en": "Chapter 17 – It is not Permissible for the Muslim that he lodges in the field of war"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:5:1:15",
        "titles": {
          "ar": "باب مَا كَانَ يُوصِي أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِهِ عِنْدَ الْقِتَالِ",
          "en": "Chapter 15 – What Amir Al-Momineen<sup>asws</sup> advised with during the fighting"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:16",
    "titles": {
      "ar": "باب",
      "en": "Chapter 16 – A Chapter"
    },
    "verse_count": 2,
    "verse_start_index": 8213,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/377)"
        ],
        "index": 8214,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5",
              "text": "الْحَسَنِ بْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/110",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3303",
              "text": "بَعْضِ أَصْحَابِ أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " فِي"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ بَعْضِ أَصْحَابِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:16:1",
        "text": [
          " السَّبِيِّ يَأْخُذُهُ الْعَدُوُّ مِنَ الْمُسْلِمِينَ فِي الْقِتَالِ مِنْ أَوْلَادِ الْمُسْلِمِينَ أَوْ مِنْ مَمَالِيكِهِمْ فَيَحُوزُونَهُمْ ثُمَّ إِنَّ الْمُسْلِمِينَ بَعْدُ قَاتَلُوهُمْ فَظَفِرُوا بِهِمْ وَ سَبَوْهُمْ وَ أَخَذُوا مِنْهُمْ مَا أَخَذُوا مِنْ مَمَالِيكِ الْمُسْلِمِينَ وَ أَوْلَادِهِمُ الَّذِينَ كَانُوا أَخَذُوهُ مِنَ الْمُسْلِمِينَ كَيْفَ يُصْنَعُ بِمَا كَانُوا أَخَذُوهُ مِنْ أَوْلَادِ الْمُسْلِمِينَ وَ مَمَالِيكِهِمْ ",
          "قَالَ فَقَالَ أَمَّا أَوْلَادُ الْمُسْلِمِينَ فَلَا يُقَامُونَ فِي سِهَامِ الْمُسْلِمِينَ وَ لَكِنْ يُرَدُّونَ إِلَى أَبِيهِمْ أَوْ أَخِيهِمْ أَوْ إِلَى وَلِيِّهِمْ بِشُهُودٍ وَ أَمَّا الْمَمَالِيكُ فَإِنَّهُمْ يُقَامُونَ فِي سِهَامِ الْمُسْلِمِينَ فَيُبَاعُونَ وَ يُعْطَى مَوَالِيهِمْ قِيمَةَ أَثْمَانِهِمْ مِنْ بَيْتِ مَالِ الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Hisham Bin Salim, ",
            "(It has been narrated) from one of the companions of Abu Abdullah<sup>asws</sup>, from Abu Abdullah<sup>asws</sup> with regards to the captives taken from the Muslims during the fighting, from the children of the Muslims, or from their owned slaves, so they (enemies) hold them. Then Muslims, afterwards fight with them and capture them, and take from them, what they had taken, from the owned slaves of the Muslims and their children whom they (enemies) had taken from the Muslim, how should they be dealt with, from the children of the Muslims and their owned slaves. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> said: ‘As for the children of the Muslim, so they would not be evaluated in the share of the Muslims, but they would be returned to their fathers, or their brothers, or to their guardians with a witness. And as for the owned slaves, so they would be evaluated in the share of the Muslims, so they would be sold and their masters would be given their price from the Public Treasury of the Muslims’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Hisham ibn Salim from certain individuals of his people who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, about the Muslim prisoners, their children or servants (slaves), taken by the enemy who were afterwards rescued after a victorious fight, how should they be dealt with, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The children of the Muslims do not become the share of the Muslims. They are returned to their parents, or brothers, or their guardian in the presence of witnesses. The slaves however become of the share of the Muslims. They are purchased with money from public treasury and their price is given to their owners.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/378)"
        ],
        "index": 8215,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/300",
              "text": "حَمَّادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/168",
              "text": "الْحَلَبِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:16:2",
        "text": [
          " سَأَلْتُهُ عَنْ رَجُلٍ لَقِيَهُ الْعَدُوُّ وَ أَصَابَ مِنْهُ مَالًا أَوْ مَتَاعاً ثُمَّ إِنَّ الْمُسْلِمِينَ أَصَابُوا ذَلِكَ كَيْفَ يُصْنَعُ بِمَتَاعِ الرَّجُلِ فَقَالَ إِذَا كَانَ أَصَابُوهُ قَبْلَ أَنْ يَحُوزُوا مَتَاعَ الرَّجُلِ رُدَّ عَلَيْهِ وَ إِنْ كَانَ أَصَابُوهُ بَعْدَ مَا حَازُوهُ فَهُوَ فَيْ‏ءٌ لِلْمُسْلِمِينَ وَ هُوَ أَحَقُّ بِالشُّفْعَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man whose enemy met him and acquired wealth from him, or chattels (belongings), then the Muslims acquired that. How should one deal with the chattels of the man?’ So he<sup>asws</sup> said: ‘If that was acquired before they had possessed the chattels of the man, these would be returned to him, and if they were acquired after having possessed by them, so it is war booty of the Muslims, and he would have a right with being the first one (to buy it back)’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Um ay r from Hammad from al-Halabiy who has said the following: “This is concerning my question before abu ‘Abd Allah, ‘Alayhi al-Salam, about a man who is captured by the enemy with his properties. Then the Muslims captured him. ‘How should they deal with his properties?’ He (the Imam) replied, ‘If they capture him before the enemies secure for themselves his properties, they should be returned to him. If they capture him after the enemies secure for themselves his properties, such properties become as Fay’ for the Muslims and he deserves the right of having priority (al-Shuf’ ah) to purchase them before anyone else does.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:16",
  "kind": "verse_list"
}