{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 17"
        },
        "path": "/books/al-kafi:5:1:17",
        "titles": {
          "ar": "باب أَنَّهُ لَا يَحِلُّ لِلْمُسْلِمِ أَنْ يَنْزِلَ دَارَ الْحَرْبِ",
          "en": "Chapter 17 – It is not Permissible for the Muslim that he lodges in the field of war"
        }
      }
    ],
    "index": 1197,
    "local_index": 17,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:17",
    "titles": {
      "ar": "باب أَنَّهُ لَا يَحِلُّ لِلْمُسْلِمِ أَنْ يَنْزِلَ دَارَ الْحَرْبِ",
      "en": "Chapter 17 – It is not Permissible for the Muslim that he lodges in the field of war"
    },
    "verse_count": 1,
    "verse_start_index": 8215,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/379)"
        ],
        "index": 8216,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:17:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَعَثَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) جَيْشاً إِلَى خَثْعَمٍ فَلَمَّا غَشِيَهُمُ اسْتَعْصَمُوا بِالسُّجُودِ فَقُتِلَ بَعْضُهُمْ فَبَلَغَ ذَلِكَ النَّبِيَّ ( صلى الله عليه وآله ) فَقَالَ أَعْطُوا الْوَرَثَةَ نِصْفَ الْعَقْلِ بِصَلَاتِهِمْ وَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) أَلَا إِنِّي بَرِي‏ءٌ مِنْ كُلِّ مُسْلِمٍ نَزَلَ مَعَ مُشْرِكٍ فِي دَارِ الْحَرْبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> sent an army to Khas’am. So when they overcame them, they exempted themselves by (performing) the Prostration. So some of them were killed, and (the news of) that reach the Prophet<sup>saww</sup>. So he<sup>saww</sup> said: ‘Give to the inheritors half the compensation due to their Prayer’. And the Prophet<sup>saww</sup> said: ‘Indeed! I<sup>saww</sup> disavow from every Muslim who lodges with a Polytheist in the battlefield’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father, from af-Nawfafiy from af-Sakuniy who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that once, the Messenger of Allah dispatched an army against the KhatlTam. When this army was overpowered by the enemy they sought protection by performing prostration. Certain ones among them were killed. When the news reached the Holy Prophet he said, ‘You must pay half of the amount of compensation for their lives because of their prayer.’ The Holy Prophet said, ‘I certainly denounce one who is a Muslim and yet goes to reside in the war zone with the pagans.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:17",
  "kind": "verse_list"
}