{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:5:1:20",
        "titles": {
          "ar": "باب ",
          "en": "Chapter 20– A Chapter"
        }
      }
    ],
    "index": 1200,
    "local_index": 20,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 21"
        },
        "path": "/books/al-kafi:5:1:21",
        "titles": {
          "ar": "باب الشِّعَارِ",
          "en": "Chapter 21 – The Slogan (Battle-cry)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:5:1:19",
        "titles": {
          "ar": "باب ",
          "en": "Chapter 19 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:20",
    "titles": {
      "ar": "باب ",
      "en": "Chapter 20– A Chapter"
    },
    "verse_count": 1,
    "verse_start_index": 8227,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/384)"
        ],
        "index": 8228,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:20:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ عَنِ ابْنِ الْقَدَّاحِ عَنْ أَبِيهِ مَيْمُونٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) كَانَ إِذَا أَرَادَ الْقِتَالَ قَالَ هَذِهِ الدَّعَوَاتِ اللَّهُمَّ إِنَّكَ أَعْلَمْتَ سَبِيلًا مِنْ سُبُلِكَ جَعَلْتَ فِيهِ رِضَاكَ وَ نَدَبْتَ إِلَيْهِ أَوْلِيَاءَكَ وَ جَعَلْتَهُ أَشْرَفَ سُبُلِكَ عِنْدَكَ ثَوَاباً وَ أَكْرَمَهَا لَدَيْكَ مَآباً وَ أَحَبَّهَا إِلَيْكَ مَسْلَكاً ",
          "ثُمَّ اشْتَرَيْتَ فِيهِ مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَ أَمْوَالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَ يُقْتَلُونَ وَعْداً عَلَيْكَ حَقّاً فَاجْعَلْنِي مِمَّنْ اشْتَرَى فِيهِ مِنْكَ نَفْسَهُ ثُمَّ وَفَى لَكَ بِبَيْعِهِ الَّذِي بَايَعَكَ عَلَيْهِ غَيْرَ نَاكِثٍ وَ لَا نَاقِضٍ عَهْداً وَ لَا مُبَدِّلًا تَبْدِيلًا ",
          "بَلِ اسْتِيجَاباً لِمَحَبَّتِكَ وَ تَقَرُّباً بِهِ إِلَيْكَ فَاجْعَلْهُ خَاتِمَةَ عَمَلِي وَ صَيِّرْ فِيهِ فَنَاءَ عُمُرِي وَ ارْزُقْنِي فِيهِ لَكَ وَ بِهِ مَشْهَداً تُوجِبُ لِي بِهِ مِنْكَ الرِّضَا وَ تَحُطُّ بِهِ عَنِّي الْخَطَايَا",
          "وَ تَجْعَلُنِي فِي الْأَحْيَاءِ الْمَرْزُوقِينَ بِأَيْدِي الْعُدَاةِ وَ الْعُصَاةِ تَحْتَ لِوَاءِ الْحَقِّ وَ رَايَةِ الْهُدَى مَاضِياً عَلَى نُصْرَتِهِمْ قُدُماً غَيْرَ مُوَلٍّ دُبُراً وَ لَا مُحْدِثٍ شَكّاً ",
          "اللَّهُمَّ وَ أَعُوذُ بِكَ عِنْدَ ذَلِكَ مِنَ الْجُبْنِ عِنْدَ مَوَارِدِ الْأَهْوَالِ وَ مِنَ الضَّعْفِ عِنْدَ مُسَاوَرَةِ الْأَبْطَالِ وَ مِنَ الذَّنْبِ الْمُحْبِطِ لِلْأَعْمَالِ فَأَحْجُمَ مَنْ شَكَّ أَوْ مَضَى بِغَيْرِ يَقِينٍ فَيَكُونَ سَعْيِي فِي تَبَابٍ وَ عَمَلِي غَيْرَ مَقْبُولٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ja’far Bin Muhammad, from Ibn Al Qaddah, from his father Maymoun, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that whenever Amir Al-Momineen<sup>asws</sup> intended the fighting, said: ‘This is the supplication, ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> Notified a Way from Your<sup>azwj</sup> Ways (and) Made Your<sup>azwj</sup> Pleasure to be therein, and Authorised Your<sup>azwj</sup> Guardians<sup>asws</sup> upon it, and Made it the noblest of Your<sup>azwj</sup> Ways with Rewards in Your<sup>azwj</sup> Presence, and most honourable of it as an ending, and the most Beloved it to You<sup>azwj</sup> as a pathway.",
            "Then You<sup>azwj</sup> Bought from the Believers, their own souls and their wealth with the (price) that the Paradise would be for them, fighting in the Way of Allah<sup>azwj</sup>. So they are killing and are being killed based on a promise upon You<sup>azwj</sup> which is true. Therefore, Make me to be from the ones whom You<sup>azwj</sup> have Bought their own selves, then they fulfil the pledge which You<sup>azwj</sup> Pledged upon it, not being from the breaker and contradictors of an oath, nor Replace me with a replacement.",
            "But, (Make me) as a responder to Your<sup>azwj</sup> Love, and to be closer to You<sup>azwj</sup> by it. Therefore, Make it a conclusion of my deeds, and Make therein an annihilation of my lifetime, and Grace me in it and by it, a martyrdom for You<sup>azwj</sup>, and Obligate to me by it, the Pleasure from you, and Delete from me, the errors by it.",
            "And Make me to be among the living Sustained ones (martyred) by the hands of the enemies and the disobedient ones, beneath the flag of the Truth and a flag of the Guidance, going to their (Believers) for their help, forward without turning backwards, nor encountering any doubts.",
            "O Allah<sup>azwj</sup>! And I seek Refuge with You<sup>azwj</sup> during that, from the cowardice during the turning conditions, and from the weakness during encounters with the champions (of the enemies), and from the sins which frustrate the deeds so I can refrain from doubts, or die without conviction in my quest in ruination, and my deeds would be without Acceptance’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Sahl ibn Ziyad from Ja’far ibn Muhammad from ibn al-Qaddah from his father, Maymun who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that whenever Amir al-Mu’minin wanted to take part in a war he would recite the following supplications: “O Lord, You have made a way of Your ways public and have placed Your pleasure in it and have called Your friends toward it. You have made it the most noble of Your ways to You in matters of reward, the most honorable before You in matters of endings and of the most beloved ones before You in terms of its direction. In this way You then purchased the souls of the believing people and their properties in exchange for paradise. They are the believers who fight in the way of Allah, they eliminate the enemy and themselves are killed because of the promise of Allah which is the true promise. O Lord, make me one of those from whom You have purchased in this way their souls and then they made their promise and agreement with You to come true. Make me of those who do not flee from the battle and those who do not disregard their promise, and do not replace me with others. Make me of those who do so in response to Your love and to become closer thereby to You. O Lord, make it to be the end of my deed, and turning of my life to its end. O Lord, grant me therein for Your sake with it a battle, which will make me deserve Your pleasure and remove thereby my sins. O Lord, place me among the living (martyrs) who receive sustenance from You because of the acts of the enemy who is disobedient. Make it happen under the banner of truth and the flag of guidance when advancing to support them (the believers) without turning my back to the enemy, or move around with doubts. O Lord, I seek Your protection in the battle against cowardice in frightening conditions and against weakness during the exchanges with champions. I seek Your protection against the sins that turn good deeds invalid, the sins that feed doubts or make me advance without certainty after which my efforts end in destruction and my deeds become unacceptable.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:20",
  "kind": "verse_list"
}