{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 25"
        },
        "path": "/books/al-kafi:5:1:25",
        "titles": {
          "ar": "باب فَضْلِ الشَّهَادَةِ ",
          "en": "Chapter 25 – Merits of the Martyrdom"
        }
      }
    ],
    "index": 1205,
    "local_index": 25,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 26"
        },
        "path": "/books/al-kafi:5:1:26",
        "titles": {
          "ar": "باب ",
          "en": "Chapter 26 – A Chapter"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:5:1:24",
        "titles": {
          "ar": "باب مَنْ قُتِلَ دُونَ مَظْلِمَتِهِ ",
          "en": "Chapter 24 – The one who is killed confronting his oppression"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:25",
    "titles": {
      "ar": "باب فَضْلِ الشَّهَادَةِ ",
      "en": "Chapter 25 – Merits of the Martyrdom"
    },
    "verse_count": 7,
    "verse_start_index": 8254,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/395)"
        ],
        "index": 8255,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:25:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ سَعْدِ بْنِ سَعْدٍ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ قَوْلِ أَمِيرِ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ وَ اللَّهِ لَأَلْفُ ضَرْبَةٍ بِالسَّيْفِ أَهْوَنُ مِنْ مَوْتٍ عَلَى فِرَاشٍ قَالَ فِي سَبِيلِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Sa’ad Bin Sa’ad, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the words of Amir Al-Momineen<sup>asws</sup>: ‘By Allah<sup>azwj</sup>! A thousand strikes with the sword is easier than death upon a bed’. He<sup>asws</sup> said: ‘In the Way of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Khalid from Sa‘d ibn Sa‘d who has said the following: “I once asked abu al-Hassan al-Rida, ‘Alayhi al-Salam, about the words of Amir al-Mu’minin, ‘Alayhi al-Salam, ‘I swear by Allah, enduring one thousand strikes by the sword is easier than dying on the bed.’ He (the Imam) said, ‘It means ‘for the cause of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/395)"
        ],
        "index": 8256,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:25:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَوْقَ كُلِّ ذِي بِرٍّ بِرٌّ حَتَّى يُقْتَلَ فِي سَبِيلِ اللَّهِ فَإِذَا قُتِلَ فِي سَبِيلِ اللَّهِ فَلَيْسَ فَوْقَهُ بِرٌّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Above every one with righteousness is a (more meritorious) righteous deed, until he is killed in the Way of Allah<sup>azwj</sup>. So when he is killed in the Way of Allah<sup>azwj</sup>, so there is no righteous deed above it’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Over every virtuous deed is a virtuous deed until one is murdered for the cause of Allah; thereafter there is no other virtuous deed which can stand over and before it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/396)"
        ],
        "index": 8257,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:25:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَنْبَسَةَ عَنْ أَبِي حَمْزَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِنَّ عَلِيَّ بْنَ الْحُسَيْنِ ( عليه السلام ) كَانَ يَقُولُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا مِنْ قَطْرَةٍ أَحَبَّ إِلَى اللَّهِ عَزَّ وَ جَلَّ مِنْ قَطْرَةِ دَمٍ فِي سَبِيلِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Anbasa, from Abu Hamza who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> was saying: ‘Rasool-Allah<sup>saww</sup> said: ‘There is none from a drop more beloved to Allah<sup>azwj</sup> Mighty and Majestic than a drop of blood in ‘سَبِيلِ اللَّهِ’ the Way of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from ‘Uthaman ibn ‘Isa from ‘Anbasah from abu Hamzah who has said the following: “I heard abu Ja‘far, ‘Alayhi al-Salam, saying, ‘Ali ibn al-Husayn, ‘Alayhi al-Salam, would say, “The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘No drop is more beloved to Allah than the drop of blood spilled in the way of Allah.””” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/396)"
        ],
        "index": 8258,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:25:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ رَفَعَهُ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) خَطَبَ يَوْمَ الْجَمَلِ فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنِّي أَتَيْتُ هَؤُلَاءِ الْقَوْمَ وَ دَعَوْتُهُمْ وَ احْتَجَجْتُ عَلَيْهِمْ فَدَعَوْنِي إِلَى أَنْ أَصْبِرَ لِلْجِلَادِ وَ أَبْرُزَ لِلطِّعَانِ فَلِأُمِّهِمُ الْهَبَلُ وَ قَدْ كُنْتُ وَ مَا أُهَدَّدُ بِالْحَرْبِ وَ لَا أُرْهَبُ بِالضَّرْبِ أَنْصَفَ الْقَارَةَ مَنْ رَامَاهَا ",
          "فَلِغَيْرِي فَلْيُبْرِقُوا وَ لْيُرْعِدُوا فَأَنَا أَبُو الْحَسَنِ الَّذِي فَلَلْتُ حَدَّهُمْ وَ فَرَّقْتُ جَمَاعَتَهُمْ وَ بِذَلِكَ الْقَلْبِ أَلْقَى عَدُوِّي وَ أَنَا عَلَى مَا وَعَدَنِي رَبِّي مِنَ النَّصْرِ وَ التَّأْيِيدِ وَ الظَّفَرِ وَ إِنِّي لَعَلَى يَقِينٍ مِنْ رَبِّي وَ غَيْرِ شُبْهَةٍ مِنْ أَمْرِي",
          "أَيُّهَا النَّاسُ إِنَّ الْمَوْتَ لَا يَفُوتُهُ الْمُقِيمُ وَ لَا يُعْجِزُهُ الْهَارِبُ لَيْسَ عَنِ الْمَوْتِ مَحِيصٌ وَ مَنْ لَمْ يَمُتْ يُقْتَلْ وَ إِنَّ أَفْضَلَ الْمَوْتِ الْقَتْلُ وَ الَّذِي نَفْسِي بِيَدِهِ لَأَلْفُ ضَرْبَةٍ بِالسَّيْفِ أَهْوَنُ عَلَيَّ مِنْ مِيتَةٍ عَلَى فِرَاشٍ ",
          "وَا عَجَبَا لِطَلْحَةَ أَلَّبَ النَّاسَ عَلَى ابْنِ عَفَّانَ حَتَّى إِذَا قُتِلَ أَعْطَانِي صَفْقَتَهُ بِيَمِينِهِ طَائِعاً ثُمَّ نَكَثَ بَيْعَتِي اللَّهُمَّ خُذْهُ وَ لَا تُمْهِلْهُ ",
          "وَ إِنَّ الزُّبَيْرَ نَكَثَ بَيْعَتِي وَ قَطَعَ رَحِمِي وَ ظَاهَرَ عَلَيَّ عَدُوِّي فَاكْفِنِيهِ الْيَوْمَ بِمَا شِئْتَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Mahboub, raising it, that, ",
            "‘Amir Al-Momineen<sup>asws</sup> addressed on the Day of (the battle of) the Camel, so he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, then said: ‘O you people! I<sup>asws</sup> went over to these people and invited them, an argued against them, so they invited me<sup>asws</sup> that I<sup>asws</sup> should wait for the executioner and duelling of the spears. So for their mothers is the bereavement (mourning), and I<sup>asws</sup> have never been, and am not, threatened by the war, nor am I<sup>asws</sup> scared by the beating with the strikes of the one who throws it.",
            "So it is for others that they should be (scaring like) lightning and thundering, for I<sup>asws</sup> am Abu Al-Hassan<sup>asws</sup> who blunted their sharp ends and dispersed their groups, and with that I<sup>asws</sup> face my<sup>asws</sup> enemy. And I<sup>asws</sup> am upon what my<sup>asws</sup> Lord<sup>azwj</sup> Promised me<sup>asws</sup>, from the victory, and the support and the triumph. And I<sup>asws</sup> am upon conviction from my<sup>asws</sup> Lord<sup>azwj</sup> and without any doubt from my<sup>asws</sup> affairs. ",
            "O you people! The death does not miss the ones staying at home, nor does it frustrate the warrior. There is nothing unavoidable about the death, and the one who does not die is killed, and that the most superior of the deaths is being killed. By the One<sup>azwj</sup> in Whose Hand is my<sup>asws</sup> soul, a thousand strikes by the sword is easier upon me<sup>asws</sup> than death upon a bed. ",
            "And how strange of Talha, being the closest of the people to the son of Affan (Usman), until when he was killed, he came to me clasping with his right hand willingly (pledging allegiance). Then he broke his allegiance to me<sup>asws</sup>. O Allah<sup>azwj</sup>! Seize him and give him no respite!",
            "And Al-Zubayr broke his allegiance with me<sup>asws</sup>, and cut off relationship with me<sup>asws</sup>, and backed my<sup>asws</sup> enemies against me, therefore Enshroud him today with whatever You<sup>azwj</sup> so Desire to!’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn Mahbub who in a marfu’ has said the following: “On the day of Jamal Amir al-Mu’minin, ‘Alayhi al-Salam, delivered a speech. He praised and glorified Allah; then said, ‘O people, I came to these people, called them and presented proof in support of my truthfulness. They then called me for a contest. Their mothers will certainly weep for them; I never was and will not feel threatened by war or intimidated by the pounding of swords. No one is able to defeat experience. They should act thunderously with lightening to frighten people other than me. I am abu al-Hassan. I am the one who turned their sharp edge very blunt and dispersed their large united group. With this kind of heart I am ready to face my enemy. I have firm belief in the promise of my Lord of victory, His support and triumph. I have firm belief in my Lord. I have not even a shred of doubt about the truthfulness of my cause. O people, death does not miss people living at home and those who run away cannot defeat it. There is no escape from death. If one does not die he is killed and the best death is being killed. I swear by the One in whose hand is my soul, enduring a thousand poundings of the sword is easier for me than dying in bed. It is very strange of Talhah who was very close to the son of ‘Affan, until the time he was killed soon thereafter he extended his right hand to me to pledge allegiance voluntarily; then he disregarded his pledging allegiance with me. O Allah, clinch him without respite. Zubayr also disregarded his pledge of allegiance with me as well as the good relationship that was his obligation to maintain with me as relatives. He supported my enemies, therefore, O Lord, suffice me against him as You deem proper.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/397)"
        ],
        "index": 8259,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:25:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قِيلَ لِلنَّبِيِّ ( صلى الله عليه وآله ) مَا بَالُ الشَّهِيدِ لَا يُفْتَنُ فِي قَبْرِهِ فَقَالَ [النَّبِيُّ] ( صلى الله عليه وآله ) كَفَى بِالْبَارِقَةِ فَوْقَ رَأْسِهِ فِتْنَةً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘It was said to the Prophet<sup>saww</sup>, ‘What is the matter the martyr does not get Tried in his grave?’ So the Prophet<sup>saww</sup> said: ‘The sword above his head sufficed as a Trial’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that someone asked the Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, ‘Why is a martyr not examined and tried in his grave?’ The Holy Prophet, replied, ‘It is because the sword over his head is a sufficient examinition and trial.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/397)"
        ],
        "index": 8260,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:25:6",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ إِسْحَاقَ عَنْ سَعْدَانَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَنْ قُتِلَ فِي سَبِيلِ اللَّهِ لَمْ يُعَرِّفْهُ اللَّهُ شَيْئاً مِنْ سَيِّئَاتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Is’haq, from Sa’dan, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The one who is killed in the Way of Allah<sup>azwj</sup>, Allah<sup>azwj</sup> would not Introduce him to anything from his sins’."
          ],
          "en.sarwar": [
            "6. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Ishaq from Sa‘dan from abu Basir who has said the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘If one is killed for the cause of Allah, Allah will not show him any of his sins.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق على الظاهر   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/397)"
        ],
        "index": 8261,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:25:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ سُوَيْدٍ الْقَلَانِسِيِّ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيُّ الْجِهَادِ أَفْضَلُ قَالَ مَنْ عُقِرَ جَوَادُهُ وَ أُهَرِيقَ دَمُهُ فِي سَبِيلِ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Al Noman, from Suweyd Al qalanasy, from Sama’at, from Abu Baseer who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Which Jihad is the most superior?’ He<sup>asws</sup> said: ‘The one whose horse is hamstrung and his blood is shed in the Way of Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Muhammad ibn Al-Husayn from Ali ibn al-Nu’man from Suwayd al-Qalanisiy from Sama‘ah from abu Basir who has said the following: “I asked abu ‘Abd Allah, ‘Alayhi al-Salam, ‘Which kind of Jihad is more virtuous?’ He (the Imam) replied, ‘It is the one in which the legs of one’s horse are cut off and his own blood is spilled for the cause of Allah.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:25",
  "kind": "verse_list"
}