{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 28"
        },
        "path": "/books/al-kafi:5:1:28",
        "titles": {
          "ar": "باب الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ",
          "en": "Chapter 28 – The Enjoining of the good and the Forbidding of the evil"
        }
      }
    ],
    "index": 1208,
    "local_index": 28,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 29"
        },
        "path": "/books/al-kafi:5:1:29",
        "titles": {
          "ar": "باب إِنْكَارِ الْمُنْكَرِ بِالْقَلْبِ ",
          "en": "Chapter 29 – Denying the evil by the heart"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 27"
        },
        "path": "/books/al-kafi:5:1:27",
        "titles": {
          "ar": "باب ",
          "en": "Chapter 27 – A Chapter"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:28",
    "titles": {
      "ar": "باب الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ",
      "en": "Chapter 28 – The Enjoining of the good and the Forbidding of the evil"
    },
    "verse_count": 15,
    "verse_start_index": 8265,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/399)"
        ],
        "index": 8266,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/50",
              "text": "بَعْضِ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4004",
              "text": "بِشْرِ بْنِ عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4005",
              "text": "أَبِي عِصْمَةَ قَاضِي مَرْوَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/185",
              "text": "جَابِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/8",
              "text": "أَبِي جَعْفَرٍ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ بِشْرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عِصْمَةَ قَاضِي مَرْوَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:1",
        "relations": {
          "Mentions": [
            "/books/quran:42:42"
          ]
        },
        "text": [
          " يَكُونُ فِي آخِرِ الزَّمَانِ قَوْمٌ يُتَّبَعُ فِيهِمْ قَوْمٌ مُرَاءُونَ يَتَقَرَّءُونَ وَ يَتَنَسَّكُونَ حُدَثَاءُ سُفَهَاءُ لَا يُوجِبُونَ أَمْراً بِمَعْرُوفٍ وَ لَا نَهْياً عَنْ مُنْكَرٍ إِلَّا إِذَا أَمِنُوا الضَّرَرَ يَطْلُبُونَ لِأَنْفُسِهِمُ الرُّخَصَ وَ الْمَعَاذِيرَ يَتَّبِعُونَ زَلَّاتِ الْعُلَمَاءِ وَ فَسَادَ عَمَلِهِمْ يُقْبِلُونَ عَلَى الصَّلَاةِ وَ الصِّيَامِ وَ مَا لَا يَكْلِمُهُمْ فِي نَفْسٍ وَ لَا مَالٍ وَ لَوْ أَضَرَّتِ الصَّلَاةُ بِسَائِرِ مَا يَعْمَلُونَ بِأَمْوَالِهِمْ وَ أَبْدَانِهِمْ لَرَفَضُوهَا كَمَا رَفَضُوا أَسْمَى الْفَرَائِضِ وَ أَشْرَفَهَا",
          "إِنَّ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ فَرِيضَةٌ عَظِيمَةٌ بِهَا تُقَامُ الْفَرَائِضُ هُنَالِكَ يَتِمُّ غَضَبُ اللَّهِ عَزَّ وَ جَلَّ عَلَيْهِمْ فَيَعُمُّهُمْ بِعِقَابِهِ فَيُهْلَكُ الْأَبْرَارُ فِي دَارِ الْفُجَّارِ وَ الصِّغَارُ فِي دَارِ الْكِبَارِ",
          "إِنَّ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ سَبِيلُ الْأَنْبِيَاءِ وَ مِنْهَاجُ الصُّلَحَاءِ فَرِيضَةٌ عَظِيمَةٌ بِهَا تُقَامُ الْفَرَائِضُ وَ تَأْمَنُ الْمَذَاهِبُ وَ تَحِلُّ الْمَكَاسِبُ وَ تُرَدُّ الْمَظَالِمُ وَ تُعْمَرُ الْأَرْضُ وَ يُنْتَصَفُ مِنَ الْأَعْدَاءِ وَ يَسْتَقِيمُ الْأَمْرُ",
          "فَأَنْكِرُوا بِقُلُوبِكُمْ وَ الْفِظُوا بِأَلْسِنَتِكُمْ وَ صُكُّوا بِهَا جِبَاهَهُمْ وَ لَا تَخَافُوا فِي اللَّهِ لَوْمَةَ لَائِمٍ فَإِنِ اتَّعَظُوا وَ إِلَى الْحَقِّ رَجَعُوا فَلَا سَبِيلَ عَلَيْهِمْ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَ يَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ أُولئِكَ لَهُمْ عَذابٌ أَلِيمٌ",
          "هُنَالِكَ فَجَاهِدُوهُمْ بِأَبْدَانِكُمْ وَ أَبْغِضُوهُمْ بِقُلُوبِكُمْ غَيْرَ طَالِبِينَ سُلْطَاناً وَ لَا بَاغِينَ مَالًا وَ لَا مُرِيدِينَ بِظُلْمٍ ظَفَراً حَتَّى يَفِيئُوا إِلَى أَمْرِ اللَّهِ وَ يَمْضُوا عَلَى طَاعَتِهِ ",
          "قَالَ وَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى شُعَيْبٍ النَّبِيِّ ( صلوات الله عليه ) أَنِّي مُعَذِّبٌ مِنْ قَوْمِكَ مِائَةَ أَلْفٍ أَرْبَعِينَ أَلْفاً مِنْ شِرَارِهِمْ وَ سِتِّينَ أَلْفاً مِنْ خِيَارِهِمْ فَقَالَ ( عليه السلام ) يَا رَبِّ هَؤُلَاءِ الْأَشْرَارُ فَمَا بَالُ الْأَخْيَارِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ دَاهَنُوا أَهْلَ الْمَعَاصِي وَ لَمْ يَغْضَبُوا لِغَضَبِي ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of our companions, from Bashr Bin Abdullah, from Abu Isama, a judge of Merv, from Jabir, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘There would transpire at the end of the times, a people who would be followed by a show-off people. They would be reciting and performing the rituals of juvenile fools, not considering it an Obligation the enjoining of the good and the forbidding of the evil, except when they are safe from harm. They would be seeking for themselves the permission and the excuse of following the blunders of the scholars and their corrupt deeds. They would be coming upon the Prayer and the Fasts and whatever does not affect their lives or their wealth. And if the Prayer were to harm the rest of what they are doing with their wealth and their bodies, they would reject it just as they would reject the loftiest of the Obligations and its nobility.",
            "The enjoining of the good, and the forbidding of the evil is a great Obligation by which the (other) Obligation stand. Over there the Anger of Allah<sup>azwj</sup> Mighty and Majestic is Completed upon them and they are engulfed by His<sup>azwj</sup> Punishment. So the righteous ones end up being destroyed in the house of the immoral ones, and the young ones in the house of the older ones. ",
            "The enjoining of the good and the forbidding of the evil is a way of the Prophets<sup>as</sup> and a manifesto of the righteous ones. (It is) a great Obligation by which the (other) Obligations stand, and the Doctrines are secured, and the earnings are made to be Permissible, and the injustices are repelled, and the lands are developed, and the justice is achieved from the enemies, and the matters are straightened. ",
            "Therefore, deny the evil by your hearts, and the words of your tongues, and slap it in the foreheads, and do not fear with regards to Allah<sup>azwj</sup> an accusation of the accuser. So, if they heed advice (fine), and to the Truth they should return. So there is no way against them, but rather <span class=\"ibTxt\"><a href=\"/#/books/quran:42#h42\">[42:42]</a> The way (to blame) is only against those who oppress men and rebel without the right, these shall have a painful Punishment</span>.",
            "So that is where you should be fighting them with your bodies, and hating them by your hearts without seeking any authority, nor gaining wealth, nor wanting a triumph by injustice, until they are loyal to the Command of Allah<sup>azwj</sup> and go upon His<sup>azwj</sup> obedience’. ",
            "He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> Mighty and Majestic Revealed unto The Prophet Shuayb<sup>as</sup>: “I<sup>azwj</sup> will be Punishing, from your<sup>as</sup> people, one hundred thousand, forty thousand being from their evil ones and sixty thousand being from their good ones”. So he<sup>as</sup> said: ‘O Lord<sup>azwj</sup>!’ They (the forty thousand) are evil, but what is the matter with the good ones?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “They sweet-talked the people of the disobedience and were not angry due to My<sup>azwj</sup> Anger”’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from certain persons of our people from Bashir ibn ‘Abd Allah from abu ‘Ismah Qadiy of Marve from Jabir who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘During the last era of time there will be a people who are followed by a certain people who just show off. They worship and perform rituals as youngsters with insufficient understanding and dimwittedness. They do not deem asking others to do good and prohibiting evil as necessary unless doing so is totally harmless for them. They seek for themselves permissions and excuses and follow the mistakes of the scholars and their invalid deeds. They go for Salat (prayer) and fasting and things that do not affect them in matters of their lives and properties. If performing Salat (prayer) would affect their other activities about their properties and persons, they disregard it just as they disregard highest quality obligations and the noblest ones. ‘Asking people to do good and to prohibit them from committing evil is a great obligation by which responsibilities are fulfilled. In such case the anger of Allah, the most Majestic, the most Glorious, becomes complete upon them. His torment encompasses them; thus, even virtuous people are destroyed in the location of the sinful ones and the children along with the grown-up ones. Asking others to do good and prohibiting them from evil is the path of the prophets and the method of the virtuous ones. It is a great responsibility with which obligations are fulfilled and religions are protected, earnings become lawful, usurped properties are retrieved, the land is developed, justice is made available for even the enemies and the matters are kept upright. You must then dislike evil in your hearts, reject it with your tongues, strike it against their faces and do not fear anyone’s blames in matters about Allah. If people committing evil accepted your advice and returned to the truth then that is fine. “Blameworthy are those who do injustice to people and rebel in the land without any truthful cause, for them there will be painful punishment.” (42: 42) Against such people you must fight with your person and hate them in your hearts without wanting domination, gaining properties or victory through injustice. You must continue until they come to the command of Allah and to obey Him.’ He (the Imam) said, ‘Allah, the most Majestic, the most Glorious, sent revelation to prophet Shu’ayb ‘Alayhi al-Salam, “I want to punish one hundred thousand people from your followers, forty thousand of the evil doers and sixty thousand of the good ones.” He asked, “O Lord, these are the evil doers but what about the good ones?” Allah, the most Majestic, the most Glorious, sent him revelation that said, “They stopped giving the good advice to the evil doers and did not become angry because of My becoming angry with them.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/401)"
        ],
        "index": 8267,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1325",
              "text": "جَمَاعَةٍ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمَاعَةٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:2",
        "text": [
          " مَا قُدِّسَتْ أُمَّةٌ لَمْ يُؤْخَذْ لِضَعِيفِهَا مِنْ قَوِيِّهَا بِحَقِّهِ غَيْرَ مُتَعْتَعٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from a group of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A community cannot be sanctified, the one which does not take for its weak ones, its rights from its strong ones without stirring’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from a group of our people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A people, who does not take back the rights of the weak ones among them from the stronger ones, without causing any harm, can never become holy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/401)"
        ],
        "index": 8268,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4006",
              "text": "مُحَمَّدِ بْنِ عُمَرَ بْنِ عَرَفَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَرَفَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:3",
        "text": [
          " سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ لَتَأْمُرُنَّ بِالْمَعْرُوفِ وَ لَتَنْهُنَّ عَنِ الْمُنْكَرِ أَوْ لَيُسْتَعْمَلَنَّ عَلَيْكُمْ شِرَارُكُمْ فَيَدْعُو خِيَارُكُمْ فَلَا يُسْتَجَابُ لَهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa, from Muhammad Bin Umar Bin Arafa who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘You should be enjoining with the good and should be forbidding from the evil, or else your evil ones would become office bearers upon you, then your good ones would be supplicating, but it would not be Answered for them’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from Muhammad ibn ‘Isa from Muhammad ibn ‘Umar ibn ‘Arafah who has said the following: “I heard abu al-Hassan, ‘Alayhi al-Salam, saying, ‘You must ask (command) others to do good and prohibit them to commit evil, otherwise, the evil ones among you will be made your rulers and then the virtuous ones among you pray and their prayers will not be answered.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/401)"
        ],
        "index": 8269,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/259",
              "text": "عَلِيِّ بْنِ النُّعْمَانِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/260",
              "text": "عَبْدِ اللَّهِ بْنِ مُسْكَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/183",
              "text": "دَاوُدَ بْنِ فَرْقَدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/261",
              "text": "أَبِي سَعِيدٍ الزُّهْرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/297",
              "text": "أَبِي جَعْفَرٍ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي سَعِيدٍ الزُّهْرِيِّ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:4",
        "text": [
          " وَيْلٌ لِقَوْمٍ  لَا يَدِينُونَ اللَّهَ بِالْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, form Ahmad Bin Muhammad, from Ali Bin Al Noman, from Abdullah Bin Muskan, from Dawood Bin Farqad, from Abu Saeed Al Zuhry, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> having said: ‘Woe be unto a people who are not considering it to be a Religion of Allah<sup>azwj</sup>, the enjoining of the good and the forbidding from the evil’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Nu’man from ‘Abd Allah ibn Muskan from Dawud ibn Farqad from abu Sa‘id al-Zuhriy from abu Ja’far and abu ‘Abd Allah, ‘Alayhi al-Salam, who have said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Woe upon a people who do not consider asking others to do good and prohibiting them from evil as part of the religion of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/401)"
        ],
        "index": 8270,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1681",
              "text": "وَ بِإِسْنَادِهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِإِسْنَادِهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:5",
        "text": [
          " قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) بِئْسَ الْقَوْمُ قَوْمٌ يَعِيبُونَ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The most evil of the people are the people who are faulting the enjoining of the good and the forbidding of the evil’."
          ],
          "en.sarwar": [
            "5. The narrator of the previous Hadith through his chain of narrators has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘A people, who consider asking others to do good and prohibiting them from evil, a blame-worthy act, are a terribly evil people.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/401)"
        ],
        "index": 8271,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/10",
              "text": "سَهْلِ بْنِ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/256",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/280",
              "text": "عَاصِمِ بْنِ حُمَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/112",
              "text": "أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2166",
              "text": "يَحْيَى بْنِ عُقَيْلٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4007",
              "text": "حَسَنٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ عَنْ حَسَنٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:6",
        "text": [
          " خَطَبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ قَالَ أَمَّا بَعْدُ فَإِنَّهُ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ حَيْثُ مَا عَمِلُوا مِنَ الْمَعَاصِي وَ لَمْ يَنْهَهُمُ الرَّبَّانِيُّونَ وَ الْأَحْبَارُ عَنْ ذَلِكَ وَ إِنَّهُمْ لَمَّا تَمَادَوْا فِي الْمَعَاصِي وَ لَمْ يَنْهَهُمُ الرَّبَّانِيُّونَ وَ الْأَحْبَارُ عَنْ ذَلِكَ نَزَلَتْ بِهِمُ الْعُقُوبَاتُ",
          "فَأْمُرُوا بِالْمَعْرُوفِ وَ انْهَوْا عَنِ الْمُنْكَرِ وَ اعْلَمُوا أَنَّ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ لَمْ يُقَرِّبَا أَجَلًا وَ لَمْ يَقْطَعَا رِزْقاً إِنَّ الْأَمْرَ يَنْزِلُ مِنَ السَّمَاءِ إِلَى الْأَرْضِ كَقَطْرِ الْمَطَرِ إِلَى كُلِّ نَفْسٍ بِمَا قَدَّرَ اللَّهُ لَهَا مِنْ زِيَادَةٍ أَوْ نُقْصَانٍ فَإِنْ أَصَابَ أَحَدَكُمْ مُصِيبَةٌ فِي أَهْلٍ أَوْ مَالٍ أَوْ نَفْسٍ وَ رَأَى عِنْدَ أَخِيهِ غَفِيرَةً فِي أَهْلٍ أَوْ مَالٍ أَوْ نَفْسٍ فَلَا تَكُونَنَّ عَلَيْهِ فِتْنَةً فَإِنَّ الْمَرْءَ الْمُسْلِمَ لَبَرِي‏ءٌ مِنَ الْخِيَانَةِ مَا لَمْ يَغْشَ دَنَاءَةً تَظْهَرُ",
          "فَيَخْشَعُ لَهَا إِذَا ذُكِرَتْ وَ يُغْرَى بِهَا لِئَامُ النَّاسِ كَانَ كَالْفَالِجِ الْيَاسِرِ الَّذِي يَنْتَظِرُ أَوَّلَ فَوْزَةٍ مِنْ قِدَاحِهِ تُوجِبُ لَهُ الْمَغْنَمَ وَ يُدْفَعُ بِهَا عَنْهُ الْمَغْرَمُ وَ كَذَلِكَ الْمَرْءُ الْمُسْلِمُ الْبَرِي‏ءُ مِنَ الْخِيَانَةِ يَنْتَظِرُ مِنَ اللَّهِ تَعَالَى إِحْدَى الْحُسْنَيَيْنِ إِمَّا دَاعِيَ اللَّهِ فَمَا عِنْدَ اللَّهِ خَيْرٌ لَهُ وَ إِمَّا رِزْقَ اللَّهِ ",
          "فَإِذَا هُوَ ذُو أَهْلٍ وَ مَالٍ وَ مَعَهُ دِينُهُ وَ حَسَبُهُ إِنَّ الْمَالَ وَ الْبَنِينَ حَرْثُ الدُّنْيَا وَ الْعَمَلَ الصَّالِحَ حَرْثُ الْآخِرَةِ وَ قَدْ يَجْمَعُهُمَا اللَّهُ لِأَقْوَامٍ ",
          "فَاحْذَرُوا مِنَ اللَّهِ مَا حَذَّرَكُمْ مِنْ نَفْسِهِ وَ اخْشَوْهُ خَشْيَةً لَيْسَتْ بِتَعْذِيرٍ  وَ اعْمَلُوا فِي غَيْرِ رِيَاءٍ وَ لَا سُمْعَةٍ فَإِنَّهُ مَنْ يَعْمَلْ لِغَيْرِ اللَّهِ يَكِلْهُ اللَّهُ إِلَى مَنْ عَمِلَ لَهُ ",
          "نَسْأَلُ اللَّهَ مَنَازِلَ الشُّهَدَاءِ وَ مُعَايَشَةَ السُّعَدَاءِ وَ مُرَافَقَةَ الْأَنْبِيَاءِ"
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Abdul Rahman Bin Abu Najran, from Aasim Bin Humeyd, from Abu Hamza, from Yahya Bin Uqeyl, from Hasan who said, ",
            "‘Amir Al-Momineen<sup>asws</sup> addressed, so he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, and said: ‘After this, so he rather they were destroyed, the ones who was before you where whatever they did from the acts of disobedience and their Rabbis and the Monks did not forbid them from that. And whenever they deliberated in their acts of disobedience and their Rabbis and the Monks did not forbid them from that, the Punishments descended unto them.",
            "Therefore, enjoin with the good and forbid from the evil, and know that the enjoining of the good and the forbidding from the evil does not bring the term (death) any nearer and does not cut off the livelihood. The Command descends from the sky to the earth like drops of the rain to every soul with whatever Allah<sup>azwj</sup> has Measured for it, from an increase or a decrease. So, if one of your were to be hit by a difficulty in a family, or wealth, or self, and sees in the presence of his brother abundance of family, or wealth, or self, so a tribulation (distress) should not occur upon him, for the Muslim person is away from the treachery so long he does not let his lowliness to become apparent.",
            "So he should fear it when it is mentioned, and be tempted by it like the generality of the people, like the one paralysed on the left who is awaiting the first success from his sitting back so that the war booty would be Obligated upon him, and the fines would be repulsed from him (too long) . And similar to that is the Muslim person who is free from the treachery, awaiting from Allah<sup>azwj</sup> the Exalted, one of the two good deeds, either he supplicates to Allah<sup>azwj</sup> for whatever is better for him in the Presence of Allah<sup>azwj</sup>, or Allah<sup>azwj</sup> Grants him sustenance.",
            "So when he is with a family, and wealth, and with him is his religion, and it is sufficient for him that the wealth and the sons are a plantation of the world, and the righteous deeds are a plantation of the Hereafter, and Allah<sup>azwj</sup> has Gathered both of these for a people. ",
            "Therefore, be cautious from Allah<sup>azwj</sup> whatever He<sup>azwj</sup> has Cautioned from Himself<sup>azwj</sup>, and fear Him<sup>azwj</sup> with a fear which is not with a pretext, and work without showing off nor to be heard (become famous), for the one who acts for other than Allah<sup>azwj</sup>, He<sup>azwj</sup> Allocates him to the one who he has acted for. ",
            "We<sup>asws</sup> hereby ask Allah<sup>azwj</sup> for the status of the martyrs, and the happy living, and friendship of the Prophets<sup>as</sup>’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from ‘Abd al-Rahman ibn abu Najran from ‘Asim ibn Humayd from abu Hamzah from Yahya ibn ‘Aqil from Hassan who has said the following: “Amir al-Mu’minin, ‘Alayhi al-Salam, once delivered a sermon. He first praised and glorified Allah. Thereafter he said, ‘People before were destroyed because when they committed sins the Rabbis and Monks did not stop them from committing such deeds. When they continued committing disobedience and the Rabbis and Monks did not prohibit them, torments descended upon them. They then commanded others to do good and prohibited to commit evil, they found this did not make the time of their death closer and nor did it reduce their sustenance. The command comes from the sky to the earth, like the drops of rain, to everyone as Allah measures for it (soul) in matters of increase and reduction. If one of you is affected in matters of family, property or life and finds all such things with his brother in abundance, it should not become matters of trial for him. A Muslim is free of all forms of treachery as long as acts of lowliness do not take place from him (through his hands), about the mention of which he remains fearful. On the other hand, people of lowly manners remain interested in lowly acts like a gambler who waits for the hit by the first winning arrow which brings him gains and fends off from him the loss. The Muslim who is free of treachery expects from Allah, the most High, one of the two forms of gains. It is either the call from Allah, thus what is with Allah for him is better, or sustenance from Allah. So he has a family, property with religion and valuable status. Wealth and children are worldly plantations but good deeds are plantations for the next life. At certain times Allah places both of them together for certain people. You must remain anxious about your relationship with Allah just as He has told you to be anxious about such relationship. You must worry, without shortcomings and about your status before Him. You must act without showing off and seeking popularity; those who act for something other than Allah, He leaves him to the one for whom he has acted. I pray to Allah to lead us to the destinations of the martyrs, living of those who have gained salvation and the company of the prophets (of Allah).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/404)"
        ],
        "index": 8272,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1373",
              "text": "الْحُسَيْنِ بْنِ إِسْحَاقَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/976",
              "text": "عَلِيِّ بْنِ مَهْزِيَارَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/98",
              "text": "النَّضْرِ بْنِ سُوَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/55",
              "text": "دُرُسْتَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/96",
              "text": "بَعْضِ أَصْحَابِهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحُسَيْنِ بْنِ إِسْحَاقَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ دُرُسْتَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:7",
        "text": [
          " إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ مَلَكَيْنِ إِلَى أَهْلِ مَدِينَةٍ لِيَقْلِبَاهَا عَلَى أَهْلِهَا فَلَمَّا انْتَهَيَا إِلَى الْمَدِينَةِ وَجَدَا رَجُلًا يَدْعُو اللَّهَ وَ يَتَضَرَّعُ فَقَالَ أَحَدُ الْمَلَكَيْنِ لِصَاحِبِهِ أَ مَا تَرَى هَذَا الدَّاعِيَ فَقَالَ قَدْ رَأَيْتُهُ وَ لَكِنْ أَمْضِي لِمَا أَمَرَ بِهِ رَبِّي فَقَالَ لَا وَ لَكِنْ لَا أُحْدِثُ شَيْئاً حَتَّى أُرَاجِعَ رَبِّي ",
          "فَعَادَ إِلَى اللَّهِ تَبَارَكَ وَ تَعَالَى فَقَالَ يَا رَبِّ إِنِّي انْتَهَيْتُ إِلَى الْمَدِينَةِ فَوَجَدْتُ عَبْدَكَ فُلَاناً يَدْعُوكَ وَ يَتَضَرَّعُ إِلَيْكَ فَقَالَ امْضِ بِمَا أَمَرْتُكَ بِهِ فَإِنَّ ذَا رَجُلٌ لَمْ يَتَمَعَّرْ وَجْهُهُ غَيْظاً لِي قَطُّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Al Husayn Bin Iss’haq, from Ali Bin Mahziyar, from Al Nazar Bin Suweyd, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Sent two Angels to the people of a city in order to overthrow its inhabitants. So when they both ended up to the city, they found a man supplicating to Allah<sup>azwj</sup>, and he was desperate. So one of the Angels said to his companion: ‘But, do you not see this supplicator?’ So he said: ‘I have seen him, but I must fulfil what my Lord<sup>azwj</sup> has Commanded me with. So he said, ‘No, but I will not do anything until I refer it to Allah<sup>azwj</sup>’. ",
            "So he returned to Allah<sup>azwj</sup> Bless and high, so he said: ‘O Lord<sup>azwj</sup>! I ended up to the city, so I found Your<sup>azwj</sup> so and so servant supplicating to You<sup>azwj</sup> and he was desperate to You<sup>azwj</sup>’. So He<sup>azwj</sup> Said: “Fulfil with what I<sup>azwj</sup> have Commanded you with, for that man did not even frown his face in anger for Me<sup>azwj</sup> at all”’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from Ali ibn Asbat from abu Ishaq al-Khurasaniy from certain persons of his people who has said the following: “He (the Imam) has said, ‘Allah, the most Majestic, the most Glorious, sent revelation to Dawud (David), ‘Alayhi al-Salam, that said, ‘I forgave your sins and placed the blame thereof on the Israelites.’ He (Dawud) asked, ‘How can that be, O Lord? You do not do injustice. He (the Lord) replied, ‘Because they did not express disappointment for what you had done.’” (This Hadith is addressed to Dawud but it is meant to apply to others. It is one of the cases where the popular expression, ‘I address you O slave-girl, but you, the neighbor woman listen.’) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/404)"
        ],
        "index": 8273,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/1565",
              "text": "حُمَيْدُ بْنُ زِيَادٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2502",
              "text": "الْحُسَيْنِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/322",
              "text": "سَمَاعَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/219",
              "text": "غَيْرِ وَاحِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/271",
              "text": "أَبَانِ بْنِ عُثْمَانَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/149",
              "text": "عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2094",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا مِنْ خَثْعَمٍ جَاءَ"
            },
            {
              "kind": "plain",
              "text": " إِلَى "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4008",
              "text": "رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَا أَفْضَلُ الْإِسْلَامِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ عَنْ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا مِنْ خَثْعَمٍ جَاءَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَا أَفْضَلُ الْإِسْلَامِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:8",
        "text": [
          " الْإِيمَانُ بِاللَّهِ قَالَ ثُمَّ مَا ذَا قَالَ ثُمَّ صِلَةُ الرَّحِمِ قَالَ ثُمَّ مَا ذَا قَالَ الْأَمْرُ بِالْمَعْرُوفِ وَ النَّهْيُ عَنِ الْمُنْكَرِ",
          "قَالَ فَقَالَ الرَّجُلُ فَأَيُّ الْأَعْمَالِ أَبْغَضُ إِلَى اللَّهِ قَالَ الشِّرْكُ بِاللَّهِ قَالَ ثُمَّ مَا ذَا قَالَ قَطِيعَةُ الرَّحِمِ قَالَ ثُمَّ مَا ذَا قَالَ الْأَمْرُ بِالْمُنْكَرِ وَ النَّهْيُ عَنِ الْمَعْرُوفِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Husayn Bin Muhammad, from Sama’at, from someone else, from Aban Bin Usman, from Abdullah Bin Muhammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘A man from Khas’am came over to Rasool-Allah<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! Inform me, what is the most superior of Al-Islam?’ He<sup>saww</sup> said: ‘Belief in Allah<sup>azwj</sup>’. He said, ‘Then, what?’ He<sup>saww</sup> said: ‘Maintaining relationships’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘The enjoining of the good and the forbidding of the evil’. ",
            "He (the narrator) said, ‘So the man said, ‘So which is the most Hateful of the deeds to Allah<sup>azwj</sup>?’ He<sup>saww</sup> said: ‘The association (Shirk) with Allah<sup>azwj</sup>’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘Cutting-off of relationships’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘The enjoining of the evil and the forbidding from the good’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from al-Husayn ibn Ishaq from Ali ibn Mahziyar from al-Nadr ibn al-Suwayd from Durust ibn abu Mansur from certain individuals of his people who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the Most Majestic, the Most Glorious, once sent two angels to a city to turn it upside down on the people therein. When they came to the city, they found a man praying to Allah with great concern and desperation. One of the angels then asked the other, ‘Do you see this person praying ? 5 The other angel replied, ‘Yes, I have seen him but I must obey the command which my Lord has issued . 5 The other angel said, ‘No, I will not do anything before asking my Lord about it . 5 This angel returned to the presence of Allah, the most Blessed, the most High, and said, ‘O Lord, I went to the city and found there one of Your servants, so and so praying to You and asking You in desperation and in a helpless condition . 5 The Lord said, ‘You must do as you were commanded to do; he is a man who has never even frowned for My sake as an expression of his anger against evil deeds . 55 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/405)"
        ],
        "index": 8274,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4009",
              "text": "أَبِي عَبْدِ اللَّهِ ع"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ع قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:9",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَمَرَنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ نَلْقَى أَهْلَ الْمَعَاصِي بِوُجُوهٍ مُكْفَهِرَّةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> ordered us all what we should meet the people of disobedience with an unfriendly face’."
          ],
          "en.sarwar": [
            "9. Humayd ibn Ziyad has narrated from Al-Husayn ibn Muhammad from Sama‘ah from more than narrators from Aban ibn ‘Uthaman from ‘Abd Allah ibn Muhammad who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once a man from Khath‘am came to the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and asked, ‘O Messenger of Allah, what is most virtuous in al-Islam ? 5 He (the Messenger of Allah) replied, ‘It is belief in Allah . 5 He then asked, ‘What is most virtuous thereafter ? 5 He, the Messenger of Allah, replied, ‘It is maintaining good relations with relatives . 5 He asked, ‘What is most important thereafter ? 5 He, the Messenger of Allah, replied, ‘It is asking others to do what is good and prohibit them to commit evil . 5 The narrator has said that the man then asked, ‘What is the most hated act in the sight of Allah ? 5 He, the Messenger of Allah, replied, ‘It is considering things as partners of Allah . 5 He then asked, ‘What is most hated thereafter ? 5 He, the Messenger of Allah, replied, ‘It is cutting off good relations with relatives . 5 He then asked, ‘What is most hated thereafter ? 5 He, the Messenger of Allah, replied, ‘It is asking people to commit evil and prohibit them from doing good . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/405)"
        ],
        "index": 8275,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2489",
              "text": "يَعْقُوبَ بْنِ يَزِيدَ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ رَفَعَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:10",
        "text": [
          " قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْأَمْرُ بِالْمَعْرُوفِ وَ النَّهْيُ عَنِ الْمُنْكَرِ خَلْقَانِ مِنْ خَلْقِ اللَّهِ فَمَنْ نَصَرَهُمَا أَعَزَّهُ اللَّهُ وَ مَنْ خَذَلَهُمَا خَذَلَهُ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Yaqoub Bin Yazeed, raising it, said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘The enjoining of the good, and the forbidding from the evil are two creatures from the creatures of Allah<sup>azwj</sup>. So the one who helps these two, Allah<sup>azwj</sup> would Honour him, and the one who abandons these two, Allah<sup>azwj</sup> would Abandon him’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Amir al-Mu 5 minin, ‘Alayhi al-Salam, has said, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, had commanded us to meet sinful people with a frowning face . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرفوع   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/405)"
        ],
        "index": 8276,
        "local_index": 11,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/254",
              "text": "مُحَمَّدِ بْنِ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1817",
              "text": "غِيَاثِ بْنِ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:11",
        "text": [
          " كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا مَرَّ بِجَمَاعَةٍ يَخْتَصِمُونَ لَا يَجُوزُهُمْ حَتَّى يَقُولَ ثَلَاثاً اتَّقُوا اللَّهَ يَرْفَعُ بِهَا صَوْتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Yahya, from Giyas Bin Ibrahim who said, ",
            "‘Whenever Abu Abdullah<sup>asws</sup> used to pass by a group quarrelling, he<sup>asws</sup> would not pass by them until he<sup>asws</sup> was saying three times: ‘Fear Allah<sup>azwj</sup>!’ - raising his<sup>asws</sup> voice with it’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Ahmad ibn ‘Abd Allah from Ya’qub ibn Yazid in a Marfu’ manner has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Asking people to do good and prohibiting them from committing evil are two creatures of the creatures of Allah. Those who support them, Allah gives them respect and Allah betrays those who betray these two creatures of Him . 55 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/405)"
        ],
        "index": 8277,
        "local_index": 12,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/29",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1819",
              "text": "مُحَمَّدِ بْنِ عَرَفَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَرَفَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:12",
        "text": [
          " سَمِعْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام) يَقُولُ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ إِذَا أُمَّتِي تَوَاكَلَتِ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ فَلْيَأْذَنُوا بِوِقَاعٍ مِنَ اللَّهِ تَعَالَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa, from Muhammad Bin Arafa who said, ",
            "‘I heard Abu Al-Hassan Al-Reza<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> was saying: ‘When my<sup>saww</sup> community leave it upon each other for the enjoining of the good and the forbidding of the evil, so they would be authorising afflictions from Allah<sup>azwj</sup> the Exalted’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Muhammad ibn Yahya from Ghiyath ibn Ibrahim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, when seeing a quarrelling group of people would not pass by without always saying three times loudly, ‘You must maintain piety in the presence of Allah . 555 "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/406)"
        ],
        "index": 8278,
        "local_index": 13,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/291",
              "text": "هَارُونَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/292",
              "text": "مَسْعَدَةَ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:13",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) كَيْفَ بِكُمْ إِذَا فَسَدَتْ نِسَاؤُكُمْ وَ فَسَقَ شَبَابُكُمْ وَ لَمْ تَأْمُرُوا بِالْمَعْرُوفِ وَ لَمْ تَنْهَوْا عَنِ الْمُنْكَرِ فَقِيلَ لَهُ وَ يَكُونُ ذَلِكَ يَا رَسُولَ اللَّهِ فَقَالَ نَعَمْ وَ شَرٌّ مِنْ ذَلِكَ ",
          "كَيْفَ بِكُمْ إِذَا أَمَرْتُمْ بِالْمُنْكَرِ وَ نَهَيْتُمْ عَنِ الْمَعْرُوفِ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ وَ يَكُونُ ذَلِكَ قَالَ نَعَمْ وَ شَرٌّ مِنْ ذَلِكَ ",
          "كَيْفَ بِكُمْ إِذَا رَأَيْتُمُ الْمَعْرُوفَ مُنْكَراً وَ الْمُنْكَرَ مَعْرُوفاً"
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘How would it be with you all when your women become spoilt and your youth become immoral, and you would not be enjoining with the good and would not be forbidding the evil?’ So it was said to him<sup>saww</sup>, ‘And would that happen, O Rasool-Allah<sup>saww</sup>?’ So he<sup>saww</sup> said: ‘Yes, and more evil than that.  ",
            "How would it be with you all when you would be enjoining with the evil and forbidding from the good?’ So it was said, ‘O Rasool-Allah<sup>saww</sup>! And would that happen?’ He<sup>saww</sup> said: ‘Yes, and more evil than that.",
            "How would it be with you all when you see the good as an evil and the evil as a good?’"
          ],
          "en.sarwar": [
            "13. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from Muhammad ibn ‘Isa from Muhammad ibn ‘Arafah who has said the following: “I heard abu al-Hassan, al-Rida, ‘Alayhi al-Salam, saying, ‘The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, would say, “When my followers postpone asking others to do good and prohibit them from committing evil they, in so doing, allow affliction to befall upon them from Allah.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/406)"
        ],
        "index": 8279,
        "local_index": 14,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/158",
              "text": "وَ بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:14",
        "text": [
          " قَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَيُبْغِضُ الْمُؤْمِنَ الضَّعِيفَ الَّذِي لَا دِينَ لَهُ فَقِيلَ لَهُ وَ مَا الْمُؤْمِنُ الَّذِي لَا دِينَ لَهُ قَالَ الَّذِي لَا يَنْهَى عَنِ الْمُنْكَرِ "
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, said, ‘The Prophet<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic is Hateful to the weak Believer who does not have a religion for him’. So it was said to him<sup>saww</sup>, ‘And what is the believer who does not have a Religion for him?’ He<sup>saww</sup> said: ‘The one who does not forbid from the evil’."
          ],
          "en.sarwar": [
            "14. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas’adah ibn Sadaqah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘The Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, “What will you do when your women will become corrupt, your young people sinful and you will not ask others to do good and prohibit them to commit evil?” They asked, “Will such things happen, O Messenger of Allah?” He, the Messenger of Allah, replied, “Yes, even worse than this will happen. What will you do when you ask others to commit evil and prohibit them from doing good?” It then was asked, “Will such things happen, O Messenger of Allah?” He, the Messenger of Allah, replied, “Yes, even worse than this will happen. What will you do when you see good things as bad and evil things as good?”’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/406)"
        ],
        "index": 8280,
        "local_index": 15,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/158",
              "text": "وَ بِهَذَا الْإِسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ بِهَذَا الْإِسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:28:15",
        "relations": {
          "Mentions": [
            "/books/quran:3:104",
            "/books/quran:16:120",
            "/books/quran:7:159"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ سُئِلَ عَنِ الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ أَ وَاجِبٌ هُوَ عَلَى الْأُمَّةِ جَمِيعاً فَقَالَ لَا فَقِيلَ لَهُ وَ لِمَ قَالَ إِنَّمَا هُوَ عَلَى الْقَوِيِّ الْمُطَاعِ الْعَالِمِ بِالْمَعْرُوفِ مِنَ الْمُنْكَرِ لَا عَلَى الضَّعِيفِ الَّذِي لَا يَهْتَدِي سَبِيلًا إِلَى أَيٍّ مِنْ أَيٍّ يَقُولُ مِنَ الْحَقِّ إِلَى الْبَاطِلِ وَ الدَّلِيلُ عَلَى ذَلِكَ كِتَابُ اللَّهِ عَزَّ وَ جَلَّ قَوْلُهُ وَ لْتَكُنْ مِنْكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَ يَأْمُرُونَ بِالْمَعْرُوفِ وَ يَنْهَوْنَ عَنِ الْمُنْكَرِ",
          "فَهَذَا خَاصٌّ غَيْرُ عَامٍّ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ مِنْ قَوْمِ مُوسى أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَ بِهِ يَعْدِلُونَ وَ لَمْ يَقُلْ عَلَى أُمَّةِ مُوسَى وَ لَا عَلَى كُلِّ قَوْمِهِ وَ هُمْ يَوْمَئِذٍ أُمَمٌ مُخْتَلِفَةٌ وَ الْأُمَّةُ وَاحِدَةٌ فَصَاعِداً كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ إِبْراهِيمَ كانَ أُمَّةً قانِتاً لِلَّهِ يَقُولُ مُطِيعاً لِلَّهِ عَزَّ وَ جَلَّ وَ لَيْسَ عَلَى مَنْ يَعْلَمُ ذَلِكَ فِي هَذِهِ الْهُدْنَةِ مِنْ حَرَجٍ إِذَا كَانَ لَا قُوَّةَ لَهُ وَ لَا عُذْرَ وَ لَا طَاعَةَ ",
          "قَالَ مَسْعَدَةُ وَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ سُئِلَ عَنِ الْحَدِيثِ الَّذِي جَاءَ عَنِ النَّبِيِّ ( صلى الله عليه وآله ) إِنَّ أَفْضَلَ الْجِهَادِ كَلِمَةُ عَدْلٍ عِنْدَ إِمَامٍ جَائِرٍ مَا مَعْنَاهُ قَالَ هَذَا عَلَى أَنْ يَأْمُرَهُ بَعْدَ مَعْرِفَتِهِ وَ هُوَ مَعَ ذَلِكَ يُقْبَلُ مِنْهُ وَ إِلَّا فَلَا."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying, and he<sup>asws</sup> was asked about the enjoining with the good and the forbidding from the evil, ‘Is it an Obligation upon the entire community?’ So he<sup>asws</sup> said: ‘No’. So it was said to him<sup>asws</sup>, ‘And why not?’ He<sup>asws</sup> said: ‘But rather it is upon the strongly followed one, knowledgeable of the good and the evil, not upon the weak who is not guided of the way, to which from which, he should be speaking from the truth to the falsehood, and the evidence upon that is the Book of Allah<sup>azwj</sup> Mighty and Majestic, His<sup>azwj</sup> Words <span class=\"ibTxt\"><a href=\"/#/books/quran:3#h104\">[3:104]</a> And from among you there should be a community inviting to the better and enjoin what is good and forbid the evil</span>. ",
            "Thus, these are particular ones and not the general public, just as Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:7#h159\">[7:159]</a> And of Musa's people was a party who guided (people) with the truth, and thereby did they do justice</span>. And He<sup>azwj</sup> did not Say: “And it is upon the people of Musa<sup>as</sup>”, nor “Upon every one of his<sup>as</sup> people”, and in those days they were different communities, and the community can be one (man), just as Allah<sup>azwj</sup> Mighty and Majestic Said that <span class=\"ibTxt\"><a href=\"/#/books/quran:16#h120\">[16:120]</a> Surely Ibrahim was a community, obedient to Allah</span>. He<sup>azwj</sup> is Saying: “Obedient to Allah<sup>azwj</sup> Mighty and Majestic”. And it is not upon the one who knows that in these times of truce from danger, when there was not strength for him, nor an excuse, and do obedience’.",
            "Mas’ada (the narrator) said, ",
            "‘And I heard Abu Abdullah<sup>asws</sup> saying, and he<sup>asws</sup> was asked about the Hadeeth which came from the Prophet<sup>saww</sup> that: ‘The most superior of the Jihad is the just word in the presence of an unjust leader’, what is its meaning?’ He<sup>asws</sup> said: ‘This is upon a stipulation that he would enjoin him (with the good) after having recognised it (himself), and along with that, he (the leader) would accept it from him, or else, so no!’."
          ],
          "en.sarwar": [
            "15. The narrator of the previous Hadith through his chain of narrators has said the following: “The Holy Prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Allah, the most Majestic, the most Glorious, dislikes a believing, weak person who has no religion.’ It then was asked, ‘Who is a believing weak person who has no religion?’ He, the Holy Prophet, said, ‘It is he who does not prohibit committing evil.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/406)"
        ],
        "narrator_chain": {
          "parts": [
            {
              "kind": "plain",
              "text": "16- "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4010",
              "text": "وَبِهَذَا الإسْنَادِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "16- وَبِهَذَا الإسْنَادِ قَالَ"
        },
        "part_type": "Hadith",
        "relations": {
          "Mentions": [
            "/books/quran:3:104",
            "/books/quran:7:158",
            "/books/quran:16:119"
          ]
        },
        "text": [
          " سَمِعْتُ أَبَا عَبْدِ اللهِ (عَلَيْهِ السَّلام) يَقُولُ وَسُئِلَ عَنِ الأمْرِ بِالْمَعْرُوفِ وَالنَّهْيِ عَنِ الْمُنْكَرِ أَوَاجِبٌ هُوَ عَلَى الأمَّةِ جَمِيعاً فَقَالَ لا فَقِيلَ لَهُ وَلِمَ قَالَ إِنَّمَا هُوَ عَلَى الْقَوِيِّ الْمُطَاعِ الْعَالِمِ بِالْمَعْرُوفِ مِنَ الْمُنْكَرِ لا عَلَى الضَّعِيفِ الَّذِي لا يَهْتَدِي سَبِيلا إِلَى أَيٍّ مِنْ أَيٍّ يَقُولُ مِنَ الْحَقِّ إِلَى الْبَاطِلِ وَالدَّلِيلُ عَلَى ذَلِكَ كِتَابُ اللهِ عَزَّ وَجَلَّ قَوْلُهُ وَلْتَكُنْ مِنْكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَيَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنْكَرِ فَهَذَا خَاصٌّ غَيْرُ عَامٍّ كَمَا قَالَ اللهُ عَزَّ وَجَلَّ وَمِنْ قَوْمِ مُوسى‏ أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَبِهِ يَعْدِلُونَ وَلَمْ يَقُلْ عَلَى أُمَّةِ مُوسَى وَلا عَلَى كُلِّ قَوْمِهِ وَهُمْ يَوْمَئِذٍ أُمَمٌ مُخْتَلِفَةٌ وَالأمَّةُ وَاحِدَةٌ فَصَاعِداً كَمَا قَالَ اللهُ عَزَّ وَجَلَّ إِنَّ إِبْراهِيمَ كانَ أُمَّةً قانِتاً للهِ يَقُولُ مُطِيعاً للهِ عَزَّ وَجَلَّ وَلَيْسَ عَلَى مَنْ يَعْلَمُ ذَلِكَ فِي هَذِهِ الْهُدْنَةِ مِنْ حَرَجٍ إِذَا كَانَ لا قُوَّةَ لَهُ وَلا عُذْرَ وَلا طَاعَةَ قَالَ مَسْعَدَةُ وَسَمِعْتُ أَبَا عَبْدِ اللهِ (عَلَيْهِ السَّلام) يَقُولُ وَسُئِلَ عَنِ الْحَدِيثِ الَّذِي جَاءَ عَنِ النَّبِيِّ (صَلَّى اللهُ عَلَيْهِ وَآلِه) إِنَّ أَفْضَلَ الْجِهَادِ كَلِمَةُ عَدْلٍ عِنْدَ إِمَامٍ جَائِرٍ مَا مَعْنَاهُ قَالَ هَذَا عَلَى أَنْ يَأْمُرَهُ بَعْدَ مَعْرِفَتِهِ وَهُوَ مَعَ ذَلِكَ يُقْبَلُ مِنْهُ وَإِلا فَلا. "
        ],
        "translations": {
          "en.sarwar": [
            "16. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas’adah ibn Sadaqah who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, when asked about commanding others to do what is obligatory and prohibiting them from committing what is evil, whether this is obligatory upon the whole nation, saying, ‘No, it is not obligatory up on the whole nation.’ He (the Imam) was asked, ‘Why it is not obligatory upon the whole nation?’ He (the Imam) replied, ‘It is obligatory only upon the strong ones who are obeyed and who know well what is obligatory and what is evil. It is not obligatory upon the weak ones who are not able to find the way - about what the facts are - to the truth and falsehood. The proof thereof is in the book of Allah, the Most Majestic, the Most Glorious, “Among you there must live a nation who must command to do what is obligatory and prohibit committing evil.” <a href=\"/#/books/quran:3#h104\">[3:104]</a> This verse is of particular sense as opposed to a general sense, just as in the following verse: “Of the people of Moses, there is a nation who guide to the truth and with truth they issue judgments.” <a href=\"/#/books/quran:7#h158\">[7:158]</a> Allah has not said, “It is obligatory upon the nation of Moses or upon his whole nation who in those days formed many nations.” Nation is also used to mean one person as well as to mean more than one person. Allah, the Most Majestic, the Most Glorious, has said, “Ibrahim was a nation (person) very obedient to Allah.” <a href=\"/#/books/quran:16#h119\">[16:119]</a> In peace-time when one is not able to enforce such commands it does not apply to his case. . . .’” “Mas’adah has said, ‘I heard abu ‘Abd Allah, ‘Alayhi al-Salam, when asked about a Hadith narrated from the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, that said, “The best Jihad is saying a word of justice before an unjust Imam.” He (the Imam) said, “This is true when commanding to do good, he knows well about what is ‘good’ as well as knowing that he will accept his command in the matter, otherwise, it (asking to do good) is not obligatory.’”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:28",
  "kind": "verse_list"
}