{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:5:1", "titles": {"ar": "كِتَابُ الْجِهَادِ", "en": "THE BOOK OF JIHAD"}}, {"indexed_titles": {"en": "Chapter 28"}, "path": "/books/al-kafi:5:1:28", "titles": {"ar": "باب الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ", "en": "Chapter 28 – The Enjoining of the good and the Forbidding of the evil"}}], "index": 1207, "local_index": 28, "part_type": "Chapter", "path": "/books/al-kafi:5:1:28", "titles": {"ar": "باب الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ", "en": "Chapter 28 – The Enjoining of the good and the Forbidding of the evil"}, "verse_count": 15, "verse_start_index": 8265, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8266, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ بِشْرِ بْنِ عَبْدِ اللَّهِ عَنْ أَبِي عِصْمَةَ قَاضِي مَرْوَ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ يَكُونُ فِي آخِرِ الزَّمَانِ قَوْمٌ يُتَّبَعُ فِيهِمْ قَوْمٌ مُرَاءُونَ يَتَقَرَّءُونَ وَ يَتَنَسَّكُونَ حُدَثَاءُ سُفَهَاءُ لَا يُوجِبُونَ أَمْراً بِمَعْرُوفٍ وَ لَا نَهْياً عَنْ مُنْكَرٍ إِلَّا إِذَا أَمِنُوا الضَّرَرَ يَطْلُبُونَ لِأَنْفُسِهِمُ الرُّخَصَ وَ الْمَعَاذِيرَ يَتَّبِعُونَ زَلَّاتِ الْعُلَمَاءِ وَ فَسَادَ عَمَلِهِمْ يُقْبِلُونَ عَلَى الصَّلَاةِ وَ الصِّيَامِ وَ مَا لَا يَكْلِمُهُمْ فِي نَفْسٍ وَ لَا مَالٍ وَ لَوْ أَضَرَّتِ الصَّلَاةُ بِسَائِرِ مَا يَعْمَلُونَ بِأَمْوَالِهِمْ وَ أَبْدَانِهِمْ لَرَفَضُوهَا كَمَا رَفَضُوا أَسْمَى الْفَرَائِضِ وَ أَشْرَفَهَا", "إِنَّ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ فَرِيضَةٌ عَظِيمَةٌ بِهَا تُقَامُ الْفَرَائِضُ هُنَالِكَ يَتِمُّ غَضَبُ اللَّهِ عَزَّ وَ جَلَّ عَلَيْهِمْ فَيَعُمُّهُمْ بِعِقَابِهِ فَيُهْلَكُ الْأَبْرَارُ فِي دَارِ الْفُجَّارِ وَ الصِّغَارُ فِي دَارِ الْكِبَارِ", "إِنَّ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ سَبِيلُ الْأَنْبِيَاءِ وَ مِنْهَاجُ الصُّلَحَاءِ فَرِيضَةٌ عَظِيمَةٌ بِهَا تُقَامُ الْفَرَائِضُ وَ تَأْمَنُ الْمَذَاهِبُ وَ تَحِلُّ الْمَكَاسِبُ وَ تُرَدُّ الْمَظَالِمُ وَ تُعْمَرُ الْأَرْضُ وَ يُنْتَصَفُ مِنَ الْأَعْدَاءِ وَ يَسْتَقِيمُ الْأَمْرُ", "فَأَنْكِرُوا بِقُلُوبِكُمْ وَ الْفِظُوا بِأَلْسِنَتِكُمْ وَ صُكُّوا بِهَا جِبَاهَهُمْ وَ لَا تَخَافُوا فِي اللَّهِ لَوْمَةَ لَائِمٍ فَإِنِ اتَّعَظُوا وَ إِلَى الْحَقِّ رَجَعُوا فَلَا سَبِيلَ عَلَيْهِمْ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَ يَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ أُولئِكَ لَهُمْ عَذابٌ أَلِيمٌ", "هُنَالِكَ فَجَاهِدُوهُمْ بِأَبْدَانِكُمْ وَ أَبْغِضُوهُمْ بِقُلُوبِكُمْ غَيْرَ طَالِبِينَ سُلْطَاناً وَ لَا بَاغِينَ مَالًا وَ لَا مُرِيدِينَ بِظُلْمٍ ظَفَراً حَتَّى يَفِيئُوا إِلَى أَمْرِ اللَّهِ وَ يَمْضُوا عَلَى طَاعَتِهِ ", "قَالَ وَ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى شُعَيْبٍ النَّبِيِّ ( صلوات الله عليه ) أَنِّي مُعَذِّبٌ مِنْ قَوْمِكَ مِائَةَ أَلْفٍ أَرْبَعِينَ أَلْفاً مِنْ شِرَارِهِمْ وَ سِتِّينَ أَلْفاً مِنْ خِيَارِهِمْ فَقَالَ ( عليه السلام ) يَا رَبِّ هَؤُلَاءِ الْأَشْرَارُ فَمَا بَالُ الْأَخْيَارِ فَأَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ دَاهَنُوا أَهْلَ الْمَعَاصِي وَ لَمْ يَغْضَبُوا لِغَضَبِي ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from one of our companions, from Bashr Bin Abdullah, from Abu Isama, a judge of Merv, from Jabir, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘There would transpire at the end of the times, a people who would be followed by a show-off people. They would be reciting and performing the rituals of juvenile fools, not considering it an Obligation the enjoining of the good and the forbidding of the evil, except when they are safe from harm. They would be seeking for themselves the permission and the excuse of following the blunders of the scholars and their corrupt deeds. They would be coming upon the Prayer and the Fasts and whatever does not affect their lives or their wealth. And if the Prayer were to harm the rest of what they are doing with their wealth and their bodies, they would reject it just as they would reject the loftiest of the Obligations and its nobility.", "The enjoining of the good, and the forbidding of the evil is a great Obligation by which the (other) Obligation stand. Over there the Anger of Allah<sup>azwj</sup> Mighty and Majestic is Completed upon them and they are engulfed by His<sup>azwj</sup> Punishment. So the righteous ones end up being destroyed in the house of the immoral ones, and the young ones in the house of the older ones. ", "The enjoining of the good and the forbidding of the evil is a way of the Prophets<sup>as</sup> and a manifesto of the righteous ones. (It is) a great Obligation by which the (other) Obligations stand, and the Doctrines are secured, and the earnings are made to be Permissible, and the injustices are repelled, and the lands are developed, and the justice is achieved from the enemies, and the matters are straightened. ", "Therefore, deny the evil by your hearts, and the words of your tongues, and slap it in the foreheads, and do not fear with regards to Allah<sup>azwj</sup> an accusation of the accuser. So, if they heed advice (fine), and to the Truth they should return. So there is no way against them, but rather <span class=\"ibTxt\">[42:42] The way (to blame) is only against those who oppress men and rebel without the right, these shall have a painful Punishment</span>.", "So that is where you should be fighting them with your bodies, and hating them by your hearts without seeking any authority, nor gaining wealth, nor wanting a triumph by injustice, until they are loyal to the Command of Allah<sup>azwj</sup> and go upon His<sup>azwj</sup> obedience’. ", "He<sup>asws</sup> said: ‘And Allah<sup>azwj</sup> Mighty and Majestic Revealed unto The Prophet Shuayb<sup>as</sup>: “I<sup>azwj</sup> will be Punishing, from your<sup>as</sup> people, one hundred thousand, forty thousand being from their evil ones and sixty thousand being from their good ones”. So he<sup>as</sup> said: ‘O Lord<sup>azwj</sup>!’ They (the forty thousand) are evil, but what is the matter with the good ones?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto him<sup>as</sup>: “They sweet-talked the people of the disobedience and were not angry due to My<sup>azwj</sup> Anger”’."]}}, {"index": 8267, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمَاعَةٍ مِنْ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَا قُدِّسَتْ أُمَّةٌ لَمْ يُؤْخَذْ لِضَعِيفِهَا مِنْ قَوِيِّهَا بِحَقِّهِ غَيْرَ مُتَعْتَعٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from a group of our companions, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A community cannot be sanctified, the one which does not take for its weak ones, its rights from its strong ones without stirring’."]}}, {"index": 8268, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عُمَرَ بْنِ عَرَفَةَ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ لَتَأْمُرُنَّ بِالْمَعْرُوفِ وَ لَتَنْهُنَّ عَنِ الْمُنْكَرِ أَوْ لَيُسْتَعْمَلَنَّ عَلَيْكُمْ شِرَارُكُمْ فَيَدْعُو خِيَارُكُمْ فَلَا يُسْتَجَابُ لَهُمْ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa, from Muhammad Bin Umar Bin Arafa who said, ", "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘You should be enjoining with the good and should be forbidding from the evil, or else your evil ones would become office bearers upon you, then your good ones would be supplicating, but it would not be Answered for them’."]}}, {"index": 8269, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:4", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ النُّعْمَانِ عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ دَاوُدَ بْنِ فَرْقَدٍ عَنْ أَبِي سَعِيدٍ الزُّهْرِيِّ عَنْ أَبِي جَعْفَرٍ وَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ وَيْلٌ لِقَوْمٍ  لَا يَدِينُونَ اللَّهَ بِالْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, form Ahmad Bin Muhammad, from Ali Bin Al Noman, from Abdullah Bin Muskan, from Dawood Bin Farqad, from Abu Saeed Al Zuhry, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup> having said: ‘Woe be unto a people who are not considering it to be a Religion of Allah<sup>azwj</sup>, the enjoining of the good and the forbidding from the evil’."]}}, {"index": 8270, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:5", "text": ["وَ بِإِسْنَادِهِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) بِئْسَ الْقَوْمُ قَوْمٌ يَعِيبُونَ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ ."], "translations": {"en.hubeali": ["And by his chain, said, ", "‘Abu Ja’far<sup>asws</sup> said: ‘The most evil of the people are the people who are faulting the enjoining of the good and the forbidding of the evil’."]}}, {"index": 8271, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:6", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ أَبِي حَمْزَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ عَنْ حَسَنٍ قَالَ خَطَبَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ وَ قَالَ أَمَّا بَعْدُ فَإِنَّهُ إِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ حَيْثُ مَا عَمِلُوا مِنَ الْمَعَاصِي وَ لَمْ يَنْهَهُمُ الرَّبَّانِيُّونَ وَ الْأَحْبَارُ عَنْ ذَلِكَ وَ إِنَّهُمْ لَمَّا تَمَادَوْا فِي الْمَعَاصِي وَ لَمْ يَنْهَهُمُ الرَّبَّانِيُّونَ وَ الْأَحْبَارُ عَنْ ذَلِكَ نَزَلَتْ بِهِمُ الْعُقُوبَاتُ", "فَأْمُرُوا بِالْمَعْرُوفِ وَ انْهَوْا عَنِ الْمُنْكَرِ وَ اعْلَمُوا أَنَّ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ لَمْ يُقَرِّبَا أَجَلًا وَ لَمْ يَقْطَعَا رِزْقاً إِنَّ الْأَمْرَ يَنْزِلُ مِنَ السَّمَاءِ إِلَى الْأَرْضِ كَقَطْرِ الْمَطَرِ إِلَى كُلِّ نَفْسٍ بِمَا قَدَّرَ اللَّهُ لَهَا مِنْ زِيَادَةٍ أَوْ نُقْصَانٍ فَإِنْ أَصَابَ أَحَدَكُمْ مُصِيبَةٌ فِي أَهْلٍ أَوْ مَالٍ أَوْ نَفْسٍ وَ رَأَى عِنْدَ أَخِيهِ غَفِيرَةً فِي أَهْلٍ أَوْ مَالٍ أَوْ نَفْسٍ فَلَا تَكُونَنَّ عَلَيْهِ فِتْنَةً فَإِنَّ الْمَرْءَ الْمُسْلِمَ لَبَرِي‏ءٌ مِنَ الْخِيَانَةِ مَا لَمْ يَغْشَ دَنَاءَةً تَظْهَرُ", "فَيَخْشَعُ لَهَا إِذَا ذُكِرَتْ وَ يُغْرَى بِهَا لِئَامُ النَّاسِ كَانَ كَالْفَالِجِ الْيَاسِرِ الَّذِي يَنْتَظِرُ أَوَّلَ فَوْزَةٍ مِنْ قِدَاحِهِ تُوجِبُ لَهُ الْمَغْنَمَ وَ يُدْفَعُ بِهَا عَنْهُ الْمَغْرَمُ وَ كَذَلِكَ الْمَرْءُ الْمُسْلِمُ الْبَرِي‏ءُ مِنَ الْخِيَانَةِ يَنْتَظِرُ مِنَ اللَّهِ تَعَالَى إِحْدَى الْحُسْنَيَيْنِ إِمَّا دَاعِيَ اللَّهِ فَمَا عِنْدَ اللَّهِ خَيْرٌ لَهُ وَ إِمَّا رِزْقَ اللَّهِ ", "فَإِذَا هُوَ ذُو أَهْلٍ وَ مَالٍ وَ مَعَهُ دِينُهُ وَ حَسَبُهُ إِنَّ الْمَالَ وَ الْبَنِينَ حَرْثُ الدُّنْيَا وَ الْعَمَلَ الصَّالِحَ حَرْثُ الْآخِرَةِ وَ قَدْ يَجْمَعُهُمَا اللَّهُ لِأَقْوَامٍ ", "فَاحْذَرُوا مِنَ اللَّهِ مَا حَذَّرَكُمْ مِنْ نَفْسِهِ وَ اخْشَوْهُ خَشْيَةً لَيْسَتْ بِتَعْذِيرٍ  وَ اعْمَلُوا فِي غَيْرِ رِيَاءٍ وَ لَا سُمْعَةٍ فَإِنَّهُ مَنْ يَعْمَلْ لِغَيْرِ اللَّهِ يَكِلْهُ اللَّهُ إِلَى مَنْ عَمِلَ لَهُ ", "نَسْأَلُ اللَّهَ مَنَازِلَ الشُّهَدَاءِ وَ مُعَايَشَةَ السُّعَدَاءِ وَ مُرَافَقَةَ الْأَنْبِيَاءِ"], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Abdul Rahman Bin Abu Najran, from Aasim Bin Humeyd, from Abu Hamza, from Yahya Bin Uqeyl, from Hasan who said, ", "‘Amir Al-Momineen<sup>asws</sup> addressed, so he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, and said: ‘After this, so he rather they were destroyed, the ones who was before you where whatever they did from the acts of disobedience and their Rabbis and the Monks did not forbid them from that. And whenever they deliberated in their acts of disobedience and their Rabbis and the Monks did not forbid them from that, the Punishments descended unto them.", "Therefore, enjoin with the good and forbid from the evil, and know that the enjoining of the good and the forbidding from the evil does not bring the term (death) any nearer and does not cut off the livelihood. The Command descends from the sky to the earth like drops of the rain to every soul with whatever Allah<sup>azwj</sup> has Measured for it, from an increase or a decrease. So, if one of your were to be hit by a difficulty in a family, or wealth, or self, and sees in the presence of his brother abundance of family, or wealth, or self, so a tribulation (distress) should not occur upon him, for the Muslim person is away from the treachery so long he does not let his lowliness to become apparent.", "So he should fear it when it is mentioned, and be tempted by it like the generality of the people, like the one paralysed on the left who is awaiting the first success from his sitting back so that the war booty would be Obligated upon him, and the fines would be repulsed from him (too long) . And similar to that is the Muslim person who is free from the treachery, awaiting from Allah<sup>azwj</sup> the Exalted, one of the two good deeds, either he supplicates to Allah<sup>azwj</sup> for whatever is better for him in the Presence of Allah<sup>azwj</sup>, or Allah<sup>azwj</sup> Grants him sustenance.", "So when he is with a family, and wealth, and with him is his religion, and it is sufficient for him that the wealth and the sons are a plantation of the world, and the righteous deeds are a plantation of the Hereafter, and Allah<sup>azwj</sup> has Gathered both of these for a people. ", "Therefore, be cautious from Allah<sup>azwj</sup> whatever He<sup>azwj</sup> has Cautioned from Himself<sup>azwj</sup>, and fear Him<sup>azwj</sup> with a fear which is not with a pretext, and work without showing off nor to be heard (become famous), for the one who acts for other than Allah<sup>azwj</sup>, He<sup>azwj</sup> Allocates him to the one who he has acted for. ", "We<sup>asws</sup> hereby ask Allah<sup>azwj</sup> for the status of the martyrs, and the happy living, and friendship of the Prophets<sup>as</sup>’."]}}, {"index": 8272, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنِ الْحُسَيْنِ بْنِ إِسْحَاقَ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنْ دُرُسْتَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ بَعَثَ مَلَكَيْنِ إِلَى أَهْلِ مَدِينَةٍ لِيَقْلِبَاهَا عَلَى أَهْلِهَا فَلَمَّا انْتَهَيَا إِلَى الْمَدِينَةِ وَجَدَا رَجُلًا يَدْعُو اللَّهَ وَ يَتَضَرَّعُ فَقَالَ أَحَدُ الْمَلَكَيْنِ لِصَاحِبِهِ أَ مَا تَرَى هَذَا الدَّاعِيَ فَقَالَ قَدْ رَأَيْتُهُ وَ لَكِنْ أَمْضِي لِمَا أَمَرَ بِهِ رَبِّي فَقَالَ لَا وَ لَكِنْ لَا أُحْدِثُ شَيْئاً حَتَّى أُرَاجِعَ رَبِّي ", "فَعَادَ إِلَى اللَّهِ تَبَارَكَ وَ تَعَالَى فَقَالَ يَا رَبِّ إِنِّي انْتَهَيْتُ إِلَى الْمَدِينَةِ فَوَجَدْتُ عَبْدَكَ فُلَاناً يَدْعُوكَ وَ يَتَضَرَّعُ إِلَيْكَ فَقَالَ امْضِ بِمَا أَمَرْتُكَ بِهِ فَإِنَّ ذَا رَجُلٌ لَمْ يَتَمَعَّرْ وَجْهُهُ غَيْظاً لِي قَطُّ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Al Husayn Bin Iss’haq, from Ali Bin Mahziyar, from Al Nazar Bin Suweyd, from one of his companions, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic Sent two Angels to the people of a city in order to overthrow its inhabitants. So when they both ended up to the city, they found a man supplicating to Allah<sup>azwj</sup>, and he was desperate. So one of the Angels said to his companion: ‘But, do you not see this supplicator?’ So he said: ‘I have seen him, but I must fulfil what my Lord<sup>azwj</sup> has Commanded me with. So he said, ‘No, but I will not do anything until I refer it to Allah<sup>azwj</sup>’. ", "So he returned to Allah<sup>azwj</sup> Bless and high, so he said: ‘O Lord<sup>azwj</sup>! I ended up to the city, so I found Your<sup>azwj</sup> so and so servant supplicating to You<sup>azwj</sup> and he was desperate to You<sup>azwj</sup>’. So He<sup>azwj</sup> Said: “Fulfil with what I<sup>azwj</sup> have Commanded you with, for that man did not even frown his face in anger for Me<sup>azwj</sup> at all”’."]}}, {"index": 8273, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:8", "text": ["حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ عَنْ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ رَجُلًا مِنْ خَثْعَمٍ جَاءَ إِلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ أَخْبِرْنِي مَا أَفْضَلُ الْإِسْلَامِ قَالَ الْإِيمَانُ بِاللَّهِ قَالَ ثُمَّ مَا ذَا قَالَ ثُمَّ صِلَةُ الرَّحِمِ قَالَ ثُمَّ مَا ذَا قَالَ الْأَمْرُ بِالْمَعْرُوفِ وَ النَّهْيُ عَنِ الْمُنْكَرِ", "قَالَ فَقَالَ الرَّجُلُ فَأَيُّ الْأَعْمَالِ أَبْغَضُ إِلَى اللَّهِ قَالَ الشِّرْكُ بِاللَّهِ قَالَ ثُمَّ مَا ذَا قَالَ قَطِيعَةُ الرَّحِمِ قَالَ ثُمَّ مَا ذَا قَالَ الْأَمْرُ بِالْمُنْكَرِ وَ النَّهْيُ عَنِ الْمَعْرُوفِ ."], "translations": {"en.hubeali": ["Humeyd Bin Ziyad, from Al Husayn Bin Muhammad, from Sama’at, from someone else, from Aban Bin Usman, from Abdullah Bin Muhammad, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>: ‘A man from Khas’am came over to Rasool-Allah<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! Inform me, what is the most superior of Al-Islam?’ He<sup>saww</sup> said: ‘Belief in Allah<sup>azwj</sup>’. He said, ‘Then, what?’ He<sup>saww</sup> said: ‘Maintaining relationships’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘The enjoining of the good and the forbidding of the evil’. ", "He (the narrator) said, ‘So the man said, ‘So which is the most Hateful of the deeds to Allah<sup>azwj</sup>?’ He<sup>saww</sup> said: ‘The association (Shirk) with Allah<sup>azwj</sup>’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘Cutting-off of relationships’. He said, ‘Then what?’ He<sup>saww</sup> said: ‘The enjoining of the evil and the forbidding from the good’."]}}, {"index": 8274, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:9", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ع قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَمَرَنَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ نَلْقَى أَهْلَ الْمَعَاصِي بِوُجُوهٍ مُكْفَهِرَّةٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> ordered us all what we should meet the people of disobedience with an unfriendly face’."]}}, {"index": 8275, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:10", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ رَفَعَهُ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الْأَمْرُ بِالْمَعْرُوفِ وَ النَّهْيُ عَنِ الْمُنْكَرِ خَلْقَانِ مِنْ خَلْقِ اللَّهِ فَمَنْ نَصَرَهُمَا أَعَزَّهُ اللَّهُ وَ مَنْ خَذَلَهُمَا خَذَلَهُ اللَّهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Abu Abdullah, from Yaqoub Bin Yazeed, raising it, said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘The enjoining of the good, and the forbidding from the evil are two creatures from the creatures of Allah<sup>azwj</sup>. So the one who helps these two, Allah<sup>azwj</sup> would Honour him, and the one who abandons these two, Allah<sup>azwj</sup> would Abandon him’."]}}, {"index": 8276, "local_index": 11, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:11", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ يَحْيَى عَنْ غِيَاثِ بْنِ إِبْرَاهِيمَ قَالَ كَانَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا مَرَّ بِجَمَاعَةٍ يَخْتَصِمُونَ لَا يَجُوزُهُمْ حَتَّى يَقُولَ ثَلَاثاً اتَّقُوا اللَّهَ يَرْفَعُ بِهَا صَوْتَهُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Yahya, from Giyas Bin Ibrahim who said, ", "‘Whenever Abu Abdullah<sup>asws</sup> used to pass by a group quarrelling, he<sup>asws</sup> would not pass by them until he<sup>asws</sup> was saying three times: ‘Fear Allah<sup>azwj</sup>!’ - raising his<sup>asws</sup> voice with it’."]}}, {"index": 8277, "local_index": 12, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:12", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عَرَفَةَ قَالَ سَمِعْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام) يَقُولُ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) يَقُولُ إِذَا أُمَّتِي تَوَاكَلَتِ الْأَمْرَ بِالْمَعْرُوفِ وَ النَّهْيَ عَنِ الْمُنْكَرِ فَلْيَأْذَنُوا بِوِقَاعٍ مِنَ اللَّهِ تَعَالَى ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Muhammad Bin Isa, from Muhammad Bin Arafa who said, ", "‘I heard Abu Al-Hassan Al-Reza<sup>asws</sup> saying: ‘Rasool-Allah<sup>saww</sup> was saying: ‘When my<sup>saww</sup> community leave it upon each other for the enjoining of the good and the forbidding of the evil, so they would be authorising afflictions from Allah<sup>azwj</sup> the Exalted’."]}}, {"index": 8278, "local_index": 13, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:13", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) كَيْفَ بِكُمْ إِذَا فَسَدَتْ نِسَاؤُكُمْ وَ فَسَقَ شَبَابُكُمْ وَ لَمْ تَأْمُرُوا بِالْمَعْرُوفِ وَ لَمْ تَنْهَوْا عَنِ الْمُنْكَرِ فَقِيلَ لَهُ وَ يَكُونُ ذَلِكَ يَا رَسُولَ اللَّهِ فَقَالَ نَعَمْ وَ شَرٌّ مِنْ ذَلِكَ ", "كَيْفَ بِكُمْ إِذَا أَمَرْتُمْ بِالْمُنْكَرِ وَ نَهَيْتُمْ عَنِ الْمَعْرُوفِ فَقِيلَ لَهُ يَا رَسُولَ اللَّهِ وَ يَكُونُ ذَلِكَ قَالَ نَعَمْ وَ شَرٌّ مِنْ ذَلِكَ ", "كَيْفَ بِكُمْ إِذَا رَأَيْتُمُ الْمَعْرُوفَ مُنْكَراً وَ الْمُنْكَرَ مَعْرُوفاً"], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Haroun Bin Muslim, from Mas’ada Bin Sadaqa, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Prophet<sup>saww</sup> said: ‘How would it be with you all when your women become spoilt and your youth become immoral, and you would not be enjoining with the good and would not be forbidding the evil?’ So it was said to him<sup>saww</sup>, ‘And would that happen, O Rasool-Allah<sup>saww</sup>?’ So he<sup>saww</sup> said: ‘Yes, and more evil than that.  ", "How would it be with you all when you would be enjoining with the evil and forbidding from the good?’ So it was said, ‘O Rasool-Allah<sup>saww</sup>! And would that happen?’ He<sup>saww</sup> said: ‘Yes, and more evil than that.", "How would it be with you all when you see the good as an evil and the evil as a good?’"]}}, {"index": 8279, "local_index": 14, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:14", "text": ["وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ النَّبِيُّ ( صلى الله عليه وآله ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ لَيُبْغِضُ الْمُؤْمِنَ الضَّعِيفَ الَّذِي لَا دِينَ لَهُ فَقِيلَ لَهُ وَ مَا الْمُؤْمِنُ الَّذِي لَا دِينَ لَهُ قَالَ الَّذِي لَا يَنْهَى عَنِ الْمُنْكَرِ "], "translations": {"en.hubeali": ["And by this chain, said, ‘The Prophet<sup>saww</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic is Hateful to the weak Believer who does not have a religion for him’. So it was said to him<sup>saww</sup>, ‘And what is the believer who does not have a Religion for him?’ He<sup>saww</sup> said: ‘The one who does not forbid from the evil’."]}}, {"index": 8280, "local_index": 15, "part_type": "Hadith", "path": "/books/al-kafi:5:1:28:15", "text": ["وَ بِهَذَا الْإِسْنَادِ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ سُئِلَ عَنِ الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ أَ وَاجِبٌ هُوَ عَلَى الْأُمَّةِ جَمِيعاً فَقَالَ لَا فَقِيلَ لَهُ وَ لِمَ قَالَ إِنَّمَا هُوَ عَلَى الْقَوِيِّ الْمُطَاعِ الْعَالِمِ بِالْمَعْرُوفِ مِنَ الْمُنْكَرِ لَا عَلَى الضَّعِيفِ الَّذِي لَا يَهْتَدِي سَبِيلًا إِلَى أَيٍّ مِنْ أَيٍّ يَقُولُ مِنَ الْحَقِّ إِلَى الْبَاطِلِ وَ الدَّلِيلُ عَلَى ذَلِكَ كِتَابُ اللَّهِ عَزَّ وَ جَلَّ قَوْلُهُ وَ لْتَكُنْ مِنْكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَ يَأْمُرُونَ بِالْمَعْرُوفِ وَ يَنْهَوْنَ عَنِ الْمُنْكَرِ", "فَهَذَا خَاصٌّ غَيْرُ عَامٍّ كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ مِنْ قَوْمِ مُوسى أُمَّةٌ يَهْدُونَ بِالْحَقِّ وَ بِهِ يَعْدِلُونَ وَ لَمْ يَقُلْ عَلَى أُمَّةِ مُوسَى وَ لَا عَلَى كُلِّ قَوْمِهِ وَ هُمْ يَوْمَئِذٍ أُمَمٌ مُخْتَلِفَةٌ وَ الْأُمَّةُ وَاحِدَةٌ فَصَاعِداً كَمَا قَالَ اللَّهُ عَزَّ وَ جَلَّ إِنَّ إِبْراهِيمَ كانَ أُمَّةً قانِتاً لِلَّهِ يَقُولُ مُطِيعاً لِلَّهِ عَزَّ وَ جَلَّ وَ لَيْسَ عَلَى مَنْ يَعْلَمُ ذَلِكَ فِي هَذِهِ الْهُدْنَةِ مِنْ حَرَجٍ إِذَا كَانَ لَا قُوَّةَ لَهُ وَ لَا عُذْرَ وَ لَا طَاعَةَ ", "قَالَ مَسْعَدَةُ وَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ وَ سُئِلَ عَنِ الْحَدِيثِ الَّذِي جَاءَ عَنِ النَّبِيِّ ( صلى الله عليه وآله ) إِنَّ أَفْضَلَ الْجِهَادِ كَلِمَةُ عَدْلٍ عِنْدَ إِمَامٍ جَائِرٍ مَا مَعْنَاهُ قَالَ هَذَا عَلَى أَنْ يَأْمُرَهُ بَعْدَ مَعْرِفَتِهِ وَ هُوَ مَعَ ذَلِكَ يُقْبَلُ مِنْهُ وَ إِلَّا فَلَا."], "translations": {"en.hubeali": ["And by this chain, said, ", "‘I heard Abu Abdullah<sup>asws</sup> saying, and he<sup>asws</sup> was asked about the enjoining with the good and the forbidding from the evil, ‘Is it an Obligation upon the entire community?’ So he<sup>asws</sup> said: ‘No’. So it was said to him<sup>asws</sup>, ‘And why not?’ He<sup>asws</sup> said: ‘But rather it is upon the strongly followed one, knowledgeable of the good and the evil, not upon the weak who is not guided of the way, to which from which, he should be speaking from the truth to the falsehood, and the evidence upon that is the Book of Allah<sup>azwj</sup> Mighty and Majestic, His<sup>azwj</sup> Words <span class=\"ibTxt\">[3:104] And from among you there should be a community inviting to the better and enjoin what is good and forbid the evil</span>. ", "Thus, these are particular ones and not the general public, just as Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[7:159] And of Musa's people was a party who guided (people) with the truth, and thereby did they do justice</span>. And He<sup>azwj</sup> did not Say: “And it is upon the people of Musa<sup>as</sup>”, nor “Upon every one of his<sup>as</sup> people”, and in those days they were different communities, and the community can be one (man), just as Allah<sup>azwj</sup> Mighty and Majestic Said that <span class=\"ibTxt\">[16:120] Surely Ibrahim was a community, obedient to Allah</span>. He<sup>azwj</sup> is Saying: “Obedient to Allah<sup>azwj</sup> Mighty and Majestic”. And it is not upon the one who knows that in these times of truce from danger, when there was not strength for him, nor an excuse, and do obedience’.", "Mas’ada (the narrator) said, ", "‘And I heard Abu Abdullah<sup>asws</sup> saying, and he<sup>asws</sup> was asked about the Hadeeth which came from the Prophet<sup>saww</sup> that: ‘The most superior of the Jihad is the just word in the presence of an unjust leader’, what is its meaning?’ He<sup>asws</sup> said: ‘This is upon a stipulation that he would enjoin him (with the good) after having recognised it (himself), and along with that, he (the leader) would accept it from him, or else, so no!’."]}}]}, "index": "al-kafi:5:1:28", "kind": "verse_list"}