{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:5:1", "titles": {"ar": "كِتَابُ الْجِهَادِ", "en": "THE BOOK OF JIHAD"}}, {"indexed_titles": {"en": "Chapter 3"}, "path": "/books/al-kafi:5:1:3", "titles": {"ar": "باب وُجُوهِ الْجِهَادِ ", "en": "Chapter 3 – Aspects of the Jihad"}}], "index": 1182, "local_index": 3, "part_type": "Chapter", "path": "/books/al-kafi:5:1:3", "titles": {"ar": "باب وُجُوهِ الْجِهَادِ ", "en": "Chapter 3 – Aspects of the Jihad"}, "verse_count": 3, "verse_start_index": 8166, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8167, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:1:3:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ فُضَيْلِ بْنِ عِيَاضٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْجِهَادِ سُنَّةٌ أَمْ فَرِيضَةٌ فَقَالَ الْجِهَادُ عَلَى أَرْبَعَةِ أَوْجُهٍ فَجِهَادَانِ فَرْضٌ وَ جِهَادٌ سُنَّةٌ لَا يُقَامُ إِلَّا مَعَ الْفَرْضِ", "فَأَمَّا أَحَدُ الْفَرْضَيْنِ فَمُجَاهَدَةُ الرَّجُلِ نَفْسَهُ عَنْ مَعَاصِي اللَّهِ عَزَّ وَ جَلَّ وَ هُوَ مِنْ أَعْظَمِ الْجِهَادِ وَ مُجَاهَدَةُ الَّذِينَ يَلُونَكُمْ مِنَ الْكُفَّارِ فَرْضٌ وَ أَمَّا الْجِهَادُ الَّذِي هُوَ سُنَّةٌ لَا يُقَامُ إِلَّا مَعَ فَرْضٍ فَإِنَّ مُجَاهَدَةَ الْعَدُوِّ فَرْضٌ عَلَى جَمِيعِ الْأُمَّةِ وَ لَوْ تَرَكُوا الْجِهَادَ لَأَتَاهُمُ الْعَذَابُ وَ هَذَا هُوَ مِنْ عَذَابِ الْأُمَّةِ وَ هُوَ سُنَّةٌ عَلَى الْإِمَامِ وَحْدَهُ أَنْ يَأْتِيَ الْعَدُوَّ مَعَ الْأُمَّةِ فَيُجَاهِدَهُمْ", "وَ أَمَّا الْجِهَادُ الَّذِي هُوَ سُنَّةٌ فَكُلُّ سُنَّةٍ أَقَامَهَا الرَّجُلُ وَ جَاهَدَ فِي إِقَامَتِهَا وَ بُلُوغِهَا وَ إِحْيَائِهَا فَالْعَمَلُ وَ السَّعْيُ فِيهَا مِنْ أَفْضَلِ الْأَعْمَالِ لِأَنَّهَا إِحْيَاءُ سُنَّةٍ وَ قَدْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ سَنَّ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَ أَجْرُ  مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ مِنْ غَيْرِ أَنْ يُنْقَصَ مِنْ أُجُورِهِمْ شَيْ‏ءٌ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and Ali Bin Muhammad Al Qasimy together, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood Al Minqary, form Fuzayl Bin Iyaz who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about the Jihad, is it a Sunnah or an Obligation?’ So he<sup>asws</sup> said: ‘The Jihad is upon four aspects, so two Jihads are Obligatory and one Jihad is Sunnah which cannot be established except by the Obligatory (Jihad).", "So as for one of the two Obligatory ones, so the man strives himself not to disobey Allah<sup>azwj</sup> Mighty and Majestic, and it is the greatest of the Jihads, and a Jihad against the Infidels who are nearby you is an Obligation. And as for the Jihad which is Sunnah which cannot be established except with the Obligatory (Jihad), so it is striving against the enemies necessitated upon the entire community, and if the Jihad were to be neglected the Punishment would come to them; and this is from the Punishment of the community, and it is a Sunnah upon the Imam<sup>asws</sup> alone, if the enemy comes to the community, so he<sup>asws</sup> fights the enemies along with them. ", "And as for the Jihad which is Sunnah, so it is every Sunnah which the man establishes and strives for in its establishment, and accomplishes it, and revives it, and the working with regards to it is from the most superior of deeds, because it revives a Sunnah, and Rasool-Allah<sup>saww</sup> has said: ‘The one who (revives) a Sunnah from the best Sunnahs, so for him would be its Recompense and a Recompense of the ones who abide by it up to the Day of Judgement, without there being any reduction from their Recompenses’."]}}, {"index": 8168, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:1:3:2", "text": ["وَ بِإِسْنَادِهِ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلَ رَجُلٌ أَبِي ( صلوات الله عليه ) عَنْ حُرُوبِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ كَانَ السَّائِلُ مِنْ مُحِبِّينَا فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) بَعَثَ اللَّهُ مُحَمَّداً ( صلى الله عليه وآله ) بِخَمْسَةِ أَسْيَافٍ ثَلَاثَةٌ مِنْهَا شَاهِرَةٌ فَلَا تُغْمَدُ حَتَّى تَضَعَ الْحَرْبُ أَوْزَارَهَا وَ لَنْ تَضَعَ الْحَرْبُ أَوْزَارَهَا حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتِ الشَّمْسُ مِنْ مَغْرِبِهَا آمَنَ النَّاسُ كُلُّهُمْ فِي ذَلِكَ الْيَوْمِ فَيَوْمَئِذٍ لا يَنْفَعُ نَفْساً إِيمانُها لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمانِها خَيْراً وَ سَيْفٌ مِنْهَا مَكْفُوفٌ وَ سَيْفٌ مِنْهَا مَغْمُودٌ سَلُّهُ إِلَى غَيْرِنَا وَ حُكْمُهُ إِلَيْنَا ", "وَ أَمَّا السُّيُوفُ الثَّلَاثَةُ الشَّاهِرَةُ فَسَيْفٌ عَلَى مُشْرِكِي الْعَرَبِ قَالَ اللَّهُ عَزَّ وَ جَلَّ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ وَ خُذُوهُمْ وَ احْصُرُوهُمْ وَ اقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ فَإِنْ تابُوا يَعْنِي آمَنُوا وَ أَقامُوا الصَّلاةَ وَ آتَوُا الزَّكاةَ فَإِخْوانُكُمْ فِي الدِّينِ فَهَؤُلَاءِ لَا يُقْبَلُ مِنْهُمْ إِلَّا الْقَتْلُ أَوِ الدُّخُولُ فِي الْإِسْلَامِ  وَ أَمْوَالُهُمْ وَ ذَرَارِيُّهُمْ سَبْيٌ عَلَى مَا سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَإِنَّهُ سَبَى وَ عَفَا وَ قَبِلَ الْفِدَاءَ", "وَ السَّيْفُ الثَّانِي عَلَى أَهْلِ الذِّمَّةِ قَالَ اللَّهُ تَعَالَى وَ قُولُوا لِلنَّاسِ حُسْناً نَزَلَتْ هَذِهِ الْآيَةُ فِي أَهْلِ الذِّمَّةِ ثُمَّ نَسَخَهَا قَوْلُهُ عَزَّ وَ جَلَّ قاتِلُوا الَّذِينَ لا يُؤْمِنُونَ بِاللَّهِ وَ لا بِالْيَوْمِ الْآخِرِ وَ لا يُحَرِّمُونَ ما حَرَّمَ اللَّهُ وَ رَسُولُهُ وَ لا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا الْكِتابَ حَتَّى يُعْطُوا الْجِزْيَةَ عَنْ يَدٍ وَ هُمْ صاغِرُونَ", "فَمَنْ كَانَ مِنْهُمْ فِي دَارِ الْإِسْلَامِ فَلَنْ يُقْبَلَ مِنْهُمْ إِلَّا الْجِزْيَةُ أَوِ الْقَتْلُ وَ مَالُهُمْ فَيْ‏ءٌ وَ ذَرَارِيُّهُمْ سَبْيٌ وَ إِذَا قَبِلُوا الْجِزْيَةَ عَلَى أَنْفُسِهِمْ حُرِّمَ عَلَيْنَا سَبْيُهُمْ وَ حُرِّمَتْ أَمْوَالُهُمْ وَ حَلَّتْ لَنَا مُنَاكَحَتُهُمْ وَ مَنْ كَانَ مِنْهُمْ فِي دَارِ الْحَرْبِ حَلَّ لَنَا سَبْيُهُمْ وَ أَمْوَالُهُمْ وَ لَمْ تَحِلَّ لَنَا مُنَاكَحَتُهُمْ وَ لَمْ يُقْبَلْ مِنْهُمْ إِلَّا الدُّخُولُ فِي دَارِ الْإِسْلَامِ أَوِ الْجِزْيَةُ أَوِ الْقَتْلُ", "وَ السَّيْفُ الثَّالِثُ سَيْفٌ عَلَى مُشْرِكِي الْعَجَمِ يَعْنِي التُّرْكَ وَ الدَّيْلَمَ وَ الْخَزَرَ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي أَوَّلِ السُّورَةِ الَّتِي يَذْكُرُ فِيهَا الَّذِينَ كَفَرُوا فَقَصَّ قِصَّتَهُمْ ثُمَّ قَالَ فَضَرْبَ الرِّقابِ حَتَّى إِذا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثاقَ فَإِمَّا مَنًّا بَعْدُ وَ إِمَّا فِداءً حَتَّى تَضَعَ الْحَرْبُ أَوْزارَها", "فَأَمَّا قَوْلُهُ فَإِمَّا مَنًّا بَعْدُ يَعْنِي بَعْدَ السَّبْيِ مِنْهُمْ وَ إِمَّا فِداءً يَعْنِي الْمُفَادَاةَ بَيْنَهُمْ وَ بَيْنَ أَهْلِ الْإِسْلَامِ فَهَؤُلَاءِ لَنْ يُقْبَلَ مِنْهُمْ إِلَّا الْقَتْلُ أَوِ الدُّخُولُ فِي الْإِسْلَامِ وَ لَا يَحِلُّ لَنَا مُنَاكَحَتُهُمْ مَا دَامُوا فِي دَارِ الْحَرْبِ", "وَ أَمَّا السَّيْفُ الْمَكْفُوفُ فَسَيْفٌ عَلَى أَهْلِ الْبَغْيِ وَ التَّأْوِيلِ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ إِنْ طائِفَتانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُما فَإِنْ بَغَتْ إِحْداهُما عَلَى الْأُخْرى فَقاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِي‏ءَ إِلى أَمْرِ اللَّهِ فَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ مِنْكُمْ  مَنْ يُقَاتِلُ بَعْدِي عَلَى التَّأْوِيلِ كَمَا قَاتَلْتُ عَلَى التَّنْزِيلِ فَسُئِلَ النَّبِيُّ ( صلى الله عليه وآله ) مَنْ هُوَ فَقَالَ خَاصِفُ النَّعْلِ يَعْنِي أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) ", "فَقَالَ عَمَّارُ بْنُ يَاسِرٍ قَاتَلْتُ بِهَذِهِ الرَّايَةِ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثاً وَ هَذِهِ الرَّابِعَةُ وَ اللَّهِ لَوْ ضَرَبُونَا حَتَّى يَبْلُغُوا بِنَا السَّعَفَاتِ مِنْ هَجَرَ لَعَلِمْنَا أَنَّا عَلَى الْحَقِّ وَ أَنَّهُمْ عَلَى الْبَاطِلِ وَ كَانَتِ السِّيرَةُ فِيهِمْ مِنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مَا كَانَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي أَهْلِ مَكَّةَ يَوْمَ فَتْحِ مَكَّةَ فَإِنَّهُ لَمْ يَسْبِ لَهُمْ ذُرِّيَّةً وَ قَالَ مَنْ أَغْلَقَ بَابَهُ فَهُوَ آمِنٌ وَ مَنْ أَلْقَى سِلَاحَهُ فَهُوَ آمِنٌ", "وَ كَذَلِكَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) يَوْمَ الْبَصْرَةِ نَادَى فِيهِمْ لَا تَسْبُوا لَهُمْ ذُرِّيَّةً وَ لَا تُجْهِزُوا عَلَى جَرِيحٍ وَ لَا تَتْبَعُوا مُدْبِراً وَ مَنْ أَغْلَقَ بَابَهُ وَ أَلْقَى سِلَاحَهُ فَهُوَ آمِنٌ", "وَ أَمَّا السَّيْفُ الْمَغْمُودُ فَالسَّيْفُ الَّذِي يَقُومُ بِهِ الْقِصَاصُ قَالَ اللَّهُ عَزَّ وَ جَلَّ النَّفْسَ بِالنَّفْسِ وَ الْعَيْنَ بِالْعَيْنِ فَسَلُّهُ إِلَى أَوْلِيَاءِ الْمَقْتُولِ وَ حُكْمُهُ إِلَيْنَا ", "فَهَذِهِ السُّيُوفُ الَّتِي بَعَثَ اللَّهُ بِهَا مُحَمَّداً ( صلى الله عليه وآله ) فَمَنْ جَحَدَهَا أَوْ جَحَدَ وَاحِداً مِنْهَا أَوْ شَيْئاً مِنْ سِيَرِهَا وَ أَحْكَامِهَا فَقَدْ كَفَرَ بِمَا أَنْزَلَ اللَّهُ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) ."], "translations": {"en.hubeali": ["And by his chain, form Al Minqary, from Hafs Bin Giyas, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> who said, ‘A man asked my<sup>asws</sup> father<sup>asws</sup> about the wars of Amir Al-Momineen<sup>asws</sup>, and the questioner was from those that love us<sup>asws</sup>, so Abu Ja’far<sup>asws</sup> said to him: ‘Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> with five swords, three of these were brandished (waved), so they would not be sheathed until the wars come to an end, and the wars will never come to an end until the sun emerges from its west. So when the sun emerges from its west, the people would be in safety, all of them, during that day. So in those days no soul would benefit from its Belief if it had not believed from beforehand, or goodness achieved from its belief; and a sword from these is restrained, and a sword from these is sheathed and would be unsheathed to other than us<sup>asws</sup>, and its decision is for us<sup>asws</sup> (to make)’. ", "And as for the three brandished (waved/displayed) swords, so a sword is upon the Arab Polytheists. Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\">[9:5] then fight the Polytheists wherever you find them, and take them captives and besiege them and lie in wait for them in every ambush, then if they repent and establish Prayer and pay the Zakat, leave their way free for them; surely Allah is Forgiving, Merciful [9:11] then they are your brethren in the Religion</span>. So they are the ones from whom nothing would be accepted except for the killing or their entry into Al-Islam, and their wealth and their offspring would be made captives upon what was a Sunnah of Rasool-Allah<sup>saww</sup>, for he<sup>saww</sup> made captives, and forgave, and accepted the ransom.", "And the second sword is upon the people under the responsibility (<span class=\"iTxt\">Ahl Al-Zimma</span>). Allah<sup>azwj</sup> the Exalted Says <span class=\"ibTxt\">[2:83] and you shall speak to the people good words</span>. This Verse was Revealed regarding the <span class=\"iTxt\">Ahl Al-Zimma</span>, then it was Abrogated by the Words of the Mighty and Majestic <span class=\"ibTxt\">[9:29] Fight those who do not believe in Allah, nor in the Last Day, nor do they sanctify what Allah and His Rasool have sanctified, nor do they make the Religion of Truth to be their Religion, out of those who have been Given the Book, until they pay the tax in acknowledgment of their lowness</span>. ", "So as for the ones who were from them in the house of Al-Islam, nothing would be accepted from him except for the taxation, or the killing, and their wealth would be <span class=\"iTxt\">Fey</span> (war booty), and their offspring would be made captives. So when they accept the taxation upon themselves, their captives would be Prohibited unto us, and their wealth would be Prohibited, and marrying them would be Permissible for us. And the ones from them who were in the house of the war, it would be Permissible for us to make them captives, and their wealth, and it would not be Permissible for us to marry them, and nothing would be accepted from them except for the entry into the house of Al-Islam, or the taxation, or the killing.", "And the third sword is a sword upon the non-Arab Polytheists, meaning the Turks, and Al-Daylam, and Al-Khazar. Allah<sup>azwj</sup> Mighty and Majestic Says in the beginning of the Chapter in which He<sup>azwj</sup> Mentioned those who disbelieved, so He<sup>azwj</sup> Related their story, then Said <span class=\"ibTxt\">[47:4] So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favour or let them ransom (themselves) until the war terminates</span>.", "So, as for His<sup>azwj</sup> Words <span class=\"ibTxt\">and afterwards</span> Meaning after taking captives from them, and <span class=\"ibTxt\">or let them ransom (themselves)</span> Meaning the ransoming between them and the people of Al-Islam. So they are the ones from whom nothing would be accepted except for the killing, or the entry into Al-Islam, and marrying them would not be Permissible for us for as long as they are in the house of the war. ", "And as for the restrained sword, so it is a sword upon the people of the rebellion and the interpretation (of the Quran). Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\">[49:9] And if two parties of the believers quarrel, make reconciliation between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah's Command</span>. So when this Verse was Revealed, Rasool-Allah<sup>saww</sup> said: ‘After me<sup>saww</sup>, there would be one among you who would be fighting upon the interpretation (of the Quran) just as I<sup>saww</sup> fought upon the Revelation’. So the Prophet<sup>saww</sup> was asked, ‘Who is he?’ So he<sup>saww</sup> said: ‘The repairer of the sandal’, meaning Amir Al-Momineen<sup>asws</sup>.", "So Ammar Bin Yasser said, ‘I fought by this flag along with Rasool-Allah<sup>saww</sup> three (times), and this is the fourth. By Allah<sup>azwj</sup>! If they were to strike us until they make us reach the palm leaves due to emigration, we would know that we are upon the Truth and they are upon the falsehood. And the way among them was from Amir Al-Momineen<sup>asws</sup> what was from Rasool-Allah<sup>saww</sup> with regards to the people of Makkah on the day Makkah was conquered, for he<sup>saww</sup> did not make captives of their offspring, and said: ‘The one who locks his door, so he is safe, and the one who lays down his weapon, so he is safe’. ", "And similar to that is what Amir Al-Momineen<sup>asws</sup> said on the Day of Al-Basra (The battle of the camel). He<sup>asws</sup> called out among them: ‘Do not take their offspring as captives, nor attack the injured, nor pursue a fleeing one. And the one who locks his door and lays down his weapon, so he is safe’.", "And as for the sheathed sword, so it is the sword by which the retaliation is established. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\">[5:45] And We prescribed to them in it that a life is for a life, and an eye for an eye</span>. So it was left upon the guardians of the killed one, and its decision (for the authorization of an action) is up to us<sup>asws</sup>.", "So these are the swords which Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> with. So the one who fights against these, or fights against one of these, or something from its ways and its decisions, so he has disbelieve with what Allah<sup>azwj</sup> Revealed upon Muhammad<sup>saww</sup>’."]}}, {"index": 8169, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:5:1:3:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) بَعَثَ بِسَرِيَّةٍ فَلَمَّا رَجَعُوا قَالَ مَرْحَباً بِقَوْمٍ قَضَوُا الْجِهَادَ الْأَصْغَرَ وَ بَقِيَ الْجِهَادُ الْأَكْبَرُ قِيلَ يَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ مَا الْجِهَادُ الْأَكْبَرُ قَالَ جِهَادُ النَّفْسِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> that the Prophet<sup>saww</sup> sent a brigade. So when they returned, he<sup>saww</sup> said: ‘Welcome to the people who have accomplished the smallest Jihad and there remains the greatest Jihad’. It was said, ‘O Rasool-Allah<sup>saww</sup>! And what is the greatest Jihad?’ He<sup>saww</sup> said: ‘Jihad of the self’."]}}]}, "index": "al-kafi:5:1:3", "kind": "verse_list"}