{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 3"
        },
        "path": "/books/al-kafi:5:1:3",
        "titles": {
          "ar": "باب وُجُوهِ الْجِهَادِ ",
          "en": "Chapter 3 – Aspects of the Jihad"
        }
      }
    ],
    "index": 1183,
    "local_index": 3,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:5:1:4",
        "titles": {
          "ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَنْ يَجِبُ عَلَيْهِ</span> الْجِهَادُ وَ مَنْ لَا يَجِبُ ",
          "en": "Chapter 4 – The one upon whom the Jihad is Obligated and the one (upon whom) it is not Obligated"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 2"
        },
        "path": "/books/al-kafi:5:1:2",
        "titles": {
          "ar": "باب جِهَادِ الرَّجُلِ وَ الْمَرْأَةِ ",
          "en": "Chapter 2 – Jihad of the man and the woman"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:3",
    "titles": {
      "ar": "باب وُجُوهِ الْجِهَادِ ",
      "en": "Chapter 3 – Aspects of the Jihad"
    },
    "verse_count": 3,
    "verse_start_index": 8166,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/331)"
        ],
        "index": 8167,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:3:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ جَمِيعاً عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنْ سُلَيْمَانَ بْنِ دَاوُدَ الْمِنْقَرِيِّ عَنْ فُضَيْلِ بْنِ عِيَاضٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الْجِهَادِ سُنَّةٌ أَمْ فَرِيضَةٌ فَقَالَ الْجِهَادُ عَلَى أَرْبَعَةِ أَوْجُهٍ فَجِهَادَانِ فَرْضٌ وَ جِهَادٌ سُنَّةٌ لَا يُقَامُ إِلَّا مَعَ الْفَرْضِ",
          "فَأَمَّا أَحَدُ الْفَرْضَيْنِ فَمُجَاهَدَةُ الرَّجُلِ نَفْسَهُ عَنْ مَعَاصِي اللَّهِ عَزَّ وَ جَلَّ وَ هُوَ مِنْ أَعْظَمِ الْجِهَادِ وَ مُجَاهَدَةُ الَّذِينَ يَلُونَكُمْ مِنَ الْكُفَّارِ فَرْضٌ وَ أَمَّا الْجِهَادُ الَّذِي هُوَ سُنَّةٌ لَا يُقَامُ إِلَّا مَعَ فَرْضٍ فَإِنَّ مُجَاهَدَةَ الْعَدُوِّ فَرْضٌ عَلَى جَمِيعِ الْأُمَّةِ وَ لَوْ تَرَكُوا الْجِهَادَ لَأَتَاهُمُ الْعَذَابُ وَ هَذَا هُوَ مِنْ عَذَابِ الْأُمَّةِ وَ هُوَ سُنَّةٌ عَلَى الْإِمَامِ وَحْدَهُ أَنْ يَأْتِيَ الْعَدُوَّ مَعَ الْأُمَّةِ فَيُجَاهِدَهُمْ",
          "وَ أَمَّا الْجِهَادُ الَّذِي هُوَ سُنَّةٌ فَكُلُّ سُنَّةٍ أَقَامَهَا الرَّجُلُ وَ جَاهَدَ فِي إِقَامَتِهَا وَ بُلُوغِهَا وَ إِحْيَائِهَا فَالْعَمَلُ وَ السَّعْيُ فِيهَا مِنْ أَفْضَلِ الْأَعْمَالِ لِأَنَّهَا إِحْيَاءُ سُنَّةٍ وَ قَدْ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ سَنَّ سُنَّةً حَسَنَةً فَلَهُ أَجْرُهَا وَ أَجْرُ  مَنْ عَمِلَ بِهَا إِلَى يَوْمِ الْقِيَامَةِ مِنْ غَيْرِ أَنْ يُنْقَصَ مِنْ أُجُورِهِمْ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Ali Bin Muhammad Al Qasimy together, from Al Qasim Bin Muhammad, from Suleyman Bin Dawood Al Minqary, form Fuzayl Bin Iyaz who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the Jihad, is it a Sunnah or an Obligation?’ So he<sup>asws</sup> said: ‘The Jihad is upon four aspects, so two Jihads are Obligatory and one Jihad is Sunnah which cannot be established except by the Obligatory (Jihad).",
            "So as for one of the two Obligatory ones, so the man strives himself not to disobey Allah<sup>azwj</sup> Mighty and Majestic, and it is the greatest of the Jihads, and a Jihad against the Infidels who are nearby you is an Obligation. And as for the Jihad which is Sunnah which cannot be established except with the Obligatory (Jihad), so it is striving against the enemies necessitated upon the entire community, and if the Jihad were to be neglected the Punishment would come to them; and this is from the Punishment of the community, and it is a Sunnah upon the Imam<sup>asws</sup> alone, if the enemy comes to the community, so he<sup>asws</sup> fights the enemies along with them. ",
            "And as for the Jihad which is Sunnah, so it is every Sunnah which the man establishes and strives for in its establishment, and accomplishes it, and revives it, and the working with regards to it is from the most superior of deeds, because it revives a Sunnah, and Rasool-Allah<sup>saww</sup> has said: ‘The one who (revives) a Sunnah from the best Sunnahs, so for him would be its Recompense and a Recompense of the ones who abide by it up to the Day of Judgement, without there being any reduction from their Recompenses’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Afi ibn Muhammad af-Qasaniy all from al-Qasim ibn Muhammad from Sulayman ibn Dawud al-Minqariy from Fudayl ibn ‘Iyad who has said the following: “This is concerning my question before abu ‘ Abd Allah, ‘Alayhi al-Salam, Ts Jihad Sunnah (optional) or obligatory?’ He replied, ‘Jihad is of four kinds. Two kinds of Jihad are obligatory and there is an optional Jihad which cannot be established without obligatory Jihad. ‘Of the two obligatory Jihad is one’s Jihad (struggle) against his soul’s desires to disobey Allah, the Most Majestic, the Most Glorious, and this is the greatest form of Jihad. Jihad against the unbeliever (declared) enemies nearby is also obligatory. ‘The kind of optional Jihad, which cannot be established without an obligatory Jihad, is when it becomes obligatory upon the whole nation to fight the enemy; and if they disregard such Jihad torment descends upon them. This is the punishment for the nation. Only for the Imam this is optional. He faces the enemy with the support of the nation to fight. ‘The optional Jihad is every optional institution for the establishment of which one strives hard to accomplish and revive. Working and the pursuit of such task is of the most excellent deeds; it is reviving of a tradition. The Messenger of Allah has said, ‘Whoever establishes a noble tradition he gains the reward therefor and a reward equal to the reward of those who act upon such noble tradition up to the Day of Judgment without any reduction in the rewards of anyone of them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/333)"
        ],
        "index": 8168,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:3:2",
        "refs": {
          "Mentions": [
            "/books/quran:9:5",
            "/books/quran:9:30",
            "/books/quran:49:9",
            "/books/quran:47:4",
            "/books/quran:5:45",
            "/books/quran:2:83",
            "/books/quran:9:29",
            "/books/quran:9:11"
          ]
        },
        "text": [
          "وَ بِإِسْنَادِهِ عَنِ الْمِنْقَرِيِّ عَنْ حَفْصِ بْنِ غِيَاثٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلَ رَجُلٌ أَبِي ( صلوات الله عليه ) عَنْ حُرُوبِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) وَ كَانَ السَّائِلُ مِنْ مُحِبِّينَا فَقَالَ لَهُ أَبُو جَعْفَرٍ ( عليه السلام ) بَعَثَ اللَّهُ مُحَمَّداً ( صلى الله عليه وآله ) بِخَمْسَةِ أَسْيَافٍ ثَلَاثَةٌ مِنْهَا شَاهِرَةٌ فَلَا تُغْمَدُ حَتَّى تَضَعَ الْحَرْبُ أَوْزَارَهَا وَ لَنْ تَضَعَ الْحَرْبُ أَوْزَارَهَا حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتِ الشَّمْسُ مِنْ مَغْرِبِهَا آمَنَ النَّاسُ كُلُّهُمْ فِي ذَلِكَ الْيَوْمِ فَيَوْمَئِذٍ لا يَنْفَعُ نَفْساً إِيمانُها لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمانِها خَيْراً وَ سَيْفٌ مِنْهَا مَكْفُوفٌ وَ سَيْفٌ مِنْهَا مَغْمُودٌ سَلُّهُ إِلَى غَيْرِنَا وَ حُكْمُهُ إِلَيْنَا ",
          "وَ أَمَّا السُّيُوفُ الثَّلَاثَةُ الشَّاهِرَةُ فَسَيْفٌ عَلَى مُشْرِكِي الْعَرَبِ قَالَ اللَّهُ عَزَّ وَ جَلَّ فَاقْتُلُوا الْمُشْرِكِينَ حَيْثُ وَجَدْتُمُوهُمْ وَ خُذُوهُمْ وَ احْصُرُوهُمْ وَ اقْعُدُوا لَهُمْ كُلَّ مَرْصَدٍ فَإِنْ تابُوا يَعْنِي آمَنُوا وَ أَقامُوا الصَّلاةَ وَ آتَوُا الزَّكاةَ فَإِخْوانُكُمْ فِي الدِّينِ فَهَؤُلَاءِ لَا يُقْبَلُ مِنْهُمْ إِلَّا الْقَتْلُ أَوِ الدُّخُولُ فِي الْإِسْلَامِ  وَ أَمْوَالُهُمْ وَ ذَرَارِيُّهُمْ سَبْيٌ عَلَى مَا سَنَّ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَإِنَّهُ سَبَى وَ عَفَا وَ قَبِلَ الْفِدَاءَ",
          "وَ السَّيْفُ الثَّانِي عَلَى أَهْلِ الذِّمَّةِ قَالَ اللَّهُ تَعَالَى وَ قُولُوا لِلنَّاسِ حُسْناً نَزَلَتْ هَذِهِ الْآيَةُ فِي أَهْلِ الذِّمَّةِ ثُمَّ نَسَخَهَا قَوْلُهُ عَزَّ وَ جَلَّ قاتِلُوا الَّذِينَ لا يُؤْمِنُونَ بِاللَّهِ وَ لا بِالْيَوْمِ الْآخِرِ وَ لا يُحَرِّمُونَ ما حَرَّمَ اللَّهُ وَ رَسُولُهُ وَ لا يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُوا الْكِتابَ حَتَّى يُعْطُوا الْجِزْيَةَ عَنْ يَدٍ وَ هُمْ صاغِرُونَ",
          "فَمَنْ كَانَ مِنْهُمْ فِي دَارِ الْإِسْلَامِ فَلَنْ يُقْبَلَ مِنْهُمْ إِلَّا الْجِزْيَةُ أَوِ الْقَتْلُ وَ مَالُهُمْ فَيْ‏ءٌ وَ ذَرَارِيُّهُمْ سَبْيٌ وَ إِذَا قَبِلُوا الْجِزْيَةَ عَلَى أَنْفُسِهِمْ حُرِّمَ عَلَيْنَا سَبْيُهُمْ وَ حُرِّمَتْ أَمْوَالُهُمْ وَ حَلَّتْ لَنَا مُنَاكَحَتُهُمْ وَ مَنْ كَانَ مِنْهُمْ فِي دَارِ الْحَرْبِ حَلَّ لَنَا سَبْيُهُمْ وَ أَمْوَالُهُمْ وَ لَمْ تَحِلَّ لَنَا مُنَاكَحَتُهُمْ وَ لَمْ يُقْبَلْ مِنْهُمْ إِلَّا الدُّخُولُ فِي دَارِ الْإِسْلَامِ أَوِ الْجِزْيَةُ أَوِ الْقَتْلُ",
          "وَ السَّيْفُ الثَّالِثُ سَيْفٌ عَلَى مُشْرِكِي الْعَجَمِ يَعْنِي التُّرْكَ وَ الدَّيْلَمَ وَ الْخَزَرَ قَالَ اللَّهُ عَزَّ وَ جَلَّ فِي أَوَّلِ السُّورَةِ الَّتِي يَذْكُرُ فِيهَا الَّذِينَ كَفَرُوا فَقَصَّ قِصَّتَهُمْ ثُمَّ قَالَ فَضَرْبَ الرِّقابِ حَتَّى إِذا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثاقَ فَإِمَّا مَنًّا بَعْدُ وَ إِمَّا فِداءً حَتَّى تَضَعَ الْحَرْبُ أَوْزارَها",
          "فَأَمَّا قَوْلُهُ فَإِمَّا مَنًّا بَعْدُ يَعْنِي بَعْدَ السَّبْيِ مِنْهُمْ وَ إِمَّا فِداءً يَعْنِي الْمُفَادَاةَ بَيْنَهُمْ وَ بَيْنَ أَهْلِ الْإِسْلَامِ فَهَؤُلَاءِ لَنْ يُقْبَلَ مِنْهُمْ إِلَّا الْقَتْلُ أَوِ الدُّخُولُ فِي الْإِسْلَامِ وَ لَا يَحِلُّ لَنَا مُنَاكَحَتُهُمْ مَا دَامُوا فِي دَارِ الْحَرْبِ",
          "وَ أَمَّا السَّيْفُ الْمَكْفُوفُ فَسَيْفٌ عَلَى أَهْلِ الْبَغْيِ وَ التَّأْوِيلِ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ إِنْ طائِفَتانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُما فَإِنْ بَغَتْ إِحْداهُما عَلَى الْأُخْرى فَقاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِي‏ءَ إِلى أَمْرِ اللَّهِ فَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ مِنْكُمْ  مَنْ يُقَاتِلُ بَعْدِي عَلَى التَّأْوِيلِ كَمَا قَاتَلْتُ عَلَى التَّنْزِيلِ فَسُئِلَ النَّبِيُّ ( صلى الله عليه وآله ) مَنْ هُوَ فَقَالَ خَاصِفُ النَّعْلِ يَعْنِي أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) ",
          "فَقَالَ عَمَّارُ بْنُ يَاسِرٍ قَاتَلْتُ بِهَذِهِ الرَّايَةِ مَعَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) ثَلَاثاً وَ هَذِهِ الرَّابِعَةُ وَ اللَّهِ لَوْ ضَرَبُونَا حَتَّى يَبْلُغُوا بِنَا السَّعَفَاتِ مِنْ هَجَرَ لَعَلِمْنَا أَنَّا عَلَى الْحَقِّ وَ أَنَّهُمْ عَلَى الْبَاطِلِ وَ كَانَتِ السِّيرَةُ فِيهِمْ مِنْ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) مَا كَانَ مِنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي أَهْلِ مَكَّةَ يَوْمَ فَتْحِ مَكَّةَ فَإِنَّهُ لَمْ يَسْبِ لَهُمْ ذُرِّيَّةً وَ قَالَ مَنْ أَغْلَقَ بَابَهُ فَهُوَ آمِنٌ وَ مَنْ أَلْقَى سِلَاحَهُ فَهُوَ آمِنٌ",
          "وَ كَذَلِكَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) يَوْمَ الْبَصْرَةِ نَادَى فِيهِمْ لَا تَسْبُوا لَهُمْ ذُرِّيَّةً وَ لَا تُجْهِزُوا عَلَى جَرِيحٍ وَ لَا تَتْبَعُوا مُدْبِراً وَ مَنْ أَغْلَقَ بَابَهُ وَ أَلْقَى سِلَاحَهُ فَهُوَ آمِنٌ",
          "وَ أَمَّا السَّيْفُ الْمَغْمُودُ فَالسَّيْفُ الَّذِي يَقُومُ بِهِ الْقِصَاصُ قَالَ اللَّهُ عَزَّ وَ جَلَّ النَّفْسَ بِالنَّفْسِ وَ الْعَيْنَ بِالْعَيْنِ فَسَلُّهُ إِلَى أَوْلِيَاءِ الْمَقْتُولِ وَ حُكْمُهُ إِلَيْنَا ",
          "فَهَذِهِ السُّيُوفُ الَّتِي بَعَثَ اللَّهُ بِهَا مُحَمَّداً ( صلى الله عليه وآله ) فَمَنْ جَحَدَهَا أَوْ جَحَدَ وَاحِداً مِنْهَا أَوْ شَيْئاً مِنْ سِيَرِهَا وَ أَحْكَامِهَا فَقَدْ كَفَرَ بِمَا أَنْزَلَ اللَّهُ عَلَى مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, form Al Minqary, from Hafs Bin Giyas, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> who said, ‘A man asked my<sup>asws</sup> father<sup>asws</sup> about the wars of Amir Al-Momineen<sup>asws</sup>, and the questioner was from those that love us<sup>asws</sup>, so Abu Ja’far<sup>asws</sup> said to him: ‘Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> with five swords, three of these were brandished (waved), so they would not be sheathed until the wars come to an end, and the wars will never come to an end until the sun emerges from its west. So when the sun emerges from its west, the people would be in safety, all of them, during that day. So in those days no soul would benefit from its Belief if it had not believed from beforehand, or goodness achieved from its belief; and a sword from these is restrained, and a sword from these is sheathed and would be unsheathed to other than us<sup>asws</sup>, and its decision is for us<sup>asws</sup> (to make)’. ",
            "And as for the three brandished (waved/displayed) swords, so a sword is upon the Arab Polytheists. Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h5\">[9:5]</a> then fight the Polytheists wherever you find them, and take them captives and besiege them and lie in wait for them in every ambush, then if they repent and establish Prayer and pay the Zakat, leave their way free for them; surely Allah is Forgiving, Merciful <a href=\"/#/books/quran:9#h11\">[9:11]</a> then they are your brethren in the Religion</span>. So they are the ones from whom nothing would be accepted except for the killing or their entry into Al-Islam, and their wealth and their offspring would be made captives upon what was a Sunnah of Rasool-Allah<sup>saww</sup>, for he<sup>saww</sup> made captives, and forgave, and accepted the ransom.",
            "And the second sword is upon the people under the responsibility (<span class=\"iTxt\">Ahl Al-Zimma</span>). Allah<sup>azwj</sup> the Exalted Says <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h83\">[2:83]</a> and you shall speak to the people good words</span>. This Verse was Revealed regarding the <span class=\"iTxt\">Ahl Al-Zimma</span>, then it was Abrogated by the Words of the Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:9#h29\">[9:29]</a> Fight those who do not believe in Allah, nor in the Last Day, nor do they sanctify what Allah and His Rasool have sanctified, nor do they make the Religion of Truth to be their Religion, out of those who have been Given the Book, until they pay the tax in acknowledgment of their lowness</span>. ",
            "So as for the ones who were from them in the house of Al-Islam, nothing would be accepted from him except for the taxation, or the killing, and their wealth would be <span class=\"iTxt\">Fey</span> (war booty), and their offspring would be made captives. So when they accept the taxation upon themselves, their captives would be Prohibited unto us, and their wealth would be Prohibited, and marrying them would be Permissible for us. And the ones from them who were in the house of the war, it would be Permissible for us to make them captives, and their wealth, and it would not be Permissible for us to marry them, and nothing would be accepted from them except for the entry into the house of Al-Islam, or the taxation, or the killing.",
            "And the third sword is a sword upon the non-Arab Polytheists, meaning the Turks, and Al-Daylam, and Al-Khazar. Allah<sup>azwj</sup> Mighty and Majestic Says in the beginning of the Chapter in which He<sup>azwj</sup> Mentioned those who disbelieved, so He<sup>azwj</sup> Related their story, then Said <span class=\"ibTxt\"><a href=\"/#/books/quran:47#h4\">[47:4]</a> So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favour or let them ransom (themselves) until the war terminates</span>.",
            "So, as for His<sup>azwj</sup> Words <span class=\"ibTxt\">and afterwards</span> Meaning after taking captives from them, and <span class=\"ibTxt\">or let them ransom (themselves)</span> Meaning the ransoming between them and the people of Al-Islam. So they are the ones from whom nothing would be accepted except for the killing, or the entry into Al-Islam, and marrying them would not be Permissible for us for as long as they are in the house of the war. ",
            "And as for the restrained sword, so it is a sword upon the people of the rebellion and the interpretation (of the Quran). Allah<sup>azwj</sup> Mighty and Majestic Says <span class=\"ibTxt\"><a href=\"/#/books/quran:49#h9\">[49:9]</a> And if two parties of the believers quarrel, make reconciliation between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah's Command</span>. So when this Verse was Revealed, Rasool-Allah<sup>saww</sup> said: ‘After me<sup>saww</sup>, there would be one among you who would be fighting upon the interpretation (of the Quran) just as I<sup>saww</sup> fought upon the Revelation’. So the Prophet<sup>saww</sup> was asked, ‘Who is he?’ So he<sup>saww</sup> said: ‘The repairer of the sandal’, meaning Amir Al-Momineen<sup>asws</sup>.",
            "So Ammar Bin Yasser said, ‘I fought by this flag along with Rasool-Allah<sup>saww</sup> three (times), and this is the fourth. By Allah<sup>azwj</sup>! If they were to strike us until they make us reach the palm leaves due to emigration, we would know that we are upon the Truth and they are upon the falsehood. And the way among them was from Amir Al-Momineen<sup>asws</sup> what was from Rasool-Allah<sup>saww</sup> with regards to the people of Makkah on the day Makkah was conquered, for he<sup>saww</sup> did not make captives of their offspring, and said: ‘The one who locks his door, so he is safe, and the one who lays down his weapon, so he is safe’. ",
            "And similar to that is what Amir Al-Momineen<sup>asws</sup> said on the Day of Al-Basra (The battle of the camel). He<sup>asws</sup> called out among them: ‘Do not take their offspring as captives, nor attack the injured, nor pursue a fleeing one. And the one who locks his door and lays down his weapon, so he is safe’.",
            "And as for the sheathed sword, so it is the sword by which the retaliation is established. Allah<sup>azwj</sup> Mighty and Majestic Said <span class=\"ibTxt\"><a href=\"/#/books/quran:5#h45\">[5:45]</a> And We prescribed to them in it that a life is for a life, and an eye for an eye</span>. So it was left upon the guardians of the killed one, and its decision (for the authorization of an action) is up to us<sup>asws</sup>.",
            "So these are the swords which Allah<sup>azwj</sup> Sent Muhammad<sup>saww</sup> with. So the one who fights against these, or fights against one of these, or something from its ways and its decisions, so he has disbelieve with what Allah<sup>azwj</sup> Revealed upon Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "2. Through the same chain of narrator he has narrated from al-Minqariy from Hafs ibn Ghiyath who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that once a man asked my father, ‘Alayhi al-Salam, about the wars in which Amir al-Mu’minin, had taken part. The man asking the question was of our followers. Abu Ja‘far, ‘Alayhi al-Salam, replied, ‘Allah sent Muhammad, ‘Alayhi al-Salam, with five swords. Three of them are taken out of their sheath and they are not sheathed until war is no more. The day without war will not come until the sun rises from the west. When the sun rises from its westerly direction all people will enjoy peace on that day. On that day a soul’s belief will be of no benefit if it did not exist before or has not gained any good thereby. One of those swords is withheld and the other one remains in its sheath and he has uncovered it on people other than us but it is up to us to decide. ‘Allah, the Most Majestic, the Most Glorious has said, “Destroy the pagans wherever you find them; capture, detain them and set up surveillance over their activities. If they repent (accept the faith), perform Salat (prayer) and pay Zakat, they are your brothers in religion.” <a href=\"/#/books/quran:9#h11\">[9:11]</a> The choice for such people is only acceptance of al-Islam or destruction. Their properties and offspring are held and detained and are dealt with in the way the Messenger of Allah had done. He detained, forgave or released them in exchange for ransom. ‘The second sword is in matters of dealing with the taxpayers. Allah, the most Blessed, the most High, has said, “Speak to people good words.” <a href=\"/#/books/quran:2#h83\">[2:83]</a>. This verse was revealed about the tax payers. Later it was amended by the following verse, “Fight those, who do not believe in Allah and in the Day of Judgment and do not consider unlawful what Allah and His Messenger have made unlawful. Thus, they do not follow the true religion. However, they are of the followers of the book. (This is the case) until they agree to pay taxes by their own hands with humbleness.” <a href=\"/#/books/quran:9#h30\">[9:30]</a> Those of them who live in the Muslims lands must pay taxes or be destroyed, their offspring detained and no Fay ’ (ransom) is accepted from them. But if they agree to pay taxes it becomes unlawful for us to detain them or touch their properties. It becomes lawful to marry from them. Those of such people who live in the war zones can be detained and their properties withheld. It is not lawful to marry from them and they are given the choices of either moving to the lands of the Muslims, pay taxes or be destroyed. ‘The third sword is to deal thereby with non- Arab pagans, such as al-Turk, al-Daylam and al-Khazar. Allah, the Most Majestic, the Most Glorious, in the beginning of the Chapter that speaks of “those who disbelieve” has stated their story and said, “It, then, is to strike their necks until they are subdued and captured, thereafter either freed as a favor or in exchange for ransom until the war is no more.” <a href=\"/#/books/quran:47#h4\">[47:4]</a> His words, “freed as a favor” means after they are detained and His words, “or in exchange for ransom” means in exchange for protection of the interests of the Muslim people. In the case of such people the choice is either destruction or acceptance of al-Islam. It is not lawful for us to marry from them as long as they live in the war zone. ‘The withheld sword is to deal thereby with the rebels and people who raise the issue of interpretations of the texts of the law. Allah, the Most Majestic, the Most Glorious, has said, “If two groups of believers fight each other, you must establish reconciliation between them. If one group rebels against the other then you must fight the rebellious one until it submits to the command of Allah.” <a href=\"/#/books/quran:49#h9\">[49:9]</a> When this was revealed the Messenger of Allah said, “Among you there will be those who fight to establish proper interpretation of (the text of law) just as their fighting to establish the revelation of the text of the law.” The Holy Prophet then was asked, “Who will be such fighters?” He (the Messenger of Allah) replied, “One who is stitching his shoes”, meaning thereby Amir al-Mu’minin, ‘Alayhi al-Salam. ‘Ammar ibn Yasar has said, “I have fought under this banner alongside the Messenger of Allah three times and this is the fourth time. I swear by Allah, if they beat us to make us retreat even all the way to the twigs of Bahrain, we will still remain certain of our truthfulness and their following falsehood. Dealings by ’Amir al-Mu’minin ‘Alayhi al-Salam, with them were just like those of the Holy Prophet toward the people of Makkah on the day of its conquest. Their offspring were not detained, and he said, ‘Those who keep their doors closed are protected.’ Those who put down their arms are protected. So also did Amir al-Mu’minin, ‘Alayhi al-Salam, on the day of Basra. He announced among them, ‘You must not detain any of their offspring, you must not attack the wounded, you must not pursue the fleeing and those who close their doors and put down their arms are all protected.’” ‘The sword in the sheath is the sword whereby retaliation for a slain person takes place. Allah, the Most Majestic, the Most Glorious, has said, “A soul for a soul and an eye for an eye . . .” <a href=\"/#/books/quran:5#h45\">[5:45]</a> He has made it ready for the heirs of the slain person but the application of its rule is left up to us to decide. These are the swords that Allah sent to Muhammad, O Allah grant salawat (favors and compensation to Muhammad and his family worthy of their services to your cause). Whoever rejects them or anyone of them or anything of their characteristics or rules has rejected what Allah has revealed to Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/336)"
        ],
        "index": 8169,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:3:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) بَعَثَ بِسَرِيَّةٍ فَلَمَّا رَجَعُوا قَالَ مَرْحَباً بِقَوْمٍ قَضَوُا الْجِهَادَ الْأَصْغَرَ وَ بَقِيَ الْجِهَادُ الْأَكْبَرُ قِيلَ يَا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) وَ مَا الْجِهَادُ الْأَكْبَرُ قَالَ جِهَادُ النَّفْسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that the Prophet<sup>saww</sup> sent a brigade. So when they returned, he<sup>saww</sup> said: ‘Welcome to the people who have accomplished the smallest Jihad and there remains the greatest Jihad’. It was said, ‘O Rasool-Allah<sup>saww</sup>! And what is the greatest Jihad?’ He<sup>saww</sup> said: ‘Jihad of the self’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah once mobilized a group of people against the enemy. When they returned back he said, ’I welcome a people who have just come back after completion of the minor Jihad and who yet have to complete the major Jihad.’ Someone then asked, ‘What is the major Jihad, O Messenger of Allah?’ He replied, ‘It is Jihad against the desires of one’s own soul to disobey Allah.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:3",
  "kind": "verse_list"
}