{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:5:1:32",
        "titles": {
          "ar": "باب كَرَاهَةِ التَّعَرُّضِ لِمَا لَا يُطِيقُ ",
          "en": "Chapter 32 – Abhorrence of exposing oneself to what one cannot endure"
        }
      }
    ],
    "index": 1212,
    "local_index": 32,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:5:1:31",
        "titles": {
          "ar": "باب مَنْ أَسْخَطَ الْخَالِقَ فِي مَرْضَاةِ الْمَخْلُوقِ",
          "en": "Chapter 31 – The one who Angers the Creator for pleasing the creatures"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:32",
    "titles": {
      "ar": "باب كَرَاهَةِ التَّعَرُّضِ لِمَا لَا يُطِيقُ ",
      "en": "Chapter 32 – Abhorrence of exposing oneself to what one cannot endure"
    },
    "verse_count": 6,
    "verse_start_index": 8291,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/411)"
        ],
        "index": 8292,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:32:1",
        "refs": {
          "Mentions": [
            "/books/quran:63:8",
            "/books/quran:63:7"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ الْحُسَيْنِ</span> عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ الْأَنْصَارِيِّ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي الْحَسَنِ الْأَحْمَسِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَوَّضَ إِلَى الْمُؤْمِنِ أُمُورَهُ كُلَّهَا وَ لَمْ يُفَوِّضْ إِلَيْهِ أَنْ يَكُونَ ذَلِيلًا أَ مَا تَسْمَعُ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ يَقُولُ وَ لِلَّهِ الْعِزَّةُ وَ لِرَسُولِهِ وَ لِلْمُؤْمِنِينَ فَالْمُؤْمِنُ يَكُونُ عَزِيزاً وَ لَا يَكُونُ ذَلِيلًا ",
          "ثُمَّ قَالَ إِنَّ الْمُؤْمِنَ أَعَزُّ مِنَ الْجَبَلِ إِنَّ الْجَبَلَ يُسْتَقَلُّ مِنْهُ بِالْمَعَاوِلِ وَ الْمُؤْمِنَ لَا يُسْتَقَلُّ مِنْ دِينِهِ شَيْ‏ءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Al Husayn, from Ibrahim Bin Is’haq Al Ahmar, from Abdullah Bin Hammad Al Ansary, from Abdullah Bin Sinan, from Abu Al Hassan Al Ahmasy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Allah<sup>azwj</sup> Mighty and Majestic has Authorised to the Believer, all of his affairs but did not Authorise for him that he suffers from humiliated. Have you not heard the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:63#h8\">[63:8]</a> and to Allah belongs the Honour and to His Rasool and to the Believers</span>. So the Believer happens to be honourable and cannot happen to be humiliated’. ",
            "Then he<sup>asws</sup> said: ‘The Believer is more honourable than the mountain. The mountain, there can be a reduction from it with the pick-axes, and the Believer, nothing can be reduced from his Religion’."
          ],
          "en.sarwar": [
            "1. Muhammad in Al-Husayn has narrated from Ibrahim ibn Ishaq al-Ahmar from ‘Abd Allah ibn Hammad al-Ansariy from ‘Abd Allah ibn Sinan from abu al-Hassan al-Ahmasiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘ Allah, the most Majestic, the most Glorious, has delegated all affairs of a believer to him but He has not delegated him to humiliate himself. Have you not heard the words of Allah, the most Majestic, the most Glorious, “All honor belongs to Allah, His Messenger and the believers. . . .” <a href=\"/#/books/quran:63#h7\">[63:7]</a> Thus, believers are honorable but not lowly and humiliated.’ He then said, ‘All believers are more majestic than mountains. Mountains are reducible by picks and shovels but believers are not reducible, even in small amounts, in matters of their religion.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/412)"
        ],
        "index": 8293,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:32:2",
        "refs": {
          "Mentions": [
            "/books/quran:63:8",
            "/books/quran:63:7"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَوَّضَ إِلَى الْمُؤْمِنِ أُمُورَهُ كُلَّهَا وَ لَمْ يُفَوِّضْ إِلَيْهِ أَنْ يُذِلَّ نَفْسَهُ أَ لَمْ تَسْمَعْ لِقَوْلِ اللَّهِ عَزَّ وَ جَلَّ وَ لِلَّهِ الْعِزَّةُ وَ لِرَسُولِهِ وَ لِلْمُؤْمِنِينَ فَالْمُؤْمِنُ يَنْبَغِي أَنْ يَكُونَ عَزِيزاً وَ لَا يَكُونَ ذَلِيلًا يُعِزُّهُ اللَّهُ بِالْإِيمَانِ وَ الْإِسْلَامِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic Authorised to the Believer, all of his affairs but did not Authorise to him that he may let himself to be humiliated. Have you not listened to the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:63#h8\">[63:8]</a> and to Allah belongs the Honour and to His Rasool and to the Believers</span>? So the Believer, it is befitting for him to become honourable and not become humiliated. Allah<sup>azwj</sup> Honours him with the belief and Al-Islam’."
          ],
          "en.sarwar": [
            "2. A number of our people have narrated from Ahmad ibn Muhammad from ‘Uthaman ibn ’Isa from Sama‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Allah, the most Majestic, the most Glorious, has delegated all affairs of believers to them but He has not delegated him to humiliate himself. Have you not heard the words of Allah, the most Majestic, the most Glorious, “All honors belongs to Allah, His Messenger and the believers. . .” <a href=\"/#/books/quran:63#h7\">[63:7]</a> Believers must stay honorable but not lowly and humiliated. Allah has granted them honor through al-Islam and belief.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن أو موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/412)"
        ],
        "index": 8294,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:32:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ مُسْكَانَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى فَوَّضَ إِلَى الْمُؤْمِنِ كُلَّ شَيْ‏ءٍ إِلَّا إِذْلَالَ نَفْسِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Usman Bin Isa, from Abdullah Bin Muskan, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that: ‘Allah<sup>azwj</sup> Blessed and High Authorised everything to the Believer except the humiliation of himself’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from his father from ‘Uthaman ibn ‘Isa from ‘Abd Allah ibn Muskan from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the most Blessed, the most High, has delegated all affairs of believers to them except their humiliating themselves.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/412)"
        ],
        "index": 8295,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:32:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ لَا يَنْبَغِي لِلْمُؤْمِنِ أَنْ يُذِلَّ نَفْسَهُ قِيلَ لَهُ وَ كَيْفَ يُذِلُّ نَفْسَهُ قَالَ يَتَعَرَّضُ لِمَا لَا يُطِيقُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Mahboub, from Dawood Al Raqqy who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying: ‘It is not befitting for the Believer that he humiliates himself’. It was said to him<sup>asws</sup>, ‘And how does he humiliate himself?’ He<sup>asws</sup> said: ‘By exposing himself to what he cannot endure’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from al-Hassan ibn Mahbub from Dawud al-Riqqiy who has said the following: “I heard abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘Believers must not humiliate themselves.’ It was asked, ‘How can one humiliate himself?’ He (the Imam) replied, ‘This happens when he does things that are not bearable.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/412)"
        ],
        "index": 8296,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:32:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ مُفَضَّلِ بْنِ عُمَرَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) لَا يَنْبَغِي لِلْمُؤْمِنِ أَنْ يُذِلَّ نَفْسَهُ قُلْتُ بِمَا يُذِلُّ نَفْسَهُ قَالَ يَدْخُلُ فِيمَا يَتَعَذَّرُ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Muhammad Bin Sinan, from Mufazzal Bin Umar who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘It is not befitting for the Believer that he humiliates himself’. I said, ‘With what does he humiliate himself?’ He<sup>asws</sup> said: ‘He indulges in what he cannot do from his (resources)’."
          ],
          "en.sarwar": [
            "5. A number of our people have narrated from Ahmad ibn Muhammad ibn Khalid from his father from Muhammad ibn Sinan from Mufaddal ibn ‘Umar who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘A believer must not humiliate himself.’ I then asked, ‘In what way can he humiliate himself?’ He (the Imam) replied, ‘He can do so by involving himself in things that he cannot do.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (8/413)"
        ],
        "index": 8297,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:32:6",
        "refs": {
          "Mentions": [
            "/books/quran:63:8",
            "/books/quran:63:7"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ أَحْمَدَ عَنْ عَبْدِ اللَّهِ بْنِ الصَّلْتِ عَنْ يُونُسَ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ فَوَّضَ إِلَى الْمُؤْمِنِ أُمُورَهُ كُلَّهَا وَ لَمْ يُفَوِّضْ إِلَيْهِ أَنْ يُذِلَّ نَفْسَهُ أَ لَمْ يَرَ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ هَاهُنَا وَ لِلَّهِ الْعِزَّةُ وَ لِرَسُولِهِ وَ لِلْمُؤْمِنِينَ وَ الْمُؤْمِنُ يَنْبَغِي لَهُ أَنْ يَكُونَ عَزِيزاً وَ لَا يَكُونَ ذَلِيلًا . "
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ahmad, from Abdullah Bin Al Salt, from Yunus, from Sama’at, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that: ‘Allah<sup>azwj</sup> Mighty and Majestic Authorise to the Believer, all of his affairs, but did not Authorise to him that he humiliates himself. Have you not seen the Words of Allah<sup>azwj</sup> Mighty and Majestic over here <span class=\"ibTxt\"><a href=\"/#/books/quran:63#h8\">[63:8]</a> and to Allah belongs the Honour and to His Rasool and to the Believers</span>? And the Believer, it is befitting for him that he happens to be honourable and does not happen to be humiliated."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Ahmad has narrated from ‘Abd Allah ibn al-Salt from Yunus from Sama‘ah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that Allah, the most Majestic, the most Glorious, has delegated all affairs of believers to them but He has not delegated him to humiliate himself. Has he not seen the words of Allah, the most Majestic, the most Glorious: ‘All honor belongs to Allah, His Messenger and the believers. . . .’ <a href=\"/#/books/quran:63#h7\">[63:7]</a> Believers must stand honorable but not humiliated.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:32",
  "kind": "verse_list"
}