{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 5"}, "path": "/books/al-kafi:5", "titles": {"ar": "الجزء الخامس‏", "en": "Volume Five"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:5:1", "titles": {"ar": "كِتَابُ الْجِهَادِ", "en": "THE BOOK OF JIHAD"}}, {"indexed_titles": {"en": "Chapter 4"}, "path": "/books/al-kafi:5:1:4", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَنْ يَجِبُ عَلَيْهِ</span> الْجِهَادُ وَ مَنْ لَا يَجِبُ ", "en": "Chapter 4 – The one upon whom the Jihad is Obligated and the one (upon whom) it is not Obligated"}}], "index": 1183, "local_index": 4, "part_type": "Chapter", "path": "/books/al-kafi:5:1:4", "titles": {"ar": "<span class=\"first-scene-phrase\"><span class=\"first-in-scene\">ب</span>اب مَنْ يَجِبُ عَلَيْهِ</span> الْجِهَادُ وَ مَنْ لَا يَجِبُ ", "en": "Chapter 4 – The one upon whom the Jihad is Obligated and the one (upon whom) it is not Obligated"}, "verse_count": 2, "verse_start_index": 8169, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8170, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:5:1:4:1", "text": ["––––––––", "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ بَكْرِ بْنِ صَالِحٍ عَنِ الْقَاسِمِ بْنِ بُرَيْدٍ عَنْ أَبِي عَمْرٍو الزُّبَيْرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ أَخْبِرْنِي عَنِ الدُّعَاءِ إِلَى اللَّهِ وَ الْجِهَادِ فِي سَبِيلِهِ أَ هُوَ لِقَوْمٍ لَا يَحِلُّ إِلَّا لَهُمْ وَ لَا يَقُومُ بِهِ إِلَّا مَنْ كَانَ مِنْهُمْ أَمْ هُوَ مُبَاحٌ لِكُلِّ مَنْ وَحَّدَ اللَّهَ عَزَّ وَ جَلَّ وَ آمَنَ بِرَسُولِهِ ( صلى الله عليه وآله ) وَ مَنْ كَانَ كَذَا فَلَهُ أَنْ يَدْعُوَ إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ إِلَى طَاعَتِهِ وَ أَنْ يُجَاهِدَ فِي سَبِيلِهِ", "فَقَالَ ذَلِكَ لِقَوْمٍ لَا يَحِلُّ إِلَّا لَهُمْ وَ لَا يَقُومُ بِذَلِكَ إِلَّا مَنْ كَانَ مِنْهُمْ قُلْتُ مَنْ أُولَئِكَ قَالَ مَنْ قَامَ بِشَرَائِطِ اللَّهِ عَزَّ وَ جَلَّ فِي الْقِتَالِ وَ الْجِهَادِ عَلَى الْمُجَاهِدِينَ فَهُوَ الْمَأْذُونُ لَهُ فِي الدُّعَاءِ إِلَى اللَّهِ عَزَّ وَ جَلَّ وَ مَنْ لَمْ يَكُنْ قَائِماً بِشَرَائِطِ اللَّهِ عَزَّ وَ جَلَّ فِي الْجِهَادِ عَلَى الْمُجَاهِدِينَ فَلَيْسَ بِمَأْذُونٍ لَهُ فِي الْجِهَادِ وَ لَا الدُّعَاءِ إِلَى اللَّهِ حَتَّى يَحْكُمَ فِي نَفْسِهِ مَا أَخَذَ اللَّهُ عَلَيْهِ مِنْ شَرَائِطَ الْجِهَادِ قُلْتُ فَبَيِّنْ لِي يَرْحَمُكَ اللَّهُ", "قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى أَخْبَرَ [نَبِيَّهُ] فِي كِتَابِهِ الدُّعَاءَ إِلَيْهِ وَ وَصَفَ الدُّعَاةَ إِلَيْهِ فَجَعَلَ ذَلِكَ لَهُمْ دَرَجَاتٍ يُعَرِّفُ بَعْضُهَا بَعْضاً وَ يُسْتَدَلُّ بِبَعْضِهَا عَلَى بَعْضٍ فَأَخْبَرَ أَنَّهُ تَبَارَكَ وَ تَعَالَى أَوَّلُ مَنْ دَعَا إِلَى نَفْسِهِ وَ دَعَا إِلَى طَاعَتِهِ وَ اتِّبَاعِ أَمْرِهِ فَبَدَأَ بِنَفْسِهِ فَقَالَ وَ اللَّهُ يَدْعُوا إِلى دارِ السَّلامِ وَ يَهْدِي مَنْ يَشاءُ إِلى صِراطٍ مُسْتَقِيمٍ", "ثُمَّ ثَنَّى بِرَسُولِهِ فَقَالَ ادْعُ إِلى سَبِيلِ رَبِّكَ بِالْحِكْمَةِ وَ الْمَوْعِظَةِ الْحَسَنَةِ وَ جادِلْهُمْ بِالَّتِي هِيَ أَحْسَنُ يَعْنِي بِالْقُرْآنِ وَ لَمْ يَكُنْ دَاعِياً إِلَى اللَّهِ عَزَّ وَ جَلَّ مَنْ خَالَفَ أَمْرَ اللَّهِ وَ يَدْعُو إِلَيْهِ بِغَيْرِ مَا أُمِرَ [بِهِ] فِي كِتَابِهِ وَ الَّذِي أَمَرَ أَنْ لَا يُدْعَى إِلَّا بِهِ وَ قَالَ فِي نَبِيِّهِ ( صلى الله عليه وآله ) وَ إِنَّكَ لَتَهْدِي إِلى صِراطٍ مُسْتَقِيمٍ يَقُولُ تَدْعُو", "ثُمَّ ثَلَّثَ بِالدُّعَاءِ إِلَيْهِ بِكِتَابِهِ أَيْضاً فَقَالَ تَبَارَكَ وَ تَعَالَى إِنَّ هذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ أَيْ يَدْعُو وَ يُبَشِّرُ الْمُؤْمِنِينَ", "ثُمَّ ذَكَرَ مَنْ أَذِنَ لَهُ فِي الدُّعَاءِ إِلَيْهِ بَعْدَهُ وَ بَعْدَ رَسُولِهِ فِي كِتَابِهِ فَقَالَ وَ لْتَكُنْ مِنْكُمْ أُمَّةٌ يَدْعُونَ إِلَى الْخَيْرِ وَ يَأْمُرُونَ بِالْمَعْرُوفِ وَ يَنْهَوْنَ عَنِ الْمُنْكَرِ وَ أُولئِكَ هُمُ الْمُفْلِحُونَ", "ثُمَّ أَخْبَرَ عَنْ هَذِهِ الْأُمَّةِ وَ مِمَّنْ هِيَ وَ أَنَّهَا مِنْ ذُرِّيَّةِ إِبْرَاهِيمَ وَ مِنْ ذُرِّيَّةِ إِسْمَاعِيلَ مِنْ سُكَّانِ الْحَرَمِ مِمَّنْ لَمْ يَعْبُدُوا غَيْرَ اللَّهِ قَطُّ الَّذِينَ وَجَبَتْ لَهُمُ الدَّعْوَةُ دَعْوَةُ إِبْرَاهِيمَ وَ إِسْمَاعِيلَ مِنْ أَهْلِ الْمَسْجِدِ الَّذِينَ أَخْبَرَ عَنْهُمْ فِي كِتَابِهِ أَنَّهُ أَذْهَبَ عَنْهُمُ الرِّجْسَ وَ طَهَّرَهُمْ تَطْهِيراً الَّذِينَ وَصَفْنَاهُمْ قَبْلَ هَذَا فِي صِفَةِ أُمَّةِ إِبْرَاهِيمَ ( عليه السلام ) الَّذِينَ عَنَاهُمُ اللَّهُ تَبَارَكَ وَ تَعَالَى فِي قَوْلِهِ أَدْعُوا إِلَى اللَّهِ عَلى بَصِيرَةٍ أَنَا وَ مَنِ اتَّبَعَنِي يَعْنِي أَوَّلَ مَنِ اتَّبَعَهُ عَلَى الْإِيمَانِ بِهِ وَ التَّصْدِيقِ لَهُ بِمَا جَاءَ بِهِ مِنْ عِنْدِ اللَّهِ عَزَّ وَ جَلَّ مِنَ الْأُمَّةِ الَّتِي بُعِثَ فِيهَا وَ مِنْهَا وَ إِلَيْهَا قَبْلَ الْخَلْقِ مِمَّنْ لَمْ يُشْرِكْ بِاللَّهِ قَطُّ وَ لَمْ يَلْبِسْ إِيمَانَهُ بِظُلْمٍ وَ هُوَ الشِّرْكُ ", "ثُمَّ ذَكَرَ أَتْبَاعَ نَبِيِّهِ ( صلى الله عليه وآله ) وَ أَتْبَاعَ هَذِهِ الْأُمَّةِ الَّتِي وَصَفَهَا فِي كِتَابِهِ بِالْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ وَ جَعَلَهَا دَاعِيَةً إِلَيْهِ وَ أَذِنَ لَهَا فِي الدُّعَاءِ إِلَيْهِ فَقَالَ يا أَيُّهَا النَّبِيُّ حَسْبُكَ اللَّهُ وَ مَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ", "ثُمَّ وَصَفَ أَتْبَاعَ نَبِيِّهِ ( صلى الله عليه وآله ) مِنَ الْمُؤْمِنِينَ فَقَالَ عَزَّ وَ جَلَّ مُحَمَّدٌ رَسُولُ اللَّهِ وَ الَّذِينَ مَعَهُ أَشِدَّاءُ عَلَى الْكُفَّارِ رُحَماءُ بَيْنَهُمْ تَراهُمْ رُكَّعاً سُجَّداً يَبْتَغُونَ فَضْلًا مِنَ اللَّهِ وَ رِضْواناً سِيماهُمْ فِي وُجُوهِهِمْ مِنْ أَثَرِ السُّجُودِ ذلِكَ مَثَلُهُمْ فِي التَّوْراةِ وَ مَثَلُهُمْ فِي الْإِنْجِيلِ ", "وَ قَالَ يَوْمَ لا يُخْزِي اللَّهُ النَّبِيَّ وَ الَّذِينَ آمَنُوا مَعَهُ نُورُهُمْ يَسْعى بَيْنَ أَيْدِيهِمْ وَ بِأَيْمانِهِمْ يَعْنِي أُولَئِكَ الْمُؤْمِنِينَ وَ قَالَ قَدْ أَفْلَحَ الْمُؤْمِنُونَ", "ثُمَّ حَلَّاهُمْ وَ وَصَفَهُمْ كَيْ لَا يَطْمَعَ فِي اللِّحَاقِ بِهِمْ إِلَّا مَنْ كَانَ مِنْهُمْ فَقَالَ فِيمَا حَلَّاهُمْ بِهِ وَ وَصَفَهُمْ الَّذِينَ هُمْ فِي صَلاتِهِمْ خاشِعُونَ وَ الَّذِينَ هُمْ عَنِ اللَّغْوِ مُعْرِضُونَ إِلَى قَوْلِهِ أُولئِكَ هُمُ الْوارِثُونَ الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيها خالِدُونَ", "وَ قَالَ فِي  صِفَتِهِمْ وَ حِلْيَتِهِمْ أَيْضاً الَّذِينَ لا يَدْعُونَ مَعَ اللَّهِ إِلهاً آخَرَ وَ لا يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ وَ لا يَزْنُونَ وَ مَنْ يَفْعَلْ ذلِكَ يَلْقَ أَثاماً يُضاعَفْ لَهُ الْعَذابُ يَوْمَ الْقِيامَةِ وَ يَخْلُدْ فِيهِ مُهاناً", "ثُمَّ أَخْبَرَ أَنَّهُ اشْتَرَى مِنْ هَؤُلَاءِ الْمُؤْمِنِينَ وَ مَنْ كَانَ عَلَى مِثْلِ صِفَتِهِمْ أَنْفُسَهُمْ وَ أَمْوالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ يُقاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَ يُقْتَلُونَ وَعْداً عَلَيْهِ حَقًّا فِي التَّوْراةِ وَ الْإِنْجِيلِ وَ الْقُرْآنِ", "ثُمَّ ذَكَرَ وَفَاءَهُمْ لَهُ بِعَهْدِهِ وَ مُبَايَعَتِهِ فَقَالَ وَ مَنْ أَوْفى بِعَهْدِهِ مِنَ اللَّهِ فَاسْتَبْشِرُوا بِبَيْعِكُمُ الَّذِي بايَعْتُمْ بِهِ وَ ذلِكَ هُوَ الْفَوْزُ الْعَظِيمُ", "فَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ إِنَّ اللَّهَ اشْتَرى مِنَ الْمُؤْمِنِينَ أَنْفُسَهُمْ وَ أَمْوالَهُمْ بِأَنَّ لَهُمُ الْجَنَّةَ قَامَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا نَبِيَّ اللَّهِ أَ رَأَيْتَكَ الرَّجُلُ يَأْخُذُ سَيْفَهُ فَيُقَاتِلُ حَتَّى يُقْتَلَ إِلَّا أَنَّهُ يَقْتَرِفُ مِنْ هَذِهِ الْمَحَارِمِ أَ شَهِيدٌ هُوَ فَأَنْزَلَ اللَّهُ عَزَّ وَ جَلَّ عَلَى رَسُولِهِ التَّائِبُونَ الْعابِدُونَ الْحامِدُونَ السَّائِحُونَ الرَّاكِعُونَ السَّاجِدُونَ الْآمِرُونَ بِالْمَعْرُوفِ وَ النَّاهُونَ عَنِ الْمُنْكَرِ وَ الْحافِظُونَ لِحُدُودِ اللَّهِ وَ بَشِّرِ الْمُؤْمِنِينَ ", "فَفَسَّرَ النَّبِيُّ ( صلى الله عليه وآله ) الْمُجَاهِدِينَ مِنَ الْمُؤْمِنِينَ الَّذِينَ هَذِهِ صِفَتُهُمْ وَ حِلْيَتُهُمْ بِالشَّهَادَةِ وَ الْجَنَّةِ وَ قَالَ التَّائِبُونَ مِنَ الذُّنُوبِ الْعَابِدُونَ الَّذِينَ لَا يَعْبُدُونَ إِلَّا اللَّهَ وَ لَا يُشْرِكُونَ بِهِ شَيْئاً الْحَامِدُونَ الَّذِينَ يَحْمَدُونَ اللَّهَ عَلَى كُلِّ حَالٍ فِي الشِّدَّةِ وَ الرَّخَاءِ السَّائِحُونَ وَ هُمُ الصَّائِمُونَ الرَّاكِعُونَ السَّاجِدُونَ الَّذِينَ يُوَاظِبُونَ عَلَى الصَّلَوَاتِ الْخَمْسِ وَ الْحَافِظُونَ لَهَا وَ الْمُحَافِظُونَ عَلَيْهَا بِرُكُوعِهَا وَ سُجُودِهَا وَ فِي الْخُشُوعِ فِيهَا وَ فِي أَوْقَاتِهَا الْآمِرُونَ بِالْمَعْرُوفِ بَعْدَ ذَلِكَ وَ الْعَامِلُونَ بِهِ وَ النَّاهُونَ عَنِ الْمُنْكَرِ وَ الْمُنْتَهُونَ عَنْهُ ", "قَالَ فَبَشِّرْ مَنْ قُتِلَ وَ هُوَ قَائِمٌ بِهَذِهِ الشُّرُوطِ بِالشَّهَادَةِ وَ الْجَنَّةِ ثُمَّ أَخْبَرَ تَبَارَكَ وَ تَعَالَى أَنَّهُ لَمْ يَأْمُرْ بِالْقِتَالِ إِلَّا أَصْحَابَ هَذِهِ الشُّرُوطِ فَقَالَ عَزَّ وَ جَلَّ أُذِنَ لِلَّذِينَ يُقاتَلُونَ بِأَنَّهُمْ ظُلِمُوا وَ إِنَّ اللَّهَ عَلى نَصْرِهِمْ لَقَدِيرٌ الَّذِينَ أُخْرِجُوا مِنْ دِيارِهِمْ بِغَيْرِ حَقٍّ إِلَّا أَنْ يَقُولُوا رَبُّنَا اللَّهُ", "وَ ذَلِكَ أَنَّ جَمِيعَ مَا بَيْنَ السَّمَاءِ وَ الْأَرْضِ لِلَّهِ عَزَّ وَ جَلَّ وَ لِرَسُولِهِ وَ لِأَتْبَاعِهِمَا مِنَ الْمُؤْمِنِينَ مِنْ أَهْلِ هَذِهِ الصِّفَةِ فَمَا كَانَ مِنَ الدُّنْيَا فِي أَيْدِي الْمُشْرِكِينَ وَ الْكُفَّارِ وَ الظَّلَمَةِ وَ الْفُجَّارِ مِنْ أَهْلِ الْخِلَافِ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الْمُوَلِّي عَنْ طَاعَتِهِمَا مِمَّا كَانَ فِي أَيْدِيهِمْ ظَلَمُوا فِيهِ الْمُؤْمِنِينَ مِنْ أَهْلِ هَذِهِ الصِّفَاتِ وَ غَلَبُوهُمْ عَلَيْهِ", "مِمَّا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ فَهُوَ حَقُّهُمْ أَفَاءَ اللَّهُ عَلَيْهِمْ وَ رَدَّهُ إِلَيْهِمْ وَ إِنَّمَا مَعْنَى الْفَيْ‏ءِ كُلُّ مَا صَارَ إِلَى الْمُشْرِكِينَ ثُمَّ رَجَعَ مِمَّا كَانَ قَدْ غُلِبَ عَلَيْهِ أَوْ فِيهِ فَمَا رَجَعَ إِلَى مَكَانِهِ مِنْ قَوْلٍ أَوْ فِعْلٍ فَقَدْ فَاءَ مِثْلُ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ لِلَّذِينَ يُؤْلُونَ مِنْ نِسائِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ فَإِنْ فاؤُ فَإِنَّ اللَّهَ غَفُورٌ رَحِيمٌ أَيْ رَجَعُوا ثُمَّ قَالَ وَ إِنْ عَزَمُوا الطَّلاقَ فَإِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ", "وَ قَالَ وَ إِنْ طائِفَتانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُما فَإِنْ بَغَتْ إِحْداهُما عَلَى الْأُخْرى فَقاتِلُوا الَّتِي تَبْغِي حَتَّى تَفِي‏ءَ إِلى أَمْرِ اللَّهِ أَيْ تَرْجِعَ فَإِنْ فاءَتْ أَيْ رَجَعَتْ فَأَصْلِحُوا بَيْنَهُما بِالْعَدْلِ وَ أَقْسِطُوا إِنَّ اللَّهَ يُحِبُّ الْمُقْسِطِينَ يَعْنِي بِقَوْلِهِ تَفِي‏ءَ تَرْجِعَ فَذَلِكَ الدَّلِيلُ عَلَى أَنَّ الْفَيْ‏ءَ كُلُّ رَاجِعٍ إِلَى مَكَانٍ قَدْ كَانَ عَلَيْهِ أَوْ فِيهِ وَ يُقَالُ لِلشَّمْسِ إِذَا زَالَتْ قَدْ فَاءَتِ الشَّمْسُ حِينَ يَفِي‏ءُ الْفَيْ‏ءُ عِنْدَ رُجُوعِ الشَّمْسِ إِلَى زَوَالِهَا", "وَ كَذَلِكَ مَا أَفَاءَ اللَّهُ عَلَى الْمُؤْمِنِينَ مِنَ الْكُفَّارِ فَإِنَّمَا هِيَ حُقُوقُ الْمُؤْمِنِينَ رَجَعَتْ إِلَيْهِمْ بَعْدَ ظُلْمِ الْكُفَّارِ إِيَّاهُمْ فَذَلِكَ قَوْلُهُ أُذِنَ لِلَّذِينَ يُقاتَلُونَ بِأَنَّهُمْ ظُلِمُوا مَا كَانَ الْمُؤْمِنُونَ أَحَقَّ بِهِ مِنْهُمْ ", "وَ إِنَّمَا أُذِنَ لِلْمُؤْمِنِينَ الَّذِينَ قَامُوا بِشَرَائِطِ الْإِيمَانِ الَّتِي وَصَفْنَاهَا وَ ذَلِكَ أَنَّهُ لَا يَكُونُ مَأْذُوناً لَهُ فِي الْقِتَالِ حَتَّى يَكُونَ مَظْلُوماً وَ لَا يَكُونُ مَظْلُوماً حَتَّى يَكُونَ مُؤْمِناً وَ لَا يَكُونُ مُؤْمِناً حَتَّى يَكُونَ قَائِماً بِشَرَائِطِ الْإِيمَانِ الَّتِي اشْتَرَطَ اللَّهُ عَزَّ وَ جَلَّ عَلَى الْمُؤْمِنِينَ وَ الْمُجَاهِدِينَ", "فَإِذَا تَكَامَلَتْ فِيهِ شَرَائِطُ اللَّهِ عَزَّ وَ جَلَّ كَانَ مُؤْمِناً وَ إِذَا كَانَ مُؤْمِناً كَانَ مَظْلُوماً وَ إِذَا كَانَ مَظْلُوماً كَانَ مَأْذُوناً لَهُ فِي الْجِهَادِ لِقَوْلِهِ عَزَّ وَ جَلَّ أُذِنَ لِلَّذِينَ يُقاتَلُونَ بِأَنَّهُمْ ظُلِمُوا وَ إِنَّ اللَّهَ عَلى نَصْرِهِمْ لَقَدِيرٌ", "وَ إِنْ لَمْ يَكُنْ مُسْتَكْمِلًا لِشَرَائِطِ الْإِيمَانِ فَهُوَ ظَالِمٌ مِمَّنْ يَبْغِي وَ يَجِبُ جِهَادُهُ حَتَّى يَتُوبَ وَ لَيْسَ مِثْلُهُ مَأْذُوناً لَهُ فِي الْجِهَادِ وَ الدُّعَاءِ إِلَى اللَّهِ عَزَّ وَ جَلَّ لِأَنَّهُ لَيْسَ مِنَ الْمُؤْمِنِينَ الْمَظْلُومِينَ الَّذِينَ أُذِنَ لَهُمْ فِي الْقُرْآنِ فِي الْقِتَالِ", "فَلَمَّا نَزَلَتْ هَذِهِ الْآيَةُ أُذِنَ لِلَّذِينَ يُقاتَلُونَ بِأَنَّهُمْ ظُلِمُوا فِي الْمُهَاجِرِينَ الَّذِينَ أَخْرَجَهُمْ أَهْلُ مَكَّةَ مِنْ دِيَارِهِمْ وَ أَمْوَالِهِمْ أُحِلَّ لَهُمْ جِهَادُهُمْ بِظُلْمِهِمْ إِيَّاهُمْ وَ أُذِنَ لَهُمْ فِي الْقِتَالِ فَقُلْتُ فَهَذِهِ نَزَلَتْ فِي الْمُهَاجِرِينَ بِظُلْمِ مُشْرِكِي أَهْلِ مَكَّةَ لَهُمْ فَمَا بَالُهُمْ فِي قِتَالِهِمْ كِسْرَى وَ قَيْصَرَ وَ مَنْ دُونَهُمْ مِنْ مُشْرِكِي قَبَائِلِ الْعَرَبِ", "فَقَالَ لَوْ كَانَ إِنَّمَا أُذِنَ لَهُمْ فِي قِتَالِ مَنْ ظَلَمَهُمْ مِنْ أَهْلِ مَكَّةَ فَقَطْ لَمْ يَكُنْ لَهُمْ إِلَى قِتَالِ جُمُوعِ كِسْرَى وَ قَيْصَرَ وَ غَيْرِ أَهْلِ مَكَّةَ مِنْ قَبَائِلِ الْعَرَبِ سَبِيلٌ لِأَنَّ الَّذِينَ ظَلَمُوهُمْ غَيْرُهُمْ وَ إِنَّمَا أُذِنَ لَهُمْ فِي قِتَالِ مَنْ ظَلَمَهُمْ مِنْ أَهْلِ مَكَّةَ لِإِخْرَاجِهِمْ إِيَّاهُمْ مِنْ دِيَارِهِمْ وَ أَمْوَالِهِمْ بِغَيْرِ حَقٍّ وَ لَوْ كَانَتِ الْآيَةُ إِنَّمَا عَنَتِ الْمُهَاجِرِينَ الَّذِينَ ظَلَمَهُمْ أَهْلُ مَكَّةَ كَانَتِ الْآيَةُ مُرْتَفِعَةَ الْفَرْضِ عَمَّنْ بَعْدَهُمْ إِذَا لَمْ يَبْقَ مِنَ الظَّالِمِينَ وَ الْمَظْلُومِينَ أَحَدٌ وَ كَانَ فَرْضُهَا مَرْفُوعاً عَنِ النَّاسِ بَعْدَهُمْ [إِذَا لَمْ يَبْقَ مِنَ الظَّالِمِينَ وَ الْمَظْلُومِينَ أَحَدٌ]", "وَ لَيْسَ كَمَا ظَنَنْتَ وَ لَا كَمَا ذَكَرْتَ وَ لَكِنَّ الْمُهَاجِرِينَ ظُلِمُوا مِنْ جِهَتَيْنِ ظَلَمَهُمْ أَهْلُ مَكَّةَ بِإِخْرَاجِهِمْ مِنْ دِيَارِهِمْ وَ أَمْوَالِهِمْ فَقَاتَلُوهُمْ بِإِذْنِ اللَّهِ لَهُمْ فِي ذَلِكَ وَ ظَلَمَهُمْ كِسْرَى وَ قَيْصَرُ وَ مَنْ كَانَ دُونَهُمْ مِنْ قَبَائِلِ الْعَرَبِ وَ الْعَجَمِ بِمَا كَانَ فِي أَيْدِيهِمْ مِمَّا كَانَ الْمُؤْمِنُونَ أَحَقَّ بِهِ مِنْهُمْ فَقَدْ قَاتَلُوهُمْ بِإِذْنِ اللَّهِ عَزَّ وَ جَلَّ لَهُمْ فِي ذَلِكَ وَ بِحُجَّةِ هَذِهِ الْآيَةِ يُقَاتِلُ مُؤْمِنُو كُلِّ زَمَانٍ", "وَ إِنَّمَا أَذِنَ اللَّهُ عَزَّ وَ جَلَّ لِلْمُؤْمِنِينَ الَّذِينَ قَامُوا بِمَا وَصَفَهَا اللَّهُ عَزَّ وَ جَلَّ مِنَ الشَّرَائِطِ الَّتِي شَرَطَهَا اللَّهُ عَلَى الْمُؤْمِنِينَ فِي الْإِيمَانِ وَ الْجِهَادِ وَ مَنْ كَانَ قَائِماً بِتِلْكَ الشَّرَائِطِ فَهُوَ مُؤْمِنٌ وَ هُوَ مَظْلُومٌ وَ مَأْذُونٌ لَهُ فِي الْجِهَادِ بِذَلِكَ الْمَعْنَى ", "وَ مَنْ كَانَ عَلَى خِلَافِ ذَلِكَ فَهُوَ ظَالِمٌ وَ لَيْسَ مِنَ الْمَظْلُومِينَ وَ لَيْسَ بِمَأْذُونٍ لَهُ فِي الْقِتَالِ وَ لَا بِالنَّهْيِ عَنِ الْمُنْكَرِ وَ الْأَمْرِ بِالْمَعْرُوفِ لِأَنَّهُ لَيْسَ مِنْ أَهْلِ ذَلِكَ وَ لَا مَأْذُونٍ لَهُ فِي الدُّعَاءِ إِلَى اللَّهِ عَزَّ وَ جَلَّ لِأَنَّهُ لَيْسَ يُجَاهِدُ مِثْلُهُ وَ أُمِرَ بِدُعَائِهِ إِلَى اللَّهِ", "وَ لَا يَكُونُ مُجَاهِداً مَنْ قَدْ أُمِرَ الْمُؤْمِنُونَ بِجِهَادِهِ وَ حَظَرَ الْجِهَادَ عَلَيْهِ وَ مَنَعَهُ مِنْهُ وَ لَا يَكُونُ دَاعِياً إِلَى اللَّهِ عَزَّ وَ جَلَّ مَنْ أُمِرَ بِدُعَاءِ مِثْلِهِ إِلَى التَّوْبَةِ وَ الْحَقِّ وَ الْأَمْرِ بِالْمَعْرُوفِ وَ النَّهْيِ عَنِ الْمُنْكَرِ وَ لَا يَأْمُرُ بِالْمَعْرُوفِ مَنْ قَدْ أُمِرَ أَنْ يُؤْمَرَ بِهِ وَ لَا يَنْهَى عَنِ الْمُنْكَرِ مَنْ قَدْ أُمِرَ أَنْ يُنْهَى عَنْهُ", "فَمَنْ كَانَتْ قَدْ تَمَّتْ فِيهِ شَرَائِطُ اللَّهِ عَزَّ وَ جَلَّ الَّتِي وُصِفَ بِهَا أَهْلُهَا مِنْ أَصْحَابِ النَّبِيِّ ( صلى الله عليه وآله ) وَ هُوَ مَظْلُومٌ فَهُوَ مَأْذُونٌ لَهُ فِي الْجِهَادِ كَمَا أُذِنَ لَهُمْ فِي الْجِهَادِ لِأَنَّ حُكْمَ اللَّهِ عَزَّ وَ جَلَّ فِي الْأَوَّلِينَ وَ الْآخِرِينَ وَ فَرَائِضَهُ عَلَيْهِمْ سَوَاءٌ إِلَّا مِنْ عِلَّةٍ أَوْ حَادِثٍ يَكُونُ", "وَ الْأَوَّلُونَ وَ الْآخِرُونَ أَيْضاً فِي مَنْعِ الْحَوَادِثِ شُرَكَاءُ وَ الْفَرَائِضُ عَلَيْهِمْ وَاحِدَةٌ يُسْأَلُ الْآخِرُونَ عَنْ أَدَاءِ الْفَرَائِضِ عَمَّا يُسْأَلُ عَنْهُ الْأَوَّلُونَ وَ يُحَاسَبُونَ عَمَّا بِهِ يُحَاسَبُونَ وَ مَنْ لَمْ يَكُنْ عَلَى صِفَةِ مَنْ أَذِنَ اللَّهُ لَهُ فِي الْجِهَادِ مِنَ الْمُؤْمِنِينَ فَلَيْسَ مِنْ أَهْلِ الْجِهَادِ وَ لَيْسَ بِمَأْذُونٍ لَهُ فِيهِ حَتَّى يَفِي‏ءَ بِمَا شَرَطَ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ", "فَإِذَا تَكَامَلَتْ فِيهِ شَرَائِطُ اللَّهِ عَزَّ وَ جَلَّ عَلَى الْمُؤْمِنِينَ وَ الْمُجَاهِدِينَ فَهُوَ مِنَ الْمَأْذُونِينَ لَهُمْ فِي الْجِهَادِ فَلْيَتَّقِ اللَّهَ عَزَّ وَ جَلَّ عَبْدٌ وَ لَا يَغْتَرَّ بِالْأَمَانِيِّ الَّتِي نَهَى اللَّهُ عَزَّ وَ جَلَّ عَنْهَا مِنْ هَذِهِ الْأَحَادِيثِ الْكَاذِبَةِ عَلَى اللَّهِ الَّتِي يُكَذِّبُهَا الْقُرْآنُ وَ يَتَبَرَّأُ مِنْهَا وَ مِنْ حَمَلَتِهَا وَ رُوَاتِهَا", "وَ لَا يَقْدَمُ عَلَى اللَّهِ عَزَّ وَ جَلَّ بِشُبْهَةٍ لَا يُعْذَرُ بِهَا فَإِنَّهُ لَيْسَ وَرَاءَ الْمُتَعَرِّضِ لِلْقَتْلِ فِي سَبِيلِ اللَّهِ مَنْزِلَةٌ يُؤْتَى اللَّهُ مِنْ قِبَلِهَا وَ هِيَ غَايَةُ الْأَعْمَالِ فِي عِظَمِ قَدْرِهَا فَلْيَحْكُمِ امْرُؤٌ لِنَفْسِهِ وَ لْيُرِهَا كِتَابَ اللَّهِ عَزَّ وَ جَلَّ وَ يَعْرِضُهَا عَلَيْهِ فَإِنَّهُ لَا أَحَدَ أَعْرَفُ بِالْمَرْءِ مِنْ نَفْسِهِ فَإِنْ وَجَدَهَا قَائِمَةً بِمَا شَرَطَ اللَّهُ عَلَيْهِ فِي الْجِهَادِ فَلْيُقْدِمْ عَلَى الْجِهَادِ", "وَ إِنْ عَلِمَ تَقْصِيراً فَلْيُصْلِحْهَا وَ لْيُقِمْهَا عَلَى مَا فَرَضَ اللَّهُ عَلَيْهَا مِنَ الْجِهَادِ ثُمَّ لْيُقْدِمْ بِهَا وَ هِيَ طَاهِرَةٌ مُطَهَّرَةٌ مِنْ كُلِّ دَنَسٍ يَحُولُ بَيْنَهَا وَ بَيْنَ جِهَادِهَا", "وَ لَسْنَا نَقُولُ لِمَنْ أَرَادَ الْجِهَادَ وَ هُوَ عَلَى خِلَافِ مَا وَصَفْنَا مِنْ شَرَائِطِ اللَّهِ عَزَّ وَ جَلَّ عَلَى الْمُؤْمِنِينَ وَ الْمُجَاهِدِينَ لَا تُجَاهِدُوا وَ لَكِنْ نَقُولُ قَدْ عَلَّمْنَاكُمْ مَا شَرَطَ اللَّهُ عَزَّ وَ جَلَّ عَلَى أَهْلِ الْجِهَادِ الَّذِينَ بَايَعَهُمْ وَ اشْتَرَى مِنْهُمْ أَنْفُسَهُمْ وَ أَمْوَالَهُمْ بِالْجِنَانِ", "فَلْيُصْلِحِ امْرُؤٌ مَا عَلِمَ مِنْ نَفْسِهِ مِنْ تَقْصِيرٍ عَنْ ذَلِكَ وَ لْيَعْرِضْهَا عَلَى شَرَائِطِ اللَّهِ فَإِنْ رَأَى أَنَّهُ قَدْ وَفَى بِهَا وَ تَكَامَلَتْ فِيهِ فَإِنَّهُ مِمَّنْ أَذِنَ اللَّهُ عَزَّ وَ جَلَّ لَهُ فِي الْجِهَادِ", "فَإِنْ أَبَى أَنْ لَا يَكُونَ مُجَاهِداً عَلَى مَا فِيهِ مِنَ الْإِصْرَارِ عَلَى الْمَعَاصِي وَ الْمَحَارِمِ وَ الْإِقْدَامِ عَلَى الْجِهَادِ بِالتَّخْبِيطِ وَ الْعَمَى وَ الْقُدُومِ عَلَى اللَّهِ عَزَّ وَ جَلَّ بِالْجَهْلِ وَ الرِّوَايَاتِ الْكَاذِبَةِ فَلَقَدْ لَعَمْرِي جَاءَ الْأَثَرُ فِيمَنْ فَعَلَ هَذَا الْفِعْلَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَنْصُرُ هَذَا الدِّينَ بِأَقْوَامٍ لَا خَلَاقَ لَهُمْ", "فَلْيَتَّقِ اللَّهَ عَزَّ وَ جَلَّ امْرُؤٌ وَ لْيَحْذَرْ أَنْ يَكُونَ مِنْهُمْ فَقَدْ بَيَّنَ لَكُمْ وَ لَا عُذْرَ لَكُمْ بَعْدَ الْبَيَانِ فِي الْجَهْلِ وَ لَا قُوَّةَ إِلَّا بِاللَّهِ وَ حَسْبُنَا اللَّهُ عَلَيْهِ تَوَكَّلْنَا وَ إِلَيْهِ الْمَصِيرُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Bakr Bin Salih, from Al Qasim Bin Bureyd, from Abu Amro Al  Zabeyr, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Inform me about the calling to Allah<sup>azwj</sup> and the Jihad in His<sup>azwj</sup> Way, is it for a (particular) people not being Permissible except for them and it cannot be established by any except for the one who was from them, or is it Permissible for every one who professes to the Oneness of Allah<sup>azwj</sup> Mighty and Majestic and believes in His<sup>azwj</sup> Rasool<sup>saww</sup>? And the one who was that, so for him is that he can call to Allah<sup>azwj</sup> Mighty and Majestic to His<sup>azwj</sup> obedience and that he can strive in His<sup>azwj</sup> Way?’ ", "So he<sup>asws</sup> said: ‘That (Jihad) is for a (particular) people, not being Permissible except for them, and none can establish that except for the one who was from them’. I said, ‘Who are they?’ He<sup>asws</sup> said: ‘The one who stands by the Stipulations (Conditions) of Allah<sup>azwj</sup> Mighty and Majestic with regards to the killing, and the Jihad is upon the combatants. So it is Permissible for him regarding the calling to Allah<sup>azwj</sup> Mighty and Majestic, but the one who does not happen to be standing by the Stipulations of Allah<sup>azwj</sup> Mighty and Majestic with regards to the Jihad upon the combatants, so there is no Permissibility for him regarding the Jihad, and he cannot call to Allah<sup>azwj</sup> until he decides with regards to himself what Allah<sup>azwj</sup> has Taken upon him from the Stipulations of the Jihad’. I said, ‘So explain it to me, may Allah<sup>azwj</sup> have Mercy on you<sup>asws</sup>’. ", "He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Blessed and High Informed His<sup>azwj</sup> Prophet<sup>saww</sup> in His<sup>azwj</sup> Book to call to Him<sup>azwj</sup>, and Described the calling to him. Thus, He<sup>azwj</sup> Made Levels for them to recognise one of it by the other, and Evidenced one upon the other. So He<sup>azwj</sup> Informed that He<sup>azwj</sup> the Blessed and High is the First One Who Calls to Himself<sup>azwj</sup>, and Calls to His<sup>azwj</sup> obedience, and the following of His<sup>azwj</sup> Commands. Thus, He<sup>azwj</sup> Began with Himself<sup>azwj</sup>, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[10:25] And Allah Invites to the House of Al-Salaam and Guides whomsoever He so Desires to the Straight Path</span>.", "Then He<sup>azwj</sup> Seconded by His<sup>azwj</sup> Rasool<sup>saww</sup> so He<sup>azwj</sup> Said <span class=\"ibTxt\">[16:125] Call to the Way of your Lord with the wisdom and goodly exhortation, and have disputations with them by that which is best</span>, Meaning by the Quran, and there has never been a caller to Allah<sup>azwj</sup> Mighty and Majestic, the one who opposed the Commands of Allah<sup>azwj</sup> and called to Him<sup>azwj</sup> without what He<sup>azwj</sup> has Commanded with in His<sup>azwj</sup> Book, and that which He<sup>azwj</sup> Commanded was that he (the caller) should not call except by it (the Quran). And He<sup>azwj</sup> Said regarding His<sup>azwj</sup> Prophet<sup>saww</sup> <span class=\"ibTxt\">[42:52] and most surely you guide the way to the Straight Path</span>, Saying ‘You<sup>saww</sup> call’. ", "Then thirdly by the calling to Him<sup>azwj</sup> by His<sup>azwj</sup> Book, as well, so the Blessed and High Said <span class=\"ibTxt\">[17:9] Surely this Quran Guides to that which is most upright</span>, i.e., calling and giving good news to the Believers. ", "Then He<sup>azwj</sup> Mentioned the ones for whom is the Permission to call to Him<sup>azwj</sup> after Himself<sup>azwj</sup>, and His<sup>azwj</sup> Rasool<sup>saww</sup> in His<sup>azwj</sup> Book, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[3:104] And from among you there should be a community inviting to the better and enjoin what is good and forbid the evil, and these are the ones who shall be successful</span>. ", "Then He<sup>azwj</sup> Informed about this community and from whom it is, and rather it is from the offspring of Ibrahim<sup>as</sup>, and from the offspring of Ismail<sup>as</sup> from the dwellers of the Sanctuary, from the ones<sup>asws</sup> who had not worshipped other than Allah<sup>azwj</sup> at all; those for whom<sup>asws</sup> the calling is Obligated, the calling of Ibrahim<sup>as</sup> and Ismail<sup>as</sup>, from the people of the Masjid whom He<sup>azwj</sup> Informed about them<sup>asws</sup> in His<sup>azwj</sup> Book that He<sup>azwj</sup> Kept-away the uncleanness from them<sup>asws</sup> and Purified them<sup>asws</sup> with a thorough Pufirication (33:33), those<sup>asws</sup> who had been described before this in the description of the community of Ibrahim<sup>as</sup>, those<sup>asws</sup> whom are Meant by Allah<sup>azwj</sup> Blessed and High in His<sup>azwj</sup> Words <span class=\"ibTxt\">[12:108] Say: This is my way: I call to Allah, I and the ones who follow me having insight</span>, meaning the first one who follows him<sup>saww</sup> upon the belief in it, and the raitification for him<sup>saww</sup> with what he<sup>saww</sup> came with from the presence of Allah<sup>azwj</sup> Mighty and Majestic from the community in which he<sup>saww</sup> was Sent, and being from it, and to it, before the (rest of the) people, from the ones<sup>asws</sup> who did no associate with Allah<sup>azwj</sup> at all, and the one<sup>asws</sup> who did not cloth his<sup>asws</sup> belief with the <span class=\"iTxt\">injustice</span>, and it is the association (<span class=\"iTxt\">Shirk</span>).", "Then He<sup>azwj</sup> Mentioned the following of His<sup>azwj</sup> Prophet<sup>saww</sup> and the following of this community which He<sup>azwj</sup> Described in His<sup>azwj</sup> Book with the enjoining of the good and the forbidding from the evil and Made it to be the callers to Him<sup>azwj</sup>, and Permitted for it with regards to the calling to Him<sup>azwj</sup>, so He<sup>azwj</sup> Said <span class=\"ibTxt\">[8:64] O Prophet! Allah is Sufficient for you and such of the Believers as follow you</span>. ", "Then He<sup>azwj</sup> Described the followers of His<sup>azwj</sup> Prophet<sup>saww</sup> from the Believers, so the Mighty and Majestic Said <span class=\"ibTxt\"> [48:29] Muhammad is Rasool-Allah, and those with him are firm of heart against the unbelievers, compassionate among themselves; you will see them bowing down, prostrating themselves, seeking Grace from Allah and Pleasure; their marks are in their faces because of the effect of prostrations; that is their example in the Torah and their example in the Evangel</span>. ", "And He<sup>azwj</sup> Said <span class=\"ibTxt\">[66:8] on the Day on which Allah will not Abase the Prophet and those who believe with him; their Light shall run on in front of them and on their right</span> – Meaning they<sup>asws</sup> are the Believers. And He<sup>azwj</sup> Said <span class=\"ibTxt\">[23:1] Successful indeed are the Believers</span>.", "Then He<sup>azwj</sup> Extolled them<sup>asws</sup> and Described them<sup>asws</sup> <span class=\"ibTxt\">[23:2] Who are humble in their Prayers [23:3] And who turn aside from the vanities [23:4] And who are givers of the Zakat [23:5] And who guard their private parts [23:6] Except before their mates or those whom their right hands possess, for they surely are not blameable [23:7] So the one who seeks to go beyond that, these are they that exceed the limits [23:8] And those who are keepers of their trusts and their covenant [23:9] And those who preserve their Prayers [23:10] These are they who are the inheritors [23:11] Who shall inherit the Firdows; they shall abide therein eternally</span>.", "And He<sup>azwj</sup> Said in their<sup>asws</sup> Description and their<sup>asws</sup> Extolling as well <span class=\"ibTxt\">[25:68] And they who do not call upon another god with Allah and do not slay the soul, which Allah has Forbidden except with the right, nor are they adulterous, and the one who does that would be in sin [25:69] The Punishment shall be doubled to him on the Day of Resurrection, and he shall abide therein eternally in disgrace</span>.", "Then He<sup>azwj</sup> Informed that He<sup>azwj</sup> had Bought from these Believers and the ones who were upon a similar description <span class=\"ibTxt\">[9:111] their own selves and their wealth for this, that they shall have the Paradise; they are fighting in Allah's Way, so they kill and are killed; a Promise which is binding on Him in the Torah and the Evangel and the Quran</span>. ", "Then He<sup>azwj</sup> Mentioned loyalty to be for them<sup>asws</sup>, and covenant and allegiance, so He<sup>azwj</sup> Said <span class=\"ibTxt\">and who is more loyal to his Covenant than Allah? Rejoice therefore in the pledge which you have made; and that is the mighty achievement</span>. ", "So when this Verse was Revealed that <span class=\"ibTxt\">[9:111] Surely Allah has Bought from the Believers their own selves and their wealth for this, that they shall have the Paradise</span>, a man stood up to the Prophet<sup>saww</sup>, so he said, ‘O Prophet<sup>saww</sup> of Allah<sup>azwj</sup>! Do you<sup>saww</sup> view that the man who takes his sword, so he fights until he is killed, except if he were to commit these Prohibition, he would be a martyr?’ So Allah<sup>azwj</sup> Mighty and Majestic Revealed unto His<sup>azwj</sup> Rasool<sup>saww</sup> <span class=\"ibTxt\">[9:112] The penitent, the worshippers, the praisers, the fasters, the powers, the prostraters, the enjoiners of good and the forbidders of evil, the preservers of the Limits of Allah; and give good news to the Believers</span>.", "So the Prophet<sup>saww</sup> interpretated, the combatants from the Believer who are of this being their description and their appearance, with the martyrdom, and the Paradise, and said: ‘The <span class=\"ibTxt\">penitent</span> from the sins, the <span class=\"ibTxt\">worshippers</span> who are not worshipping except for Allah<sup>azwj</sup> and not associating anything with Him<sup>azwj</sup>, the <span class=\"ibTxt\">praisers</span> who are praising Allah<sup>azwj</sup> upon every state, during the difficulties and the ease; and the ones who go forth, and they are the <span class=\"ibTxt\">fasters</span>, the <span class=\"ibTxt\">bowers</span>, the <span class=\"ibTxt\">prostrators</span> who are adhering upon the five Prayers, and the <span class=\"ibTxt\">preservers</span> of these, and the preserving upon these by their bowings and their prostrations, and are being humble during these, and with regards to their timing, the enjoiners of the good after that, and the acting by it, and the fobidders from the evil and preventers from it. ", "He<sup>asws</sup> said: ‘So the good news and the Paradise is for the one who is killed and he is established by these Stipulations. Then the Blessed and high Informed that he would order for the fighting except the one who is the one upon these Stiuplations, so the Mighty and Majestic Said <span class=\"ibTxt\">[22:39] Permission (to fight) is given to those upon whom war is made because they are oppressed, and Allah is well Able to Assist them [22:40] Those who have been expelled from their homes without right except that they say: Our Lord is Allah</span>. ", "And that is because the entirety of what is between the sky and the earth is for Allah<sup>azwj</sup> Mighty and Majestic, and for His<sup>azwj</sup> Rasool<sup>saww</sup>, and the followers of the two, from the Believers from the rightful ones of these descriptions. So whatever was from the world in the hands of the Polytheists, and the Infidels, and the unjust, and the immoral from the people of the adversaries to Rasool-Allah<sup>saww</sup> and the ones turned away from the obedience of them both (Allah<sup>azwj</sup> and Rasool<sup>saww</sup>), from whatever was in their hands is due to them being unjust to the Believers with regards to it, the ones rightful of these descriptions, and their overcoming them<sup>asws</sup>. ", "From what Allah<sup>azwj</sup> had Bestowed upon His<sup>azwj</sup> Rasool<sup>saww</sup>, so it is their<sup>asws</sup> right. Allah<sup>azwj</sup> has Bestowed it upon them<sup>asws</sup>, and Returned it to them, and rather the meaning of <span class=\"iTxt\">Al-Fey</span> (war booty) is everything what went to the Polytheists, then returns from what they had overcome upon, or regarding it. Thus, whatever returns to its place, from words or deeds, so it is Bestowed, like the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[2:226] Those who swear that they will not go in to their wives should wait four months; so if they go back, then Allah is surely Forgiving, Merciful</span>, i.e. returning (فاؤُ). Then He<sup>azwj</sup> Said <span class=\"ibTxt\">[2:227] And if they have resolved upon the divorce, then Allah is surely Hearing, Knowing</span>.", "And He<sup>azwj</sup> Said <span class=\"ibTxt\">[49:9] And if two parties of the believers quarrel, make reconciliation between them; but if one of them acts wrongfully towards the other, fight that which acts wrongfully until it returns to Allah's Command</span>, i.e., returns (تَفِي‏ءَ). So if he (فاءَتْ), i.e., <span class=\"ibTxt\">then if it returns, make reconciliation between them with justice and act equitably; surely Allah loves the equitable people</span> – Meaning by His<sup>azwj</sup> Word ‘Fey’ to Mean return. So that is the proof upon the fact that <span class=\"iTxt\">Al-Fey</span> is everything returning to its place which it was upon or in. And it is said to the sun when it declines, ‘The sun has returned (فَاءَتِ) where the word يَفِي‏ءُ is <span class=\"iTxt\">Al-Fey </span>(الْفَيْ‏ءُ ) upon the returning of the sun to its setting. ", "And similar to that is what Allah<sup>azwj</sup> Bestowed upon the Believers from the Infidels. These are the rights of the Believers which are returning to them after the injustices of the Infidels upon them. So these are His<sup>azwj</sup> Words <span class=\"ibTxt\">[22:39] Permission (to fight) is given to those upon whom war is made because they are oppressed</span> over what the Believers were more rightful with it than them. ", "But rather, it is Permitted for the Believers who stand by the Stipulations of the belief which we<sup>asws</sup> have described, and that is that they are not Permitted for it regarding the fighting until they happen to be oppressed, and they cannot happen to be oppressed until they happen to be Believers, and they cannot happen to be Believers until they are established upon the Stiuplations of the belief which Allah<sup>azwj</sup> Mighty and Majestic has stipulated upon the Believers and the combatants.", "So when the Stiuplations of Allah<sup>azwj</sup> Mighty and Majestic is completed in him, so he would be a Believer, and when he was a Believer so he would be an oppressed one, and when he was an oppressed one, he would be one with a Permission for him regarding the Jihad due to the Words of the Mighty and Majestic <span class=\"ibTxt\">[22:39] Permission (to fight) is given to those upon whom war is made because they are oppressed and Allah is well Able to Assist them</span>.", "And if he does no happen to be completely upon the Stipulations of the belief, so he is an oppressor from the ones who have rebelled and Jihad against him is Obligated until he repents, and the likes of him are not with Permission regarding the Jihad, and the calling to Allah<sup>azwj</sup> Mighty and Majestic because he is not from the Believers, the oppressed ones for whom there is Permission for them in the Quran regarding the fighting. ", "So when this Verse was Revealed <span class=\"ibTxt\">[22:39] Permission (to fight) is given to those upon whom war is made </span>regarding the Emigrants who were thrown out by the people of Makkah from their houses and their wealth, their Jihad was Permissible for them due to their (Polytheists) oppressing them, and there was Permission for them regarding the fighting’. So I said, ‘So this was Revealed regarding the Emigrants due to the injustices of the Polytheists of the people of Makkah, so what was their situation regarding their fighting Chosroe and Caesar, and the ones besides them from the Polytheists of the Arab tribes?’ ", "So he<sup>asws</sup> said: ‘If it was rather a Permission for them regarding the fighting the ones who oppressed them from the people of Makkah only, there would not be any way for them to fight the multitudes of Chosroe and Caesar and other than the people of Makkah from the Arab tribes, because the ones who oppressed them were others, and rather Permission for them would have been regarding fighting the ones who oppressed them from the people of Makkah due to their expelling them from their houses and their wealth without right; and if the Verse had Meant the Emigrants whom the people of Makkah oppressed, the Verse would have Lifted the Obligation from the ones after them, when there did not remain any of the oppressors and the oppressed ones, and its Obligation would be Lifted from the people after them (when there did no remain anyone from the oppressors and the oppressed).", "And it is not as you are thinking it to be, nor as I<sup>asws</sup> mentioned, but the Emigrants were oppressed from two aspects. The people of Makkah oppressed them by their expelling them from their houses and their wealth, so they fought them by the Permission of Allah<sup>azwj</sup> for them regarding that, and they were oppressed by Chosroe and Caesar, and the ones who were besides them from the Arab tribes, and the non-Arabs with what was in their hands from what the Believers were more rightful with it than them. So they fought them by the Permission of Allah<sup>azwj</sup> Mighty and Majestic for them regarding that, and by the argument of this Verse (22:39) the Believers of every era can fight. ", "And rather the Permission of Allah<sup>azwj</sup> Mighty and Majestic is for the Believers who stand by what Allah<sup>azwj</sup> Mighty and Majestic Described from the Stipulations which Allah<sup>azwj</sup> Stipulated upon the Believers regarding the belief and the Jihad. And the one who was standing by these Stipulations so he is a Believer, and he is an oppressed, and there is Permission for him regarding the Jihad in that meaning. ", "And the one who was opposte to that, so he is an oppressor and is not from the oppressed ones, and would not be with Permission for him regarding the fighting, nor for forbidding from the evil and the enjoining of the good, because he would not be from the rightful ones of that, nor would there be a Permission for him regarding the calling to Allah<sup>azwj</sup> Mighty and Majestic because he cannot fight against the likes of himself and order with calling others to Allah<sup>azwj</sup>. ", "And he cannot become a combatant, the one who had ordered the Believers to his Jihad, and Jihad presets itself upon him, and prevents him from it, nor can he become a caller to Allah<sup>azwj</sup> Mighty and Majestic the one who calls the likes of himself to the repentance, and the Truth, and the enjoining of the good, and the forbidding from the evil. And he cannot enjoin the with good, the one who himself had been ordered with it, nor can he forbid from the evil the one who himself had been ordered to be prevented from it.", "So the one in whom the Stipulations of Allah<sup>azwj</sup> Mighty and Majestic were complete, the ones which He<sup>azwj</sup> has Described as being its rightful ones from the companions of the Prophet<sup>saww</sup>, and he is an oppressed one, so there is Permission for him regarding the Jihad just as it was Permitted for them regarding the Jihad, because the Decision of Allah<sup>azwj</sup> Mighty and Majestic is for the former ones and the later ones, and His<sup>azwj</sup> Obligations upon them is the same, except from a reason, or an event taking place. ", "And the former ones and the later ones as well, with regards to the prevention of the events, are participants, and the Obligations upon them is one. The later ones would be Questioned about the fulfillment of the Obligations about what the former ones would be Questioned with, and these ones would be Reckoned with what those ones would be Reckoned with. And the one who does not happen to be upon the description of the ones Allah<sup>azwj</sup> has Permitted for him regarding the Jihad from the Believers, so he is not the rightful of the Jihad, and he is not with a Permission for him with regards to it until he fulfills with what Allah<sup>azwj</sup> Mighty and Majestic has Stipulated upon him. ", "So when these are completed in him, the Stipulations of Allah<sup>azwj</sup> Mighty and Majestic upon the Believers and the combatants, so he is from the Permitted ones regarding the Jihad. Therefore, let a servant fear Allah<sup>azwj</sup> Mighty and Majestic and he should not be deceived by the aspirations which Allah<sup>azwj</sup> Mighty and Majestic has Forbidden from, from these false Ahadeeth (forged) against Allah<sup>azwj</sup> which belie the Quran, and he should disavow from these, and from bearing these, and reporting these. ", "And he should not present upon Allah<sup>azwj</sup> Mighty and Majestic with doubt. He would not be excused for it, for it would not have any status for the fighting in the Way of Allah<sup>azwj</sup>, in front of what Allah<sup>azwj</sup> has Given out, and it (the Jihad) is the pinnacle of the deeds with the greatest of worth. Therefore, let him decide the matter for himself, and let he see the Book of Allah<sup>azwj</sup> Mighty and Majestic and present it (his decision) upon it, for there is no one who recognises the personality than his own self. So if he were to find it as having standing with what Allah<sup>azwj</sup> has Stipulated upon him regarding the Jihad, so let him proceed upon the Jihad.", "And if he knows (himself) as being deficient, so let him correct it, and let him straighter upon what Allah<sup>azwj</sup> Obligated upon him from the Jihad. Then let him proceed with it, and it is purer, purified from every filth which surrounds beween him and between his Jihad. ", "And we<sup>asws</sup> are not talking about the one who intends the Jihad, and he is opposite to what we<sup>asws</sup> have described from the Stipulations of Allah<sup>azwj</sup> Mighty and Majestic upon the Believes and the combatants, that he should not do Jihad, but we<sup>asws</sup> are saying that we<sup>asws</sup> have taught you all what Allah<sup>azwj</sup> Mighty and Majestic has Stipulated upon the rightful ones of the Jihad, to whom He<sup>azwj</sup> has Sold them the Paradise and Bought from them their own selves and their wealth.", "So let the person correct what he knows from himself, from the deficiencies from that, and let him present his self upon the Stipuations of Allah<sup>azwj</sup>. So if he were to see that he has fulfilled by it, and these are complete in him, so he would be from the ones Allah<sup>azwj</sup> Mighty and Majestic has Permitted for him regarding the Jihad. ", "So if he refuses that he would not become a combatant upon what is therein from the persistence upon the disobedience, and the Prohibitions, and the proceeding upon the Jihad by the barging and the blindness and the proceeding upon Allah<sup>azwj</sup> Mighty and Majestic by the ignorance, and the false reports, so he has, by my<sup>asws</sup> life, has come with the Hadeeth. So the ones who did this deed, Allah<sup>azwj</sup> Mighty and Majestic would Help this Religion with people<sup>asws</sup> who have no (come up with) innovations for them. ", "So let a person fear Allah<sup>azwj</sup> Mighty and Majestic and be cautious that he would become from them, for I<sup>asws</sup> have clarified for you all, and there is no excuse for you all after the clarification, regarding the ignorance. And there is no Strength except with Allah<sup>azwj</sup> and Allah<sup>azwj</sup> is Sufficient for us<sup>asws</sup>; upon Him<sup>azwj</sup> do we<sup>asws</sup> rely, and to Him<sup>azwj</sup> is the eventual return’."]}}, {"index": 8171, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:5:1:4:2", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحَكَمِ بْنِ مِسْكِينٍ عَنْ عَبْدِ الْمَلِكِ بْنِ عَمْرٍو قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا عَبْدَ الْمَلِكِ مَا لِي لَا أَرَاكَ تَخْرُجُ إِلَى هَذِهِ الْمَوَاضِعِ الَّتِي يَخْرُجُ إِلَيْهَا أَهْلُ بِلَادِكَ قَالَ قُلْتُ وَ أَيْنَ فَقَالَ جُدَّةُ وَ عَبَّادَانُ وَ الْمَصِّيصَةُ وَ قَزْوِينُ فَقُلْتُ انْتِظَاراً لِأَمْرِكُمْ وَ الِاقْتِدَاءِ بِكُمْ فَقَالَ إِي وَ اللَّهِ لَوْ كَانَ خَيْراً مَا سَبَقُونَا إِلَيْهِ قَالَ قُلْتُ لَهُ فَإِنَّ الزَّيْدِيَّةَ يَقُولُونَ لَيْسَ بَيْنَنَا وَ بَيْنَ جَعْفَرٍ خِلَافٌ إِلَّا أَنَّهُ لَا يَرَى الْجِهَادَ فَقَالَ أَنَا لَا أَرَاهُ بَلَى وَ اللَّهِ إِنِّي لَأَرَاهُ وَ لَكِنْ أَكْرَهُ أَنْ أَدَعَ عِلْمِي إِلَى جَهْلِهِمْ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, form his father, form Ibn Abu Umeyr, from Al Hakam Bin Miskeen, from Abdul Malik Bin Amro who said, ", "‘Abu Abdullah<sup>asws</sup> said to me: ‘O Abdul Malik! What is the matter I<sup>asws</sup> do not see you going out to these places which the people of your city have gone out to?’ I said, ‘And where?’ So he<sup>asws</sup> said: ‘Jeddah, and Abadan, and Maseya, and Qazween’. I said, ‘I am awaiting your<sup>asws</sup> orders and emulate by you<sup>asws</sup>’. So he<sup>asws</sup> said: ‘Yes, by Allah<sup>azwj</sup>! If there was any good in it they would not have preceded us<sup>asws</sup> to it’. I said to him<sup>asws</sup>, ‘The Zaydiites are saying, ‘There is no differing between us and Ja’far<sup>asws</sup>, except that he<sup>asws</sup> does not consider the Jihad’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> do not consider it? Yes, by Allah<sup>azwj</sup>, I<sup>asws</sup> do consider it, but I<sup>asws</sup> abhor it that I<sup>asws</sup> should be invited to their ignorance and (leave aside) my<sup>asws</sup> knowledge."]}}]}, "index": "al-kafi:5:1:4", "kind": "verse_list"}