{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 5"
        },
        "path": "/books/al-kafi:5",
        "titles": {
          "ar": "الجزء الخامس‏",
          "en": "Volume Five"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:5:1",
        "titles": {
          "ar": "كِتَابُ الْجِهَادِ",
          "en": "THE BOOK OF JIHAD"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:5:1:5",
        "titles": {
          "ar": "باب الْغَزْوِ مَعَ النَّاسِ إِذَا خِيفَ عَلَى الْإِسْلَام",
          "en": "Chapter 5 – The (military) expedition with the people when there is fear upon Al-Islam"
        }
      }
    ],
    "index": 1185,
    "local_index": 5,
    "part_type": "Chapter",
    "path": "/books/al-kafi:5:1:5",
    "titles": {
      "ar": "باب الْغَزْوِ مَعَ النَّاسِ إِذَا خِيفَ عَلَى الْإِسْلَام",
      "en": "Chapter 5 – The (military) expedition with the people when there is fear upon Al-Islam"
    },
    "verse_count": 3,
    "verse_start_index": 8171,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/345)"
        ],
        "index": 8172,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:5:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ أَبِي عَمْرَةَ السُّلَمِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلَهُ رَجُلٌ فَقَالَ إِنِّي كُنْتُ أُكْثِرُ الْغَزْوَ وَ أَبْعُدُ فِي طَلَبِ الْأَجْرِ وَ أُطِيلُ الْغَيْبَةَ فَحُجِرَ ذَلِكَ عَلَيَّ فَقَالُوا لَا غَزْوَ إِلَّا مَعَ إِمَامٍ عَادِلٍ فَمَا تَرَى أَصْلَحَكَ اللَّهُ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنْ شِئْتَ أَنْ أُجْمِلَ لَكَ أَجْمَلْتُ وَ إِنْ شِئْتَ أَنْ أُلَخِّصَ لَكَ لَخَّصْتُ فَقَالَ بَلْ أَجْمِلْ قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَحْشُرُ النَّاسَ عَلَى نِيَّاتِهِمْ يَوْمَ الْقِيَامَةِ ",
          "قَالَ فَكَأَنَّهُ اشْتَهَى أَنْ يُلَخِّصَ لَهُ قَالَ فَلَخِّصْ لِي أَصْلَحَكَ اللَّهُ فَقَالَ هَاتِ فَقَالَ الرَّجُلُ غَزَوْتُ فَوَاقَعْتُ الْمُشْرِكِينَ فَيَنْبَغِي قِتَالُهُمْ قَبْلَ أَنْ أَدْعُوَهُمْ فَقَالَ إِنْ كَانُوا غَزَوْا وَ قُوتِلُوا وَ قَاتَلُوا فَإِنَّكَ تَجْتَرِئُ بِذَلِكَ وَ إِنْ كَانُوا قَوْماً لَمْ يَغْزُوا وَ لَمْ يُقَاتِلُوا فَلَا يَسَعُكَ قِتَالُهُمْ حَتَّى تَدْعُوَهُمْ ",
          "قَالَ الرَّجُلُ فَدَعَوْتُهُمْ فَأَجَابَنِي مُجِيبٌ وَ أَقَرَّ بِالْإِسْلَامِ فِي قَلْبِهِ وَ كَانَ فِي الْإِسْلَامِ فَجِيرَ عَلَيْهِ فِي الْحُكْمِ وَ انْتُهِكَتْ حُرْمَتُهُ وَ أُخِذَ مَالُهُ وَ اعْتُدِيَ عَلَيْهِ فَكَيْفَ بِالْمَخْرَجِ وَ أَنَا دَعَوْتُهُ فَقَالَ إِنَّكُمَا مَأْجُورَانِ عَلَى مَا كَانَ مِنْ ذَلِكَ وَ هُوَ مَعَكَ يَحُوطُكَ مِنْ وَرَاءِ حُرْمَتِكَ وَ يَمْنَعُ قِبْلَتَكَ وَ يَدْفَعُ عَنْ كِتَابِكَ وَ يَحْقُنُ دَمَكَ خَيْرٌ مِنْ أَنْ يَكُونَ عَلَيْكَ يَهْدِمُ قِبْلَتَكَ وَ يَنْتَهِكُ حُرْمَتَكَ وَ يَسْفِكُ دَمَكَ وَ يُحْرِقُ كِتَابَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Abu Amara Al Salmy, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man asked him<sup>asws</sup>, so he said, ‘I used to be frequent in the military expeditions, and go far in seeking the Recompense, and long absences, so that was prohibited unto me, and they (people) said, ‘Do not go on military expeditions except with a Just Imam<sup>asws</sup>. So what is your<sup>asws</sup> view, may Allah<sup>saww</sup> Keep you<sup>asws</sup> well?.’ ",
            "So Abu Abdullah<sup>asws</sup> said: ‘If you so desire, that I<sup>asws</sup> should generalise it for you, I<sup>asws</sup> will generalise, and if you so desire to I<sup>asws</sup> particularise it for you, I<sup>asws</sup> will particularise’. So he said, ‘But, generalise’. He<sup>asws</sup> said: ‘Allah<sup>azwj</sup> Mighty and Majestic would Resurrect the people upon their intentions, on the Day of Judgement’. ",
            "He (the narrator) said, ‘So it was as if he<sup>asws</sup> wanted to summarise it for him’. He said, ‘So particularise it for me, may Allah<sup>azwj</sup> Keep you<sup>asws</sup> well’. So he<sup>asws</sup> said: ‘Give me<sup>asws</sup> (a particular instance)’. So the man said, ‘I go on a military expedition and I come across the Polytheists, so is it befitting for me to fight them before I invite them (to Al-Islam)?’ So he<sup>asws</sup> said: ‘If they had attacked you and fought and killed, so you go by that, and if they were a people who did not attack and did not kill, so there is no leeway for you to fight them until you invite them’. ",
            "The man said, ‘Supposing I invite them, and one of them responds to me with a (positive) answer and agrees with Al-Islam in his heart, and injustice was done upon him in the decision, and his sactitiy was violated, and his wealth was taken, and he was transgressed upon, so how would it be with the going out (for Jihad), and I had invited him?’ So he<sup>asws</sup> said: ‘Both of you would be Recompensed upon whatever was from that, and he was with you protecting your sanctity behind you, and defending your Qiblah, and safeguarding your Book, and saving your blood. This is better than if he happened to be against you demolishing your Qiblah, and violating your sanctity, and shedding your blood, and burning your Book’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from abu ‘Amrah al-Sullamiy who has said the following: “A man once asked abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘I would mobilize (against the enemy) very often, stay away from asking for compensation and remain absent for a long time. This was called impermissible for me and they said, ‘There is no mobilization (against the enemy) without the Imam of justice.’ May Allah keep you well, what do you say about it?’ Abu ‘Abd Allah, ‘Alayhi al- Salam, said, ‘I can say it for you in general terms and if you want I can say it to you in clear terms.’ The man said, ‘Say it in general terms.’ He (the Imam) said, ‘Allah, the Most Majestic, the Most Glorious, will resurrect people on the Day of Judgment according to their intentions.’ The narrator has said that it seemed as if he wanted the Imam to say it in clear terms. He said, ‘Make it for me in clear terms, may Allah keep you well.’ He (the Imam) asked, ‘Explain it.’ The man said, ‘I mobilized and faced the pagans. Should I fight them before calling them to Allah?’ He (the Imam) said, ‘If they mobilize and fight, you are drawn in it. If they are a people who have not mobilized and had not fought, you can do nothing but to call them to Allah.’ The man said, ‘I called them to Allah. One of them accepted the call, affirmed al-Islam in his heart and lived as a Muslim but injustice was done to him in judgment, his honor was violated, his property taken and he was subjected to transgression. What is the solution when I was the one to call him to Allah?’ He (the Imam) said, ‘Both of you deserve rewards in the matter. He is with you to shield your honor, protect your Qiblah (the sacred location), to defend your book and save your life. This is better for you than his being against you, destroy your Qiblah, violate your honor, shed your blood and burn your book.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (18/346)"
        ],
        "index": 8173,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:5:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبِي الْحَسَنِ الرِّضَا ( عليه السلام ) قَالَ قُلْتُ لَهُ جُعِلْتُ فِدَاكَ إِنَّ رَجُلًا مِنْ مَوَالِيكَ بَلَغَهُ أَنَّ رَجُلًا يُعْطِي السَّيْفَ وَ الْفَرَسَ فِي سَبِيلِ اللَّهِ فَأَتَاهُ فَأَخَذَهُمَا مِنْهُ وَ هُوَ جَاهِلٌ بِوَجْهِ السَّبِيلِ ثُمَّ لَقِيَهُ أَصْحَابُهُ فَأَخْبَرُوهُ أَنَّ السَّبِيلَ مَعَ هَؤُلَاءِ لَا يَجُوزُ وَ أَمَرُوهُ بِرَدِّهِمَا فَقَالَ فَلْيَفْعَلْ ",
          "قَالَ قَدْ طَلَبَ الرَّجُلَ فَلَمْ يَجِدْهُ وَ قِيلَ لَهُ قَدْ شَخَصَ الرَّجُلُ قَالَ فَلْيُرَابِطْ وَ لَا يُقَاتِلْ قَالَ فَفِي مِثْلِ قَزْوِينَ وَ الدَّيْلَمِ وَ عَسْقَلَانَ وَ مَا أَشْبَهَ هَذِهِ الثُّغُورَ فَقَالَ نَعَمْ فَقَالَ لَهُ يُجَاهِدُ قَالَ لَا إِلَّا أَنْ يَخَافَ عَلَى ذَرَارِيِّ الْمُسْلِمِينَ [فَقَالَ] أَ رَأَيْتَكَ لَوْ أَنَّ الرُّومَ دَخَلُوا عَلَى الْمُسْلِمِينَ لَمْ يَنْبَغِ لَهُمْ أَنْ يَمْنَعُوهُمْ قَالَ يُرَابِطُ وَ لَا يُقَاتِلُ وَ إِنْ خَافَ عَلَى بَيْضَةِ الْإِسْلَامِ وَ الْمُسْلِمِينَ قَاتَلَ فَيَكُونُ قِتَالُهُ لِنَفْسِهِ وَ لَيْسَ لِلسُّلْطَانِ ",
          "قَالَ قُلْتُ فَإِنْ جَاءَ الْعَدُوُّ إِلَى الْمَوْضِعِ الَّذِي هُوَ فِيهِ مُرَابِطٌ كَيْفَ يَصْنَعُ قَالَ يُقَاتِلُ عَنْ بَيْضَةِ الْإِسْلَامِ لَا عَنْ هَؤُلَاءِ لِأَنَّ فِي دُرُوسِ الْإِسْلَامِ دُرُوسَ دِينِ مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, ",
            "(It has been narrated) from Abu Al-Hassan Al-Reza<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! A man from the ones in your<sup>asws</sup> Wilayah, news reached him that a man is giving away the sword and the horse in the Way of Allah<sup>azwj</sup>. So he went over to him and took these two from him, and he was ignorant of the aspects of the Way (Jihad). Then he met his companion who informed him that the Way (Jihad) with them is not allowed, and instructed him with returning these two’. So he<sup>asws</sup> said: ‘So let him do it’. ",
            "He said, ‘He sought the man, but did not find him, and it was said to him, ‘The man has left’. He<sup>asws</sup> said: ‘So let him be stationed (somewhere) and he should not fight’. He said, ‘So in (places) similar to Qazween, and Al-Daylam, and Asqalaan, and what resembles these border areas’. So he<sup>asws</sup> said: ‘Yes’. So he said to him<sup>asws</sup>, ‘Can he fight?’ He<sup>asws</sup> said: ‘No, except if there is a fear upon the Muslim offsprings’. So he said, ‘What is your<sup>asws</sup> view, if the Romans were to enter upon (attack) the Muslims, would it not be befitting for him to prevent them?’ He<sup>asws</sup> said: ‘He should be stationed there and he should not fight. And if he were to fear upon the assets of Al-Islam and the Muslims, he can fight, so his fighting would happen to be for himself, and it would not be for the ruling authorities (i.e., a king or a caliph)’. ",
            "He (the narrator) said, ‘I said, ‘Supposing if the enemies were to come over to the place in which he was stationed, how should he react?’ He<sup>asws</sup> said: ‘He should fight about the eggs (assets) of Al-Islam, not about them, because in the extinction of Al-Islam is the extinction of the Religion of Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim and Muhammad ibn ‘Isa have narrated from Yunus who has said the following: “I once asked abu al-Hassan al-Rida’, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, one of followers had heard that a man gives away sword and horse for the cause of Allah. He went to that man and took the two items but he did not know the rules. His companions met him and told him that working in the way (of Allah) with these people is not permissible and they commanded them to return the items.’ He (the Imam) said, ‘He should do so.’ The man said, ‘He searched for the man but did not find him. It was said that the man has left.’ He (the Imam) said, ‘He should serve as a guard but he must not fight.’ The man then asked, ‘Should he serve as a guard in Qazwin, al-Daylam and ‘Asqalan?’ He (the Imam) said, ‘No, unless there is fear for the (offspring of) other Muslims.’ The man then asked, ‘Do you say that if Romans entered the lands of the Muslims, they should not stop them?’ He (the Imam) said, ‘It is to be on their guard but not fighting. However, if the center of al-Islam and Muslims is feared for, then one must fight. In such case his fighting is for his own sake and not for the authority (the king).’ The narrator has said that he then asked, ‘If the enemy comes to the place where he serves as a guard then what should he do?’ He (the Imam) said, ‘He fights for the center of al-Islam but not for these people. It is because in the wear and tear of al- Islam is wear and tear of the religion of Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’” Ali has narrated from his father from Yahya ibn abu ‘Imran from Yunus from al-Rida’, ‘Alayhi al- Salam, a similar Hadith. "
          ]
        }
      },
      {
        "index": 8174,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:5:1:5:3",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ يَحْيَى بْنِ أَبِي عِمْرَانَ عَنْ يُونُسَ عَنِ الرِّضَا ( عليه السلام ) نَحْوَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Yahya Bin Abu Imran, form Yunus, ",
            "(It has been narrated) from Al-Reza<sup>asws</sup>, approximate to it’. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:5:1:5",
  "kind": "verse_list"
}