{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:7:3", "titles": {"ar": "كتاب الْحُدُودِ ", "en": "THE BOOK OF LEGAL PENALTIES"}}, {"indexed_titles": {"en": "Chapter 22"}, "path": "/books/al-kafi:7:3:22", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 22 – Another chapter from it"}}], "index": 2105, "local_index": 22, "part_type": "Chapter", "path": "/books/al-kafi:7:3:22", "titles": {"ar": "باب آخَرُ مِنْهُ", "en": "Chapter 22 – Another chapter from it"}, "verse_count": 1, "verse_start_index": 13611, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 13612, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:3:22:1", "text": ["فَلَمَّا كَانَ مِنْ غَدٍ عَادَ إِلَيْهِ فَقَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي أَوْقَبْتُ عَلَى غُلَامٍ فَطَهِّرْنِي فَقَالَ لَهُ يَا هَذَا امْضِ إِلَى مَنْزِلِكَ لَعَلَّ مِرَاراً هَاجَ بِكَ حَتَّى فَعَلَ ذَلِكَ ثَلَاثاً بَعْدَ مَرَّتِهِ الْأُولَى فَلَمَّا كَانَ فِي الرَّابِعَةِ قَالَ لَهُ يَا هَذَا إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) حَكَمَ فِي مِثْلِكَ بِثَلَاثَةِ أَحْكَامٍ فَاخْتَرْ أَيَّهُنَّ شِئْتَ قَالَ وَ مَا هُنَّ يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ ضَرْبَةٌ بِالسَّيْفِ فِي عُنُقِكَ بَالِغَةً مَا بَلَغَتْ أَوْ إِهْدَاءٌ مِنْ جَبَلٍ مَشْدُودَ الْيَدَيْنِ وَ الرِّجْلَيْنِ أَوْ إِحْرَاقٌ بِالنَّارِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَيُّهُنَّ أَشَدُّ عَلَيَّ قَالَ الْإِحْرَاقُ بِالنَّارِ قَالَ فَإِنِّي قَدِ اخْتَرْتُهَا يَا أَمِيرَ الْمُؤْمِنِينَ قَالَ خُذْ لِذَلِكَ أُهْبَتَكَ فَقَالَ نَعَمْ", "فَقَالَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ جَلَسَ فِي تَشَهُّدِهِ فَقَالَ اللَّهُمَّ إِنِّي قَدْ أَتَيْتُ مِنَ الذَّنْبِ مَا قَدْ عَلِمْتَهُ وَ إِنِّي تَخَوَّفْتُ مِنْ ذَلِكَ فَجِئْتُ إِلَى وَصِيِّ رَسُولِكَ وَ ابْنِ عَمِّ نَبِيِّكَ فَسَأَلْتُهُ أَنْ يُطَهِّرَنِي فَخَيَّرَنِي بَيْنَ ثَلَاثَةِ أَصْنَافٍ مِنَ الْعَذَابِ اللَّهُمَّ فَإِنِّي قَدِ اخْتَرْتُ أَشَدَّهَا اللَّهُمَّ فَإِنِّي أَسْأَلُكَ أَنْ تَجْعَلَ ذَلِكَ كَفَّارَةً لِذُنُوبِي وَ أَنْ لَا تُحْرِقَنِي بِنَارِكَ فِي آخِرَتِي ", "ثُمَّ قَامَ وَ هُوَ بَاكٍ حَتَّى جَلَسَ فِي الْحُفْرَةِ الَّتِي حَفَرَهَا لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ هُوَ يَرَى النَّارَ تَتَأَجَّجُ حَوْلَهُ قَالَ فَبَكَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ بَكَى أَصْحَابُهُ جَمِيعاً فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) قُمْ يَا هَذَا فَقَدْ أَبْكَيْتَ مَلَائِكَةَ السَّمَاءِ وَ مَلَائِكَةَ الْأَرْضِ فَإِنَّ اللَّهَ قَدْ تَابَ عَلَيْكَ فَقُمْ وَ لَا تُعَاوِدَنَّ شَيْئاً مِمَّا قَدْ فَعَلْتَ ."], "translations": {"en.hubeali": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ مَالِكِ بْنِ عَطِيَّةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَيْنَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي مَلَإٍ مِنْ أَصْحَابِهِ إِذْ أَتَاهُ رَجُلٌ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي قَدْ أَوْقَبْتُ عَلَى غُلَامٍ فَطَهِّرْنِي فَقَالَ لَهُ يَا هَذَا امْضِ إِلَى مَنْزِلِكَ لَعَلَّ مِرَاراً هَاجَ بِكَ", "Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ibn Raib, from Maalik Bin Atiyya, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whilst Amir Al-Momineen<sup>asws</sup> was among a group of his<sup>asws</sup> companions, when a man came over and said, ‘O Amir Al-Momineen<sup>asws</sup>! I have gone to a boy, therefore purify me’. So he<sup>asws</sup> said: ‘O you! Go to your house, perhaps your gall bladder is exciting you’. ", "So when is was the next morning, he returned to him<sup>asws</sup> and said to him<sup>asws</sup>, ‘O Amir Al-Momineen<sup>asws</sup>! I have gone to a boy, therefore purify me’. So he<sup>asws</sup> said to him: ‘O you! Go to your house, perhaps your gall bladder is exciting you’. He did it three times after the first. So when it was during the fourth, he<sup>asws</sup> said to him: ‘O you! Rasool-Allah<sup>saww</sup> had judged regarding (a case) similar to yours with three judgements, therfore choose which of these you like’. He said, ‘And what are these, O Amir Al-Momineen<sup>asws</sup>?’ He<sup>asws</sup> said: ‘A strike with the sword in your neck, it reaches what it reaches, or throwing you off the mountain with your hands and feet tied up, or burning with the fire’. So he said, ‘O Amir Al-Momineen<sup>asws</sup>! Which of these is the harshest upon me’. He<sup>asws</sup> said: ‘Burning with the fire’. He said, ‘So I have chosen it, O Amir Al-Momineen<sup>asws</sup>! He<sup>asws</sup> said: ‘Are you prepared to take that, I<sup>asws</sup> shall call for you’. So he said, ‘Yes’. ", "So he<sup>asws</sup> said: ‘So he (the sinner) Prayed two cycles, then sat in his <span class=\"iTxt\">Tashahhud</span>, so he said: ‘O Allah<sup>azwj</sup>! I had committed from the sins which You<sup>azwj</sup> Know of, and I feared from that. So I went to the successor<sup>asws</sup> of Your<sup>azwj</sup> Rasool<sup>saww</sup>, and a cousin of Your<sup>azwj</sup> Prophet<sup>saww</sup>, so I asked him<sup>asws</sup> that he<sup>asws</sup> should purify me. So<sup>asws</sup> gave me a choice of three types of punishment. O Allah<sup>azwj</sup>! So I have chosen the harshest of these. O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> that You<sup>azwj</sup> Make that as an expiation of my sin, and that You<sup>azwj</sup> do not Burn me with Your<sup>azwj</sup> Fire in my Hereafter!’ ", "Then he stood up and he was crying until he sat in the pit which had been dug out for him by Amir Al-Momineen<sup>asws</sup>, and he was seeing the fire inflaming around him. So Amir Al-Momineen<sup>asws</sup> wept and his companions wept altogether. So Amir Al-Momineen<sup>asws</sup> said to him: ‘Arise, O you, for you have made the Angels of the sky and the Angels of the earth to cry, so Allah<sup>azwj</sup> has Turned towards you (with Mercy). So arise and do not repeat anything from what you have done’."]}}]}, "index": "al-kafi:7:3:22", "kind": "verse_list"}