{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:7:3",
        "titles": {
          "ar": "كتاب الْحُدُودِ ",
          "en": "THE BOOK OF LEGAL PENALTIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 36"
        },
        "path": "/books/al-kafi:7:3:36",
        "titles": {
          "ar": "باب حَدِّ الْقَطْعِ وَ كَيْفَ هُوَ",
          "en": "Chapter 36 – Penalty (Hadd) of the cutting, and how it is to be"
        }
      }
    ],
    "index": 2129,
    "local_index": 36,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:3:36",
    "titles": {
      "ar": "باب حَدِّ الْقَطْعِ وَ كَيْفَ هُوَ",
      "en": "Chapter 36 – Penalty (Hadd) of the cutting, and how it is to be"
    },
    "verse_count": 17,
    "verse_start_index": 13723,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 13724,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ مِنْ أَيْنَ يَجِبُ الْقَطْعُ فَبَسَطَ أَصَابِعَهُ وَ قَالَ مِنْ هَاهُنَا يَعْنِي مِنْ مَفْصِلِ الْكَفِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Abu Umeyr, from Hammad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘From where is the cutting (of the hand) Obligated?’ So he<sup>asws</sup> extended his fingers and said: ‘For over here, meaning from the hinge of the palm’."
          ]
        }
      },
      {
        "index": 13725,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْقَطْعُ مِنْ وَسَطِ الْكَفِّ وَ لَا يُقْطَعُ الْإِبْهَامُ وَ إِذَا قُطِعَتِ الرِّجْلُ تُرِكَ الْعَقِبُ لَمْ يُقْطَعْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ali Bin Abu Hamza, from Abu baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The cutting (of the hand) is from the middle of the palm, and the thumb is not cut; and when the foot is cut, the heel is not cut’."
          ]
        }
      },
      {
        "index": 13726,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:3",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ عَلِيٌّ ( صلوات الله عليه ) لَا يَزِيدُ عَلَى قَطْعِ الْيَدِ وَ الرِّجْلِ وَ يَقُولُ إِنِّي لَأَسْتَحْيِي مِنْ رَبِّي أَنْ أَدَعَهُ لَيْسَ لَهُ مَا يَسْتَنْجِي بِهِ أَوْ يَتَطَهَّرُ بِهِ ",
          "قَالَ وَ سَأَلْتُهُ إِنْ هُوَ سَرَقَ بَعْدَ قَطْعِ الْيَدِ وَ الرِّجْلِ فَقَالَ أَسْتَوْدِعُهُ السِّجْنَ أَبَداً وَ أُغْنِي عَنِ النَّاسِ شَرَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban Bin Usman, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Ali<sup>asws</sup> did not increased upon cutting of the hand and the leg, and he<sup>asws</sup> was saying, I<sup>asws</sup> am embarassed from my<sup>asws</sup> Lord<sup>azwj</sup> that I<sup>asws</sup> should leave him not having for him what he can wash himself with (from toilet), or clean himself with’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup>, ‘If he were to steal after cutting of the hand and the leg?’ So he<sup>asws</sup> said: ‘I<sup>asws</sup> would leave him in the prison forever, and make the people to be free from his evil’."
          ]
        }
      },
      {
        "index": 13727,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي السَّارِقِ إِذَا سَرَقَ قَطَعْتُ يَمِينَهُ وَ إِذَا سَرَقَ مَرَّةً أُخْرَى قَطَعْتُ رِجْلَهُ الْيُسْرَى ثُمَّ إِذَا سَرَقَ مَرَّةً أُخْرَى سَجَنْتُهُ وَ تَرَكْتُ رِجْلَهُ الْيُمْنَى يَمْشِي عَلَيْهَا إِلَى الْغَائِطِ وَ يَدَهُ الْيُسْرَى يَأْكُلُ بِهَا وَ يَسْتَنْجِي بِهَا وَ قَالَ إِنِّي لَأَسْتَحْيِي مِنَ اللَّهِ أَنْ أَتْرُكَهُ لَا يَنْتَفِعُ بِشَيْ‏ءٍ وَ لَكِنِّي أَسْجُنُهُ حَتَّى يَمُوتَ فِي السِّجْنِ ",
          "وَ قَالَ مَا قَطَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ سَارِقٍ بَعْدَ يَدِهِ وَ رِجْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, altogether from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding the thief: ‘When he steals, cut off his right hand, and when he steals again, cut off his left leg. Then if he were to steal again, imprison him and leave his right leg to walk upon it to the WC, and his left hand, he can eat with it, and wash himself (from the WC) with it’. And he<sup>asws</sup> said: ‘I<sup>asws</sup> am embarassed from Allah<sup>azwj</sup> that I<sup>asws</sup> would leave him not being able to do anything, but I<sup>asws</sup> would imprison him until he dies in the prison’. ",
            "And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> did not cut (anymore) from a thief after (having cut) his hand and his leg’."
          ]
        }
      },
      {
        "index": 13728,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنِ النَّضْرِ بْنِ سُوَيْدٍ عَنِ الْقَاسِمِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ سَرَقَ فَقَالَ سَمِعْتُ أَبِي يَقُولُ أُتِيَ عَلِيٌّ ( عليه السلام ) فِي زَمَانِهِ بِرَجُلٍ قَدْ سَرَقَ فَقَطَعَ يَدَهُ ثُمَّ أُتِيَ بِهِ ثَانِيَةً فَقَطَعَ رِجْلَهُ مِنْ خِلَافٍ ثُمَّ أُتِيَ بِهِ ثَالِثَةً فَخَلَّدَهُ فِي السِّجْنِ وَ أَنْفَقَ عَلَيْهِ مِنْ بَيْتِ مَالِ الْمُسْلِمِينَ وَ قَالَ هَكَذَا صَنَعَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لَا أُخَالِفُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Al Nazar Bin Suweyd, from Al Qasim, ",
            "(the narrator) says, ‘I asked Abu Abdullah<sup>asws</sup> about a man who stole, so he<sup>asws</sup> said: ‘I<sup>asws</sup> heard my<sup>asws</sup> father<sup>asws</sup> saying, ‘They came with a man who had stolen, to Ali<sup>asws</sup> during his<sup>asws</sup> era. So he<sup>asws</sup> cut his hand. They came with him for a second time, so he<sup>asws</sup> cut his opposite leg (left leg). Then they came with him for a third time, so he<sup>asws</sup> imprisoned him for life, and spent upon him from the public treasury of the Muslims and said: ‘This is what Rasool-Allah<sup>saww</sup> used to do. I<sup>asws</sup> will not oppose him<sup>saww</sup>’."
          ]
        }
      },
      {
        "index": 13729,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ شُعَيْبٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَطْعُ رِجْلِ السَّارِقِ بَعْدَ قَطْعِ الْيَدِ ثُمَّ لَا يُقْطَعُ بَعْدُ فَإِنْ عَادَ حُبِسَ فِي السِّجْنِ وَ أُنْفِقَ عَلَيْهِ مِنْ بَيْتِ مَالِ الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan Bin Yahy, from Shuayb, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Cut the thieving man after cutting the hand, then do not cut afterwards. So if he repeats, withhold him in the prison, and spend upon him from the public treasury of the Muslims’."
          ]
        }
      },
      {
        "index": 13730,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ أُمِرَ بِهِ أَنْ يُقْطَعَ يَمِينُهُ فَقُدِّمَتْ شِمَالُهُ فَقَطَعُوهَا وَ حَسَبُوهَا يَمِينَهُ وَ قَالُوا إِنَّمَا قَطَعْنَا شِمَالَهُ أَ تُقْطَعُ يَمِينُهُ قَالَ فَقَالَ لَا يُقْطَعُ يَمِينُهُ وَ قَدْ قُطِعَتْ شِمَالُهُ وَ قَالَ فِي رَجُلٍ أَخَذَ بَيْضَةً مِنَ الْمَغْنَمِ وَ قَالُوا قَدْ سَرَقَ اقْطَعْهُ فَقَالَ إِنِّي لَمْ أَقْطَعْ أَحَداً لَهُ فِيمَا أَخَذَ شِرْكٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, altogether from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a man whom he<sup>asws</sup> ordered for his right hand to be cut. So he placed forward his left hand, so they cut it off, and reckoned it as his right, and they said, ‘But rather, we have cut off his left, shall his right be cut off (as well)?’ So he<sup>asws</sup> said: ‘His right hand would not be cut off, and his left has already been cut’. And he<sup>asws</sup> said regarding a man who took a helmet from the war booty, and they said, ‘He has stolen, so cut him’. So he<sup>asws</sup> said: ‘I<sup>asws</sup> would not cut any who is a participant in what he has taken’."
          ]
        }
      },
      {
        "index": 13731,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:8",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ قَالَ قَالَ إِذَا أُخِذَ السَّارِقُ قُطِعَتْ يَدُهُ مِنْ وَسَطِ الْكَفِّ فَإِنْ عَادَ قُطِعَتْ رِجْلُهُ مِنْ وَسَطِ الْقَدَمِ فَإِنْ عَادَ اسْتُودِعَ السِّجْنَ فَإِنْ سَرَقَ فِي السِّجْنِ قُتِلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from usman Bin Isa, from Sama’at Bin Mahran who said, ",
            "‘When the thief is seized, cut his hand from the middle of the palm. So if he were to repeat, cut his left foot from the middle. So if he repeats, leave him in the prison. So if he steals in the prison, kill (him)’."
          ]
        }
      },
      {
        "index": 13732,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:9",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ سَرَقَ سَرِقَةً فَكَابَرَ عَنْهَا فَضُرِبَ فَجَاءَ بِهَا بِعَيْنِهَا هَلْ يَجِبُ عَلَيْهِ الْقَطْعُ قَالَ نَعَمْ وَ لَكِنْ لَوِ اعْتَرَفَ وَ لَمْ يَجِئْ بِالسَّرِقَةِ لَمْ تُقْطَعْ يَدُهُ لِأَنَّهُ اعْتَرَفَ عَلَى الْعَذَابِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, from Suleyman Bin Khalid who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who stole something, but he argued from it. So he was whipped. So he came with it (the stolen item) exactly. Would the cutting be Obligated upon him?’ He<sup>asws</sup> said: ‘Yes. But, had he acknowledged, and did not come with the stolen item, his hand would not be cut, because he would have acknowledged (his theft) upon the punishment’."
          ]
        }
      },
      {
        "index": 13733,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:10",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ ثَقَبَ بَيْتاً فَأُخِذَ قَبْلَ أَنْ يَصِلَ إِلَى شَيْ‏ءٍ قَالَ يُعَاقَبُ فَإِنْ أُخِذَ وَ قَدْ أَخْرَجَ مَتَاعاً فَعَلَيْهِ الْقَطْعُ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ أَخَذُوهُ وَ قَدْ حَمَلَ كَارَةً مِنْ ثِيَابٍ وَ قَالَ صَاحِبُ الْبَيْتِ أَعْطَانِيهَا قَالَ يُدْرَأُ عَنْهُ الْقَطْعُ إِلَّا أَنْ يَقُومَ عَلَيْهِ الْبَيِّنَةُ فَإِنْ قَامَتِ الْبَيِّنَةُ عَلَيْهِ قُطِعَ ",
          "قَالَ وَ يُقْطَعُ الْيَدُ وَ الرِّجْلُ ثُمَّ لَا يُقْطَعُ بَعْدُ وَ لَكِنْ إِنْ عَادَ حُبِسَ وَ أُنْفِقَ عَلَيْهِ مِنْ بَيْتِ مَالِ الْمُسْلِمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad, from Al Halby who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who pierced a hole in a house (to steal), but he was seized before he could arrive to anything. He<sup>asws</sup> said: ‘He would be punished. So if he was seized and he had extracted goods (from the house), so upon him would be the cutting (of the hand)’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who was seized and he was carrying a bundle of clothes, and said that the owner of the house had given these to him’. He<sup>asws</sup> said: ‘The cutting would be staved off from him except if the proof is established upon him. So if the proof is established upon him, his (hand) would be cut’. ",
            "He<sup>asws</sup> said: ‘The hand and the leg would be cut, then no other (parts) of his be cut afterwards, but if he were to repeat, he would be imprisoned and would be expended upon from the public treasury of the Muslims’."
          ]
        }
      },
      {
        "index": 13734,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي السَّارِقِ إِذَا أُخِذَ وَ قَدْ أَخَذَ الْمَتَاعَ وَ هُوَ فِي الْبَيْتِ لَمْ يَخْرُجْ بَعْدُ فَقَالَ لَيْسَ عَلَيْهِ الْقَطْعُ حَتَّى يَخْرُجَ بِهِ مِنَ الدَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said regarding the thief: ‘When he is seized and he has taken the goods, and he is in the house and not having come out. So he<sup>asws</sup> said: ‘There is no cutting upon him until he comes out with it (the goods) from the house’."
          ]
        }
      },
      {
        "index": 13735,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:12",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ بُكَيْرِ بْنِ أَعْيَنَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ سَرَقَ فَلَمْ يُقْدَرْ عَلَيْهِ ثُمَّ سَرَقَ مَرَّةً أُخْرَى فَلَمْ يُقْدَرْ عَلَيْهِ وَ سَرَقَ مَرَّةً أُخْرَى فَأُخِذَ فَجَاءَتِ الْبَيِّنَةُ فَشَهِدُوا عَلَيْهِ بِالسَّرِقَةِ الْأُولَى وَ السَّرِقَةِ الْأَخِيرَةِ فَقَالَ تُقْطَعُ يَدُهُ بِالسَّرِقَةِ الْأُولَى وَ لَا تُقْطَعُ رِجْلُهُ بِالسَّرِقَةِ الْأَخِيرَةِ فَقِيلَ كَيْفَ ذَاكَ فَقَالَ لِأَنَّ الشُّهُودَ شَهِدُوا جَمِيعاً فِي مَقَامٍ وَاحِدٍ بِالسَّرِقَةِ الْأُولَى وَ الْأَخِيرَةِ قَبْلَ أَنْ يُقْطَعَ بِالسَّرِقَةِ الْأُولَى وَ لَوْ أَنَّ الشُّهُودَ شَهِدُوا عَلَيْهِ بِالسَّرِقَةِ الْأُولَى ثُمَّ أَمْسَكُوا حَتَّى يُقْطَعَ ثُمَّ شَهِدُوا عَلَيْهِ بِالسَّرِقَةِ الْأَخِيرَةِ قُطِعَتْ رِجْلُهُ الْيُسْرَى ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ali Bi Ibrahim, from his father, altogether from Ibn Mahboub, from Abdul Rahman Bin Al Hajjaj, from Bukeyr Bin Ayn, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a man who stole but they were not able over (catching him). Then he stole again but they were not able over (catching) him, and he stole again, so he was seized. So the proof came, and they (witnesses) testified against him with the earlier ones and the last theft. So he<sup>asws</sup> said: ‘His hand would be cut due to the first theft and his leg would not be cut due to the second theft’. So it was said, ‘So how come that is so?’ So he<sup>asws</sup> said: ‘Because the witnessed testified together in one place with the first theft and the last one, before he had been cut due to the first theft. And had the witnesses testified against him with the first theft, then waited until he was cut, then testified against him with the last theft, his left leg would be cut’."
          ]
        }
      },
      {
        "index": 13736,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:13",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي إِبْرَاهِيمَ ( عليه السلام ) قَالَ تُقْطَعُ يَدُ السَّارِقِ وَ يُتْرَكُ إِبْهَامُهُ وَ صَدْرُ رَاحَتِهِ وَ تُقْطَعُ رِجْلُهُ وَ تُتْرَكُ لَهُ عَقِبُهُ يَمْشِي عَلَيْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Is’haq Bin Ammar, ",
            "(It has been narrated) from Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The hand of the thief would be cut and his thumb would be left alone along with the centre of the palm; and his leg would be cut and his sole would be left alone so he can walk upon it’."
          ]
        }
      },
      {
        "index": 13737,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:14",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِرِجَالٍ قَدْ سَرَقُوا فَقَطَعَ أَيْدِيَهُمْ ثُمَّ قَالَ إِنَّ الَّذِي بَانَ مِنْ أَجْسَادِكُمْ قَدْ وَصَلَ إِلَى النَّارِ فَإِنْ تَتُوبُوا تَجُرُّوهَا وَ إِنْ لَمْ تَتُوبُوا تَجُرَّكُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Sama’at who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘They came to Amir Al-Momineen<sup>asws</sup> with men who had stolen. So he cut their hands, then said: ‘That which has spearated from your bodies has arrived to the fire. So if you were to repent, you would pull it (out from the Fire of Hell), and if you do not repent, it would pull you (into the Fire of Hell)’."
          ]
        }
      },
      {
        "index": 13738,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:15",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا سَرَقَ السَّارِقُ قُطِعَتْ يَدُهُ وَ غُرِّمَ مَا أَخَذَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Mansour Bin Hazim, from Suleyman Bin Khalid who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘When thief steals, his hand it cut, and he has to compensate for whatever he has taken (stolen)’."
          ]
        }
      },
      {
        "index": 13739,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:16",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ أَشَلِّ الْيَدِ الْيُمْنَى أَوْ أَشَلِّ الْيَدِ الشِّمَالِ سَرَقَ قَالَ تُقْطَعُ يَدُهُ الْيُمْنَى عَلَى كُلِّ حَالٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man with a crippled right hand, or a crippled left hand, steals’. He<sup>asws</sup> said: ‘His right hand would be cut upon every state’."
          ]
        }
      },
      {
        "index": 13740,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:36:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ هِلَالٍ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ أَخْبِرْنِي عَنِ السَّارِقِ لِمَ تُقْطَعُ يَدُهُ الْيُمْنَى وَ رِجْلُهُ الْيُسْرَى وَ لَا تُقْطَعُ يَدُهُ الْيُمْنَى وَ رِجْلُهُ الْيُمْنَى فَقَالَ ( عليه السلام ) مَا أَحْسَنَ مَا سَأَلْتَ إِذَا قُطِعَتْ يَدُهُ الْيُمْنَى وَ رِجْلُهُ الْيُمْنَى سَقَطَ عَلَى جَانِبِهِ الْأَيْسَرِ وَ لَمْ يَقْدِرْ عَلَى الْقِيَامِ فَإِذَا قُطِعَتْ يَدُهُ الْيُمْنَى وَ رِجْلُهُ الْيُسْرَى اعْتَدَلَ وَ اسْتَوَى قَائِماً ",
          "قُلْتُ لَهُ جُعِلْتُ فِدَاكَ وَ كَيْفَ يَقُومُ وَ قَدْ قُطِعَتْ رِجْلُهُ قَالَ إِنَّ الْقَطْعَ لَيْسَ مِنْ حَيْثُ رَأَيْتَ يُقْطَعُ إِنَّمَا يُقْطَعُ الرِّجْلُ مِنَ الْكَعْبِ وَ يُتْرَكُ مِنْ قَدَمِهِ مَا يَقُومُ عَلَيْهِ يُصَلِّي وَ يَعْبُدُ اللَّهَ ",
          "قُلْتُ لَهُ مِنْ أَيْنَ تُقْطَعُ الْيَدُ قَالَ تُقْطَعُ الْأَرْبَعُ أَصَابِعَ وَ تُتْرَكُ الْإِبْهَامُ يَعْتَمِدُ عَلَيْهَا فِي الصَّلَاةِ وَ يَغْسِلُ بِهَا وَجْهَهُ لِلصَّلَاةِ ",
          "قُلْتُ فَهَذَا الْقَطْعَ مَنْ أَوَّلُ مَنْ قَطَعَ قَالَ قَدْ كَانَ عُثْمَانُ بْنُ عَفَّانَ حَسَّنَ ذَلِكَ لِمُعَاوِيَةَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Abdullah Bin Hilal, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I said to him<sup>asws</sup>, ‘Inform me about the thief, why is his right hand and his left leg cut, and his right hand and his right leg is not cut?’ So he<sup>asws</sup> said: ‘How good is what you have asked. When his right hand and right leg is cut, he would fall upon his left side, and he would not be able to stand. So when his right hand and his left leg are cut, he would balance and be able to stand straight’. ",
            "I said to him<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! And how can he stand and his leg has been cut?’ He<sup>asws</sup> said: ‘The cutting is not from where you view as him being cut. But rather, the man would be cut from the lower part of the foot, and there would be left from his foot upon which he can stand to Pray and worship Allah<sup>azwj</sup>’. ",
            "I said to him<sup>asws</sup>, ‘From where would the hand be cut?’ He<sup>asws</sup> said: ‘The four fingers would be cut, and the thumb would be left, so he can depend upon it during the Prayer, and he can wash his face with it for the Prayer’. ",
            "I said, ‘So this is the cutting from the first one who was cut (in such a manner)?’ He<sup>asws</sup> said: ‘It was Usman Bin Affan who made that good for Muawiya’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:3:36",
  "kind": "verse_list"
}