{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:7:3",
        "titles": {
          "ar": "كتاب الْحُدُودِ ",
          "en": "THE BOOK OF LEGAL PENALTIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 44"
        },
        "path": "/books/al-kafi:7:3:44",
        "titles": {
          "ar": "باب حَدِّ الصِّبْيَانِ فِي السَّرِقَةِ",
          "en": "Chapter 44 – Penalty (Hadd) of the children regarding the theft"
        }
      }
    ],
    "index": 2137,
    "local_index": 44,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 45"
        },
        "path": "/books/al-kafi:7:3:45",
        "titles": {
          "ar": "باب مَا يَجِبُ عَلَى الْمَمَالِيكِ وَ الْمُكَاتَبِينَ مِنَ الْحَدِّ",
          "en": "Chapter 45 – What Penalty (Hadd) is Obigated upon the owned (slaves) and the contracted (slaves)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 43"
        },
        "path": "/books/al-kafi:7:3:43",
        "titles": {
          "ar": "باب أَنَّهُ لَا يُقْطَعُ السَّارِقُ فِي الْمَجَاعَةِ",
          "en": "Chapter 43 – The thief would not be cut during the famine"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:7:3",
        "titles": {
          "ar": "كتاب الْحُدُودِ ",
          "en": "THE BOOK OF LEGAL PENALTIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:3:44",
    "titles": {
      "ar": "باب حَدِّ الصِّبْيَانِ فِي السَّرِقَةِ",
      "en": "Chapter 44 – Penalty (Hadd) of the children regarding the theft"
    },
    "verse_count": 11,
    "verse_start_index": 13774,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 13775,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الصَّبِيِّ يَسْرِقُ قَالَ يُعْفَى عَنْهُ مَرَّةً وَ مَرَّتَيْنِ وَ يُعَزَّرُ فِي الثَّالِثَةِ فَإِنْ عَادَ قُطِعَتْ أَطْرَافُ أَصَابِعِهِ فَإِنْ عَادَ قُطِعَ أَسْفَلُ مِنْ ذَلِكَ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus, from Abdullah Bin Sinan who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the child who steals. He<sup>asws</sup> said: ‘He would be excused from it once, and twice, and he would be rebuked during the third. So if he repeats, a bit of his finger would be cut. So if he repeats, lower than that would be cut’."
          ]
        }
      },
      {
        "index": 13776,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:2",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنِ الصَّبِيِّ يَسْرِقُ قَالَ إِذَا سَرَقَ مَرَّةً وَ هُوَ صَغِيرٌ عُفِيَ عَنْهُ فَإِنْ عَادَ عُفِيَ عَنْهُ فَإِنْ عَادَ قُطِعَ بَنَانُهُ فَإِنْ عَادَ قُطِعَ أَسْفَلُ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about the child who steals. He<sup>asws</sup> said: ‘When he steals once and he is small, he would be excused from it. So if he repeats, he would be excused from it. So if he repeats, his fingertip would be cut. So if he repeats, he would be cut lower than that’."
          ]
        }
      },
      {
        "index": 13777,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:3",
        "text": [
          "عَنْهُ عَنْ صَفْوَانَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي إِبْرَاهِيمَ ( عليه السلام ) الصِّبْيَانُ إِذَا أُتِيَ بِهِمْ عَلِيٌّ ( عليه السلام ) قَطَعَ أَنَامِلَهُمْ مِنْ أَيْنَ قَطَعَ فَقَالَ مِنَ الْمَفْصِلِ مَفْصِلِ الْأَنَامِلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Safwan, from Is’haq Bin Ammar, said, ",
            "‘I said to Abu Ibrahim<sup>asws</sup> (7<sup>th</sup> Imam<sup>asws</sup>), ‘The children, when they came with them, Ali<sup>asws</sup> cut their fingertips from where did he<sup>asws</sup> cut?’ So he<sup>asws</sup> said: ‘From the joints, the joints of the fingertips’."
          ]
        }
      },
      {
        "index": 13778,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَرَقَ الصَّبِيُّ عُفِيَ عَنْهُ فَإِنْ عَادَ عُزِّرَ فَإِنْ عَادَ قُطِعَ أَطْرَافُ الْأَصَابِعِ فَإِنْ عَادَ قُطِعَ أَسْفَلُ مِنْ ذَلِكَ ",
          "وَ قَالَ أُتِيَ عَلِيٌّ بِغُلَامٍ يُشَكُّ فِي احْتِلَامِهِ فَقَطَعَ أَطْرَافَ الْأَصَابِعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the child steals, he would be excused from it. So if he repeats, he is rebuked. So if he repeats, the ends of the fingers are cut. So if he repeats, he would be cut lower than that’. ",
            "And he<sup>asws</sup> said: ‘They came to Ali<sup>asws</sup> with a boy, there was doubt with regards to him having bed-wetted yet. So he<sup>asws</sup> cut the ends of the fingers’."
          ]
        }
      },
      {
        "index": 13779,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ عَلِيٌّ ( عليه السلام ) بِجَارِيَةٍ لَمْ تَحِضْ قَدْ سَرَقَتْ فَضَرَبَهَا أَسْوَاطاً وَ لَمْ يَقْطَعْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘They came to Ali<sup>asws</sup> with an unmarried girl who had stolen. So he<sup>asws</sup> lashed her with a whip and did not cut her’."
          ]
        }
      },
      {
        "index": 13780,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الصَّبِيِّ يَسْرِقُ قَالَ يُعْفَى عَنْهُ مَرَّةً فَإِنْ عَادَ قُطِعَتْ أَنَامِلُهُ أَوْ حُكَّتْ حَتَّى تَدْمَى فَإِنْ عَادَ قُطِعَتْ أَصَابِعُهُ فَإِنْ عَادَ قُطِعَ أَسْفَلُ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Muhammad Bin Yahya, from Ahmad Bin Muhammad, altogether from Ibn Mahboub, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the child who steals. He<sup>asws</sup> said: ‘He would be excused from it once. So if he repeats, his fingertips would be cut, or they would be scratched until they bleed. So he if repeats, his fingers would be cut. So if he repeats, he would be cut lower than that’."
          ]
        }
      },
      {
        "index": 13781,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:7",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ ابْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ مِنْ أَصْحَابِهِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ أُتِيَ عَلِيٌّ ( عليه السلام ) بِغُلَامٍ قَدْ سَرَقَ فَطَرَّفَ أَصَابِعَهُ ثُمَّ قَالَ أَمَا لَئِنْ عُدْتَ لَأَقْطَعَنَّهَا ثُمَّ قَالَ أَمَا إِنَّهُ مَا عَمِلَهُ إِلَّا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Ibn Sama’at, from someone else, from his companion, from Aban Bin Usman, from Zurara who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘They came to Ali<sup>asws</sup> with a boy who had stolen. So he<sup>asws</sup> scratched his fingers, then said: ‘But, if you were to repeat, I would cut these’. Then he<sup>asws</sup> said: ‘But it has not been done except by Rasool-Allah<sup>saww</sup> and myself<sup>asws</sup>’."
          ]
        }
      },
      {
        "index": 13782,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:8",
        "text": [
          "أَبَانٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا سَرَقَ الصَّبِيُّ وَ لَمْ يَحْتَلِمْ قُطِعَتْ أَطْرَافُ أَصَابِعِهِ قَالَ وَ قَالَ [عَلِيٌّ ع] لَمْ يَصْنَعْهُ إِلَّا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Aban, from Abdul Rahman Bin Abu Abdullah, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘When the child steals and he has yet to bed-wet, the ends of his fingers would be cut’. And Ali<sup>asws</sup> said: ‘It has not been done except by Rasool-Allah<sup>saww</sup> and myself<sup>asws</sup>’."
          ]
        }
      },
      {
        "index": 13783,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ بَعْضِ أَصْحَابِهِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الصَّبِيِّ يَسْرِقُ فَقَالَ إِنْ كَانَ لَهُ تِسْعُ سِنِينَ قُطِعَتْ يَدُهُ وَ لَا يُضَيَّعُ حَدٌّ مِنْ حُدُودِ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from one of his companions, from Al A’la Bin Razeyn, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the child who stole, so he<sup>asws</sup> said: ‘If he was nine years of age, his hand would be cut, and a Penalty (<span class=\"iTxt\">Hadd</span>) from the Penalties of Allah<sup>azwj</sup> would not be wasted’."
          ]
        }
      },
      {
        "index": 13784,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:10",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ زُرَارَةَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ أُتِيَ عَلِيٌّ ( عليه السلام ) بِغُلَامٍ قَدْ سَرَقَ فَطَرَّفَ أَصَابِعَهُ ثُمَّ قَالَ أَمَا لَئِنْ عُدْتَ لَأَقْطَعَنَّهَا قَالَ ثُمَّ قَالَ أَمَا إِنَّهُ مَا عَمِلَهُ إِلَّا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ أَنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Washa, from Aban, from Razeyn who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘They came to Ali<sup>asws</sup> with a boy who had stolen, so he<sup>asws</sup> scratched his fingers, then said: ‘But, if you were to repeat, I<sup>asws</sup> would cut these’. Then he<sup>asws</sup> said: ‘But, it was not done except by Rasool-Allah<sup>saww</sup> and myself<sup>asws</sup>’."
          ]
        }
      },
      {
        "index": 13785,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:44:11",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ النَّهِيكِيِّ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عِدَّةٍ مِنْ أَصْحَابِنَا عَنْ مُحَمَّدِ بْنِ خَالِدِ بْنِ عَبْدِ اللَّهِ الْقَسْرِيِّ قَالَ كُنْتُ عَلَى الْمَدِينَةِ فَأُتِيتُ بِغُلَامٍ قَدْ سَرَقَ فَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْهُ فَقَالَ سَلْهُ حَيْثُ سَرَقَ كَانَ يَعْلَمُ أَنَّ عَلَيْهِ فِي السَّرِقَةِ عُقُوبَةً فَإِنْ قَالَ نَعَمْ قِيلَ لَهُ أَيُّ شَيْ‏ءٍ تِلْكَ الْعُقُوبَةُ فَإِنْ لَمْ يَعْلَمْ أَنَّ عَلَيْهِ فِي السَّرِقَةِ قَطْعاً فَخَلِّ عَنْهُ ",
          "قَالَ فَأَخَذْتُ الْغُلَامَ فَسَأَلْتُهُ وَ قُلْتُ لَهُ أَ كُنْتَ تَعْلَمُ أَنَّ فِي السَّرِقَةِ عُقُوبَةً قَالَ نَعَمْ قُلْتُ أَيُّ شَيْ‏ءٍ هُوَ قَالَ الضَّرْبُ فَخَلَّيْتُ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin ziyad, from Ubeydullah Bin Ahmad Al Naheyki, from Ibn Abu Umeyr, from a number of companions, from Muhammad Bin Khalid Bin Abdullah Al Qasary who said, ",
            "‘I was at Al-Medina, so they came with a boy who had stolen. So I asked Abu Abdullah<sup>asws</sup> about it, so he<sup>asws</sup> said: ‘Ask him that when he stole, did he know that with regards to the stealing there would be punishment upon him? So if he says yes, so say to him, ‘Which is that punishment?’ So if he does not know that upon him, with regards to the theft, is the cutting, so free him from it’. ",
            "He said, ‘So I seized the boy and asked him, and said to him, ‘Did you know that regarding the theft is punishment?’ He said, ‘Yes’. I said, ‘Which thing is it?’ He said, ‘The whipping’. So I freed him from it’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:3:44",
  "kind": "verse_list"
}