{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:7:3",
        "titles": {
          "ar": "كتاب الْحُدُودِ ",
          "en": "THE BOOK OF LEGAL PENALTIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 63"
        },
        "path": "/books/al-kafi:7:3:63",
        "titles": {
          "ar": "باب النَّوَادِرِ",
          "en": "Chapter 63 – The Miscelanneous"
        }
      }
    ],
    "index": 2156,
    "local_index": 63,
    "nav": {
      "prev": {
        "indexed_titles": {
          "en": "Chapter 62"
        },
        "path": "/books/al-kafi:7:3:62",
        "titles": {
          "ar": "باب حَدِّ السَّاحِرِ",
          "en": "Chapter 62 – Penalty (Hadd) of the sorcerer"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:7:3",
        "titles": {
          "ar": "كتاب الْحُدُودِ ",
          "en": "THE BOOK OF LEGAL PENALTIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:3:63",
    "titles": {
      "ar": "باب النَّوَادِرِ",
      "en": "Chapter 63 – The Miscelanneous"
    },
    "verse_count": 45,
    "verse_start_index": 13908,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 13909,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْحَسَنِ بْنِ صَالِحٍ الثَّوْرِيِّ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) أَمَرَ قَنْبَرَ أَنْ يَضْرِبَ رَجُلًا حَدّاً فَغَلُظَ قَنْبَرٌ فَزَادَهُ ثَلَاثَةَ أَسْوَاطٍ فَأَقَادَهُ عَلِيٌّ ( عليه السلام ) مِنْ قَنْبَرٍ ثَلَاثَةَ أَسْوَاطٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al Hassan Bin Salih Al Sowry, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said that Amir Al-Momineen<sup>asws</sup> ordered Qanbar that he should whip a man, a Penalty (<span class=\"iTxt\">Hadd</span>). So Qanbar was harsh, and increased by three lashes. So Ali<sup>asws</sup> caused retaliation from Qanbar of the three (excessive) lashes’."
          ]
        }
      },
      {
        "index": 13910,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) إِنَّ أَبْغَضَ النَّاسِ إِلَى اللَّهِ عَزَّ وَ جَلَّ رَجُلٌ جَرَّدَ ظَهْرَ مُسْلِمٍ بِغَيْرِ حَقٍّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘The most hateful of the people to Allah<sup>azwj</sup> Mighty and Majestic is a man who bares the back of a Muslim without a right (to do so)’."
          ]
        }
      },
      {
        "index": 13911,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:3",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ بَعْضِ أَصْحَابِنَا قَالَ نَهَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَنِ الْأَدَبِ عِنْدَ الْغَضَبِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ali Bin Asbat, from one of our companions who said, ",
            "‘Rasool-Allah<sup>saww</sup> forbade from the disciplining during the anger’."
          ]
        }
      },
      {
        "index": 13912,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلَّالِ قَالَ قَالَ يَاسِرٌ عَنْ بَعْضِ الْغِلْمَانِ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) أَنَّهُ قَالَ لَا يَزَالُ الْعَبْدُ يَسْرِقُ حَتَّى إِذَا اسْتَوْفَى ثَمَنَ يَدِهِ أَظْهَرَهَا اللَّهُ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Ahmad Bin Umar Al Hallal, from Yasir, from one of the slaves, ",
            "From Abu Al-Hassan<sup>asws</sup> having said: ‘If a servant does not stop from stealing even after he is satisfied with his wages, Allah<sup>azwj</sup> Exposes it against him’."
          ]
        }
      },
      {
        "index": 13913,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:5",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ فِي مَسَائِلِ إِسْمَاعِيلَ بْنِ عِيسَى عَنِ الْأَخِيرِ فِي مَمْلُوكٍ يَعْصِي صَاحِبَهُ أَ يَحِلُّ ضَرْبُهُ أَمْ لَا فَقَالَ لَا يَحِلُّ لَكَ أَنْ تَضْرِبَهُ إِنْ وَافَقَكَ فَأَمْسِكْهُ وَ إِلَّا فَخَلِّ عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, in the questions of Ismail Bin Isa, ",
            "(It has been narrated) from Al-Akheer regarding an owned (slave) who disobeys his master, is it Permissible to whip him or not?’ So he<sup>asws</sup> said: ‘It is not Permissible for you that you should whip him, if he is compatible with you, so keep him, or else release him’."
          ]
        }
      },
      {
        "index": 13914,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:6",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ أَبِي الْبَخْتَرِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ مَنْ أَقَرَّ عِنْدَ تَجْرِيدٍ أَوْ تَخْوِيفٍ أَوْ حَبْسٍ أَوْ تَهْدِيدٍ فَلَا حَدَّ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bandar, from Ahmad Bin Abu Abdullah, form his father, from Abu Al Bakhtary, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> said, ‘The one who confesses during the stripping, or frightening, or imprisonment, or imposition of a Penalty (<span class=\"iTxt\">Hadd</span>), so there is no Penalty (<span class=\"iTxt\">Hadd</span>) upon him (Due to being under duress/pressure)’."
          ]
        }
      },
      {
        "index": 13915,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ أَسْلَمَ الْجَبَلِيِّ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ امْرَأَةٍ ذَاتِ بَعْلٍ زَنَتْ فَحَبِلَتْ فَلَمَّا وَلَدَتْ قَتَلَتْ وَلَدَهَا سِرّاً قَالَ تُجْلَدُ مِائَةَ [جَلْدَةٍ] لِقَتْلِهَا وَلَدَهَا وَ تُرْجَمُ لِأَنَّهَا مُحْصَنَةٌ ",
          "قَالَ وَ سَأَلْتُهُ عَنِ امْرَأَةٍ غَيْرِ ذَاتِ بَعْلٍ زَنَتْ فَحَبِلَتْ فَقَتَلَتْ وَلَدَهَا سِرّاً قَالَ تُجْلَدُ مِائَةً لِأَنَّهَا زَنَتْ وَ تُجْلَدُ مِائَةً لِأَنَّهَا قَتَلَتْ وَلَدَهَا."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Muhammad Bin Aslam Al Jabaly, form Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(The narrator) says, ‘I asked Abu Ja’far<sup>asws</sup> about a woman who was with a husband, committed adultery, so she became pregnant. So when she gave birth, she killer her child secretly. He<sup>asws</sup> said: ‘She would be whipped one hundred lashes due to killing her child, and she would be stoned (to death) because she was married (while committing immorality)’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a woman who was not with a husband, committed adultery. So she killed her child secretly. He<sup>asws</sup> said: ‘She would be whipped one hundred (lashes) because she committed adultery, and she would be whipped one hundred (lashes) because she killed her child’."
          ]
        }
      },
      {
        "index": 13916,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ مَنْ أَقَرَّ بِوَلَدٍ ثُمَّ نَفَاهُ جُلِدَ الْحَدَّ وَ أُلْزِمَ الْوَلَدَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that Amir Al-Momineen<sup>asws</sup> said: ‘The one who confesses with (ownership of) a child, then denies it, would be whipped the Penalty (<span class=\"iTxt\">Hadd</span>), and the child would be enforced upon him’."
          ]
        }
      },
      {
        "index": 13917,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:9",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ صَالِحِ بْنِ سَعِيدٍ رَفَعَهُ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ يَسْرِقُ فَتُقْطَعُ يَدُهُ بِإِقَامَةِ الْبَيِّنَةِ عَلَيْهِ وَ لَمْ يَرُدَّ مَا سَرَقَ كَيْفَ يُصْنَعُ بِهِ فِي مَالِ الرَّجُلِ الَّذِي سَرَقَ مِنْهُ أَ وَ لَيْسَ عَلَيْهِ رَدُّهُ وَ إِنِ ادَّعَى أَنَّهُ لَيْسَ عِنْدَهُ قَلِيلٌ وَ لَا كَثِيرٌ وَ عُلِمَ ذَلِكَ مِنْهُ قَالَ يُسْتَسْعَى حَتَّى يُؤَدِّيَ آخِرَ دِرْهَمٍ سَرَقَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Salih Bin Saeed, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), said, ‘I asked him<sup>asws</sup> about a man who stole, so his hand was cut by the establishment of the proof against him, but he did not return what he had stolen. So how should one deal with the property of the man whom it had been stolen from, or is there not the returning upon him? And if he were to claim that there is nothing in his possession anymore, neither less nor more, and that is known to be from him?’ He<sup>asws</sup> said: ‘He would be made to work until he pays back the last Dirham he had stolen’."
          ]
        }
      },
      {
        "index": 13918,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:10",
        "text": [
          "عَلِيٌّ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَخْبِرْنِي عَنِ الْقَوَّادِ مَا حَدُّهُ قَالَ لَا حَدَّ عَلَى الْقَوَّادِ أَ لَيْسَ إِنَّمَا يُعْطَى الْأَجْرَعَلَى أَنْ يَقُودَ قُلْتُ جُعِلْتُ فِدَاكَ إِنَّمَا يَجْمَعُ بَيْنَ الذَّكَرِ وَ الْأُنْثَى حَرَاماً قَالَ ذَاكَ الْمُؤَلِّفُ بَيْنَ الذَّكَرِ وَ الْأُنْثَى حَرَاماً فَقُلْتُ هُوَ ذَاكَ جُعِلْتُ فِدَاكَ قَالَ يُضْرَبُ ثَلَاثَةَ أَرْبَاعِ حَدِّ الزَّانِي خَمْسَةً وَ سَبْعِينَ سَوْطاً وَ يُنْفَى مِنَ الْمِصْرِ الَّذِي هُوَ فِيهِ ",
          "فَقُلْتُ جُعِلْتُ فِدَاكَ فَمَا عَلَى رَجُلٍ الَّذِي وَثَبَ عَلَى امْرَأَةٍ فَحَلَقَ رَأْسَهَا قَالَ يُضْرَبُ ضَرْباً وَجِيعاً وَ يُحْبَسُ فِي سِجْنِ الْمُسْلِمِينَ حَتَّى يُسْتَبْرَأَ شَعْرُهَا فَإِنْ نَبَتَ أُخِذَ مِنْهُ مَهْرُ نِسَائِهَا وَ إِنْ لَمْ يَنْبُتْ أُخِذَتْ مِنْهُ الدِّيَةُ كَامِلَةً خَمْسَةُ آلَافِ دِرْهَمٍ فَقُلْتُ فَكَيْفَ صَارَ مَهْرَ نِسَائِهَا إِنْ نَبَتَ شَعْرُهَا قَالَ يَا ابْنَ سِنَانٍ إِنَّ شَعْرَ الْمَرْأَةِ وَ عُذْرَتَهَا يَشْتَرِكَانِ فِي الْجَمَالِ فَإِذَا ذُهِبَ بِأَحَدِهِمَا وَجَبَ لَهَا الْمَهْرُ كَامِلًا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Muhammad Bin Suleyman, from Abdullah Bin Sinan who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Inform me about the pimp, what is his Penalty (<span class=\"iTxt\">Hadd</span>)?’ He<sup>asws</sup> said: ‘There is no Penalty (<span class=\"iTxt\">Hadd</span>) upon the pimp. Is it not, rather, he is given the wages upon what he procures?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! But rather, he gathers between the male and the female unlawfully’. He<sup>asws</sup> said: ‘That is the joiner between the male and the female unlawfully?’ So I said, ‘He is that, may I be sacrificed for you<sup>asws</sup>’. He<sup>asws</sup> said: ‘He would be whipped three quarters of a Penalty (<span class=\"iTxt\">Hadd</span>) of the adulterer, seventy five lashes, and he would be exiled from the city in which he is in’. ",
            "So I said, ‘May I be sacrificed for you<sup>asws</sup>! So what is upon a man who pounces upon a woman and shaves off her head?’ He<sup>asws</sup> said: ‘He would be whipped painful lashes, and he would be imprisoned in a prison of the Muslims until her hair grows back. So when it does grows back, (an amount equal to) a dower of his womenfolk would be taken from him. And if it does not grow back, the complete wergild of five thousand Dirhams is taken from him’. So I said, ‘So how did it come to be a dower of his womenfolk, if her hair does grows back?’ He<sup>asws</sup> said: ‘O Ibn Sinan! Hair of the woman, and her virginity are two associates in the beauty. So if one of the two goes away, the complete dower is Obligated for her’."
          ]
        }
      },
      {
        "index": 13919,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:11",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْعَلَاءِ بْنِ الْفُضَيْلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الرَّجُلُ يَنْتَفِي مِنْ وَلَدِهِ وَ قَدْ أَقَرَّ بِهِ فَقَالَ إِنْ كَانَ الْوَلَدُ مِنْ حُرَّةٍ جُلِدَ الْحَدَّ خَمْسِينَ سَوْطاً حَدَّ الْمَمْلُوكِ وَ إِنْ كَانَ مِنْ أَمَةٍ فَلَا شَيْ‏ءَ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa, from Muhammad Bin Sinan, from Al A’la Bin Al Fuzayl, ",
            "(The narrator) says, ‘I said to Abu Abdullah<sup>asws</sup>, ‘The man denies from his child, and he had previously acknowledge with it. So he<sup>asws</sup> said: ‘If the child was from a free woman, he would be whipped the Penalty (<span class=\"iTxt\">Hadd</span>) of fifty lashes, a Penalty (<span class=\"iTxt\">Hadd</span>) of the owned (slaves), and if it was from a slave girl, so there is nothing upon him’."
          ]
        }
      },
      {
        "index": 13920,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:12",
        "text": [
          "مُحَمَّدُ بْنُ أَحْمَدَ عَنْ أَبِي عَبْدِ اللَّهِ الرَّازِيِّ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي عَبْدِ اللَّهِ الْمُؤْمِنِ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الزِّنَى أَشَرُّ أَوْ شُرْبُ الْخَمْرِ وَ كَيْفَ صَارَ فِي الْخَمْرِ ثَمَانِينَ وَ فِي الزِّنَى مِائَةً فَقَالَ يَا إِسْحَاقُ الْحَدُّ وَاحِدٌ وَ لَكِنْ زِيدَ هَذَا لِتَضْيِيعِهِ النُّطْفَةَ وَ لِوَضْعِهِ إِيَّاهَا فِي غَيْرِ مَوْضِعِهَا الَّذِي أَمَرَهُ اللَّهُ عَزَّ وَ جَلَّ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ahmad, from Abu Abdullah Al Razy, from Al Hassan Bin Ali Bin Abu Hamza, from Abu Abdullah Al Momin, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is the adulterer more evil or drinker of the wine? And how did eighty lashes come to be with regards to the wine, and a hundred regarding adultery?’ So he<sup>asws</sup> said: ‘O Is’haq! The Penalty (<span class=\"iTxt\">Hadd</span>) is one, but there is an increase in this due to his wasting of the sperm and placing it in other than its (rightful) place which Allah<sup>azwj</sup> Mighty and Majestic has Commanded it with’."
          ]
        }
      },
      {
        "index": 13921,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:13",
        "text": [
          "مُحَمَّدُ بْنُ أَحْمَدَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ الثَّقَفِيِّ عَنْ إِبْرَاهِيمَ بْنِ يَحْيَى الثَّوْرِيِّ عَنْ هَيْثَمِ بْنِ بَشِيرٍ عَنْ أَبِي بَشِيرٍ عَنْ أَبِي رَوْحٍ أَنَّ امْرَأَةً تَشَبَّهَتْ بِأَمَةٍ لِرَجُلٍ وَ ذَلِكَ لَيْلًا فَوَاقَعَهَا وَ هُوَ يَرَى أَنَّهَا جَارِيَتُهُ فَرُفِعَ إِلَى عُمَرَ فَأَرْسَلَ إِلَى عَلِيٍّ ( عليه السلام ) فَقَالَ اضْرِبِ الرَّجُلَ حَدّاً فِي السِّرِّ وَ اضْرِبِ الْمَرْأَةَ حَدّاً فِي الْعَلَانِيَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ahmad, from one of his companions, from Ibrahim Bin Muhammad Al Saqafy, from Ibrahim Bin Yahya Al Sowry, from Haysam Bin Basheer, from Abu Basheer, from Abu Rawh that, ",
            "‘A woman resembled herself with a slave girl for a man, and that was at night. So he fell upon her, and he took her for his slave girl. So the matter was raised to Umar. So he sent a messenger to Ali<sup>asws</sup>, so he<sup>asws</sup> said: ‘Whip the man a Penalty (<span class=\"iTxt\">Hadd</span>) in the secrecy, and whip the woman a Penalty (<span class=\"iTxt\">Hadd</span>) in the open’."
          ]
        }
      },
      {
        "index": 13922,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:14",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يُقَامُ الْحَدُّ عَلَى الْمُسْتَحَاضَةِ حَتَّى يَنْقَطِعَ الدَّمُ عَنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The Penalty would not be established upon the menstruating woman until the (flow of) blood is cut off from her’."
          ]
        }
      },
      {
        "index": 13923,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:15",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ الْمَحْمُودِيِّ عَنْ أَبِيهِ عَنْ يُونُسَ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَمِعْتُهُ يَقُولُ الْوَاجِبُ عَلَى الْإِمَامِ إِذَا نَظَرَ إِلَى رَجُلٍ يَزْنِي أَوْ يَشْرَبُ الْخَمْرَ أَنْ يُقِيمَ عَلَيْهِ الْحَدَّ وَ لَا يَحْتَاجُ إِلَى بَيِّنَةٍ مَعَ نَظَرِهِ لِأَنَّهُ أَمِينُ اللَّهِ فِي خَلْقِهِ وَ إِذَا نَظَرَ إِلَى رَجُلٍ يَسْرِقُ فَالْوَاجِبُ عَلَيْهِ أَنْ يَزْبُرَهُ وَ يَنْهَاهُ وَ يَمْضِيَ وَ يَدَعَهُ قُلْتُ كَيْفَ ذَاكَ قَالَ لِأَنَّ الْحَقَّ إِذَا كَانَ لِلَّهِ فَالْوَاجِبُ عَلَى الْإِمَامِ إِقَامَتُهُ وَ إِذَا كَانَ لِلنَّاسِ فَهُوَ لِلنَّاسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Muhammad Bin Ahmad Al Mahmoudy, from his father, from Yunus, from Al Husayn Bin Khalid, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I heard him<sup>asws</sup> saying: ‘It is Obligatory upon the Imam<sup>asws</sup> when he<sup>asws</sup> finds a man committing adultery, or drinking the wine, that he<sup>asws</sup> should established the Penalty (<span class=\"iTxt\">Hadd</span>) upon him, and he<sup>asws</sup> is not needy of any proof along with his<sup>asws</sup> vision, because he<sup>asws</sup> is a Trustee of Allah<sup>azwj</sup> among His<sup>azwj</sup> creatures. And when he<sup>asws</sup> looks at a man who steals, so it is Obligatory upon him<sup>asws</sup> that he<sup>asws</sup> reprimands him, and forbids him, and goes and leaves him’. I said, ‘How can that be so?’ He<sup>asws</sup> said: ‘Because the truth, if it was for the Sake of Allah<sup>azwj</sup>, so it is Obligatory upon the Imam<sup>asws</sup> to stand by it, and when it was for the people, so it is for the people (to stand by it)’."
          ]
        }
      },
      {
        "index": 13924,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:16",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ رَفَعَهُ قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يُوَلِّي الشُّهُودَ الْحُدُودَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, raising it, said, ",
            "‘Amir Al-Momineen<sup>asws</sup> used to give the authority to the witnesses for (execution of) the Penalties’."
          ]
        }
      },
      {
        "index": 13925,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:17",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ مَنْ ضَرَبَ مَمْلُوكاً حَدّاً مِنَ الْحُدُودِ مِنْ غَيْرِ حَدٍّ أَوْجَبَهُ الْمَمْلُوكُ عَلَى نَفْسِهِ لَمْ يَكُنْ لِضَارِبِهِ كَفَّارَةٌ إِلَّا عِتْقُهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Hisham Bin Salim, from Abu Baseer, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘The one who whips an owned (slave), a Penalty (<span class=\"iTxt\">Hadd</span>) from the Penalties, without a Penalty (<span class=\"iTxt\">Hadd</span>) having been Obligated upon himself, there would not be an expiation except for his emancipation (libration)’."
          ]
        }
      },
      {
        "index": 13926,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:18",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ الْمِيثَمِيِّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنِ ابْنِ أَبِي يَعْفُورٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ ( صلى الله عليه وآله ) فَقَالَ يَا رَسُولَ اللَّهِ إِنَّنِي سَأَلْتُ رَجُلًا بِوَجْهِ اللَّهِ فَضَرَبَنِي خَمْسَةَ أَسْوَاطٍ فَضَرَبَهُ النَّبِيُّ ( صلى الله عليه وآله ) خَمْسَةَ أَسْوَاطٍ أُخْرَى وَ قَالَ سَلْ بِوَجْهِكَ اللَّئِيمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Humeyd Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ahmad Bin Al Hassan Al Maysami, from Aban Bin Usman, from Ibn Abu Yafour, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘A man came to the Prophet<sup>saww</sup>, so he said, ‘O Rasool-Allah<sup>saww</sup>! I asked a man by the Face of Allah<sup>azwj</sup>, so he whipped me five lashes’. So the Prophet<sup>saww</sup> whipped him another five lashes and said: ‘Ask by your own ignoble face’."
          ]
        }
      },
      {
        "index": 13927,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:19",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ قَالَ إِنَّ رَجُلًا قَالَ لِرَجُلٍ عَلَى عَهْدِ أَمِيرِ الْمُؤْمِنِينَ <span class=\"bTxt\">( عليه السلام ) إِنِّي احْتَلَمْتُ بِأُمِّكَ فَرَفَعَهُ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ إِنَّ هَذَا افْتَرَى عَلَى أُمِّي فَقَالَ لَهُ وَ مَا قَالَ لَكَ قَالَ زَعَمَ أَنَّهُ احْتَلَمَ بِأُمِّي فَقَالَ لَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي الْعَدْلِ إِنْ شِئْتَ أَقَمْتُهُ لَكَ فِي الشَّمْسِ فَاجْلِدْ ظِلَّهُ فَإِنَّ الْحُلُمَ مِثْلُ الظِّلِّ وَ لَكِنْ سَنَضْرِبُهُ حَتَّى لَا يَعُودَ يُؤْذِي الْمُسْلِمِينَ .</span>",
          "وَ فِي رِوَايَةٍ أُخْرَى ضَرَبَهُ ضَرْباً وَجِيعاً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Sama’at who said, ",
            "‘A man said to a man, during the era of Amir Al-Momineen<sup>asws</sup>, ‘I bed-wetted with your mother (in mind)’. So it was raised to Amir Al-Momineen<sup>asws</sup>. He said, ‘This one has fabricated upon my mother’. So he<sup>asws</sup> said to him: ‘And what did he say to you?’ He said, ‘He claims that he bed-wetted by (having) my mother (in mind)’. So Amir Al-Momineen<sup>asws</sup> said to him: ‘With regards to the justice, if I<sup>asws</sup> so desire to, for you, I<sup>asws</sup> would make him stand in the (heat of) the sun, and whip his shadow, for the dream is similar to the shadow. But, we<sup>asws</sup> shall be whipping him until he does not repeat hurting the Muslims’. ",
            "And in another report, he<sup>asws</sup> whipped him with a painful whipping’."
          ]
        }
      },
      {
        "index": 13928,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:20",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) رَأَى قَاصّاً فِي الْمَسْجِدِ فَضَرَبَهُ بِالدِّرَّةِ وَ طَرَدَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that: ‘Amir Al-Momineen<sup>asws</sup> saw a story-teller in the Masjid, so he<sup>asws</sup> hit him with the whip and expelled him’."
          ]
        }
      },
      {
        "index": 13929,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:21",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ رَفَعَهُ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) كَانَ لَا يَرَى الْحَبْسَ إِلَّا فِي ثَلَاثٍ رَجُلٍ أَكَلَ مَالَ الْيَتِيمِ أَوْ غَصَبَهُ أَوْ رَجُلٍ اؤْتُمِنَ عَلَى أَمَانَةٍ فَذَهَبَ بِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj, raising it, ",
            "(It has been narrated) that Amir Al-Momineen<sup>asws</sup> would never imprison anyone except regarding three – a man who consumed the property of the orphan, or usurped it (property), or a man who was enstrusted upon a trust, so he went away (absconded) with it’."
          ]
        }
      },
      {
        "index": 13930,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:22",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مِرْدَاسٍ عَنْ سَعْدَانَ بْنِ مُسْلِمٍ عَنْ بَعْضِ أَصْحَابِنَا عَنِ الْحَارِثِ بْنِ حَصِيرَةَ قَالَ مَرَرْتُ بِحَبَشِيٍّ وَ هُوَ يَسْتَسْقِي بِالْمَدِينَةِ وَ إِذَا هُوَ أَقْطَعُ فَقُلْتُ لَهُ مَنْ قَطَعَكَ فَقَالَ قَطَعَنِي خَيْرُ النَّاسِ إِنَّا أُخِذْنَا فِي سَرِقَةٍ وَ نَحْنُ ثَمَانِيَةُ نَفَرٍ فَذُهِبَ بِنَا إِلَى عَلِيِّ بْنِ أَبِي طَالِبٍ ( عليه السلام ) فَأَقْرَرْنَا بِالسَّرِقَةِ فَقَالَ لَنَا تَعْرِفُونَ أَنَّهَا حَرَامٌ قُلْنَا نَعَمْ فَأَمَرَ بِنَا فَقُطِعَتْ أَصَابِعُنَا مِنَ الرَّاحَةِ وَ خُلِّيَتِ الْإِبْهَامُ ",
          "ثُمَّ أَمَرَ بِنَا فَحُبِسْنَا فِي بَيْتٍ يُطْعِمُنَا فِيهِ السَّمْنَ وَ الْعَسَلَ حَتَّى بَرَأَتْ أَيْدِينَا ثُمَّ أَمَرَ بِنَا فَأُخْرِجْنَا وَ كَسَانَا فَأَحْسَنَ كِسْوَتَنَا ثُمَّ قَالَ لَنَا إِنْ تَتُوبُوا وَ تَصْلُحُوا فَهُوَ خَيْرٌ لَكُمْ يُلْحِقْكُمُ اللَّهُ بِأَيْدِيكُمْ فِي الْجَنَّةِ وَ إِنْ لَا تَفْعَلُوا يُلْحِقْكُمُ اللَّهُ بِأَيْدِيكُمْ فِي النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Mola Bin Muhammad, from Ali Bin Mardas, from Sa’adan Bin Muslim, from one of our companions, from Al Haris Bin Haseyra who said, ",
            "‘I passed my an Ethiopian man, and he used to supply water at Al-Medina, and he had been cut. So I said to him, ‘Who cut you?’ So he said, ‘It was the best of the people who cut me. We were seized during a robbery and we were eight persons. So they went with us to Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup>, and we confessed with the theft. So he<sup>asws</sup> said to us: ‘Do you recognise that it is Prohibited?’ We said, ‘Yes’. So he<sup>asws</sup> ordered for our fingers to be cut from the palm and left the thumb. ",
            "Then he<sup>asws</sup> ordered with us, for he<sup>asws</sup> withheld us in a house wherein we were fed the butter and the honey until our hands were cured. Then he<sup>asws</sup> ordered with us, so we were brought out, and clothed us, so we had the best of the clothes. Then he<sup>asws</sup> said to us: ‘If you were to repent and correct yourselves, it would be better for you all, Allah<sup>azwj</sup> would Attach you with your fingers in the Paradise, but if you do not do it, Allah<sup>azwj</sup> would Attach you with your fingers in the Fire’."
          ]
        }
      },
      {
        "index": 13931,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:23",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ جَاءَ بِهِ رَجُلَانِ وَ قَالَا إِنَّ هَذَا سَرَقَ دِرْعاً فَجَعَلَ الرَّجُلُ يُنَاشِدُهُ لَمَّا نَظَرَ فِي الْبَيِّنَةِ وَ جَعَلَ يَقُولُ وَ اللَّهِ لَوْ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَا قَطَعَ يَدِي أَبَداً قَالَ وَ لِمَ قَالَ يُخْبِرُهُ رَبُّهُ أَنِّي بَرِي‏ءٌ فَيُبَرِّئُنِي بِبَرَاءَتِي فَلَمَّا رَأَى مُنَاشَدَتَهُ إِيَّاهُ دَعَا الشَّاهِدَيْنِ وَ قَالَ اتَّقِيَا اللَّهَ وَ لَا تَقْطَعَا يَدَ الرَّجُلِ ظُلْماً وَ نَاشَدَهُمَا ",
          "ثُمَّ قَالَ لِيَقْطَعْ أَحَدُكُمَا يَدَهُ وَ يُمْسِكَ الْآخَرُ يَدَهُ فَلَمَّا تَقَدَّمَا إِلَى الْمِصْطَبَّةِ لِيَقْطَعَ يَدَهُ ضَرَبَ النَّاسَ حَتَّى اخْتَلَطُوا فَلَمَّا اخْتَلَطُوا أَرْسَلَا الرَّجُلَ فِي غُمَارِ النَّاسِ حَتَّى اخْتَلَطَا بِالنَّاسِ فَجَاءَ الَّذِي شَهِدَا عَلَيْهِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ شَهِدَ عَلَيَّ الرَّجُلَانِ ظُلْماً فَلَمَّا ضَرَبَ النَّاسَ وَ اخْتَلَطُوا أَرْسَلَانِي وَ فَرَّا وَ لَوْ كَانَا صَادِقَيْنِ لَمْ يُرْسِلَانِي فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ يَدُلُّنِي عَلَى هَذَيْنِ أُنَكِّلْهُمَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding a man who was brought by two men who both said, ‘This one stole an armour’. When the man saw the proof he started adjuring and went on saying, ‘By Allah<sup>azwj</sup>! If Rasool-Allah<sup>saww</sup> was around, my hand would not be cut, ever!’ He<sup>asws</sup> said: ‘And why not?’ He said, ‘His<sup>saww</sup> Lord<sup>azwj</sup> would have Informed him<sup>saww</sup> that I was innocent, so he<sup>saww</sup> would have freed me due to my innocence’. So when he<sup>asws</sup> saw his adjuring, he<sup>asws</sup> called the two witnesses and said: ‘Both of you fear Allah<sup>azwj</sup> and do not cut the hand of the man unjustly’, and he<sup>asws</sup> adjured both of them.",
            "Then he<sup>asws</sup> said, ‘Let one of you cut his hand, while the other one holds his hand’. So when they both went to the outdoor place to cut his hand, the people crowded until they got mixed. So when they were mixed with the people, they sent the man away in the crowd of the people until he was mixed with the people. So the one against who they had testified came over, so he said, ‘O Amir Al-Momineen<sup>asws</sup>! Two men testified against me unjustly. So when the people crowded and mixed, they sent me and fled, and had they both been truthful they would never have sent me away’. So Amir Al-Momineen<sup>asws</sup> said: ‘The one who can point me to these two, I<sup>asws</sup> will treat them harshly’."
          ]
        }
      },
      {
        "index": 13932,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:24",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْوَشَّاءِ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلَيْنِ سَرَقَا مِنْ مَالِ اللَّهِ أَحَدُهُمَا عَبْدٌ لِمَالِ اللَّهِ وَ الْآخَرُ مِنْ عُرْضِ النَّاسِ فَقَالَ أَمَّا هَذَا فَمِنْ مَالِ اللَّهِ لَيْسَ عَلَيْهِ شَيْ‏ءٌ مِنْ مَالِ اللَّهِ أَكَلَ بَعْضُهُ بَعْضاً وَ أَمَّا الْآخَرُ فَقَدَّمَهُ فَقَطَعَ يَدَهُ ثُمَّ أَمَرَ أَنْ يُطْعَمَ السَّمْنَ وَ اللَّحْمَ حَتَّى بَرَأَتْ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Washa, from Aasim Bin Humeyd, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> judged regarding two men who had stolen from the wealth of Allah<sup>azwj</sup>. One of the two was a slave of the wealth of Allah<sup>azwj</sup>, and the other one was from among the (ordinary) people. So he<sup>asws</sup> said: ‘As for this one who is from the wealth of Allah<sup>azwj</sup>, there is nothing upon him from the wealth of Allah<sup>azwj</sup>. One part has eaten the other part. And as for the other one, so bring him’. So he<sup>as</sup><sup>ws</sup> cut his hand, then ordered than he should be fed the butter and the meat, until he is cured from it’."
          ]
        }
      },
      {
        "index": 13933,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:25",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ طَلْحَةَ بْنِ زَيْدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) أُتِيَ بِرَجُلٍ عَبِثَ بِذَكَرِهِ فَضَرَبَ يَدَهُ حَتَّى احْمَرَّتْ ثُمَّ زَوَّجَهُ مِنْ بَيْتِ الْمَالِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Talha Bin Zayd, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said that they came with a man to Amir Al-Momineen<sup>asws</sup>, who had tampered with his manhood. So he<sup>asws</sup> hit his hand until it was red. Then he<sup>asws</sup> got him married from the public treasury’."
          ]
        }
      },
      {
        "index": 13934,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:26",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ مُحَمَّدِ بْنِ الْفُرَاتِ عَنِ الْأَصْبَغِ بْنِ نُبَاتَةَ رَفَعَهُ قَالَ أُتِيَ عُمَرُ بِخَمْسَةِ نَفَرٍ أُخِذُوا فِي الزِّنَى فَأَمَرَ أَنْ يُقَامَ عَلَى كُلِّ وَاحِدٍ مِنْهُمُ الْحَدُّ وَ كَانَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) حَاضِراً فَقَالَ يَا عُمَرُ لَيْسَ هَذَا حُكْمَهُمْ قَالَ فَأَقِمْ أَنْتَ عَلَيْهِمُ الْحُكْمَ فَقَدَّمَ وَاحِداً مِنْهُمْ فَضَرَبَ عُنُقَهُ وَ قَدَّمَ الثَّانِيَ فَرَجَمَهُ وَ قَدَّمَ الثَّالِثَ فَضَرَبَهُ الْحَدَّ وَ قَدَّمَ الرَّابِعَ فَضَرَبَهُ نِصْفَ الْحَدِّ وَ قَدَّمَ الْخَامِسَ فَعَزَّرَهُ ",
          "فَتَحَيَّرَ عُمَرُ وَ تَعَجَّبَ النَّاسُ مِنْ فِعْلِهِ فَقَالَ عُمَرُ يَا أَبَا الْحَسَنِ خَمْسَةُ نَفَرٍ فِي قَضِيَّةٍ وَاحِدَةٍ أَقَمْتَ عَلَيْهِمْ خَمْسَ حُدُودٍ لَيْسَ شَيْ‏ءٌ مِنْهَا يُشْبِهُ الْآخَرَ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَمَّا الْأَوَّلُ فَكَانَ ذِمِّيّاً خَرَجَ عَنْ ذِمَّتِهِ لَمْ يَكُنْ لَهُ حُكْمٌ إِلَّا السَّيْفُ وَ أَمَّا الثَّانِي فَرَجُلٌ مُحْصَنٌ كَانَ حَدُّهُ الرَّجْمَ وَ أَمَّا الثَّالِثُ فَغَيْرُ مُحْصَنٍ جُلِدَ الْحَدَّ وَ أَمَّا الرَّابِعُ فَعَبْدٌ ضَرَبْنَاهُ نِصْفَ الْحَدِّ وَ أَمَّا الْخَامِسُ فَمَجْنُونٌ مَغْلُوبٌ عَلَى عَقْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Muhammad Bin Al Waleed, from Muhammad Bin Al Furaat, from Al Asbagh Bin Nubata, raising it, said, ",
            "‘They came to Umar with five people who had committed adultery. So he ordered that the Penalty (<span class=\"iTxt\">Hadd</span>) be established upon each one of them, and Amir Al-Momineen<sup>asws</sup> was present. So he<sup>asws</sup> said: ‘O Umar! This is not (supposed to be) their judgement’. So he said, ‘So you<sup>asws</sup> establish the judgement upon them’. So they brought forward one of them, so he<sup>asws</sup> struck his neck; and they brought the second one, so he<sup>asws</sup> stoned him; and they brought the third one, so he<sup>asws</sup> whipped him the Penalty (<span class=\"iTxt\">Hadd</span>); and they brought the fourth, so he<sup>asws</sup> whipped him half the Penalty (<span class=\"iTxt\">Hadd</span>); and they brought the fifth, so he<sup>asws</sup> reprimanded him’.  ",
            "So Umar was confounded and the people were astounded from his<sup>asws</sup> actions. So Umar said, ‘O Abu Al-Hassan<sup>asws</sup>, five people in one judgement, five judgements being established upon them, not a thing from it resembling the other!’ So Amir Al-Momineen<sup>asws</sup> said: ‘As for the first one, he was a <span class=\"iTxt\">Zimmi</span> (under the responsibility) who had exited from the responsibility (of the government), there was no judgement for him except for the sword. And as for the second one, so he was a married man, his Penalty (<span class=\"iTxt\">Hadd</span>) was the stoning. And as for the third one, so he was not married, was whipped the Penalty (<span class=\"iTxt\">Hadd</span>). And as for the fourth one, so he was a slave, we whipped him half the Penalty (<span class=\"iTxt\">Hadd</span>); and as for the fifth, so he was an insane, his intellect had been overcome’."
          ]
        }
      },
      {
        "index": 13935,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:27",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ ابْنِ بُكَيْرٍ عَنْ زُرَارَةَ عَنْ حُمْرَانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ أَوْ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ رَجُلٍ أُقِيمَ عَلَيْهِ الْحَدُّ فِي الدُّنْيَا أَ يُعَاقَبُ فِي الْآخِرَةِ فَقَالَ اللَّهُ أَكْرَمُ مِنْ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Ibn Bukeyr, from Zurara, from Humran who said, ",
            "(It has been narrated) ‘I asked Abu Abdullah<sup>asws</sup> or Abu Ja’far<sup>asws</sup> about a man, upon whom the Penalty (<span class=\"iTxt\">Hadd</span>) was established in the world, would he be Punished in the Hereafter?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> is more benevolent than that (to Punish twice)’."
          ]
        }
      },
      {
        "index": 13936,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:28",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَحْدَثَ فِي الْكَعْبَةِ حَدَثاً قُتِلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of our companions, from Abu Al Sabbah Al Kinany, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who excretes in the Kaaba with an excretion, would be killed’."
          ]
        }
      },
      {
        "index": 13937,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:29",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الْحَجَّالِ عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِرَجُلٍ نَصْرَانِيٍّ كَانَ أَسْلَمَ وَ مَعَهُ خِنْزِيرٌ قَدْ شَوَاهُ وَ أَدْرَجَهُ بِرَيْحَانٍ قَالَ مَا حَمَلَكَ عَلَى هَذَا قَالَ الرَّجُلُ مَرِضْتُ فَقَرِمْتُ إِلَى اللَّحْمِ فَقَالَ أَيْنَ أَنْتَ مِنْ لَحْمِ الْمَعْزِ وَ كَانَ خَلَفاً مِنْهُ ثُمَّ قَالَ لَوْ أَنَّكَ أَكَلْتَهُ لَأَقَمْتُ عَلَيْكَ الْحَدَّ وَ لَكِنْ سَأَضْرِبُكَ ضَرْباً فَلَا تَعُدْ فَضَرَبَهُ حَتَّى شَغَرَ بِبَوْلِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Hajjal, from Ali Bin Muhammad Bin Abdul Rahman, from Al Nowfaly, from Al Sakuny, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘They came to Amir Al-Momineen<sup>asws</sup> with a Christian man who had become a Muslim, and with him was a pig which he had roasted, and seasoned it with basil. He<sup>asws</sup> said: ‘What carried you upon that?’ The man said, ‘I was sick, so I longed for the meat’. So he<sup>asws</sup> said: ‘Where are you from the meat of the goat?’ And it was following him. Then he<sup>asws</sup> said: ‘If you were to eat it, I<sup>asws</sup> will establish the Penalty (<span class=\"iTxt\">Hadd</span>) upon you, but I<sup>asws</sup> would be hitting you with a strike. So he<sup>asws</sup> hit him until his urine trickled out’."
          ]
        }
      },
      {
        "index": 13938,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:30",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ قَالَ سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ شَتَمَ رَجُلٌ عَلَى عَهْدِ جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَأُتِيَ بِهِ عَامِلَ الْمَدِينَةِ فَجَمَعَ النَّاسَ فَدَخَلَ عَلَيْهِ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) وَ هُوَ قَرِيبُ الْعَهْدِ بِالْعِلَّةِ وَ عَلَيْهِ رِدَاءٌ لَهُ مُوَرَّدٌ ",
          "فَأَجْلَسَهُ فِي صَدْرِ الْمَجْلِسِ وَ اسْتَأْذَنَهُ فِي الِاتِّكَاءِ وَ قَالَ لَهُمْ مَا تَرَوْنَ فَقَالَ لَهُ عَبْدُ اللَّهِ بْنُ الْحَسَنِ وَ الْحَسَنُ بْنُ زَيْدٍ وَ غَيْرُهُمَا نَرَى أَنْ يُقْطَعَ لِسَانُهُ فَالْتَفَتَ الْعَامِلُ إِلَى رَبِيعَةِ الرَّأْيِ وَ أَصْحَابِهِ فَقَالَ مَا تَرَوْنَ فَقَالَ يُؤَدَّبُ ",
          "فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) سُبْحَانَ اللَّهِ فَلَيْسَ بَيْنَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ بَيْنَ أَصْحَابِهِ فَرْقٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ali Bin Muhammad, from Al Hassan Bin Ali Al Washa who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying: ‘In the era of Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, a man insulted Rasool-Allah<sup>saww</sup>. So they came with him to the governor of Al-Medina, and the people gathered. And it was near to the time of his<sup>asws</sup> illness, and upon him<sup>asws</sup> was a robe of his<sup>asws</sup>, wrapped around him<sup>asws</sup>. ",
            "So they got him<sup>asws</sup> to be seated in the centre of the gathering and permitted him<sup>asws</sup> regarding the reclining, and (the governor) said to them, ‘What are your views?’ So Abdullah Bin Al-Hassan, and Al-Hassan Bin Zayd, and others said to him, ‘We view that his tongue should be cut’. So the governor turned towards Rabi’e Al-Rai’y and his companions, so he said, ‘What is your view?’ So he said, ‘He should be disciplined’. ",
            "So, Abu Abdullah<sup>asws</sup> said to him: ‘Glory be to Allah<sup>azwj</sup>! So there is no difference between Rasool-Allah<sup>saww</sup> and his<sup>saww</sup> companions?’"
          ]
        }
      },
      {
        "index": 13939,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:31",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ الدَّيْلَمِيِّ عَنْ هَارُونَ بْنِ الْجَهْمِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِقَوْمٍ لُصُوصٍ قَدْ سَرَقُوا فَقَطَعَ أَيْدِيَهُمْ مِنْ نِصْفِ الْكَفِّ وَ تَرَكَ الْإِبْهَامَ وَ لَمْ يَقْطَعْهَا وَ أَمَرَهُمْ أَنْ يَدْخُلُوا دَارَ الضِّيَافَةِ وَ أَمَرَ بِأَيْدِيهِمْ أَنْ تُعَالَجَ فَأَطْعَمَهُمُ السَّمْنَ وَ الْعَسَلَ وَ اللَّحْمَ حَتَّى بَرَءُوا فَدَعَاهُمْ وَ قَالَ يَا هَؤُلَاءِ إِنَّ أَيْدِيَكُمْ قَدْ سَبَقَتْ إِلَى النَّارِ فَإِنْ تُبْتُمْ وَ عَلِمَ اللَّهُ مِنْكُمْ صِدْقَ النِّيَّةِ تَابَ اللَّهُ عَلَيْكُمْ وَ جَرَرْتُمْ أَيْدِيَكُمْ إِلَى الْجَنَّةِ وَ إِنْ لَمْ تُقْلِعُوا وَ لَمْ تَنْتَهُوا عَمَّا أَنْتُمْ عَلَيْهِ جَرَّتْكُمْ أَيْدِيكُمْ إِلَى النَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Suleyman Al Daylami, from Haroun Bin Al Jahm, from Muhammad Bin Muslim, ",
            "Abu Ja’far<sup>asws</sup> has said: ‘They came to Amir Al-Momineen<sup>asws</sup> with a group who had stolen. So he<sup>asws</sup> cut their hands from half the palm, and left the thumb and did not cut it, and ordered them that they should enter the guest house, and ordered for the healing of their hands. So they were fed the butter, and the honey, and the meat, until they were cured. So he<sup>asws</sup> called them over and said: ‘O you all! Your hands have preceded you to the Fire. So if you were to repent, and Allah<sup>azwj</sup> Knows from you the sincerity of the intention, He<sup>azwj</sup> would Trun towards you (with Mercy) and your hands would join you in the Paradise. And if you do not improve and do not stop from what you are upon, your hands would drag you into the Fire’."
          ]
        }
      },
      {
        "index": 13940,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:32",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ عَلِيِّ بْنِ جَعْفَرٍ قَالَ أَخْبَرَنِي أَخِي مُوسَى ( عليه السلام ) قَالَ كُنْتُ وَاقِفاً عَلَى رَأْسِ أَبِي حِينَ أَتَاهُ رَسُولُ زِيَادِ بْنِ عُبَيْدِ اللَّهِ الْحَارِثِيِّ عَامِلِ الْمَدِينَةِ قَالَ يَقُولُ لَكَ الْأَمِيرُ انْهَضْ إِلَيَّ فَاعْتَلَّ بِعِلَّةٍ فَعَادَ إِلَيْهِ الرَّسُولُ فَقَالَ لَهُ قَدْ أَمَرْتُ أَنْ يُفْتَحَ لَكَ بَابُ الْمَقْصُورَةِ فَهُوَ أَقْرَبُ لِخُطْوَتِكَ ",
          "قَالَ فَنَهَضَ أَبِي وَ اعْتَمَدَ عَلَيَّ وَ دَخَلَ عَلَى الْوَالِي وَ قَدْ جَمَعَ فُقَهَاءَ الْمَدِينَةِ كُلَّهُمْ وَ بَيْنَ يَدَيْهِ كِتَابٌ فِيهِ شَهَادَةٌ عَلَى رَجُلٍ مِنْ أَهْلِ وَادِي الْقُرَى فَذَكَرَ النَّبِيَّ ( صلى الله عليه وآله ) فَنَالَ مِنْهُ",
          "فَقَالَ لَهُ الْوَالِي يَا أَبَا عَبْدِ اللَّهِ انْظُرْ فِي الْكِتَابِ قَالَ حَتَّى أَنْظُرَ مَا قَالُوا فَالْتَفَتَ إِلَيْهِمْ فَقَالَ مَا قُلْتُمْ قَالُوا قُلْنَا يُؤَدَّبُ وَ يُضْرَبُ وَ يُعَزَّرُ وَ يُحْبَسُ قَالَ فَقَالَ لَهُمْ أَ رَأَيْتُمْ لَوْ ذَكَرَ رَجُلًا مِنْ أَصْحَابِ النَّبِيِّ ( صلى الله عليه وآله ) بِمِثْلِ مَا ذَكَرَ بِهِ النَّبِيَّ ( صلى الله عليه وآله ) مَا كَانَ الْحُكْمُ فِيهِ قَالُوا مِثْلَ هَذَا قَالَ سُبْحَانَ اللَّهِ فَقَالَ فَلَيْسَ بَيْنَ النَّبِيِّ ( صلى الله عليه وآله ) وَ بَيْنَ رَجُلٍ مِنْ أَصْحَابِهِ فَرْقٌ ",
          "قَالَ فَقَالَ الْوَالِي دَعْ هَؤُلَاءِ يَا أَبَا عَبْدِ اللَّهِ لَوْ أَرَدْنَا هَؤُلَاءِ لَمْ نُرْسِلْ إِلَيْكَ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَخْبَرَنِي أَبِي ( عليه السلام ) أَنَّ رَسُولَ اللَّهِ ( عليه السلام ) قَالَ [إِنَّ] النَّاسَ فِيَّ أُسْوَةٌ سَوَاءٌ مَنْ سَمِعَ أَحَداً يَذْكُرُنِي فَالْوَاجِبُ عَلَيْهِ أَنْ يَقْتُلَ مَنْ شَتَمَنِي وَ لَا يُرْفَعُ إِلَى السُّلْطَانِ وَ الْوَاجِبُ عَلَى السُّلْطَانِ إِذَا رُفِعَ إِلَيْهِ أَنْ يَقْتُلَ مَنْ نَالَ مِنِّي ",
          "فَقَالَ زِيَادُ بْنُ عُبَيْدِ اللَّهِ أَخْرِجُوا الرَّجُلَ فَاقْتُلُوهُ بِحُكْمِ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Asbaat, ",
            "(It has been narrated) from Ali son of Ja’far<sup>asws</sup> who said, ‘My brother<sup>asws</sup> Musa<sup>asws</sup> said: ‘I<sup>asws</sup> was standing next to the head of my<sup>asws</sup> father<sup>asws</sup>, when a messenger of Ziyad Bin Ubeydulla, the governor of Al-Medina came over. He said, ‘The commander is saying to you<sup>asws</sup>, ‘Arise to come over to me’. So he<sup>asws</sup> excused himself<sup>asws</sup> due to illness. So the messenger reiterated to him, so he said to him<sup>asws</sup>, ‘He has ordered that the shorter door be opened up for you, it would be nearer for your<sup>asws</sup> steps’.",
            "He<sup>asws</sup> said: ‘So my<sup>asws</sup> father<sup>asws</sup> arose and leaned upon me<sup>asws</sup>, and entered upon the governor, and there had gathered therein the jurists of Al-Medina, all of them, and there was a letter in front of him in which was a testimony upon a man from the people of the valley of Al-Qura, in which he mentioned the Prophet<sup>saww</sup> having been maligned (defamed) in it.  ",
            "So the governor said to him<sup>asws</sup>, ‘O Abu Abdullah<sup>asws</sup>! Look in the letter’. He<sup>asws</sup> said: ‘(Not) until I<sup>asws</sup> look at what they said’. So he turned towards them, so he said, ‘What are you saying?’ They said, ‘We say he should be displined, and whipped, and reprimanded, and imprisoned’. So he<sup>asws</sup> said to them: ‘What is your view if he had mentioned a man from the companions of the Prophet<sup>saww</sup> with similar to what he has mentioned the Prophet<sup>saww</sup> by. What would have been the judgement regarding it?’ They said, ‘Similar to this’. He<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! So there is not between the Prophet<sup>saww</sup> and a man from his<sup>saww</sup> companions, a difference?’. ",
            "He (7<sup>th</sup> Imam<sup>asws</sup>) said: ‘So the governor said: ‘Leave them, O Abu Abdullah<sup>asws</sup>! Had we intended them, we would not have sent a messenger to you<sup>asws</sup>’. So Abu Abdullah<sup>asws</sup> said: ‘My<sup>asws</sup> father<sup>asws</sup> informed me<sup>asws</sup> that Rasool-Allah<sup>saww</sup> said: ‘The people are all equal in example. The one who hears anyone mentioning me<sup>saww</sup> (maliciously) so it is Obligatory upon him that he kills the one who insults me, and not raise it to the authorities, and it is Obligatory upon the authorities when it is raised to them that they should kill the one who maligns (slanders) me<sup>asws</sup>’. ",
            "So Ziyad Bin Ubeydullah said, ‘Bring out the man, so kill him, by the judgement of Abu Abdullah<sup>asws</sup>’."
          ]
        }
      },
      {
        "index": 13941,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:33",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ رِبْعِيٍّ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ رَجُلًا مِنْ هُذَيْلٍ كَانَ يَسُبُّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَبَلَغَ ذَلِكَ النَّبِيَّ ( صلى الله عليه وآله ) فَقَالَ مَنْ لِهَذَا فَقَامَ رَجُلَانِ مِنَ الْأَنْصَارِ فَقَالَا نَحْنُ يَا رَسُولَ اللَّهِ فَانْطَلَقَا حَتَّى أَتَيَا عَرَبَةَ فَسَأَلَا عَنْهُ فَإِذَا هُوَ يَتَلَقَّى غَنَمَهُ فَلَحِقَاهُ بَيْنَ أَهْلِهِ وَ غَنَمِهِ فَلَمْ يُسَلِّمَا عَلَيْهِ فَقَالَ مَنْ أَنْتُمَا وَ مَا اسْمُكُمَا فَقَالَا لَهُ أَنْتَ فُلَانُ بْنُ فُلَانٍ فَقَالَ نَعَمْ فَنَزَلَا وَ ضَرَبَا عُنُقَهُ ",
          "قَالَ مُحَمَّدُ بْنُ مُسْلِمٍ فَقُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) أَ رَأَيْتَ لَوْ أَنَّ رَجُلًا الْآنَ سَبَّ النَّبِيَّ ( صلى الله عليه وآله ) أَ يُقْتَلُ قَالَ إِنْ لَمْ تَخَفْ عَلَى نَفْسِكَ فَاقْتُلْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hammad Bin Isa, from Rabie, from Muhammad Bin Muslim, ",
            "Abu Ja’far<sup>asws</sup> has said: ‘A man from Huzayl insulted Rasool-Allah<sup>saww</sup>. So that reached the Prophet<sup>saww</sup>, so he<sup>saww</sup> said: ‘Who is for this one?’ So two men from the Helpers stood up, so they both said, ‘Us, O Rasool-Allah<sup>saww</sup>!’ So they both went until they came over to Bedouins. So they asked about him, so there he was tending his sheep. So they met him between his family and his sheep. So they did not greet him, so he said, ‘Who are you two, and what are both your names?’ So they both said to him, ‘Are you so and so, son of son and so?’ So he said, ‘Yes’. So they descended and struck off his neck.",
            "Muhammad Bin Muslim (the narrator) said, ‘So I said to Abu Ja’far<sup>asws</sup>, ‘What is your<sup>asws</sup> view if a man now were to insult the Prophet<sup>saww</sup>, should he be killed?’ He<sup>asws</sup> said: ‘If you do not fear for yourself, so kill him’."
          ]
        }
      },
      {
        "index": 13942,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:34",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ إِسْحَاقَ بْنِ عَمَّارٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رُبَّمَا ضَرَبْتُ الْغُلَامَ فِي بَعْضِ مَا يَحْرُمُ فَقَالَ وَ كَمْ تَضْرِبُهُ فَقُلْتُ رُبَّمَا ضَرَبْتُهُ مِائَةً فَقَالَ مِائَةً مِائَةً فَأَعَادَ ذَلِكَ مَرَّتَيْنِ ثُمَّ قَالَ حَدَّ الزِّنَى اتَّقِ اللَّهَ فَقُلْتُ جُعِلْتُ فِدَاكَ فَكَمْ يَنْبَغِي لِي أَنْ أَضْرِبَهُ فَقَالَ وَاحِداً فَقُلْتُ وَ اللَّهِ لَوْ عَلِمَ أَنِّي لَا أَضْرِبُهُ إِلَّا وَاحِداً مَا تَرَكَ لِي شَيْئاً إِلَّا أَفْسَدَهُ فَقَالَ فَاثْنَتَيْنِ فَقُلْتُ جُعِلْتُ فِدَاكَ هَذَا هُوَ هَلَاكِي إِذاً قَالَ فَلَمْ أَزَلْ أُمَاكِسُهُ حَتَّى بَلَغَ خَمْسَةً ثُمَّ غَضِبَ فَقَالَ يَا إِسْحَاقُ إِنْ كُنْتَ تَدْرِي حَدَّ مَا أَجْرَمَ فَأَقِمِ الْحَدَّ فِيهِ وَ لَا تَعَدَّ حُدُودَ اللَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Usman Bin Isa, from Is’haq Bin Ammar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Sometimes I hit the slave regarding something which is Prohibited’. So he<sup>asws</sup> said: ‘And how much do you hit him?’ So I said, ‘Sometimes I hit him one hundred (hits)’. So he<sup>asws</sup> said: ‘One hundred, one hundred?’ So he<sup>asws</sup> repeated that twice. Then he<sup>asws</sup> said: ‘The Penalty (<span class=\"iTxt\">Hadd</span>) of the adulterer, fear Allah<sup>azwj</sup>’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! So how much is befitting for me that I should hit him?’ ",
            "So he<sup>asws</sup> said: ‘One’. So I said, ‘By Allah<sup>azwj</sup>! If he comes to know, that I would not be hitting him except for one, he would not leave anything for me except that he would spoil it’. So he<sup>asws</sup> said: ‘So, twice’. So I said, ‘May I be sacrificed for you<sup>asws</sup>! This is my destruction’, when he<sup>asws</sup> said it. So I did not stop haggling until it reached five. Then he<sup>asws</sup> got angered, so he<sup>asws</sup> said: ‘O Is’haq! If you know a Penalty (<span class=\"iTxt\">Hadd</span>) of what crime has been committed, so establish the Penalty (<span class=\"iTxt\">Hadd</span>), and do not exceed the Penalties of Allah<sup>azwj</sup>!’"
          ]
        }
      },
      {
        "index": 13943,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:35",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ حَمَّادِ بْنِ عُثْمَانَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي أَدَبِ الصَّبِيِّ وَ الْمَمْلُوكِ فَقَالَ خَمْسَةٌ أَوْ سِتَّةٌ وَ ارْفُقْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Hammad Bin Usman who said, ",
            "‘I spoke to Abu Abdullah<sup>asws</sup> regarding disiplining of the child and the owned (slave), so he<sup>asws</sup> said: ‘Five, or six, and be kind’."
          ]
        }
      },
      {
        "index": 13944,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:36",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا كَانَ الرَّجُلُ كَلَامُهُ كَلَامَ النِّسَاءِ وَ مِشْيَتُهُ مِشْيَةَ النِّسَاءِ وَ يُمَكِّنُ مِنْ نَفْسِهِ فَيُنْكَحُ كَمَا تُنْكَحُ الْمَرْأَةُ فَارْجُمُوهُ وَ لَا تَسْتَحْيُوهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘If the man was speaking the speech of the women, and his walking was the walking of the women, and he is abling (men) upon himself, so he is being copulated with like the copulation of the women, so stone him and do not let him live’."
          ]
        }
      },
      {
        "index": 13945,
        "local_index": 37,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:37",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ رَسُولُ اللَّهِ <span class=\"bTxt\">( صلى الله عليه وآله )</span> مَنْ بَلَغَ حَدّاً فِي غَيْرِ حَدٍّ فَهُوَ مِنَ الْمُعْتَدِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, said, ‘Rasool-Allah<sup>saww</sup> said: ‘The one who reaches a Penalty (<span class=\"iTxt\">Hadd</span>) regarding (something) in which there is no Penalty (<span class=\"iTxt\">Hadd</span>) (applicable), so he is from the exceeders’."
          ]
        }
      },
      {
        "index": 13946,
        "local_index": 38,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:38",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ أَنَّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) أَلْقَى صِبْيَانُ الْكُتَّابِ أَلْوَاحَهُمْ بَيْنَ يَدَيْهِ لِيَخِيرَ بَيْنَهُمْ فَقَالَ أَمَا إِنَّهَا حُكُومَةٌ وَ الْجَوْرُ فِيهَا كَالْجَوْرِ فِي الْحُكْمِ أَبْلِغُوا مُعَلِّمَكُمْ إِنْ ضَرَبَكُمْ فَوْقَ ثَلَاثِ ضَرَبَاتٍ فِي الْأَدَبِ اقْتُصَّ مِنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "‘Amir Al-Momineen<sup>asws</sup> - two children threw their books and their tablets in front of him<sup>asws</sup> in order for him<sup>asws</sup> to choose between them. So he<sup>asws</sup> said: ‘But it is a judgement, and the tyranny in it is like the tyranny in the judgement. Deliver (what I<sup>asws</sup> am saying) to your teacher that if he were to hit you over three hits during the disciplining, there would be compensation from it’."
          ]
        }
      },
      {
        "index": 13947,
        "local_index": 39,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:39",
        "text": [
          "وَ بِهَذَا الْإِسْنَادِ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) قَالَ لَا تَدَعُوا الْمَصْلُوبَ بَعْدَ ثَلَاثَةِ أَيَّامٍ حَتَّى يُنْزَلَ فَيُدْفَنَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And by this chain, ",
            "‘Rasool-Allah<sup>saww</sup> said: ‘Do not leave the crucified one after three days until you get him down, so he would be buried’."
          ]
        }
      },
      {
        "index": 13948,
        "local_index": 40,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:40",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ بَعَثَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِلَى بِشْرِ بْنِ عُطَارِدٍ التَّمِيمِيِّ فِي كَلَامٍ بَلَغَهُ فَمَرَّ بِهِ رَسُولُ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فِي بَنِي أَسَدٍ وَ أَخَذَهُ فَقَامَ إِلَيْهِ نُعَيْمُ بْنُ دَجَاجَةَ الْأَسَدِيُّ فَأَفْلَتَهُ ",
          "فَبَعَثَ إِلَيْهِ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَأَتَوْهُ بِهِ وَ أَمَرَ بِهِ أَنْ يُضْرَبَ فَقَالَ لَهُ نُعَيْمٌ أَمَا وَ اللَّهِ إِنَّ الْمُقَامَ مَعَكَ لَذُلٌّ وَ إِنَّ فِرَاقَكَ لَكُفْرٌ قَالَ فَلَمَّا سَمِعَ ذَلِكَ مِنْهُ قَالَ لَهُ يَا نُعَيْمُ قَدْ عَفَوْنَا عَنْكَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ السَّيِّئَةَ أَمَّا قَوْلُكَ إِنَّ الْمُقَامَ مَعَكَ لَذُلٌّ فَسَيِّئَةٌ اكْتَسَبْتَهَا وَ أَمَّا قَوْلُكَ إِنَّ فِرَاقَكَ لَكُفْرٌ فَحَسَنَةٌ اكْتَسَبْتَهَا فَهَذِهِ بِهَذِهِ ثُمَّ أَمَرَ أَنْ يُخَلَّى عَنْهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ibn Mahboub, from one of his companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> sent someone to Bishr Bin Utaradi Al-Tameemy regarding a speech which reached him<sup>asws</sup>. So the messenger of Amir Al-Momineen<sup>asws</sup> passed by him among the Clan of Asad and seized him. So Nuaym Bin Dajaja Al-Asady stood up to him and had him released. ",
            "So Amir Al-Momineen<sup>asws</sup> sent someone to him, so he came up with him, and he<sup>asws</sup> ordered for him to be whipped. So Nuaym said to him<sup>asws</sup>, ‘But, by Allah<sup>azwj</sup>, the staying with you<sup>asws</sup> is a disgrace, and in separation from you<sup>asws</sup> is infidelity’. So when he<sup>asws</sup> heard that from him, he<sup>asws</sup> said to him: ‘O Nuaym! We<sup>asws</sup> have excused you, for Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\">[23:96] Repel evil by what is best</span>. As for your words that, ‘Staying with you<sup>asws</sup> is disgrace’, so it is an evil which you have attained; and as for your words, ‘In separation from you<sup>asws</sup> is infidelity’, so it is a good deed which you have attained. So this here (compensates) for this’. Then he<sup>asws</sup> ordered that he be released from it’."
          ]
        }
      },
      {
        "index": 13949,
        "local_index": 41,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:41",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ الْأَشْعَرِيُّ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ عَلِيِّ بْنِ إِسْمَاعِيلَ عَنْ عَمْرِو بْنِ أَبِي الْمِقْدَامِ عَنْ رَجُلٍ عَنْ رَزِينٍ قَالَ كُنْتُ أَتَوَضَّأُ فِي مِيضَاةِ الْكُوفَةِ فَإِذَا رَجُلٌ قَدْ جَاءَ فَوَضَعَ نَعْلَيْهِ وَ وَضَعَ دِرَّتَهُ فَوْقَهَا ثُمَّ دَنَا فَتَوَضَّأَ مَعِي فَزَحَمْتُهُ فَوَقَعَ عَلَى يَدَيْهِ فَقَامَ فَتَوَضَّأَ فَلَمَّا فَرَغَ ضَرَبَ رَأْسِي بِالدِّرَّةِ ثَلَاثاً ثُمَّ قَالَ إِيَّاكَ أَنْ تَدْفَعَ فَتَكْسِرَ فَتُغَرَّمَ فَقُلْتُ مَنْ هَذَا فَقَالُوا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَذَهَبْتُ أَعْتَذِرُ إِلَيْهِ فَمَضَى وَ لَمْ يَلْتَفِتْ إِلَيَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad Al Ashary, from Moala Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Aban, from Ali Bin Ismail, from Amro Bin Abu Al Maqdam, from a man, from Razeyn who said, ",
            "‘I was performing ablution in the washing facilities of Al-Kufa, so there was a man who had come over. So he took-off his shoes, and placed his whip upon it. Then he approached me, so he performed ablution along with me. So I bumped him, and he fell upon his hands. So he arose and performed ablution. So when he was free, he struck my head with the whip, three times, then said: ‘Beware of bumping, so if you break (somebody’s bone), you will (have to pay) compensation’. So I said, ‘Who is this?’ So they (people) said, ‘Amir Al-Momineen<sup>asws</sup>’. So I went to offer my excuses, but he<sup>asws</sup> went and did not turn towards me’."
          ]
        }
      },
      {
        "index": 13950,
        "local_index": 42,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:42",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ مَحْبُوبٍ عَنْ يُونُسَ بْنِ يَعْقُوبَ عَنْ مَطَرِ بْنِ أَرْقَمَ قَالَ سَمِعْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ إِنَّ عَبْدَ الْعَزِيزِ بْنَ عُمَرَ الْوَالِيَ بَعَثَ إِلَيَّ فَأَتَيْتُهُ وَ بَيْنَ يَدَيْهِ رَجُلَانِ قَدْ تَنَاوَلَ أَحَدُهُمَا صَاحِبَهُ فَمَرَشَ وَجْهَهُ وَ قَالَ مَا تَقُولُ يَا أَبَا عَبْدِ اللَّهِ فِي هَذَيْنِ الرَّجُلَيْنِ قُلْتُ وَ مَا قَالَا قَالَ قَالَ أَحَدُهُمَا لَيْسَ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) فَضْلٌ عَلَى أَحَدٍ مِنْ بَنِي أُمَيَّةَ فِي الْحَسَبِ وَ قَالَ الْآخَرُ لَهُ الْفَضْلُ عَلَى النَّاسِ كُلِّهِمْ فِي كُلِّ حِينٍ وَ غَضِبَ الَّذِي نَصَرَ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَصَنَعَ بِوَجْهِهِ مَا تَرَى فَهَلْ عَلَيْهِ شَيْ‏ءٌ ",
          "فَقُلْتُ لَهُ إِنِّي أَظُنُّكَ قَدْ سَأَلْتَ مَنْ حَوْلَكَ فَأَخْبَرُوكَ فَقَالَ أَقْسَمْتُ عَلَيْكَ لَمَّا قُلْتَ فَقُلْتُ لَهُ كَانَ يَنْبَغِي لِلَّذِي زَعَمَ أَنَّ أَحَداً مِثْلُ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) فِي الْفَضْلِ أَنْ يُقْتَلَ وَ لَا يُسْتَحْيَا قَالَ فَقَالَ أَ وَ مَا الْحَسَبُ بِوَاحِدٍ فَقُلْتُ إِنَّ الْحَسَبَ لَيْسَ النَّسَبَ أَ لَا تَرَى لَوْ نَزَلْتَ بِرَجُلٍ مِنْ بَعْضِ هَذِهِ الْأَجْنَاسِ فَقَرَاكَ فَقُلْتَ إِنَّ هَذَا الْحَسَبُ [لَجَازَ ذَلِكَ] فَقَالَ أَ وَ مَا النَّسَبُ بِوَاحِدٍ قُلْتُ إِذَا اجْتَمَعَا إِلَى آدَمَ ( عليه السلام ) فَإِنَّ النَّسَبَ وَاحِدٌ إِنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) لَمْ يَخْلِطْهُ شِرْكٌ وَ لَا بَغْيٌ فَأَمَرَ بِهِ الْوَالِي فَقُتِلَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Mahboub, from Yunus Bin Yaqoub, from Matar Bin Arqam who said, ",
            "‘I heard Abu Abdullah<sup>asws</sup> saying that Abul Aziz Bin Umar the governor sent an escort to me, so I<sup>asws</sup> went over to him, and in front of him were two men, one of them had grabbed his companions, so he scratched his face, and he (the governor) said, ‘What are you<sup>asws</sup> saying, O Abu Abdullah<sup>asws</sup> regarding these two men?’ I<sup>asws</sup> said, ‘And what did they both say?’ He said, ‘One of them said, ‘There is not merit for Rasool-Allah<sup>saww</sup> over anyone from the Clan of Umayya with regards to the nobility’, and the other one said to him, ‘He<sup>saww</sup> has the merit over the people, all of them, regarding every thing’, and the one who supported Rasool-Allah<sup>saww</sup> got angered, so he did with his face what you<sup>asws</sup> see. So is there anything upon him?’ ",
            "So I<sup>asws</sup> said to him: ‘I<sup>asws</sup> think you have already asked the ones around you, so they have informed you’. So he said, ‘I swear to you<sup>asws</sup>, I have not said it’. So I<sup>asws</sup> said: ‘It would be befitting for the one who alleges that anyone is similar to Rasool-Allah<sup>azwj</sup> with regards to the merits, that he should be killed, and not be left to live’. So he said, ‘Or is not the nobility of descent, one?’ So I<sup>asws</sup> said:’ The nobility is not the lineage. Do you not see, if I<sup>asws</sup> were to lodge a man from some of these races, your poor ones, so I said, ‘This is the nobility (that would be allowed)’. So he said, ‘Is not the lineage, one?’ I<sup>asws</sup> said: ‘When it is gathered to Adam<sup>as</sup>, so the lineage is one, (except that) Rasool-Allah<sup>saww</sup> did not mix with Polytheism, nor unchasteness’. So the governor ordered it, so he was killed’."
          ]
        }
      },
      {
        "index": 13951,
        "local_index": 43,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:43",
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَبِيعِ بْنِ مُحَمَّدٍ عَنْ عَبْدِ اللَّهِ بْنِ سُلَيْمَانَ الْعَامِرِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَيَّ شَيْ‏ءٍ تَقُولُ فِي رَجُلٍ سَمِعْتُهُ يَشْتِمُ عَلِيّاً ( عليه السلام ) وَ يَتَبَرَّأُ مِنْهُ قَالَ فَقَالَ لِي وَ اللَّهِ حَلَالُ الدَّمِ وَ مَا أَلْفٌ مِنْهُمْ بِرَجُلٍ مِنْكُمْ دَعْهُ لَا تَعَرَّضْ لَهُ إِلَّا أَنْ تَأْمَنَ عَلَى نَفْسِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhamamd, from Ali Bin Al Hakam, from Rabie Bin Muhammad, from Abdullah Bin Suleyman Al Aamiry who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Which thing are you<sup>asws</sup> saying regarding a man who was heard insulting Ali<sup>asws</sup> and disavowed from him<sup>asws</sup>?’ So he<sup>asws</sup> said to me: ‘By Allah<sup>azwj</sup>, the blood is Permissible, and (there are) a thousand from them with one man from you. Leave him and do not meddle with him, except if you are secure upon yourself’."
          ]
        }
      },
      {
        "index": 13952,
        "local_index": 44,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:44",
        "text": [
          "وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ هِشَامِ بْنِ سَالِمٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) مَا تَقُولُ فِي رَجُلٍ سَبَّابَةٍ لِعَلِيٍّ ( عليه السلام ) قَالَ فَقَالَ لِي حَلَالُ الدَّمِ وَ اللَّهِ لَوْ لَا أَنْ تَعُمَّ بِهِ بَرِيئاً قَالَ فَقُلْتُ فَمَا تَقُولُ فِي رَجُلٍ مُؤْذٍ لَنَا قَالَ فَقَالَ فِيمَا ذَا قُلْتُ مُؤْذِينَا فِيكَ بِذِكْرِكَ قَالَ فَقَالَ لِي لَهُ فِي عَلِيٍّ ( عليه السلام ) نَصِيبٌ قُلْتُ إِنَّهُ لَيَقُولُ ذَاكَ وَ يُظْهِرُهُ قَالَ لَا تَعَرَّضْ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Hisham Bin Salim who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘What are you<sup>asws</sup> saying regarding a man who pointed a finger at Ali<sup>asws</sup> (used foul language)?’ So he<sup>asws</sup> said to me: ‘The blood is Permissible, by Allah<sup>azwj</sup>, if it is not permeated by presumed innocence’. So I said, ‘So what are you<sup>asws</sup> saying regarding a man who is hurting us?’ He<sup>asws</sup> said: ‘With regards to what?’ I said, ‘He is hurting us regarding you<sup>asws</sup>, by mentioning you<sup>asws</sup> (in derogatory terms)?’ So he<sup>asws</sup> said to me: ‘Is there a share for him with regards to Ali<sup>asws</sup>?’ I said, ‘He is saying that and manifesting it’. He<sup>asws</sup> said: ‘Do not meddle with him’."
          ]
        }
      },
      {
        "index": 13953,
        "local_index": 45,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:63:45",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ بَعْضِ أَصْحَابِهِ عَنْ حَمَّادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ لَا يُخَلَّدُ فِي السِّجْنِ إِلَّا ثَلَاثَةٌ الَّذِي يُمَثِّلُ وَ الْمَرْأَةُ تَرْتَدُّ عَنِ الْإِسْلَامِ وَ السَّارِقُ بَعْدَ قَطْعِ الْيَدِ وَ الرِّجْلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from one of his companions, from Hammad, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘No one is to be imprisoned for ever except for three – One who severely tortures someone, and the woman who reneges from Al-Islam, and the thief (who steals) after the cutting of the hand and the leg’."
          ]
        }
      },
      {
        "part_type": "Heading",
        "text": [
          "تَمَّ كِتَابُ الْحُدُودِ مِنَ الْكَافِي وَ يَتْلُوهُ كِتَابُ الدِّيَاتِ إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "The Book of the Penalty (Hadd)s from Al Kafi is completed, and would be followed by the Book of Wergild, Allah<sup>azwj</sup> Willing. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:3:63",
  "kind": "verse_list"
}