{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 3"}, "path": "/books/al-kafi:7:3", "titles": {"ar": "كتاب الْحُدُودِ ", "en": "THE BOOK OF LEGAL PENALTIES"}}, {"indexed_titles": {"en": "Chapter 8"}, "path": "/books/al-kafi:7:3:8", "titles": {"ar": "باب صِفَةِ الرَّجْمِ", "en": "Chapter 8 – Description of the stoning"}}], "index": 2091, "local_index": 8, "part_type": "Chapter", "path": "/books/al-kafi:7:3:8", "titles": {"ar": "باب صِفَةِ الرَّجْمِ", "en": "Chapter 8 – Description of the stoning"}, "verse_count": 6, "verse_start_index": 13551, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 13552, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:3:8:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ إِسْحَاقَ بْنِ عَمَّارٍ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) تُدْفَنُ الْمَرْأَةُ إِلَى وَسَطِهَا إِذَا أَرَادُوا أَنْ يَرْجُمُوهَا وَ يَرْمِي الْإِمَامُ ثُمَّ النَّاسُ بَعْدُ بِأَحْجَارٍ صِغَارٍ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus, from Is’haq Bin Ammar, from Abu Baseer who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘Bury the woman up to her waist when it is intended to stone her, and the Imam<sup>asws</sup> would pelt, then the people afterwards, with the small stones’."]}}, {"index": 13553, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:3:8:2", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ بْنِ مِهْرَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تُدْفَنُ الْمَرْأَةُ إِلَى وَسَطِهَا ثُمَّ يَرْمِي الْإِمَامُ ثُمَّ يَرْمِي النَّاسُ بِأَحْجَارٍ صِغَارٍ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from Usman Bin Isa, from Sama’at Bin Mahran, ", "Abu Abdullah<sup>asws</sup> has said: ‘The woman is buried up to her waist, then the Imam<sup>asws</sup> pelts, then the people pelt, with the small stones’."]}}, {"index": 13554, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:3:8:3", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ صَفْوَانَ عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَقَرَّ الزَّانِي الْمُحْصَنُ كَانَ أَوَّلَ مَنْ يَرْجُمُهُ الْإِمَامُ ثُمَّ النَّاسُ فَإِذَا قَامَتْ عَلَيْهِ الْبَيِّنَةُ كَانَ أَوَّلَ مَنْ يَرْجُمُهُ الْبَيِّنَةُ ثُمَّ الْإِمَامُ ثُمَّ النَّاسُ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from the one who reported it, ", "Abu Abdullah<sup>asws</sup> has said: ‘When the married adulterer confesses, the first one to pelt him would be the Imam<sup>asws</sup>, then the people. So when the proof is established against him, the first ones to pelt him would be the ‘provers’ (four witnesses), then the Imam<sup>asws</sup>, then the people’."]}}, {"index": 13555, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:3:8:4", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ يُونُسَ عَنْ سَمَاعَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تُدْفَنُ الْمَرْأَةُ إِلَى وَسَطِهَا ثُمَّ يَرْمِي الْإِمَامُ وَ يَرْمِي النَّاسُ بِأَحْجَارٍ صِغَارٍ وَ لَا يُدْفَنُ الرَّجُلُ إِذَا رُجِمَ إِلَّا إِلَى حَقْوَيْهِ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa Bin Ubeyd, from Yunus, from Sama’at, ", "Abu Abdullah<sup>asws</sup> has said: ‘The woman would be buried up to her waist, then the Imam<sup>asws</sup> would pelt, and the people would pelt, with the small stones; and the man would not be buried when stoned, except up to his loins’."]}}, {"index": 13556, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:3:8:5", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنِ الْحُسَيْنِ بْنِ خَالِدٍ قَالَ قُلْتُ لِأَبِي الْحَسَنِ ( عليه السلام ) أَخْبِرْنِي عَنِ الْمُحْصَنِ إِذَا هُوَ هَرَبَ مِنَ الْحَفِيرَةِ هَلْ يُرَدُّ حَتَّى يُقَامَ عَلَيْهِ الْحَدُّ فَقَالَ يُرَدُّ وَ لَا يُرَدُّ فَقُلْتُ وَ كَيْفَ ذَلِكَ فَقَالَ إِذَا كَانَ هُوَ الْمُقِرَّ عَلَى نَفْسِهِ ثُمَّ هَرَبَ مِنَ الْحَفِيرَةِ بَعْدَ مَا يُصِيبُهُ شَيْ‏ءٌ مِنَ الْحِجَارَةِ لَمْ يُرَدَّ ", "وَ إِنْ كَانَ إِنَّمَا قَامَتْ عَلَيْهِ الْبَيِّنَةُ وَ هُوَ يَجْحَدُ ثُمَّ هَرَبَ رُدَّ وَ هُوَ صَاغِرٌ حَتَّى يُقَامَ عَلَيْهِ الْحَدُّ وَ ذَلِكَ أَنَّ مَاعِزَ بْنَ مَالِكٍ أَقَرَّ عِنْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) بِالزِّنَى فَأَمَرَ بِهِ أَنْ يُرْجَمَ فَهَرَبَ مِنَ الْحَفِيرَةِ فَرَمَاهُ الزُّبَيْرُ بْنُ الْعَوَّامِ بِسَاقِ بَعِيرٍ فَعَقَلَهُ فَسَقَطَ فَلَحِقَهُ النَّاسُ فَقَتَلُوهُ ثُمَّ أَخْبَرُوا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بِذَلِكَ فَقَالَ لَهُمْ فَهَلَّا تَرَكْتُمُوهُ إِذَا هَرَبَ يَذْهَبُ فَإِنَّمَا هُوَ الَّذِي أَقَرَّ عَلَى نَفْسِهِ ", "وَ قَالَ لَهُمْ أَمَا لَوْ كَانَ عَلِيٌّ حَاضِراً مَعَكُمْ لَمَا ضَلَلْتُمْ ", "قَالَ وَ وَدَاهُ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مِنْ بَيْتِ مَالِ الْمُسْلِمِينَ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, from Amro Bin Usman, from Al Husayn Bin Khalid who said, ", "‘I said to Abu Al-Hassan<sup>asws</sup>, ‘Inform me about the married man when he flees from the pit, would he be returned until the Penalty (<span class=\"iTxt\">Hadd</span>) (of stoning) is established upon him?’ So he<sup>asws</sup> said: ‘He would be returned and not returned’. So I said, ‘And how is that?’ So he<sup>asws</sup> said: ‘If was a confessor upon himself, then he fled from the pit after something having hit him, from the stones, he would not be returned.", "And if it was so that the proof was established against him, and he was arguing against it, then he flees, he would be returned and would be humiliated until the Penalty (<span class=\"iTxt\">Hadd</span>) is established against him. And that is that Maiz Bin Malik accepted in the presence of Rasool-Allah<sup>saww</sup> with having committed adultery. So he<sup>saww</sup> ordered that he should be stoned, so he fled from the pit. So Al-Zubeyr Bin Al-Awwam hit him with a left of a camel, so he was injured and fell down. So the people came over and killed him. Then Rasool-Allah<sup>saww</sup> was informed of that, so he<sup>saww</sup> said to them: ‘If only you would have left him alone when he fled, he would have gone. But rather, it was he who accepted it upon himself’. ", "And he<sup>saww</sup> said:’ And if Ali<sup>asws</sup> had been present with you all, you would not have gone astray’. ", "He<sup>asws</sup> said: ‘And Rasool-Allah<sup>saww</sup> paid (his wergild – the blood money) from the public treasury of the Muslims’."]}}, {"index": 13557, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:3:8:6", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ يُونُسَ عَنْ أَبَانٍ عَنْ أَبِي الْعَبَّاسِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) أَتَى النَّبِيَّ ( صلى الله عليه وآله ) رَجُلٌ فَقَالَ إِنِّي زَنَيْتُ فَطَهِّرْنِي فَصَرَفَ النَّبِيُّ ( صلى الله عليه وآله ) وَجْهَهُ عَنْهُ فَأَتَاهُ مِنْ جَانِبِهِ الْآخَرِ ثُمَّ قَالَ مِثْلَ مَا قَالَ فَصَرَفَ وَجْهَهُ عَنْهُ ثُمَّ جَاءَ الثَّالِثَةَ فَقَالَ لَهُ يَا رَسُولَ اللَّهِ إِنِّي زَنَيْتُ وَ عَذَابُ الدُّنْيَا أَهْوَنُ لِي مِنْ عَذَابِ الْآخِرَةِ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَ بِصَاحِبِكُمْ بَأْسٌ يَعْنِي جِنَّةً فَقَالُوا لَا فَأَقَرَّ عَلَى نَفْسِهِ الرَّابِعَةَ ", "فَأَمَرَ بِهِ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) أَنْ يُرْجَمَ فَحَفَرُوا لَهُ حَفِيرَةً فَلَمَّا وَجَدَ مَسَّ الْحِجَارَةِ خَرَجَ يَشْتَدُّ فَلَقِيَهُ الزُّبَيْرُ فَرَمَاهُ بِسَاقِ بَعِيرٍ فَسَقَطَ فَعَقَلَهُ بِهِ فَأَدْرَكَهُ النَّاسُ فَقَتَلُوهُ فَأَخْبَرُوا رَسُولَ اللَّهِ ( صلى الله عليه وآله ) بِذَلِكَ فَقَالَ هَلَّا تَرَكْتُمُوهُ ثُمَّ قَالَ لَوِ اسْتَتَرَ ثُمَّ تَابَ كَانَ خَيْراً لَهُ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from Muhammad Bin Isa, from Yunus, from Aban, from Abu Al Abbas who said, ", "‘Abu Abdullah<sup>asws</sup> said: ‘A man came over to the Prophet<sup>saww</sup> so he said, ‘I have committed adultery, so purify me’. So the Prophet<sup>saww</sup> turned his<sup>saww</sup> face away from him. So he came over from his<sup>saww</sup> other side, then said similar to what he had said. So he<sup>saww</sup> turned his<sup>saww</sup> face away from him. Then he came for the third time, so he said to him<sup>saww</sup>, ‘O Rasool-Allah<sup>saww</sup>! I have committed adultery, and the punishment of the world is easier to me than the Punishment of the Hereafter!’ So Rasool-Allah<sup>saww</sup> said (to his<sup>saww</sup> companions): ‘Is there a problem with your companion?’ – meaning insanity. So they said, ‘No’. So he confessed upon himself for the fourth time.", "So Rasool-Allah<sup>saww</sup> ordered that he be stoned, so they dug out a pit for him. So when he found the touch of the stone (being pelted), he came out fleeing hurriedly. So Al-Zubayr met him, and hit him with a leg of a camel. So he fell injured by it. So the people realised, so they killed him’. So they informed Rasool-Allah<sup>saww</sup> of that, so he<sup>saww</sup> said: ‘If only you had just left him alone’. Then he<sup>saww</sup> said: ‘Had he hid himself, then repented, that would have been better for him’."]}}]}, "index": "al-kafi:7:3:8", "kind": "verse_list"}