{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:7:3",
        "titles": {
          "ar": "كتاب الْحُدُودِ ",
          "en": "THE BOOK OF LEGAL PENALTIES"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:7:3:9",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 9 – Another chapter from it"
        }
      }
    ],
    "index": 2102,
    "local_index": 9,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:7:3:10",
        "titles": {
          "ar": "باب الرَّجُلِ يَغْتَصِبُ الْمَرْأَةَ فَرْجَهَا",
          "en": "Chapter 10 – The man rapes the woman of her chastity"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 8"
        },
        "path": "/books/al-kafi:7:3:8",
        "titles": {
          "ar": "باب صِفَةِ الرَّجْمِ",
          "en": "Chapter 8 – Description of the stoning"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 3"
        },
        "path": "/books/al-kafi:7:3",
        "titles": {
          "ar": "كتاب الْحُدُودِ ",
          "en": "THE BOOK OF LEGAL PENALTIES"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:3:9",
    "titles": {
      "ar": "باب آخَرُ مِنْهُ",
      "en": "Chapter 9 – Another chapter from it"
    },
    "verse_count": 3,
    "verse_start_index": 13568,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      }
    ],
    "verses": [
      {
        "index": 13569,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/119",
              "text": "عَلِيِّ بْنِ أَبِي حَمْزَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5637",
              "text": "عِمْرَانَ بْنِ مِيثَمٍ أَوْ صَالِحِ بْنِ مِيثَمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ عَنْ عِمْرَانَ بْنِ مِيثَمٍ أَوْ صَالِحِ بْنِ مِيثَمٍ عَنْ أَبِيهِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:9:1",
        "text": [
          " أَتَتِ امْرَأَةٌ مُجِحٌّ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي زَنَيْتُ فَطَهِّرْنِي طَهَّرَكَ اللَّهُ فَإِنَّ عَذَابَ الدُّنْيَا أَيْسَرُ مِنْ عَذَابِ الْآخِرَةِ الَّذِي لَا يَنْقَطِعُ فَقَالَ لَهَا مِمَّا أُطَهِّرُكِ فَقَالَتْ إِنِّي زَنَيْتُ فَقَالَ لَهَا أَ وَ ذَاتُ بَعْلٍ أَنْتِ أَمْ غَيْرُ ذَلِكِ فَقَالَتْ بَلْ ذَاتُ بَعْلٍ فَقَالَ لَهَا أَ فَحَاضِراً كَانَ بَعْلُكِ إِذْ فَعَلْتِ مَا فَعَلْتِ أَمْ غَائِباً كَانَ عَنْكِ فَقَالَتْ بَلْ حَاضِراً فَقَالَ لَهَا انْطَلِقِي فَضَعِي مَا فِي بَطْنِكِ ثُمَّ ائْتِنِي أُطَهِّرْكِ فَلَمَّا وَلَّتْ عَنْهُ الْمَرْأَةُ فَصَارَتْ حَيْثُ لَا تَسْمَعُ كَلَامَهُ قَالَ اللَّهُمَّ إِنَّهَا شَهَادَةٌ",
          "فَلَمْ يَلْبَثْ أَنْ أَتَتْهُ فَقَالَتْ قَدْ وَضَعْتُ فَطَهِّرْنِي قَالَ فَتَجَاهَلَ عَلَيْهَا فَقَالَ أُطَهِّرُكِ يَا أَمَةَ اللَّهِ مِمَّا ذَا فَقَالَتْ إِنِّي زَنَيْتُ فَطَهِّرْنِي فَقَالَ وَ ذَاتُ بَعْلٍ إِذْ فَعَلْتِ مَا فَعَلْتِ قَالَتْ نَعَمْ قَالَ وَ كَانَ زَوْجُكِ حَاضِراً أَمْ غَائِباً قَالَتْ بَلْ حَاضِراً قَالَ فَانْطَلِقِي وَ أَرْضِعِيهِ حَوْلَيْنِ كَامِلَيْنِ كَمَا أَمَرَكِ اللَّهُ قَالَ فَانْصَرَفَتِ الْمَرْأَةُ فَلَمَّا صَارَتْ مِنْ حَيْثُ لَا تَسْمَعُ كَلَامَهُ قَالَ اللَّهُمَّ إِنَّهُمَا شَهَادَتَانِ",
          "قَالَ فَلَمَّا مَضَى حَوْلَانِ أَتَتِ الْمَرْأَةُ فَقَالَتْ قَدْ أَرْضَعْتُهُ حَوْلَيْنِ فَطَهِّرْنِي يَا أَمِيرَ الْمُؤْمِنِينَ فَتَجَاهَلَ عَلَيْهَا وَ قَالَ أُطَهِّرُكِ مِمَّا ذَا فَقَالَتْ إِنِّي زَنَيْتُ فَطَهِّرْنِي قَالَ وَ ذَاتُ بَعْلٍ أَنْتِ إِذْ فَعَلْتِ مَا فَعَلْتِ فَقَالَتْ نَعَمْ قَالَ وَ بَعْلُكِ غَائِبٌ عَنْكِ إِذْ فَعَلْتِ مَا فَعَلْتِ أَوْ حَاضِرٌ قَالَتْ بَلْ حَاضِرٌ قَالَ فَانْطَلِقِي فَاكْفُلِيهِ حَتَّى يَعْقِلَ أَنْ يَأْكُلَ وَ يَشْرَبَ وَ لَا يَتَرَدَّى مِنْ سَطْحٍ وَ لَا يَتَهَوَّرَ فِي بِئْرٍ قَالَ فَانْصَرَفَتْ وَ هِيَ تَبْكِي فَلَمَّا وَلَّتْ فَصَارَتْ حَيْثُ لَا تَسْمَعُ كَلَامَهُ قَالَ اللَّهُمَّ إِنَّهَا ثَلَاثُ شَهَادَاتٍ",
          "قَالَ فَاسْتَقْبَلَهَا عَمْرُو بْنُ حُرَيْثٍ الْمَخْزُومِيُّ فَقَالَ لَهَا مَا يُبْكِيكِ يَا أَمَةَ اللَّهِ وَ قَدْ رَأَيْتُكِ تَخْتَلِفِينَ إِلَى عَلِيٍّ تَسْأَلِينَهُ أَنْ يُطَهِّرَكِ فَقَالَتْ إِنِّي أَتَيْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) فَسَأَلْتُهُ أَنْ يُطَهِّرَنِي فَقَالَ اكْفُلِي وَلَدَكِ حَتَّى يَعْقِلَ أَنْ يَأْكُلَ وَ يَشْرَبَ وَ لَا يَتَرَدَّى مِنْ سَطْحٍ وَ لَا يَتَهَوَّرَ فِي بِئْرٍ وَ قَدْ خِفْتُ أَنْ يَأْتِيَ عَلَيَّ الْمَوْتُ وَ لَمْ يُطَهِّرْنِي فَقَالَ لَهَا عَمْرُو بْنُ حُرَيْثٍ ارْجِعِي إِلَيْهِ فَأَنَا أَكْفُلُهُ",
          "فَرَجَعَتْ فَأَخْبَرَتْ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) بِقَوْلِ عَمْرٍو فَقَالَ لَهَا أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) وَ هُوَ مُتَجَاهِلٌ عَلَيْهَا وَ لِمَ يَكْفُلُ عَمْرٌو وَلَدَكِ فَقَالَتْ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي زَنَيْتُ فَطَهِّرْنِي فَقَالَ وَ ذَاتُ بَعْلٍ أَنْتِ إِذْ فَعَلْتِ مَا فَعَلْتِ قَالَتْ نَعَمْ قَالَ أَ فَغَائِباً كَانَ بَعْلُكِ إِذْ فَعَلْتِ مَا فَعَلْتِ أَمْ حَاضِراً فَقَالَتْ بَلْ حَاضِراً",
          "قَالَ فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَ قَالَ اللَّهُمَّ إِنَّهُ قَدْ ثَبَتَ لَكَ عَلَيْهَا أَرْبَعُ شَهَادَاتٍ وَ إِنَّكَ قَدْ قُلْتَ لِنَبِيِّكَ ( صلى الله عليه وآله ) فِيمَا أَخْبَرْتَهُ بِهِ مِنْ دِينِكَ يَا مُحَمَّدُ مَنْ عَطَّلَ حَدّاً مِنْ حُدُودِي فَقَدْ عَانَدَنِي وَ طَلَبَ بِذَلِكَ مُضَادَّتِي اللَّهُمَّ فَإِنِّي غَيْرُ مُعَطِّلٍ حُدُودَكَ وَ لَا طَالِبٍ مُضَادَّتَكَ وَ لَا مُضَيِّعٍ لِأَحْكَامِكَ بَلْ مُطِيعٌ لَكَ وَ مُتَّبِعٌ سُنَّةَ نَبِيِّكَ ( صلى الله عليه وآله )",
          "قَالَ فَنَظَرَ إِلَيْهِ عَمْرُو بْنُ حُرَيْثٍ وَ كَأَنَّمَا الرُّمَّانُ يُفْقَأُ فِي وَجْهِهِ فَلَمَّا رَأَى ذَلِكَ عَمْرٌو قَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنَّنِي إِنَّمَا أَرَدْتُ أَكْفُلُهُ إِذْ ظَنَنْتُ أَنَّكَ تُحِبُّ ذَلِكَ فَأَمَّا إِذَا كَرِهْتَهُ فَإِنِّي لَسْتُ أَفْعَلُ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) أَ بَعْدَ أَرْبَعِ شَهَادَاتٍ بِاللَّهِ لَتَكْفُلَنَّهُ وَ أَنْتَ صَاغِرٌ",
          "فَصَعِدَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) الْمِنْبَرَ فَقَالَ يَا قَنْبَرُ نَادِ فِي النَّاسِ الصَّلَاةَ جَامِعَةً فَنَادَى قَنْبَرٌ فِي النَّاسِ فَاجْتَمَعُوا حَتَّى غَصَّ الْمَسْجِدُ بِأَهْلِهِ وَ قَامَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) فَحَمِدَ اللَّهَ وَ أَثْنَى عَلَيْهِ ثُمَّ قَالَ أَيُّهَا النَّاسُ إِنَّ إِمَامَكُمْ خَارِجٌ بِهَذِهِ الْمَرْأَةِ إِلَى هَذَا الظَّهْرِ لِيُقِيمَ عَلَيْهَا الْحَدَّ إِنْ شَاءَ اللَّهُ فَعَزَمَ عَلَيْكُمْ أَمِيرُ الْمُؤْمِنِينَ لَمَّا خَرَجْتُمْ وَ أَنْتُمْ مُتَنَكِّرُونَ وَ مَعَكُمْ أَحْجَارُكُمْ لَا يَتَعَرَّفُ أَحَدٌ مِنْكُمْ إِلَى أَحَدٍ حَتَّى تَنْصَرِفُوا إِلَى مَنَازِلِكُمْ إِنْ شَاءَ اللَّهُ",
          "قَالَ ثُمَّ نَزَلَ فَلَمَّا أَصْبَحَ النَّاسُ بُكْرَةً خَرَجَ بِالْمَرْأَةِ وَ خَرَجَ النَّاسُ مُتَنَكِّرِينَ مُتَلَثِّمِينَ بِعَمَائِمِهِمْ وَ بِأَرْدِيَتِهِمْ وَ الْحِجَارَةُ فِي أَرْدِيَتِهِمْ وَ فِي أَكْمَامِهِمْ حَتَّى انْتَهَى بِهَا وَ النَّاسُ مَعَهُ إِلَى الظَّهْرِ بِالْكُوفَةِ فَأَمَرَ أَنْ يُحْفَرَ لَهَا حَفِيرَةٌ ثُمَّ دَفَنَهَا فِيهَا ثُمَّ رَكِبَ بَغْلَتَهُ وَ أَثْبَتَ رِجْلَيْهِ فِي غَرْزِ الرِّكَابِ ثُمَّ وَضَعَ إِصْبَعَيْهِ السَّبَّابَتَيْنِ فِي أُذُنَيْهِ ثُمَّ نَادَى بِأَعْلَى صَوْتِهِ يَا أَيُّهَا النَّاسُ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى عَهِدَ إِلَى نَبِيِّهِ ( صلى الله عليه وآله ) عَهْداً عَهِدَهُ مُحَمَّدٌ ( صلى الله عليه وآله ) إِلَيَّ بِأَنَّهُ لَا يُقِيمُ الْحَدَّ مَنْ لِلَّهِ عَلَيْهِ حَدٌّ فَمَنْ كَانَ عَلَيْهِ حَدٌّ مِثْلُ مَا عَلَيْهَا فَلَا يُقِيمُ عَلَيْهَا الْحَدَّ",
          "قَالَ فَانْصَرَفَ النَّاسُ يَوْمَئِذٍ كُلُّهُمْ مَا خَلَا أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) وَ الْحَسَنَ وَ الْحُسَيْنَ ( عليهما السلام ) فَأَقَامَ هَؤُلَاءِ الثَّلَاثَةُ عَلَيْهَا الْحَدَّ يَوْمَئِذٍ وَ مَا مَعَهُمْ غَيْرُهُمْ قَالَ وَ انْصَرَفَ ",
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ خَلَفِ بْنِ حَمَّادٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ جَاءَتِ امْرَأَةٌ حَامِلٌ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) فَقَالَتْ إِنِّي فَعَلْتُ فَطَهِّرْنِي ثُمَّ ذَكَرَ نَحْوَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, form his father, form Ibn Mahboub, from Ali Bin Abu Hamza, from Abu Baseer, from Imran Bin Maysam, or Salih Bin Maysam, from his father who said, ",
            "‘A woman came over to Amir Al-Momineen<sup>asws</sup>, so she said, ‘O Amir Al-Momineen<sup>asws</sup>! I have committed adultery, so purify me, may Allah<sup>azwj</sup> Purify you<sup>asws</sup>, for the punishment of the world is easier than the Punishment of the Hereafter which would not be cut off’. So he<sup>asws</sup> said to her: ‘From what should I<sup>asws</sup> purify you?’ So she said, ‘I have committed adulty’. So he<sup>asws</sup> said to her: ‘Are you with a husband or other than that?’ So she said, ‘But, I am with a husband’. So he<sup>asws</sup> said to her: ‘So, were you with your husband, being present, when you did what you did, or was he absent from you?’ So she said, ‘But, he was present’. So he<sup>asws</sup> said: ‘So go and place (give birth to) whatever is in your belly, then come to me<sup>asws</sup> and I<sup>asws</sup> shall purify you’. So when the woman turned away from him and went where she could not hear his<sup>asws</sup> speech, he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! She has testified with one testimony’. ",
            "So it was not long before she came over and said, ‘I have placed (given birth), so purify me’. He (the narrator said), ‘He<sup>asws</sup> ignored her’. He<sup>asws</sup> said: ‘I<sup>asws</sup> should purify you, O maid of Allah<sup>azwj</sup>, from what?’ So she said, ‘I have committed adultery, so purify me’. So he<sup>asws</sup> said: ‘And that was when you were with a husband when you did what you did?’ She said, ‘Yes’. He<sup>asws</sup> said: ‘And your husband was present or was he absent from you?’ She said, ‘But, he was present’. He<sup>asws</sup> said: ‘So go, and breastfeed him for two years complete just as Allah<sup>azwj</sup> has Commanded you to’. So the woman went away. So when she went to where she could not hear his<sup>asws</sup> speech, he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! These are two testimonies’. ",
            "He (the narrator) said, ‘So when two years passed by, the woman came over, so she said, ‘I have breastfed him for two years, so purify me, O Amir Al-Momineen<sup>asws</sup>! So he<sup>asws</sup> ignored her and said: ‘What is that which I<sup>asws</sup> should purify you from?’ So she said, ‘I have committed adultery, so purify me’. He<sup>asws</sup> said: ‘And you were with a husband when you did what you did?’ So she said, ‘Yes’. He<sup>asws</sup> said: ‘And being with a husband, was he absent from you when you did what you did, or was he present?’ She said, ‘But, present’. He<sup>asws</sup> said: ‘So go and look after him (your child) until he has intellect and he eats and drinks, and would not fall off from the roof, nor fall into a well’. So she left, and she was crying. So when she left to be where she could not hear his<sup>asws</sup> speech, he<sup>asws</sup> said: ‘O Allah<sup>azwj</sup>! These are three testimonies’. ",
            "He (the narrator) said, ‘So Amro Bin Hureys Al-Makhzoumy met her, so he said to her, ‘What makes you cry, O maid of Allah<sup>azwj</sup>, and I have seen you having followed you to Ali<sup>asws</sup>, you asked him that he<sup>asws</sup> should purify you?’ So she said, ‘I went over to Amir Al-Momineen<sup>asws</sup>, so I asked him<sup>asws</sup> that he should purify me. So he<sup>asws</sup> said: ‘Look after your child until he has intellect of eating and drinking, and does not fall off from the roof, nor fall into a well, and I fear that death would come unto me and he<sup>asws</sup> has not purified me’. So Amro Bin Hureys said to her, ‘Return to him<sup>asws</sup>, for I will look after him (the child)’. ",
            "So she returned and informed Amir Al-Momineen<sup>asws</sup> with the words of Amro. So Amir Al-Momineen<sup>asws</sup> said to her, and he<sup>asws</sup> was ignoring her: ‘And why would Amro look after your child?’ So she said, ‘O Amir Al-Momineen<sup>asws</sup>! I have committed adultery, so purify me’. So he<sup>asws</sup> said: ‘And you were with a husband when you did what you did?’ She said, ‘Yes’. He<sup>asws</sup> said: ‘Your husband was absent when you did what you did, or present?’ She said, ‘But, present’. ",
            "He (the narrator) said, ‘So he<sup>asws</sup> raised his<sup>asws</sup> head towards the sky and said: ‘O Allah<sup>azwj</sup>! Four testimonies have been affirmed against her for You<sup>azwj</sup>, and You<sup>azwj</sup> have Said to Your<sup>azwj</sup> Prophet<sup>saww</sup> regarding what You<sup>azwj</sup> Informed him<sup>saww</sup> with from Your<sup>azwj</sup> Religion was: “O Muhammad<sup>saww</sup>! The one who fails any of My<sup>azwj</sup> Penalties so he has opposed Me<sup>azwj</sup> and has sought by that what is opposite to Me<sup>azwj</sup>”. Therefore I<sup>asws</sup> am not failing Your<sup>azwj</sup> Penalty (<span class=\"iTxt\">Hadd</span>) and I<sup>asws</sup> do not seek opposite to You<sup>azwj</sup>, nor am I<sup>asws</sup> a waster of Your<sup>azwj</sup> Judgements. But, I<sup>asws</sup> am obedient to You<sup>azwj</sup>, and obedient to the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>’.",
            "He (the narrator) said, ‘So Amro Bin Hurays looked at him<sup>asws</sup>, and it was as if a pomegranate had been sliced upon his<sup>asws</sup> face (it was red). So when Amro saw that, said, ‘O Amir Al-Momineen<sup>asws</sup>! I, but rather, I intended to look after him and thought that you<sup>asws</sup> would like that. So if you<sup>asws</sup> are disliking it, so I will not do it’. So Amir Al-Momineen<sup>asws</sup> said: ‘After four testimonies with Allah<sup>azwj</sup>? You will have to look after him, and you are humiliated’. ",
            "So Amir Al-Momineen<sup>asws</sup> ascended the Pulpit, so he<sup>asws</sup> said: ‘O Qanbar! Call out among the people for the congregational Prayer’. So Qanbar called about among the people. So they gathered until the Masjid was congested with its inhabitants. And Amir Al-Momineen<sup>asws</sup> stood up, so he<sup>asws</sup> Praised Allah<sup>azwj</sup> and Extolled Him<sup>azwj</sup>, then said: ‘O you people! Your Imam<sup>asws</sup> will be going out with this woman, to this backyard in order to establish the Penalty (<span class=\"iTxt\">Hadd</span>) upon her, Allah<sup>azwj</sup> Willing! Therefore Amir Al-Momineen<sup>asws</sup> is instructing you that when you come out, and you should be masking yourselves, and with you should be your stones, noone should be able to recognise anyone from you until you disperse to your houses, Allah<sup>azwj</sup> Willing’. ",
            "He (the narrator) said, ‘Then he<sup>asws</sup> descended. So when the people woke up in the morning he<sup>asws</sup> went out with the woman, and the people went out having veiled themselves with their turbans, and their gowns, and the stones were in their garments and their sleeves, until he<sup>asws</sup> ended up with her to the back of Al-Kufa, and the people were with him<sup>asws</sup>. So he<sup>asws</sup> instructed that they should dig a pit for her. Then he<sup>asws</sup> buried her in it, then rode upon his<sup>asws</sup> mule and affirmed his<sup>asws</sup> feet in the stirrups. Then he<sup>asws</sup> placed his<sup>asws</sup> fingers, the two forefingers in his<sup>asws</sup> ears, then called out in a high voice: ‘O you people! Allah<sup>azwj</sup> Blessed and High Contracted with His<sup>azwj</sup> Prophet<sup>saww</sup> with a contract. Muhammad<sup>saww</sup> contracted it to me<sup>asws</sup> that no one should establish the Penalty (<span class=\"iTxt\">Hadd</span>) of Allah<sup>azwj</sup> upon him is a Penalty (<span class=\"iTxt\">Hadd</span>) due. So upon whom there is a Penalty (<span class=\"iTxt\">Hadd</span>) similar to what is upon her, so he should not establish the Penalty (<span class=\"iTxt\">Hadd</span>) upon her!’",
            "He (the narrator) said: ‘So the people dispersed on that day, all of them, except for Amir Al-Momineen<sup>asws</sup>, and Al-Hassan<sup>asws</sup>, and Al-Husayn<sup>asws</sup>. So these three established the Penalty (Hadd) upon her on that day, and there was no one with them<sup>asws</sup> apart from themselves<sup>asws</sup> being there’. ",
            "A number of our companions, from Ahmad Bin Muhammad, from Muhammad Bin Khalid, from Khalaf Bin Hammad, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘A pregnant woman came over to Amir Al-Momineen<sup>asws</sup>, so she said, ‘I have committed adultery, so purify me’. Then he mentioned approximate to it (the above narration)’."
          ]
        }
      },
      {
        "index": 13570,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/126",
              "text": "رَوَاهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/3066",
              "text": "أَبِي جَعْفَرٍ أَوْ أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَمَّنْ رَوَاهُ عَنْ أَبِي جَعْفَرٍ أَوْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:9:2",
        "text": [
          " أُتِيَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) بِرَجُلٍ قَدْ أَقَرَّ عَلَى نَفْسِهِ بِالْفُجُورِ فَقَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لِأَصْحَابِهِ اغْدُوا غَداً عَلَيَّ مُتَلَثِّمِينَ فَغَدَوْا عَلَيْهِ مُتَلَثِّمِينَ فَقَالَ لَهُمْ مَنْ فَعَلَ مِثْلَ فِعْلِهِ فَلَا يَرْجُمْهُ فَلْيَنْصَرِفْ قَالَ فَانْصَرَفَ بَعْضُهُمْ وَ بَقِيَ بَعْضٌ فَرَجَمَهُ مَنْ بَقِيَ مِنْهُمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from the one who reported it, ",
            "(It has been narrated either) from Abu Ja’far or abu Abdullah<sup>asws</sup>: ‘They came with a man to Amir Al-Momineen<sup>asws</sup> who had accpeted upon himself with the immorality. So Amir Al-Momineen<sup>asws</sup> said to his<sup>asws</sup> companions: ‘Come to me<sup>asws</sup> tomorrow having veiled yourselves’. So they came over to him in the morning being veiled. So he<sup>asws</sup> said to them: ‘The one has done similar to his deed, so he should not stone him, so let him leave’. So some of them left, and some of them remained, so they stoned him, the ones who remained from them’."
          ]
        }
      },
      {
        "index": 13571,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/2183",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ رَفَعَهُ"
            },
            {
              "kind": "plain",
              "text": " إِلَى "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/343",
              "text": "أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ رَفَعَهُ إِلَى أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:3:9:3",
        "text": [
          " أَتَاهُ رَجُلٌ بِالْكُوفَةِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي زَنَيْتُ فَطَهِّرْنِي قَالَ مِمَّنْ أَنْتَ قَالَ مِنْ مُزَيْنَةَ قَالَ أَ تَقْرَأُ مِنَ الْقُرْآنِ شَيْئاً قَالَ بَلَى قَالَ فَاقْرَأْ فَقَرَأَ فَأَجَادَ فَقَالَ أَ بِكَ جِنَّةٌ قَالَ لَا قَالَ فَاذْهَبْ حَتَّى نَسْأَلَ عَنْكَ فَذَهَبَ الرَّجُلُ",
          "ثُمَّ رَجَعَ إِلَيْهِ بَعْدُ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ إِنِّي زَنَيْتُ فَطَهِّرْنِي فَقَالَ أَ لَكَ زَوْجَةٌ قَالَ بَلَى قَالَ فَمُقِيمَةٌ مَعَكَ فِي الْبَلَدِ قَالَ نَعَمْ قَالَ فَأَمَرَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَذَهَبَ وَ قَالَ حَتَّى نَسْأَلَ عَنْكَ فَبَعَثَ إِلَى قَوْمِهِ فَسَأَلَ عَنْ خَبَرِهِ فَقَالُوا يَا أَمِيرَ الْمُؤْمِنِينَ صَحِيحُ الْعَقْلِ",
          "فَرَجَعَ إِلَيْهِ الثَّالِثَةَ فَقَالَ لَهُ مِثْلَ مَقَالَتِهِ فَقَالَ لَهُ اذْهَبْ حَتَّى نَسْأَلَ عَنْكَ فَرَجَعَ إِلَيْهِ الرَّابِعَةَ فَلَمَّا أَقَرَّ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) لِقَنْبَرٍ احْتَفِظْ بِهِ ثُمَّ غَضِبَ ثُمَّ قَالَ مَا أَقْبَحَ بِالرَّجُلِ مِنْكُمْ أَنْ يَأْتِيَ بَعْضَ هَذِهِ الْفَوَاحِشِ فَيَفْضَحَ نَفْسَهُ عَلَى رُءُوسِ الْمَلَإِ أَ فَلَا تَابَ فِي بَيْتِهِ فَوَ اللَّهِ لَتَوْبَتُهُ فِيمَا بَيْنَهُ وَ بَيْنَ اللَّهِ أَفْضَلُ مِنْ إِقَامَتِي عَلَيْهِ الْحَدَّ ثُمَّ أَخْرَجَهُ",
          "وَ نَادَى فِي النَّاسِ يَا مَعْشَرَ الْمُسْلِمِينَ اخْرُجُوا لِيُقَامَ عَلَى هَذَا الرَّجُلِ الْحَدُّ وَ لَا يَعْرِفَنَّ أَحَدُكُمْ صَاحِبَهُ فَأَخْرَجَهُ إِلَى الْجَبَّانِ فَقَالَ يَا أَمِيرَ الْمُؤْمِنِينَ أَنْظِرْنِي أُصَلِّي رَكْعَتَيْنِ ثُمَّ وَضَعَهُ فِي حُفْرَتِهِ وَ اسْتَقْبَلَ النَّاسَ بِوَجْهِهِ فَقَالَ يَا مَعَاشِرَ الْمُسْلِمِينَ إِنَّ هَذَا حَقٌّ مِنْ حُقُوقِ اللَّهِ عَزَّ وَ جَلَّ فَمَنْ كَانَ لِلَّهِ فِي عُنُقِهِ حَقٌّ فَلْيَنْصَرِفْ وَ لَا يُقِيمُ حُدُودَ اللَّهِ مَنْ فِي عُنُقِهِ لِلَّهِ حَدٌّ ",
          "فَانْصَرَفَ النَّاسُ وَ بَقِيَ هُوَ وَ الْحَسَنُ وَ الْحُسَيْنُ ( عليهما السلام ) فَأَخَذَ حَجَراً فَكَبَّرَ ثَلَاثَ تَكْبِيرَاتٍ ثُمَّ رَمَاهُ بِثَلَاثَةِ أَحْجَارٍ فِي كُلِّ حَجَرٍ ثَلَاثَ تَكْبِيرَاتٍ ثُمَّ رَمَاهُ الْحَسَنُ ( عليه السلام ) مِثْلَ مَا رَمَاهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ثُمَّ رَمَاهُ الْحُسَيْنُ ( عليه السلام ) فَمَاتَ الرَّجُلُ فَأَخْرَجَهُ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فَأَمَرَ فَحُفِرَ لَهُ وَ صَلَّى عَلَيْهِ وَ دَفَنَهُ فَقِيلَ يَا أَمِيرَ الْمُؤْمِنِينَ أَ لَا تُغَسِّلُهُ فَقَالَ قَدِ اغْتَسَلَ بِمَا هُوَ طَاهِرٌ إِلَى يَوْمِ الْقِيَامَةِ لَقَدْ صَبَرَ عَلَى أَمْرٍ عَظِيمٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ahmad Bin Muhammad Bin Khalid, ",
            "(It has been narrated) raising it to Amir Al-Momineen<sup>asws</sup>, said, ‘A man came over to him<sup>asws</sup> at Al-Kufa, so he said, ‘O Amir Al-Momineen<sup>asws</sup>! I had committed adultery, so purify me’. He<sup>asws</sup> said: ‘From where are you (coming from)?’ He said, ‘From Muzeyna’. He<sup>asws</sup> said: ‘Have you read anything from the Quran?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘So read’. So he read, and it was good (recitation). So he<sup>asws</sup> said: ‘Are you with insanity’. He said, ‘No’. He<sup>asws</sup> said: ‘So go away, until we ask about you’. So the man went away. ",
            "Then he returned to him<sup>asws</sup> afterwards, so he said, ‘O Amir Al-Momineen<sup>asws</sup>! I have committed adultery, so purify me’. So he<sup>asws</sup> said: ‘Is there a wife for you?’ He said, ‘Yes’. He<sup>asws</sup> said: ‘Is she staying with you in the city?’ He said, ‘Yes’. So Amir Al-Momineen<sup>asws</sup> ordered him, So go away until we ask about you’. So he sent someone to his people who asked about his news. So they said, ‘O Amir Al-Momineen<sup>asws</sup>! He is of correct mind’. ",
            "So he returned to him for the third time, and he said to him similar to his words before. So he<sup>asws</sup> said to him: ‘Go away until we ask about you’. So he returned to him for the fourth time. So when he confessed, Amir Al-Momineen<sup>asws</sup> said to Qanbar: ‘Keep him locked up’. Then he<sup>asws</sup> got annoyed, then said: ‘There is nothing more uglier with the man from you that he comes to one of these immoralities, so he disgraces himself upon the chiefs of the tribes. Why did he not repent in his own house, for by Allah<sup>azwj</sup>, his repentance between him and Allah<sup>azwj</sup> is superior than my<sup>asws</sup> establishing the Penalty (<span class=\"iTxt\">Hadd</span>) upon him’. ",
            "And he called out among the people: ‘O group of the Muslims! Come out for the establishment of the Penalty (<span class=\"iTxt\">Hadd</span>) upon this man, and not one of you should be able to recognise his companion’. So he<sup>asws</sup> brought him out to the wilderness. So he said, ‘Respite me, O Amir Al-Momineen<sup>asws</sup>, while I Pray two cycles’. Then he<sup>asws</sup> placed him in his pit, and the people faced him. So he<sup>asws</sup> said: ‘O group of the Muslims! This is a right from the Rights of Allah<sup>azwj</sup> Mighty and Majestic! So the one whom had (such) a right upon his own neck, so let him disperse, and he should not establish the Penalties of Allah<sup>azwj</sup>, the one on whose neck is due a Penalty (<span class=\"iTxt\">Hadd</span>) of Allah<sup>azwj</sup>’. ",
            "So the people dispersed and there remained himself<sup>asws</sup>, and Al-Hassan<sup>asws</sup> and Al-Husayn<sup>asws</sup>. So he<sup>asws</sup> grabbed the stones, exclaimed the Greatness of Allah<sup>azwj</sup> with three exclamations, then pelted him with three stones, during each stone, three exclamations. Then Al-Hassan<sup>asws</sup> pelted him similarly to what Amir Al-Momineen<sup>asws</sup> had pelted him. Then Al-Husayn<sup>asws</sup> pelted him<sup>asws</sup>. So the man died, and Amir Al-Momineen<sup>asws</sup> brought him out. So he<sup>asws</sup> ordered for a grave to be dug out for him, and Prayed over him, and buried him. So it was said, ‘O Amir Al-Momineen<sup>asws</sup>! Will you not wash him (before burying him)?’ So he<sup>asws</sup> said: ‘He has been washed by what has purified him up to the Day of Judgement. He was patient upon a grievous matter’."
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:3:9",
  "kind": "verse_list"
}