{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:4:4", "titles": {"ar": "أَبْوَابُ الزِّيَارَاتِ", "en": "CHAPTERS ON ZIYARAAT"}}, {"indexed_titles": {"en": "Chapter 15"}, "path": "/books/al-kafi:4:4:15", "titles": {"ar": "بَابُ مَا يُقَالُ عِنْدَ قَبْرِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "Chapter 227 – What is to be said at the grave of Amir Al-Momineen<sup>asws</sup>"}}], "index": 1170, "local_index": 15, "part_type": "Chapter", "path": "/books/al-kafi:4:4:15", "titles": {"ar": "بَابُ مَا يُقَالُ عِنْدَ قَبْرِ أَمِيرِ الْمُؤْمِنِينَ ( عليه السلام )", "en": "Chapter 227 – What is to be said at the grave of Amir Al-Momineen<sup>asws</sup>"}, "verse_count": 2, "verse_start_index": 8103, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 8104, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:4:15:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ أُورَمَةَ عَمَّنْ حَدَّثَهُ عَنِ الصَّادِقِ أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) قَالَ يَقُولُ السَّلَامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ أَنْتَ أَوَّلُ مَظْلُومٍ وَ أَوَّلُ مَنْ غُصِبَ حَقُّهُ صَبَرْتَ وَ احْتَسَبْتَ حَتَّى أَتَاكَ الْيَقِينُ فَأَشْهَدُ أَنَّكَ لَقِيتَ اللَّهَ وَ أَنْتَ شَهِيدٌ عَذَّبَ اللَّهُ قَاتِلَكَ بِأَنْوَاعِ الْعَذَابِ وَ جَدَّدَ عَلَيْهِ الْعَذَابَ ", "جِئْتُكَ عَارِفاً بِحَقِّكَ مُسْتَبْصِراً بِشَأْنِكَ مُعَادِياً لِأَعْدَائِكَ وَ مَنْ ظَلَمَكَ أَلْقَى عَلَى ذَلِكَ رَبِّي إِنْ شَاءَ اللَّهُ يَا وَلِيَّ اللَّهِ إِنَّ لِي ذُنُوباً كَثِيرَةً فَاشْفَعْ لِي إِلَى رَبِّكَ فَإِنَّ لَكَ عِنْدَ اللَّهِ مَقَاماً مَحْمُوداً مَعْلُوماً وَ إِنَّ لَكَ عِنْدَ اللَّهِ جَاهاً وَ شَفَاعَةً وَ قَدْ قَالَ تَعَالَى وَ لا يَشْفَعُونَ إِلَّا لِمَنِ ارْتَضى .", "مُحَمَّدُ بْنُ جَعْفَرٍ الرَّازِيُّ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي الْحَسَنِ الثَّالِثِ ( عليه السلام ) مِثْلَهُ "], "translations": {"en.hubeali": ["A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Awrama, from the one who narrated it, ", "(It has been narrated) from Al-Sadiq Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> having said: ‘You should be saying, ‘The greetings be upon you<sup>asws</sup>, O Guardian (from) Allah<sup>azwj</sup>! You<sup>asws</sup> are the first oppressed one, and the first one whose rights were usurped, and you<sup>asws</sup> were patient and reckoned until the conviction (death) came to you<sup>asws</sup>. I hereby testify that You<sup>asws</sup> met Allah<sup>azwj</sup>, and you<sup>asws</sup> were a martyr. May Allah<sup>azwj</sup> Punish your<sup>asws</sup> murderer with the varieties of the Punishments, and Renew the Punishments upon him. ", "I come to you having recognised your<sup>asws</sup> right, with an insight concerning you<sup>asws</sup>, and enemy to your<sup>asws</sup> enemies and the ones who oppressed you<sup>asws</sup>. I shall meet my Lord<sup>azwj</sup> being upon that, Allah<sup>azwj</sup> Willing. O Guardian<sup>asws</sup> of Allah<sup>azwj</sup>! There are numerous sins for me, therefore intercede for me to your<sup>asws</sup> Lord<sup>azwj</sup>, there is a praiseworthy status for you<sup>asws</sup> in the Presence of Allah<sup>azwj</sup>, well-known, and that for you<sup>asws</sup>, in the Presence of Allah<sup>azwj</sup>, is a prestige and (right of) intercession, and Allah<sup>azwj</sup> th Exalted has Said <span class=\"ibTxt\">[21:28] and they will not be interceding except for the one whom He Approves of</span>’.", "Muhammad Bin Ja’far Al Razy, from Muhammad Bin Is Bin Ubeyd, from one of our companions, from Abu Al-Hassan<sup>asws</sup> the 3<sup>rd</sup> – similar to it."]}}, {"index": 8105, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:4:15:2", "text": ["تَقُولُ السَّلَامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ السَّلَامُ عَلَيْكَ يَا حُجَّةَ اللَّهِ السَّلَامُ عَلَيْكَ يَا خَلِيفَةَ اللَّهِ السَّلَامُ عَلَيْكَ يَا عَمُودَ الدِّينِ السَّلَامُ عَلَيْكَ يَا وَارِثَ النَّبِيِّينَ السَّلَامُ عَلَيْكَ يَا قَسِيمَ الْجَنَّةِ وَ النَّارِ وَ صَاحِبَ الْعَصَا وَ الْمِيسَمِ السَّلَامُ عَلَيْكَ يَا أَمِيرَ الْمُؤْمِنِينَ", "أَشْهَدُ أَنَّكَ كَلِمَةُ التَّقْوَى وَ بَابُ الْهُدَى وَ الْعُرْوَةُ الْوُثْقَى وَ الْحَبْلُ الْمَتِينُ وَ الصِّرَاطُ الْمُسْتَقِيمُ وَ أَشْهَدُ أَنَّكَ حُجَّةُ اللَّهِ عَلَى خَلْقِهِ وَ شَاهِدُهُ عَلَى عِبَادِهِ وَ أَمِينُهُ عَلَى عِلْمِهِ وَ خَازِنُ سِرِّهِ وَ مَوْضِعُ حِكْمَتِهِ وَ أَخُو رَسُولِهِ ( عليه السلام )", "وَ أَشْهَدُ أَنَّ دَعْوَتَكَ حَقٌّ وَ كُلَّ دَاعٍ مَنْصُوبٍ دُونَكَ بَاطِلٌ مَدْحُوضٌ أَنْتَ أَوَّلُ مَظْلُومٍ وَ أَوَّلُ مَغْصُوبٍ حَقُّهُ فَصَبَرْتَ وَ احْتَسَبْتَ لَعَنَ اللَّهُ مَنْ ظَلَمَكَ وَ اعْتَدَى عَلَيْكَ وَ صَدَّ عَنْكَ لَعْناً كَثِيراً يَلْعَنُهُمْ بِهِ كُلُّ مَلَكٍ مُقَرَّبٍ وَ كُلُّ نَبِيٍّ مُرْسَلٍ وَ كُلُّ عَبْدٍ مُؤْمِنٍ مُمْتَحَنٍ", "صَلَّى اللَّهُ عَلَيْكَ يَا أَمِيرَ الْمُؤْمِنِينَ وَ صَلَّى اللَّهُ عَلَى رُوحِكَ وَ بَدَنِكَ أَشْهَدُ أَنَّكَ عَبْدُ اللَّهِ وَ أَمِينُهُ بَلَّغْتَ نَاصِحاً وَ أَدَّيْتَ أَمِيناً وَ قُتِلْتَ صِدِّيقاً وَ مَضَيْتَ عَلَى يَقِينٍ لَمْ تُؤْثِرْ عَمًى عَلَى هُدًى وَ لَمْ تَمِلْ مِنْ حَقٍّ إِلَى بَاطِلٍ", "أَشْهَدُ أَنَّكَ قَدْ أَقَمْتَ الصَّلَاةَ وَ آتَيْتَ الزَّكَاةَ وَ أَمَرْتَ بِالْمَعْرُوفِ وَ نَهَيْتَ عَنِ الْمُنْكَرِ وَ اتَّبَعْتَ الرَّسُولَ وَ نَصَحْتَ لِلْأُمَّةِ وَ تَلَوْتَ الْكِتَابَ حَقَّ تِلَاوَتِهِ وَ جَاهَدْتَ فِي اللَّهِ حَقَّ جِهَادِهِ وَ دَعَوْتَ إِلَى سَبِيلِهِ بِالْحِكْمَةِ وَ الْمَوْعِظَةِ الْحَسَنَةِ حَتَّى أَتَاكَ الْيَقِينُ", "أَشْهَدُ أَنَّكَ كُنْتَ عَلَى بَيِّنَةٍ مِنْ رَبِّكَ وَ دَعَوْتَ إِلَيْهِ عَلَى بَصِيرَةٍ وَ بَلَّغْتَ مَا أُمِرْتَ بِهِ وَ قُمْتَ بِحَقِّ اللَّهِ غَيْرَ وَاهِنٍ وَ لَا مُوهِنٍ فَصَلَّى اللَّهُ عَلَيْكَ صَلَاةً مُتَّبَعَةً مُتَوَاصِلَةً مُتَرَادِفَةً يَتْبَعُ بَعْضُهَا بَعْضاً لَا انْقِطَاعَ لَهَا وَ لَا أَمَدَ وَ لَا أَجَلَ وَ السَّلَامُ عَلَيْكَ وَ رَحْمَةُ اللَّهِ وَ بَرَكَاتُهُ وَ جَزَاكَ اللَّهُ مِنْ صِدِّيقٍ خَيْراً عَنْ رَعِيَّتِهِ ", "أَشْهَدُ أَنَّ الْجِهَادَ مَعَكَ جِهَادٌ وَ أَنَّ الْحَقَّ مَعَكَ وَ إِلَيْكَ وَ أَنْتَ أَهْلُهُ وَ مَعْدِنُهُ وَ مِيرَاثَ النُّبُوَّةِ عِنْدَكَ فَصَلَّى اللَّهُ عَلَيْكَ وَ سَلَّمَ تَسْلِيماً وَ عَذَّبَ اللَّهُ قَاتِلَكَ بِأَنْوَاعِ الْعَذَابِ", "أَتَيْتُكَ يَا أَمِيرَ الْمُؤْمِنِينَ عَارِفاً بِحَقِّكَ مُسْتَبْصِراً بِشَأْنِكَ مُعَادِياً لِأَعْدَائِكَ مُوَالِياً لِأَوْلِيَائِكَ بِأَبِي أَنْتَ وَ أُمِّي أَتَيْتُكَ عَائِذاً بِكَ مِنْ نَارٍ اسْتَحَقَّهَا مِثْلِي بِمَا جَنَيْتُ عَلَى نَفْسِي أَتَيْتُكَ زَائِراً أَبْتَغِي بِزِيَارَتِكَ فَكَاكَ رَقَبَتِي مِنَ النَّارِ", "أَتَيْتُكَ هَارِباً مِنْ ذُنُوبِيَ الَّتِي احْتَطَبْتُهَا عَلَى ظَهْرِي أَتَيْتُكَ وَافِداً لِعَظِيمِ حَالِكَ وَ مَنْزِلَتِكَ عِنْدَ رَبِّي فَاشْفَعْ لِي عِنْدَ رَبِّكَ فَإِنَّ لِي ذُنُوباً كَثِيرَةً وَ إِنَّ لَكَ عِنْدَ اللَّهِ مَقَاماً مَعْلُوماً وَ جَاهاً عَظِيماً وَ شَأْناً كَبِيراً وَ شَفَاعَةً مَقْبُولَةً وَ قَدْ قَالَ اللَّهُ عَزَّ وَ جَلَّ وَ لا يَشْفَعُونَ إِلَّا لِمَنِ ارْتَضى", "اللَّهُمَّ رَبَّ الْأَرْبَابِ صَرِيخَ الْأَحْبَابِ إِنِّي عُذْتُ بِأَخِي رَسُولِكَ مَعَاذاً فَفُكَّ رَقَبَتِي مِنَ النَّارِ آمَنْتُ بِاللَّهِ وَ مَا أُنْزِلَ إِلَيْكُمْ وَ أَتَوَلَّى آخِرَكُمْ بِمَا تَوَلَّيْتُ بِهِ أَوَّلَكُمْ وَ كَفَرْتُ بِالْجِبْتِ وَ الطَّاغُوتِ وَ اللَّاتِ وَ الْعُزَّى ."], "translations": {"en.hubeali": ["You should be saying, ‘The greetings be upon you<sup>asws</sup>, O Guardian (from) Allah<sup>azwj</sup>! The greetings be upon you<sup>asws</sup> O Proof of Allah<sup>azwj</sup>! The greetings be upon you<sup>asws</sup> O Caliph of Allah<sup>azwj</sup>! The greetings be upon you<sup>asws</sup>, O Pillar of the Religion! The greetings be upon you<sup>asws</sup>, O inheritor of the Prophets<sup>as</sup>! The greetings be upon you<sup>asws</sup>, O Distributor of the Garden and the Fire, and the owner of the staff (of Musa<sup>as</sup>) and the branding tool! (he is a Believer, and he is an Infidel). The greetings be upon you<sup>asws</sup> O Amir Al-Momineen<sup>asws</sup>!", "I hereby testify that you<sup>asws</sup> are the <span class=\"ibTxt\">[48:26] the word of piety</span>, and the door of guidance, and the <span class=\"ibTxt\">[31:22] the Firmest Handle</span>, and the strong rope, and <span class=\"ibTxt\">[1:6] the Straight Path</span>. And I testify that you<sup>asws</sup> are the Proof of Allah<sup>azwj</sup> upon His<sup>azwj</sup> creatures, and His<sup>azwj</sup> witness upon His<sup>azwj</sup> servants, and His<sup>azwj</sup> trustworthy upon His<sup>azwj</sup> Knowledge, and a Keeper of His<sup>azwj</sup> secrets, and a place of His<sup>azwj</sup> Wisdom, and a brother of His<sup>azwj</sup> Rasool<sup>saww</sup>. ", "And I testify that you<sup>asws</sup> call was True, and every call linked to those besides you<sup>asws</sup> is false, to be refuted. You<sup>asws</sup> are the first oppressed one, and the first one whose right was usurped, but you<sup>asws</sup> were patient and reckoned. May Allah<sup>azwj</sup> Curse the ones who oppressed you<sup>asws</sup>, and exceeded upon you<sup>asws</sup>, and shut-off from you with numerous Curses, Cursed by the Angels of Proximity, and every Mursil Prophet<sup>as</sup>, and every Tested Believing servant.", "May the Blessings be upon you<sup>asws</sup>, O Amir Al-Momineen<sup>asws</sup>, and may Allah<sup>azwj</sup> Send Blessings upon your<sup>asws</sup> soul, and your<sup>asws</sup> body. I testify that you<sup>asws</sup> are a servant of Allah<sup>azwj</sup>, and His<sup>azwj</sup> trustworthy one, having delivered the preaching, and fulfilled the entrustment, and were murdered while being a truthful one, and went upon certainty. You<sup>asws</sup> did not give preference to the blindness over the guidance, and did not incline away from the Truth towards the falsehood.", "I testify that you established the <span class=\"iTxt\">Salaat</span> and paid the Zakat, and enjoined with the goodness and forbade from the evil, and followed the Rasool<sup>saww</sup>, and preached to the community, and recited the Book with its rightful recitation, and struggled in the Way of Allah<sup>azwj</sup> as it was rightful, and called to His<sup>azwj</sup> Way with the wisdom and the goodly preaching until the conviction (death) came to you<sup>asws</sup>.", "I testify that you were upon the Proof of your<sup>asws</sup> Lord<sup>azwj</sup>, and called to Him<sup>azwj</sup> upon an insight, and delivered what you<sup>asws</sup> were Commanded with, and stood with the Right of Allah<sup>azwj</sup> without any weakness or hesitation. So may Allah<sup>azwj</sup> Send Blessings upon you, consecutively, continuously, in tandem, one following the other, there being no interruption to it, nor a time, nor a term. And the greetings be upon you<sup>asws</sup>, and Mercy of Allah<sup>azwj</sup>, and His<sup>azwj</sup> Blessings, and may Allah<sup>azwj</sup> Recompense you<sup>asws</sup> due to your<sup>asws</sup> sincere goodness about His<sup>azwj</sup> citizens.", "I testify that the Jihad performed alongside you<sup>asws</sup> is a Jihaad, and that the Truth is with you<sup>asws</sup>, and to you<sup>asws</sup>, and you<sup>asws</sup> are its rightful one, and its mine, and the inheritance of the Prophet-hood is with you<sup>asws</sup>. So may Allah<sup>azwj</sup> Send Blessings upon you<sup>asws</sup>, and greetings with abundance greetings; and may Allah<sup>azwj</sup> Punish your<sup>asws</sup> murderer with the varieties of the Punishments.", "I come to you<sup>asws</sup>, O Amir Al-Momineen<sup>asws</sup>, a recogniser of your<sup>asws</sup> right, and with an insight about you<sup>asws</sup>, an enemy to your<sup>asws</sup> enemies, a friend of your<sup>asws</sup> friends. May my father and my mother be sacrificed for you<sup>asws</sup>! I come to you seeking refuge with you<sup>asws</sup> from a Fire Prepared for the likes of me due to what I have committed against myself. I come to you<sup>asws</sup> as a visitor seeking by your<sup>asws</sup> <span class=\"iTxt\">Ziyarah</span>, an emancipation (liberation) of my neck from the Fire. ", "I come to you<sup>asws</sup> fleeing from my sins, which I have loaded upon my back. I come to you<sup>asws</sup> as a delegate due to your<sup>asws</sup> magnificent status and position in the Presence of my Lord<sup>azwj</sup>. Therefore, intercede for me in the Presence of your<sup>asws</sup> Lord<sup>azwj</sup>, for there are numerous sins upon me, and that for you<sup>asws</sup>, in the Presence of Allah<sup>azwj</sup>, is a well-known position, and a magnificent status, and a great glory, and an Accepted intercession. And Allah<sup>azwj</sup> Mighty and Majestic has Said <span class=\"ibTxt\">[21:28] and they will not be interceding except for the one whom He Approves of</span>. ", "O Allah<sup>azwj</sup>! Lord<sup>azwj</sup> of the lords! Helper of the Loved ones! I hereby seek refuge with the brother<sup>asws</sup> of Your<sup>azwj</sup> Rasool<sup>saww</sup> with a refuge, therefore Save my neck from the Fire. I believe in Allah<sup>azwj</sup> and whatever was Revelaed upon you<sup>asws</sup> and I befriend the last ones of you<sup>asws</sup> with what I befriended the first ones of you<sup>asws</sup>, and I reject with the false idols, and the tyrants, and Al-Laat and Al-Uzza (first and the second one are referred to with these names in the Ahadith – the names of idols they used to worship)’."]}}]}, "index": "al-kafi:4:4:15", "kind": "verse_list"}