{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 4"}, "path": "/books/al-kafi:4", "titles": {"ar": "الجزء الرابع‏", "en": "Volume Four"}}, {"indexed_titles": {"en": "Book 4"}, "path": "/books/al-kafi:4:4", "titles": {"ar": "أَبْوَابُ الزِّيَارَاتِ", "en": "CHAPTERS ON ZIYARAAT"}}, {"indexed_titles": {"en": "Chapter 18"}, "path": "/books/al-kafi:4:4:18", "titles": {"ar": "بَابُ الْقَوْلِ عِنْدَ قَبْرِ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) وَ أَبِي جَعْفَرٍ الثَّانِي وَ مَا يُجْزِئُ مِنَ الْقَوْلِ عِنْدَ كُلِّهِمْ (عليهم السلام)", "en": "Chapter 230 – The words to be spoken at the grave of Abu Al-Hassan Musa<sup>asws</sup>, and Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, and what suffices from the words at (the graves) of all of them<sup>asws</sup>"}}], "index": 1173, "local_index": 18, "part_type": "Chapter", "path": "/books/al-kafi:4:4:18", "titles": {"ar": "بَابُ الْقَوْلِ عِنْدَ قَبْرِ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) وَ أَبِي جَعْفَرٍ الثَّانِي وَ مَا يُجْزِئُ مِنَ الْقَوْلِ عِنْدَ كُلِّهِمْ (عليهم السلام)", "en": "Chapter 230 – The words to be spoken at the grave of Abu Al-Hassan Musa<sup>asws</sup>, and Abu Ja’far<sup>asws</sup> the 2<sup>nd</sup>, and what suffices from the words at (the graves) of all of them<sup>asws</sup>"}, "verse_count": 2, "verse_start_index": 8111, "verses": [{"index": 8112, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:4:4:18:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ جَعْفَرٍ</span> الرَّزَّازُ الْكُوفِيُّ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي الْحَسَنِ ( عليه السلام ) قَالَ تَقُولُ بِبَغْدَادَ السَّلَامُ عَلَيْكَ يَا وَلِيَّ اللَّهِ السَّلَامُ عَلَيْكَ يَا حُجَّةَ اللَّهِ السَّلَامُ عَلَيْكَ يَا نُورَ اللَّهِ فِي ظُلُمَاتِ الْأَرْضِ السَّلَامُ عَلَيْكَ يَا مَنْ بَدَا لِلَّهِ فِي شَأْنِهِ أَتَيْتُكَ عَارِفاً بِحَقِّكَ مُعَادِياً لِأَعْدَائِكَ فَاشْفَعْ لِي عِنْدَ رَبِّكَ وَ ادْعُ اللَّهَ وَ سَلْ حَاجَتَكَ \nقَالَ وَ تُسَلِّمُ بِهَذَا عَلَى أَبِي جَعْفَرٍ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ja’far Al Razzaz Al Kufy, from Muhammad Bin Isa Bin Ubeyd, from the one who mentioned it, \n(It has been narrated) from Abu Al-Hassan<sup>asws</sup> having said: ‘You should be saying at Baghdad, ‘The greetings be upon you, O Guardian from Allah<sup>azwj</sup>! The greetings be upon you<sup>asws</sup>, O Proof of Allah<sup>azwj</sup>! The greetings be upon you<sup>asws</sup>, O Light of Allah<sup>azwj</sup> in the darknesses of the earth. The greetings be upon you<sup>asws</sup>, O who appeared as Allah<sup>azwj</sup> in His<sup>azwj</sup> Glory! I come to you recognising of your<sup>asws</sup> right, as (I am) an enemy of your<sup>asws</sup> enemies, therefore interceded for me in the Presence of your<sup>asws</sup> Lord<sup>azwj</sup>’; and supplicate to Allah<sup>azwj</sup> and ask your need’. \nAnd he<sup>asws</sup> said: ‘And you should greet with this to Abu Ja’far<sup>asws</sup>’."}]}, {"index": 8113, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:4:4:18:2", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ عَلِيِّ بْنِ حَسَّانَ عَنِ الرِّضَا ( عليه السلام ) قَالَ سُئِلَ أَبِي عَنْ إِتْيَانِ قَبْرِ الْحُسَيْنِ ( عليه السلام ) فَقَالَ صَلُّوا فِي الْمَسَاجِدِ حَوْلَهُ وَ يُجْزِئُ فِي الْمَوَاضِعِ كُلِّهَا أَنْ تَقُولَ السَّلَامُ عَلَى أَوْلِيَاءِ اللَّهِ وَ أَصْفِيَائِهِ السَّلَامُ عَلَى أُمَنَاءِ اللَّهِ وَ أَحِبَّائِهِ السَّلَامُ عَلَى أَنْصَارِ اللَّهِ وَ خُلَفَائِهِ السَّلَامُ عَلَى مَحَالِّ مَعْرِفَةِ اللَّهِ السَّلَامُ عَلَى مَسَاكِنِ ذِكْرِ اللَّهِ \nالسَّلَامُ عَلَى مُظَاهِرِي أَمْرِ اللَّهِ وَ نَهْيِهِ السَّلَامُ عَلَى الدُّعَاةِ إِلَى اللَّهِ السَّلَامُ عَلَى الْمُسْتَقِرِّينَ فِي مَرْضَاةِ اللَّهِ السَّلَامُ عَلَى الْمُمَحَّصِينَ فِي طَاعَةِ اللَّهِ السَّلَامُ عَلَى الْأَدِلَّاءِ عَلَى اللَّهِ السَّلَامُ عَلَى الَّذِينَ مَنْ وَالَاهُمْ فَقَدْ وَالَى اللَّهَ وَ مَنْ عَادَاهُمْ فَقَدْ عَادَى اللَّهَ وَ مَنْ عَرَفَهُمْ فَقَدْ عَرَفَ اللَّهَ وَ مَنْ جَهِلَهُمْ فَقَدْ جَهِلَ اللَّهَ وَ مَنِ اعْتَصَمَ بِهِمْ فَقَدِ اعْتَصَمَ بِاللَّهِ وَ مَنْ تَخَلَّى مِنْهُمْ فَقَدْ تَخَلَّى مِنَ اللَّهِ\nأُشْهِدُ اللَّهَ أَنِّي سِلْمٌ لِمَنْ سَالَمْتُمْ وَ حَرْبٌ لِمَنْ حَارَبْتُمْ مُؤْمِنٌ بِسِرِّكُمْ وَ عَلَانِيَتِكُمْ مُفَوِّضٌ فِي ذَلِكَ كُلِّهِ إِلَيْكُمْ لَعَنَ اللَّهُ عَدُوَّ آلِ مُحَمَّدٍ مِنَ الْجِنِّ وَ الْإِنْسِ وَ أَبْرَأُ إِلَى اللَّهِ مِنْهُمْ وَ صَلَّى اللَّهُ عَلَى مُحَمَّدٍ وَ آلِهِ \nهَذَا يُجْزِئُ فِي الزِّيَارَاتِ كُلِّهَا وَ تُكْثِرُ مِنَ الصَّلَاةِ عَلَى مُحَمَّدٍ وَ آلِهِ وَ تُسَمِّي وَاحِداً وَاحِداً بِأَسْمَائِهِمْ وَ تَبْرَأُ إِلَى اللَّهِ مِنْ أَعْدَائِهِمْ وَ تَخْتَارُ لِنَفْسِكَ مِنَ الدُّعَاءِ مَا أَحْبَبْتَ وَ لِلْمُؤْمِنِينَ وَ الْمُؤْمِنَاتِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Haroun Bin Muslim, \n(It has been narrated) from Ali Bin Hassan from Al-Reza<sup>asws</sup> who said, ‘My father asked about going to the grave of Al-Husayn<sup>asws</sup>, so he<sup>asws</sup> said: ‘Praying <span class=\"iTxt\">Salaat</span> in the Masajids around it would suffice in all of its places that you should be saying, ‘The greetings be upon the Guardians of Allah<sup>azwj</sup>, and His<sup>azwj</sup> elites. The greetings be upon the trustworthy ones of Allah<sup>azwj</sup> and His<sup>azwj</sup> Beloved ones! The greetings be upon the helpers of Allah<sup>azwj</sup> and His<sup>azwj</sup> Caliphs. The greetings be upon the places for recognising Allah<sup>azwj</sup>! The greetings be upon the Houses of Allah<sup>azwj</sup> Mention.\nThe greetings be upon the disclosers of the Command of Allah<sup>azwj</sup> and His<sup>azwj</sup> Prohibitions! The greetings be upon the callers to Allah<sup>azwj</sup>! The greetings be upon the ones settled in the Pleasure of Allah<sup>azwj</sup>! The greetings be upon the ones refined in the obedience of Allah<sup>azwj</sup>! The greetings be upon the pointers towards Allah<sup>azwj</sup>! The greetings be upon those who, if one befriends them<sup>asws</sup>, so he has befriended Allah<sup>azwj</sup>, and the one who is inimical to them<sup>asws</sup>, so he has been inimical to Allah<sup>azwj</sup>, and the one who recognises them<sup>asws</sup> so he has recognised Allah<sup>azwj</sup>, and the one who is ignorant of them<sup>asws</sup>, so he is ignorant of Allah<sup>azwj</sup>, and the one who holds them<sup>asws</sup> so he has held on to Allah<sup>azwj</sup>, and the one who loosens from them<sup>asws</sup> so he has loosened from Allah<sup>azwj</sup>. \nI testify to Allah<sup>azwj</sup> that I am at peace with the ones who are at peace with you<sup>asws</sup>, and (I am) at war against those who are at war with you<sup>asws</sup>, (I am) a believer in your<sup>asws</sup> secrets and your public notifications, (I am) entrusting myself with regards to all of that, to you<sup>asws</sup>. May Allah<sup>azwj</sup> Curse the enemies of the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>, from the Jinns and the human, and the disavow from them to Allah<sup>azwj</sup>, and may Allah<sup>azwj</sup> Send Blessings upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>’. \nThis would suffice with regards to all of the <span class=\"iTxt\">Ziyarah</span>s, and frequent from the sending of <span class=\"iTxt\">Salawat </span> upon Muhammad<sup>saww</sup> and his<sup>saww</sup> Progeny<sup>asws</sup>, and name them<sup>asws</sup>, one by one, by their<sup>asws</sup> names, and disavow to Allah<sup>azwj</sup> from their<sup>asws</sup> enemies, and choose for yourself from the supplication, whatever you like, and for the believing men and the believing women’."}]}]}, "index": "al-kafi:4:4:18", "kind": "verse_list"}