{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:6:1:18",
        "titles": {
          "ar": "باب أَنَّ الْعَقِيقَةَ لَيْسَتْ بِمَنْزِلَةِ الْأُضْحِيَّةِ وَ أَنَّهَا تُجْزِئُ مَا كَانَتْ",
          "en": "Chapter 18 – The Aqeeqa is not with the status of the slaughter (during Hajj), and it can be sufficed by whatever there was"
        }
      }
    ],
    "index": 1581,
    "local_index": 18,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:1:18",
    "titles": {
      "ar": "باب أَنَّ الْعَقِيقَةَ لَيْسَتْ بِمَنْزِلَةِ الْأُضْحِيَّةِ وَ أَنَّهَا تُجْزِئُ مَا كَانَتْ",
      "en": "Chapter 18 – The Aqeeqa is not with the status of the slaughter (during Hajj), and it can be sufficed by whatever there was"
    },
    "verse_count": 2,
    "verse_start_index": 10422,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/53)"
        ],
        "index": 10423,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:18:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ صَفْوَانَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ مِنْهَالٍ الْقَمَّاطِ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ أَصْحَابَنَا يَطْلُبُونَ الْعَقِيقَةَ إِذَا كَانَ إِبَّانُ تَقْدَمُ الْأَعْرَابُ فَيَجِدُونَ الْفُحُولَةَ وَ إِذَا كَانَ غَيْرُ ذَلِكَ الْإِبَّانِ لَمْ تُوجَدْ فَتَعِزُّ عَلَيْهِمْ فَقَالَ إِنَّمَا هِيَ شَاةُ لَحْمٍ لَيْسَتْ بِمَنْزِلَةِ الْأُضْحِيَّةِ يُجْزِئُ مِنْهَا كُلُّ شَيْ‏ءٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Abbas Bin Marouf, from Safwan, from Abdul Rahman Bin Al Hajjaj, from Minhal Al Qammat who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Our companions are seeking the <span class=\"iTxt\">Aqeeqa</span> when the Bedouins come over, so they are finding the stallions; and when it is other than that they cannot find it, and it is a (heavy) cost upon them’. So he<sup>asws</sup> said: ‘But rather, it is a sheep, flesh which is not at the status of the sacrificial animal (during Hajj). Everything suffices from it’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-‘ Abbas ibn M‘aruf from Safwan ‘Abd al-Rahman ibn al- Hajj a] from Minhal al-Qammat who has said the following: “Once I said to abu ‘Abd Allah, ‘Alayhi al-Salam, that our people can find animals for ‘Aqiqah when Arabs are around. They can find ram but in other seasons such an animal is difficult to find and it is expensive for them. He (the Imam) said, ‘It is only a sheep and it is not like the sacrificial offering for al-Hajj. Anything is sufficient for it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/54)"
        ],
        "index": 10424,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:18:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ مُحَمَّدِ بْنِ زِيَادٍ عَنِ الْكَاهِلِيِّ عَنْ مُرَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْعَقِيقَةُ لَيْسَتْ بِمَنْزِلَةِ الْهَدْيِ خَيْرُهَا أَسْمَنُهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad, from Salih Bin Abu Hammad, from Muhammad Bin Ziyad, from Al Kahly, from Murazam, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The <span class=\"iTxt\">Aqeeqa</span> is not at the status of the sacrifice (during Hajj). The best of these is the fattest of these’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad has narrated from Salih ibn abu Hammad from Muhammad ibn Ziyad from al-Kahiliy from Murazim who has said the following: “Abu ‘Abd Allah, Alayhi al-Salam, has said, ‘ Aqiqah is not like the animal offering for al-Hajj. The fat one is better for Aqiqah.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:1:18",
  "kind": "verse_list"
}