{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:6:1:19",
        "titles": {
          "ar": "باب الْقَوْلِ عَلَى الْعَقِيقَةِ",
          "en": "Chapter 19 – The speech upon the Aqeeqa"
        }
      }
    ],
    "index": 1582,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:6:1:20",
        "titles": {
          "ar": "باب أَنَّ الْأُمَّ لَا تَأْكُلُ مِنَ الْعَقِيقَةِ",
          "en": "Chapter 20 – The mother should not eat from the Aqeeqa"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:6:1:18",
        "titles": {
          "ar": "باب أَنَّ الْعَقِيقَةَ لَيْسَتْ بِمَنْزِلَةِ الْأُضْحِيَّةِ وَ أَنَّهَا تُجْزِئُ مَا كَانَتْ",
          "en": "Chapter 18 – The Aqeeqa is not with the status of the slaughter (during Hajj), and it can be sufficed by whatever there was"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:1:19",
    "titles": {
      "ar": "باب الْقَوْلِ عَلَى الْعَقِيقَةِ",
      "en": "Chapter 19 – The speech upon the Aqeeqa"
    },
    "verse_count": 6,
    "verse_start_index": 10424,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/54)"
        ],
        "index": 10425,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:19:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ وَ صَفْوَانَ عَنْ إِبْرَاهِيمَ الْكَرْخِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ عَلَى الْعَقِيقَةِ إِذَا عَقَقْتَ بِسْمِ اللَّهِ وَ بِاللَّهِ اللَّهُمَّ عَقِيقَةٌ عَنْ فُلَانٍ لَحْمُهَا بِلَحْمِهِ وَ دَمُهَا بِدَمِهِ وَ عَظْمُهَا بِعَظْمِهِ اللَّهُمَّ اجْعَلْهُ وِقَاءً لآِلِ مُحَمَّدٍ ( صلى الله عليه وآله ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, and Ali Bin Muhammad, from Salih Bin Abu Hammad, both together from Ibn Abu Umeyr, and Safwan, from Ibrahim Al Karkhy, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘You should be saying upon the <span class=\"iTxt\">Aqeeqa</span>, when you perform it, ‘In the Name of Allah<sup>azwj</sup>, and by Allah<sup>azwj</sup>. O Allah<sup>azwj</sup>! I am performing <span class=\"iTxt\">Aqeeqa </span>for so and so, its flesh by his flesh, and its blood by his blood, and its bones by his bones. O Allah<sup>azwj</sup>! Make it a shield for the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Afi ibn Muhammad from Salih ibn abu Hammad all from ibn abu ‘Umayr and Safwan from Ibrahim al-Karkhiy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘When you offer ‘Aqiqah say, ‘In the name of Allah and with Allah; it is an ‘Aqiqah for so and so. Its flesh is for his flesh, its blood for his blood and its bones for his bones. O Lord, make it a protection for Muhammad and family of Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/54)"
        ],
        "index": 10426,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:19:2",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ إِسْمَاعِيلَ بْنِ مَرَّارٍ عَنْ يُونُسَ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا ذَبَحْتَ فَقُلْ بِسْمِ اللَّهِ وَ بِاللَّهِ وَ الْحَمْدُ لِلَّهِ وَ اللَّهُ أَكْبَرُ إِيمَاناً بِاللَّهِ وَ ثَنَاءً عَلَى رَسُولِ اللَّهِ ( صلى الله عليه وآله ) وَ الْعِصْمَةَ لِأَمْرِهِ وَ الشُّكْرَ لِرِزْقِهِ وَ الْمَعْرِفَةَ بِفَضْلِهِ عَلَيْنَا أَهْلَ الْبَيْتِ ",
          "فَإِنْ كَانَ ذَكَراً فَقُلِ اللَّهُمَّ إِنَّكَ وَهَبْتَ لَنَا ذَكَراً وَ أَنْتَ أَعْلَمُ بِمَا وَهَبْتَ وَ مِنْكَ مَا أَعْطَيْتَ وَ كُلُّ مَا صَنَعْنَا فَتَقَبَّلْهُ مِنَّا عَلَى سُنَّتِكَ وَ سُنَّةِ نَبِيِّكَ وَ رَسُولِكَ ( صلى الله عليه وآله ) وَ اخْسَأْ عَنَّا الشَّيْطَانَ الرَّجِيمَ لَكَ سُفِكَتِ الدِّمَاءُ لَا شَرِيكَ لَكَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ismail Bin Marrar, from Yunus, from one of his companions, ",
            "Abu Ja’far<sup>asws</sup> has said: ‘When you slaughter (an animal) so say, ‘In the Name of Allah<sup>azwj</sup>, and the Praise is for Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is the Greatest! I believe in Allah<sup>azwj</sup>, and praise be upon Rasool-Allah<sup>saww</sup>, and the infallibility of His<sup>azwj</sup> Commands, and the thanks for His<sup>azwj</sup> sustenance, and the understanding by His<sup>azwj</sup> Grace upon us<sup>asws</sup>, the People<sup>asws</sup> of the Household.",
            "So if it was a male, so say, ‘O Allah<sup>azwj</sup>! You<sup>azwj</sup> have Bestowed a male to us, and You<sup>azwj</sup> are more Knowing with what You<sup>azwj</sup> Bestow, and from You<sup>azwj</sup> is what is Granted, so what it is we do, so Accept it from us, being upon Your<sup>azwj</sup> Sunnah and the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup> and Your<sup>azwj</sup> Rasool<sup>saww</sup>; and Keep the Satan<sup>la</sup> the Pelted, away from us; for You<sup>azwj</sup> the blood has been spilt, there being no Associate for You<sup>azwj</sup>; and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from ’Ismahl ibn Marrar from Yunus from certain persons of his people who have said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘When you slaughter the animal for ‘Aqiqah, say, “In the name of Allah, with Allah, all praise belongs to Allah and Allah is greater than can be described. (It is) the expression of (our) belief in Allah, praise in favor of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, keeping up with His command and an expression of thanks for His sustenance and due to the knowledge about His generosity to us, people of the family.” If the newborn is a male then say, “O Lord, You have granted us a boy. You know best about your gift and the favor is from You. Please accept all that we do according to Your Sunnah and the Sunnah of Your prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. Drive away and repel Satan, the one condemned to be stoned, from us. Blood is shed for Your sake, there is no partner for You and all praise belongs to Allah, Lord of the worlds.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/55)"
        ],
        "index": 10427,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:19:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ بَعْضِ أَصْحَابِهِ يَرْفَعُهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ تَقُولُ عَلَى الْعَقِيقَةِ ذَكَرَ مِثْلَهُ وَ زَادَ فِيهِ اللَّهُمَّ لَحْمُهَا بِلَحْمِهِ وَ دَمُهَا بِدَمِهِ وَ عَظْمُهَا بِعَظْمِهِ وَ شَعْرُهَا بِشَعْرِهِ وَ جِلْدُهَا بِجِلْدِهِ اللَّهُمَّ اجْعَلْهُ وِقَاءً لِفُلَانِ بْنِ فُلَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from one of our companions, raising it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘You should be saying upon the <span class=\"iTxt\">Aqeeqa</span>’ – and mentioned similar to it (the above Hadeeth), and increased in it, ‘O Allah<sup>azwj</sup>! Its flesh, by his flesh, and its blood by his blood, and its bones by his bones, and its hair by his hair, and its skin by his skin. O Allah<sup>azwj</sup>! Make it a shield for so and so, son of so and so’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from certain persons of his people in a marfu ‘ manner who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has instructed to say on ‘Aqiqah - he (the narrator) mentioned the prayer in Hadith number two above with this addition: ‘O Lord, its flesh is for his flesh, its blood is for his blood, its bones for his bones, its hairs for his hairs and its skin is for his skin. O Lord, make it a protection for so and so son of so and so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/55)"
        ],
        "index": 10428,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:19:4",
        "refs": {
          "Mentions": [
            "/books/quran:6:162",
            "/books/quran:6:79",
            "/books/quran:6:78",
            "/books/quran:6:163"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُصَدِّقِ بْنِ صَدَقَةَ عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا أَرَدْتَ أَنْ تَذْبَحَ الْعَقِيقَةَ قُلْتَ يَا قَوْمِ إِنِّي بَرِي‏ءٌ مِمَّا تُشْرِكُونَ إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَ الْأَرْضَ حَنِيفاً مُسْلِماً وَ مَا أَنَا مِنَ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَ نُسُكِي وَ مَحْيَايَ وَ مَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ وَ بِذَلِكَ أُمِرْتُ وَ أَنَا مِنَ الْمُسْلِمِينَ ",
          "اللَّهُمَّ مِنْكَ وَ لَكَ بِسْمِ اللَّهِ وَ اللَّهُ أَكْبَرُ اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ آلِ مُحَمَّدٍ وَ تَقَبَّلْ مِنْ فُلَانِ بْنِ فُلَانٍ وَ تُسَمِّي الْمَوْلُودَ بِاسْمِهِ ثُمَّ تَذْبَحُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad Bin Al Hassan, from Amro Bin Saeed, from Musaddaw Bin Sadaqa, from Ammar Bin Musa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Whenever you intend to slaughter the <span class=\"iTxt\">Aqeeqa</span>, say, <span class=\"ibTxt\"><a href=\"/#/books/quran:6#h78\">[6:78]</a> O my people! I am clear of what you are associating (with Allah) <a href=\"/#/books/quran:6#h79\">[6:79]</a> Surely I have turned myself, being upright, submitting to Him Who Originated the skies and the earth, and I am not of the polytheists <a href=\"/#/books/quran:6#h162\">[6:162]</a> Say: Surely my Prayer and my sacrifice and my life and my death are (all) for Allah, the Lord of the worlds <a href=\"/#/books/quran:6#h163\">[6:163]</a> There is no associate for Him; and with that I am Commanded, and I am the first of those who submit</span>.",
            "O Allah<sup>azwj</sup>! From You<sup>azwj</sup>, and for You<sup>azwj</sup>, in the Name of Allah<sup>azwj</sup>, and Allah<sup>azwj</sup> is the Greatest. O Allah<sup>azwj</sup>! Send Blessings upon Muhammad<sup>saww</sup> and the Progeny<sup>asws</sup> of Muhammad, and Accept from so and so, son of so and so’ – and name the new-born with its name, then slaughter’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ahmad ibn al-Hassan from ‘Amr in Sa‘id from Musaddiq ibn Sadaqah from ‘Ammar ibn Musa who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when you decide to slaughter the animal for ‘Aqiqah say, ‘O my people I denounce what you consider partners (of Allah). I turn my face to the One who has invented the skies and earth, purely in obedience to Him and I am not a pagan. My Salat (prayer), acts of worship, life and death are in obedience to the Lord of the worlds. Allah does not have any partners. This is what I am commanded to do and believe and I am the first to submit to the will of Allah. O Lord, (it is) from You, for You, in the name of Allah, Allah is great beyond description. O Lord, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, and accept from so and so son of so and so ’ - mention the name of the newborn then slaughter the offering for ‘Aqiqah.” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/56)"
        ],
        "index": 10429,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:19:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ عَلِيِّ بْنِ سُلَيْمَانَ بْنِ رُشَيْدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنْ مُحَمَّدِ بْنِ هَاشِمٍ عَنْ مُحَمَّدِ بْنِ مَارِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ يُقَالُ عِنْدَ الْعَقِيقَةِ اللَّهُمَّ مِنْكَ وَ لَكَ مَا وَهَبْتَ وَ أَنْتَ أَعْطَيْتَ اللَّهُمَّ فَتَقَبَّلْ مِنَّا عَلَى سُنَّةِ نَبِيِّكَ ( صلى الله عليه وآله ) وَ نَسْتَعِيذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ وَ تُسَمِّي وَ تَذْبَحُ وَ تَقُولُ لَكَ سُفِكَتِ الدِّمَاءُ لَا شَرِيكَ لَكَ وَ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ اللَّهُمَّ اخْسَأِ الشَّيْطَانَ الرَّجِيمَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ali Bin Suleyman Bin Rusheyd, from Al Hassan Bin Ali Bin Yaqteen, from Muhammad Bin Hashim, from Muhammad Bin Marid, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘One should be saying during the <span class=\"iTxt\">Aqeeqa</span>, ‘O Allah<sup>azwj</sup>! From You<sup>azwj</sup>, and for You<sup>azwj</sup> is what is Gifted, and You<sup>azwj</sup> Gave it. O Allah<sup>azwj</sup>! So Accept from us upon the Sunnah of Your<sup>azwj</sup> Prophet<sup>saww</sup>, and we seek Refuge with Allah<sup>azwj</sup> from the Pelted Satan<sup>la</sup>’; and you should name, and slaughter, and you should be saying, ‘For You<sup>azwj</sup> I spill the blood, there being no Associate for You<sup>azwj</sup>, and the Praise is for Allah<sup>azwj</sup>, Lord<sup>azwj</sup> of the worlds! O Allah<sup>azwj</sup>! Keep away the Pelted Satan<sup>la</sup>’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn Sulayman ibn Rashid from al-Hassan ibn Ali ibn Yaqtin from Muhammad ibn Hashim from Muhammad ibn Marid who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said to say this when offering ‘Aqiqah, ‘0 Lord, it is from You and for You is what You have granted. O Lord, accept it from us on the Sunnah of Your prophet, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause. We seek refuge with Allah against Satan, condemned to be stoned.’ Thereafter mention the name of the newborn , then slaughter the offering for ‘Aqiqah and say, Tor You I have spilled the blood and no one is Your partner. All praise belongs to Allah, Cherisher of the worlds. O Lord, drive away Satan, condemned to be stoned.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/56)"
        ],
        "index": 10430,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:19:6",
        "refs": {
          "Mentions": [
            "/books/quran:6:162",
            "/books/quran:6:79"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ زَكَرِيَّا بْنِ آدَمَ عَنِ الْكَاهِلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي الْعَقِيقَةِ إِذَا ذَبَحْتَ تَقُولُ وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَ الْأَرْضَ حَنِيفاً مُسْلِماً وَ مَا أَنَا مِنَ الْمُشْرِكِينَ إِنَّ صَلَاتِي وَ نُسُكِي وَ مَحْيَايَ وَ مَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ لَا شَرِيكَ لَهُ اللَّهُمَّ مِنْكَ وَ لَكَ اللَّهُمَّ هَذَا عَنْ فُلَانِ بْنِ فُلَانٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Zakariyya Bin Adam, from Al Kahily, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said regarding the <span class=\"iTxt\">Aqeeqa</span>: ‘When you slaughter, you should be saying, ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:6#h79\">[6:79]</a> Surely I have turned myself, being upright, submitting to Him Who Originated the skies and the earth, and I am not of the polytheists <a href=\"/#/books/quran:6#h162\">[6:162]</a> Say: Surely my Prayer and my sacrifice and my life and my death are (all) for Allah, the Lord of the worlds</span>. There is no associate for You<sup>azwj</sup>. O Allah<sup>azwj</sup>! From You<sup>azwj</sup>, and for You<sup>azwj</sup>! O Allah<sup>azwj</sup>! This is from so and so, son of so and so’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from his father from Zakariya ibn Adam from al-Kahiliy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that when you offer ‘Aqiqah say, T turn my face to the One who has invented the skies and earth, purely in obedience to Him and I am not a pagan. My Salat (prayer), acts of worship, life and death are all in obedience to Allah, Cherisher of the worlds who has no partner. O Lord, it is from You and for You. O Lord, this is from so and so son of so and so.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:1:19",
  "kind": "verse_list"
}