{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:6:1:23",
        "titles": {
          "ar": "باب التَّطْهِيرِ",
          "en": "Chapter 23 – The purification"
        }
      }
    ],
    "index": 1586,
    "local_index": 23,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:6:1:24",
        "titles": {
          "ar": "باب خَفْضِ الْجَوَارِي",
          "en": "Chapter 24 – Cutting to lower (the genitals of) the girls"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:6:1:22",
        "titles": {
          "ar": "باب أَنَّ أَبَا طَالِبٍ عَقَّ عَنْ رَسُولِ اللَّهِ ( صلى الله عليه وآله )",
          "en": "Chapter 22 – Abu Talibas performed Aqeeqa for Rasool-Allahsaww"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:1:23",
    "titles": {
      "ar": "باب التَّطْهِيرِ",
      "en": "Chapter 23 – The purification"
    },
    "verse_count": 10,
    "verse_start_index": 10440,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/62)"
        ],
        "index": 10441,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/291",
              "text": "هَارُونَ بْنِ مُسْلِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/292",
              "text": "مَسْعَدَةَ بْنِ صَدَقَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ هَارُونَ بْنِ مُسْلِمٍ عَنْ مَسْعَدَةَ بْنِ صَدَقَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:1",
        "text": [
          " اخْتِنُوا أَوْلَادَكُمْ لِسَبْعَةِ أَيَّامٍ فَإِنَّهُ أَطْهَرُ وَ أَسْرَعُ لِنَبَاتِ اللَّحْمِ وَ إِنَّ الْأَرْضَ لَتَكْرَهُ بَوْلَ الْأَغْلَفِ ",
          "وَ بِهَذَا الْإِسْنَادِ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ ثَقْبَ أُذُنِ الْغُلَامِ مِنَ السُّنَّةِ وَ خِتَانَهُ لِسَبْعَةِ أَيَّامٍ مِنَ السُّنَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from haroun Bin Muslim, from Mas’ada Bin Sadaqa, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Circumcise your children within seven days, for it purifies and (makes it) easier for the growth of the flesh, and the earth dislikes the urine of the uncircumcised’. ",
            "And by this chain, said, ‘Abu Abdullah<sup>asws</sup> said: ‘The piercing (of the hole) in the ear of the boy is from the Sunnah, and his circumcision within seven days is from the Sunnah’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Harun ibn Muslim from Mas‘adah ibn Sadaqah who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ’Circumcise your children on the seventh day from their birth; it is more clean and allows the flesh to grow quicker. The earth dislikes the urine of one who is not circumcised.”’ Through the same chain of narrators as that of the previous Hadith the following is narrated: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ’Piercing a hole in the ear of a boy is of Sunnah and circumcision on the seventh day is of Sunnah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/62)"
        ],
        "index": 10442,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/57",
              "text": "عَلِيٌّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيٌّ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:2",
        "text": [
          " قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طَهِّرُوا أَوْلَادَكُمْ يَوْمَ السَّابِعِ فَإِنَّهُ أَطْيَبُ وَ أَطْهَرُ وَ أَسْرَعُ لِنَبَاتِ اللَّحْمِ وَ إِنَّ الْأَرْضَ تَنْجَسُ مِنْ بَوْلِ الْأَغْلَفِ أَرْبَعِينَ صَبَاحاً ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali, from his father, from Al Nowfaly, from Al Sakuny, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Rasool-Allah<sup>saww</sup> said: ‘Purify your children on the seventh day, for it is better, and cleaner, and easier for the growth of the flesh, and that the earth stays dirty from the urine of the uncircumcised, for forty mornings’."
          ],
          "en.sarwar": [
            "2. Ali has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that the Messenger of Allah. O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, has said, ‘Cleanse (circumcise) your children on the seventh day of their birth; it is more clean and allows the flesh to grow quicker. The land remains unclean for forty days because of the urine of an uncircumcised man.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/63)"
        ],
        "index": 10443,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى وَ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ أَنَّهُ كَتَبَ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) أَنَّهُ رُوِيَ عَنِ الصَّادِقِينَ ( عليهما السلام ) أَنِ اخْتِنُوا أَوْلَادَكُمْ يَوْمَ السَّابِعِ يَطَّهَّرُوا وَ إِنَّ الْأَرْضَ تَضِجُّ إِلَى اللَّهِ مِنْ بَوْلِ الْأَغْلَفِ وَ لَيْسَ جُعِلْتُ فِدَاكَ لِحَجَّامِي بَلَدِنَا حِذْقٌ بِذَلِكَ وَ لَا يَخْتِنُونَهُ يَوْمَ السَّابِعِ وَ عِنْدَنَا حَجَّامُ الْيَهُودِ فَهَلْ يَجُوزُ لِلْيَهُودِ أَنْ يَخْتِنُوا أَوْلَادَ الْمُسْلِمِينَ أَمْ لَا إِنْ شَاءَ اللَّهُ فَوَقَّعَ ( عليه السلام ) السُّنَّةُ يَوْمَ السَّابِعِ فَلَا تُخَالِفُوا السُّنَنَ إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya and Muhammad Bin Abdullah, ",
            "(It has been narrated) from Abdullah son of Ja’far<sup>asws</sup> who wrote to Abu Muhammad<sup>asws</sup> that it has been reported from the two truthful ones (5<sup>th</sup> and 6<sup>th</sup> Imams<sup>asws</sup>) that: ‘Circumcise your children on the seventh day purifying them, and that the earth resounds with noise to Allah<sup>azwj</sup> from the urine of the uncircumcised; and there are no surgeons in our city skillful with that, and they (the people) are not circumcising on the seventh day, and among us is a Jewish surgeon, so is it allowed for the Jew that he circumcises the children of the Muslims or not, Allah<sup>azwj</sup> Willing?’ So he<sup>asws</sup> signed: ‘The Sunnah is on the seventh day, therefore you should not oppose the Sunnah, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya and Muhammad ibn ‘Abd Allah have narrated from ‘Abd Allah ibn Ja‘far who has said the following: “I once wrote to abu Muhammad, ‘Alayhi al-Salam, that it is narrated from the two truthful Imam, ‘Alayhim al-Salam, who have said, ’Circumcise your children on the seventh day from their birth; the earth cries before Allah because of the urine of an uncircumcised person.’ I pray to Allah to keep my soul in service for your cause, people performing circumcision in our city are not very knowledgeable and they do not do it on the seventh day but there is a Jewish person; if it is permissible for a Jewish person to circumcise children of Muslims or not by the will of Allah. He (the Imam) signed the answer that said, ’It is of Sunnah to circumcise on the seventh day, so do not oppose the Sunnah by the will of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/63)"
        ],
        "index": 10444,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4731",
              "text": "مُحَمَّدِ بْنِ قَزَعَةَ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ قَزَعَةَ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:4",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ مَنْ قِبَلَنَا يَقُولُونَ إِنَّ إِبْرَاهِيمَ ( عليه السلام ) خَتَنَ نَفْسَهُ بِقَدُومٍ عَلَى دَنٍّ فَقَالَ سُبْحَانَ اللَّهِ لَيْسَ كَمَا يَقُولُونَ كَذَبُوا عَلَى إِبْرَاهِيمَ ( عليه السلام ) قُلْتُ وَ كَيْفَ ذَاكَ ",
          "فَقَالَ إِنَّ الْأَنْبِيَاءَ ( عليهم السلام ) كَانَتْ تَسْقُطُ عَنْهُمْ غُلْفَتُهُمْ مَعَ سُرَرِهِمْ فِي الْيَوْمِ السَّابِعِ فَلَمَّا وُلِدَ لِإِبْرَاهِيمَ ( عليه السلام ) مِنْ هَاجَرَ عَيَّرَتْ سَارَةُ هَاجَرَ بِمَا تُعَيَّرُ بِهِ الْإِمَاءُ فَبَكَتْ هَاجَرُ وَ اشْتَدَّ ذَلِكَ عَلَيْهَا فَلَمَّا رَآهَا إِسْمَاعِيلُ تَبْكِي بَكَى لِبُكَائِهَا وَ دَخَلَ إِبْرَاهِيمُ ( عليه السلام ) فَقَالَ مَا يُبْكِيكَ يَا إِسْمَاعِيلُ فَقَالَ إِنَّ سَارَةَ عَيَّرَتْ أُمِّي بِكَذَا وَ كَذَا فَبَكَتْ وَ بَكَيْتُ لِبُكَائِهَا",
          "فَقَامَ إِبْرَاهِيمُ إِلَى مُصَلَّاهُ فَنَاجَى فِيهِ رَبَّهُ وَ سَأَلَهُ أَنْ يُلْقِيَ ذَلِكَ عَنْ هَاجَرَ فَأَلْقَاهُ اللَّهُ عَنْهَا فَلَمَّا وَلَدَتْ سَارَةُ إِسْحَاقَ وَ كَانَ يَوْمَ السَّابِعِ سَقَطَتْ عَنْ إِسْحَاقَ سُرَّتُهُ وَ لَمْ تَسْقُطْ عَنْهُ غُلْفَتُهُ فَجَزِعَتْ مِنْ ذَلِكَ سَارَةُ",
          "فَلَمَّا دَخَلَ إِبْرَاهِيمُ ( عليه السلام ) عَلَيْهَا قَالَتْ يَا إِبْرَاهِيمُ مَا هَذَا الْحَادِثُ الَّذِي حَدَثَ فِي آلِ إِبْرَاهِيمَ وَ أَوْلَادِ الْأَنْبِيَاءِ هَذَا ابْنُكَ إِسْحَاقُ قَدْ سَقَطَتْ عَنْهُ سُرَّتُهُ وَ لَمْ تَسْقُطْ عَنْهُ غُلْفَتُهُ فَقَامَ إِبْرَاهِيمُ ( عليه السلام ) إِلَى مُصَلَّاهُ فَنَاجَى رَبَّهُ وَ قَالَ يَا رَبِّ مَا هَذَا الْحَادِثُ الَّذِي قَدْ حَدَثَ فِي آلِ إِبْرَاهِيمَ وَ أَوْلَادِ الْأَنْبِيَاءِ وَ هَذَا ابْنِي إِسْحَاقُ قَدْ سَقَطَتْ عَنْهُ سُرَّتُهُ وَ لَمْ تَسْقُطْ عَنْهُ غُلْفَتُهُ",
          "فَأَوْحَى اللَّهُ تَعَالَى إِلَيْهِ أَنْ يَا إِبْرَاهِيمُ هَذَا لِمَا عَيَّرَتْ سَارَةُ هَاجَرَ فَآلَيْتُ أَنْ لَا أُسْقِطَ ذَلِكَ عَنْ أَحَدٍ مِنْ أَوْلَادِ الْأَنْبِيَاءِ لِتَعْيِيرِ سَارَةَ هَاجَرَ فَاخْتِنْ إِسْحَاقَ بِالْحَدِيدِ وَ أَذِقْهُ حَرَّ الْحَدِيدِ ",
          "قَالَ فَخَتَنَهُ إِبْرَاهِيمُ ( عليه السلام ) بِالْحَدِيدِ وَ جَرَتِ السُّنَّةُ بِالْخِتَانِ فِي أَوْلَادِ إِسْحَاقَ بَعْدَ ذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Muhammad Bin Qaza’a who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The ones in front of us are saying that Ibrahim<sup>as</sup> circumcised himself<sup>as</sup> with a curved knife upon a large jar’. So he<sup>asws</sup> said: ‘Glory be to Allah<sup>azwj</sup>! It is not as what they are saying it to be. They are lying upon Ibrahim<sup>as</sup>’. I said, ‘And how is that?’ ",
            "So he<sup>asws</sup> said: ‘The Prophets<sup>as</sup>, their<sup>as</sup> wrapping used to drop off from them<sup>as</sup> along with their navel during the seventh day. So when (Ismail<sup>as</sup>) was born to Ibrahim<sup>as</sup> from Hajar<sup>as</sup>, Sarah<sup>as</sup> reproached Hajar<sup>as</sup> with what slaves are reproached with. So Hajar<sup>as</sup> cried, and that was grievous upon her<sup>as</sup>. So when Ismail<sup>as</sup> saw her<sup>as</sup> crying, he<sup>as</sup> cried as well due to her<sup>as</sup> crying, and Ibrahim<sup>as</sup> entered. So he<sup>as</sup> said: ‘What makes you<sup>as</sup> cry, O Ismail<sup>as</sup>?’ So he<sup>as</sup> said: ‘Sarah<sup>as</sup> reproached my<sup>as</sup> mother<sup>as</sup> with such and such. So she<sup>as</sup> cried, and I<sup>as</sup> cried due to her<sup>as</sup> crying’. ",
            "So Ibrahim<sup>as</sup> stood upon his<sup>as</sup> Prayer Mat, so he<sup>as</sup> whispered unto his<sup>as</sup> Lord<sup>azwj</sup>, and asked Him<sup>azwj</sup> Cast that away from Hajar<sup>as</sup>. So Allah<sup>azwj</sup> Cast that off from Hajar<sup>as</sup>. So when Sarah<sup>as</sup> gave birth to Is’haq<sup>as</sup>, and it was the seventh day, there fell down from him<sup>as</sup>, his<sup>as</sup> navel, but his<sup>as</sup> wrapping did not fall. So Sarah<sup>as</sup> panicked from that. ",
            "So when Ibrahim<sup>as</sup> came over to her<sup>as</sup>, she<sup>as</sup> said: ‘O Ibrahim<sup>as</sup>! What is this occurrence which has occurred in the Progeny of Ibrahim<sup>as</sup>, and the children of the Prophets<sup>as</sup>? This is your<sup>as</sup> son<sup>as</sup> Is’haq. His<sup>as</sup> navel has fallen off from him and his<sup>as</sup> wrapping did not fall off from him<sup>as</sup>’. So Ibrahim<sup>as</sup> stood upon his<sup>as</sup> Prayer Mat, so he<sup>as</sup> whispered to his<sup>as</sup> Lord<sup>azwj</sup>, and said: ‘O Lord<sup>azwj</sup>! What is this occurrence which has occurred in the Progeny of Ibrahim<sup>as</sup> and the children of the Prophets<sup>as</sup>, and this is my<sup>as</sup> son<sup>as</sup> Is’haq<sup>as</sup>. His<sup>as</sup> navel has fallen off from him<sup>as</sup> and his<sup>as</sup> wrapping did not fall off from him’. ",
            "So Allah<sup>azwj</sup> the High Revealed unto him<sup>as</sup>: “O Ibrahim<sup>as</sup>! This is due to what Sarah<sup>as</sup> reproached Hajar<sup>as</sup> with, so I<sup>azwj</sup> Swore that, that would not fall off from anyone from the children of the Prophets<sup>as</sup> due to the reproach of Sarah<sup>as</sup> to Hajar<sup>as</sup>. Therefore, circumcise Is’haq<sup>as</sup> with the iron, and make him<sup>as</sup> taste the heat of the iron”. ",
            "He<sup>asws</sup> said: ‘So Ibrahim<sup>as</sup> circumcised him<sup>as</sup> with the iron, and the Sunnah flowed with the circumcision in the children of Is’haq after that’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Muhammad ibn Qaza‘ah who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘We are told that Ibrahim ‘Alayhi al-Salam circumcised with an adze on a base. He (the Imam) said, ‘Allah is free of all defects, it is not the way they say it is. They have lied against Ibrahim.’ I then asked, ‘How did it happen?’ He (the Imam) said, ‘In the case of the prophets, ‘Alayhim al-Salam, it would drop off on its own as well as their umbilical cord on the seventh day. When a child was born to Ibrahim, ‘Alayhi al-Salam, from Hagar, Sarah reproached her as slave-girls are reproached and she wept. It caused her an intense feeling and when Tsma‘il saw her weep he also wept because of her weeping. Ibrahim came in and asked Tsma‘il, ‘What has made you weep?’ Tsma‘il replied, “Sarah reproached my mother with such and such words. She wept and I also wept.” Ibrahim then stood on his place for prayer, spoke to his Lord and asked to make it drop from Hagar. Allah caused it to drop off. When Sarah gave birth to Ishaq and it became the seventh day the umbilical cord of Ishaq fell off but not the cover to be circumcised. Sarah became frightened thereby. When Ibrahim came in she said, ‘O Ibrahim, what is this incident which has taken place with the family of Ibrahim and the children of prophets? This is your son Ishaq. His umbilical cord has fallen off but not his circumcision place.’ Ibrahim stood in the place of his prayer, spoke to his Lord and asked, ‘O Lord, what is this incident that has taken place in the family of Ibrahim and the children of prophets? This is my son Ishaq. His umbilical cord has fallen off but not his circumcision place. Allah, most High, sent him revelation that said, ‘O Ibrahim this is because when Sarah reproached Hagar I then swore not to allow the circumcision place of one of the children of the prophets to fall off because of Sarah’s reproaching Hagar. Thus circumcise Ishaq with iron and make him to feel the heat of iron.’ He (the Imam) said, ‘Ibrahim circumcised him with iron; then the tradition continued in the children of Ishaq thereafter.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/64)"
        ],
        "index": 10445,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "وَ عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/108",
              "text": "مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/41",
              "text": "عَبْدِ اللَّهِ بْنِ سِنَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:5",
        "text": [
          " ثَقْبُ أُذُنِ الْغُلَامِ مِنَ السُّنَّةِ وَ خِتَانُ الْغُلَامِ مِنَ السُّنَّةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Isa, from Abdullah Bin Sinan, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Piercing the ear of the boy is from the Sunnah, and circumcision of the boy is from the Sunnah’."
          ],
          "en.sarwar": [
            "5. It is narrated from the narrator of the previous Hadith from Ahmad ibn Muhammad ibn ‘Isa from ‘Abd Allah ibn Sinan who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Piercing the ears of a boy is of the Sunnah as well as his circumcision.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/64)"
        ],
        "index": 10446,
        "local_index": 6,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "وَ عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/241",
              "text": "الْحُسَيْنِ بْنِ سَعِيدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/201",
              "text": "فَضَالَةَ بْنِ أَيُّوبَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1595",
              "text": "الْقَاسِمِ بْنِ بُرَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/157",
              "text": "أَبِي بَصِيرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ فَضَالَةَ بْنِ أَيُّوبَ عَنِ الْقَاسِمِ بْنِ بُرَيْدٍ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:6",
        "text": [
          " مِنْ سُنَنِ الْمُرْسَلِينَ الِاسْتِنْجَاءُ وَ الْخِتَانُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Fazalat Bin Ayoub, from Al Qasim Bin Bureyd, from Abu Baseer, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘From the Sunnah of the <span class=\"iTxt\">Mursil</span> Prophets<sup>as</sup> is the cleaning oneself after the toilet, and the circumcision’."
          ],
          "en.sarwar": [
            "6. It is narrated from the narrator of the previous Hadith from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Fadalah ibn Ayyub from al-Qasim ibn Burayd from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Of the Sunnah of prophets is draining al-Istinja’ (one’s urine) and circumcision.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/65)"
        ],
        "index": 10447,
        "local_index": 7,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/24",
              "text": "وَ عَنْهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/30",
              "text": "الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1079",
              "text": "أَخِيهِ الْحُسَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1080",
              "text": "أَبِيهِ عَلِيِّ بْنِ يَقْطِينٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "وَ عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ يَقْطِينٍ عَنْ أَخِيهِ الْحُسَيْنِ عَنْ أَبِيهِ عَلِيِّ بْنِ يَقْطِينٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:7",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ خِتَانِ الصَّبِيِّ لِسَبْعَةِ أَيَّامٍ مِنَ السُّنَّةِ هُوَ أَوْ يُؤَخَّرُ وَ أَيُّهُمَا أَفْضَلُ قَالَ لِسَبْعَةِ أَيَّامٍ مِنَ السُّنَّةِ وَ إِنْ أُخِّرَ فَلَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from Ahmad Bin Muhammad, from Al Hassan Bin Ali Bin Yaqteen, from his brother Al Husayn, from his father Ali Bin Yaqteen who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about circumcising the child within seven days, is it from the Sunnah or can one delay it, and whichever of the two is preferable?’ He<sup>asws</sup> said: ‘For the seventh day is from the Sunnah, and if it is delayed, so there is no problem (expiation)’."
          ],
          "en.sarwar": [
            "7. It is narrated from the narrator of the previous Hadith from Ahmad ibn Muhammad from al-Hassan ibn Ali ibn Yaqtin from his brother al-Husayn from his father Ali ibn Yaqtin who has said the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about circumcision of a child, if on the seventh day is of Sunnah or it can be delayed and which one is better. He (the Imam) said, ‘On the seventh day is of Sunnah but delaying is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/65)"
        ],
        "index": 10448,
        "local_index": 8,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/111",
              "text": "هِشَامِ بْنِ سَالِمٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:8",
        "text": [
          " مِنَ الْحَنِيفِيَّةِ الْخِتَانُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Salim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘From the uprightness is the circumcision’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Circumcision is of pure obedience to Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل كالصحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/65)"
        ],
        "index": 10449,
        "local_index": 9,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/2",
              "text": "عِدَّةٌ مِنْ أَصْحَابِنَا"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/460",
              "text": "أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/206",
              "text": "عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/177",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:9",
        "text": [
          " الْمَوْلُودُ يُعَقُّ عَنْهُ وَ يُخْتَنُ لِسَبْعَةِ أَيَّامٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Abdullah Bin Al Mugheira, from the one who mentioned it, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘The new-born, perform <span class=\"iTxt\">Aqeeqa</span> from him and circumcision within seven days’."
          ],
          "en.sarwar": [
            "9. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father from ‘Abd Allah ibn al-Mughirah from those whom he has mentioned who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘For a newborn ‘Aqiqah is offered on the seventh day and the child is circumcised.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/65)"
        ],
        "index": 10450,
        "local_index": 10,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/38",
              "text": "النَّوْفَلِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/39",
              "text": "السَّكُونِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:23:10",
        "text": [
          " قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) إِذَا أَسْلَمَ الرَّجُلُ اخْتَتَنَ وَ لَوْ بَلَغَ ثَمَانِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakuny, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘When the man becomes a Muslim, he should be circumcised even if he has reached eighty (years)’."
          ],
          "en.sarwar": [
            "10. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘If a man becomes a Muslim he must circumcise even if he is eighty years old.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:1:23",
  "kind": "verse_list"
}