{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:6:1", "titles": {"ar": "كِتَابُ الْعَقِيقَةِ", "en": "THE BOOK OF AQEEQA"}}, {"indexed_titles": {"en": "Chapter 26"}, "path": "/books/al-kafi:6:1:26", "titles": {"ar": "باب نَوَادِرَ", "en": "Chapter 26 - Miscellaneous"}}], "index": 1582, "local_index": 26, "part_type": "Chapter", "path": "/books/al-kafi:6:1:26", "titles": {"ar": "باب نَوَادِرَ", "en": "Chapter 26 - Miscellaneous"}, "verse_count": 3, "verse_start_index": 10448, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10449, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:1:26:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ خَالِدٍ عَنْ سَعْدِ بْنِ سَعْدٍ عَنْ إِدْرِيسَ بْنِ عَبْدِ اللَّهِ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ مَوْلُودٍ يُولَدُ فَيَمُوتُ يَوْمَ السَّابِعِ هَلْ يُعَقُّ عَنْهُ قَالَ إِنْ كَانَ مَاتَ قَبْلَ الظُّهْرِ لَمْ يُعَقَّ عَنْهُ وَ إِنْ مَاتَ بَعْدَ الظُّهْرِ عُقَّ عَنْهُ ."], "translations": {"en.hubeali": ["Muhammad Bin yahya, from Ahmad Bin Muhammad Bin Isa, from Muhammad Bin Khalid, from Sa’ad Bin Saeed, from Idrees Bin Abdullah who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a new-born who was born, so he died on the seventh day, should <span class=\"iTxt\">Aqeeqa</span> be performed from him?’ He<sup>asws</sup> said: ‘If he dies before <span class=\"iTxt\">Al-Zohr</span> (midday), there would be no <span class=\"iTxt\">Aqeeqa</span> for him, and if he dies after <span class=\"iTxt\">Al-Zohr</span>, there would be <span class=\"iTxt\">Aqeeqa</span> for him’."]}}, {"index": 10450, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:1:26:2", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنْ أَبِي هَارُونَ مَوْلَى آلِ جَعْدَةَ قَالَ كُنْتُ جَلِيساً لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) بِالْمَدِينَةِ فَفَقَدَنِي أَيَّاماً ثُمَّ إِنِّي جِئْتُ إِلَيْهِ فَقَالَ لِي لَمْ أَرَكَ مُنْذُ أَيَّامٍ يَا أَبَا هَارُونَ فَقُلْتُ وُلِدَ لِي غُلَامٌ فَقَالَ بَارَكَ اللَّهُ فِيهِ فَمَا سَمَّيْتَهُ قُلْتُ سَمَّيْتُهُ مُحَمَّداً ", "قَالَ فَأَقْبَلَ بِخَدِّهِ نَحْوَ الْأَرْضِ وَ هُوَ يَقُولُ مُحَمَّدٌ مُحَمَّدٌ مُحَمَّدٌ حَتَّى كَادَ يَلْصَقُ خَدُّهُ بِالْأَرْضِ ثُمَّ قَالَ بِنَفْسِي وَ بِوُلْدِي وَ بِأَهْلِي وَ بِأَبَوَيَّ وَ بِأَهْلِ الْأَرْضِ كُلِّهِمْ جَمِيعاً الْفِدَاءُ لِرَسُولِ اللَّهِ ( صلى الله عليه وآله ) لَا تَسُبَّهُ وَ لَا تَضْرِبْهُ وَ لَا تُسِئْ إِلَيْهِ وَ اعْلَمْ أَنَّهُ لَيْسَ فِي الْأَرْضِ دَارٌ فِيهَا اسْمُ مُحَمَّدٍ إِلَّا وَ هِيَ تُقَدَّسُ كُلَّ يَوْمٍ ", "ثُمَّ قَالَ لِي عَقَقْتَ عَنْهُ قَالَ فَأَمْسَكْتُ قَالَ وَ قَدْ رَآنِي حَيْثُ أَمْسَكْتُ ظَنَّ أَنِّي لَمْ أَفْعَلْ فَقَالَ يَا مُصَادِفُ ادْنُ مِنِّي فَوَ اللَّهِ مَا عَلِمْتُ مَا قَالَ لَهُ إِلَّا أَنِّي ظَنَنْتُ أَنَّهُ قَدْ أَمَرَ لِي بِشَيْ‏ءٍ فَذَهَبْتُ لِأَقُومَ فَقَالَ لِي كَمَا أَنْتَ يَا أَبَا هَارُونَ فَجَاءَنِي مُصَادِفٌ بِثَلَاثَةِ دَنَانِيرَ فَوَضَعَهَا فِي يَدِي فَقَالَ يَا أَبَا هَارُونَ اذْهَبْ فَاشْتَرِ كَبْشَيْنِ وَ اسْتَسْمِنْهُمَا وَ اذْبَحْهُمَا وَ كُلْ وَ أَطْعِمْ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Abu Haroun, a slave of the progeny of Ja’da who said, ", "‘I was a regular sitter with Abu Abdullah<sup>asws</sup> in Al-Medina. So he<sup>asws</sup> found me absent for a few days, then I came over to him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘Why have I<sup>asws</sup> not seen you since a few days, O Abu Haroun?’ So I said, ‘A boy has been born for me’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Bless you in him. So what have you named him as?’ I said, ‘I have named him as Muhammad’. ", "He (the narrator) said, ‘So turned his<sup>asws</sup> cheek towards the ground and he<sup>asws</sup> was saying: ‘Muhammad, Muhammad, Muhammad’, until his<sup>asws</sup> cheek almost got fixed with the ground. Then he<sup>asws</sup> said: ‘By my<sup>asws</sup> soul, and by my<sup>asws</sup> children, and by my<sup>asws</sup> family, and by my<sup>asws</sup> parents, and by the inhabitants of the earth, all of them together, sacrificed for Rasool-Allah<sup>saww</sup>. Neither insult him, nor hit him, nor harm him; and know that there no house in the earth in which is a name Muhammad, except that it Extols (the Holiness of Allah<sup>azwj</sup>) every day’. ", "Then he<sup>asws</sup> said to me: ‘Have you performed <span class=\"iTxt\">Aqeeqa</span> from him?’ So I remained silent. And he<sup>asws</sup> saw me where I remained silent thinking that I did not do it, so he<sup>asws</sup> said: ‘O Musaddaf! Come closer to me<sup>asws</sup>’. So, by Allah<sup>azwj</sup>, I do not know what he<sup>asws</sup> said to him, except that I guessed he<sup>asws</sup> had ordered something for me. So I went to arise, so he<sup>asws</sup> said to me: ‘Stay as you were, O Abu Haroun! So Musaddaf came over to me with three Dinars, so he placed them in my hands. So he<sup>asws</sup> said: ‘O Abu Haroun! Go and buy two rams, and fatten both of these, and slaughter both of these, and eat and feed’."]}}, {"index": 10451, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:1:26:3", "text": ["عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ لَمْ يَعُقَّ عَنْ وَلَدِهِ حَتَّى كَبِرَ وَ كَانَ غُلَاماً شَابّاً أَوْ رَجُلًا قَدْ بَلَغَ قَالَ إِذَا ضُحِّيَ عَنْهُ أَوْ ضَحَّى الْوَلَدُ عَنْ نَفْسِهِ فَقَدْ أَجْزَأَتْ عَنْهُ عَقِيقَتُهُ ", "وَ قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) الْمَوْلُودُ مُرْتَهَنٌ بِعَقِيقَتِهِ فَكَّهُ أَبَوَاهُ أَوْ تَرَكَاهُ ."], "translations": {"en.hubeali": ["A number of our companions, from Ahmad Bin Muhammad Bin Khalid and Ali Bin Ibrahim, from his father, from Usman Bin Isa, from Sama’at who said, ", "‘I asked him<sup>asws</sup> about a man who had not performed <span class=\"iTxt\">Aqeeqa</span> for his child until he was old, and was a youthful boy, or a man who had matured. He<sup>asws</sup> said: ‘When he offers a sacrifice from him, or the boy offers a sacrifice from himself, so he has sufficed from it of his <span class=\"iTxt\">Aqeeqa</span>’. ", "And he<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> said; ‘The new-born is a pledgee with his <span class=\"iTxt\">Aqeeqa</span>, so his parents either free him (from the pledge) or leave him (in it)’."]}}]}, "index": "al-kafi:6:1:26", "kind": "verse_list"}