{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:6:1", "titles": {"ar": "كِتَابُ الْعَقِيقَةِ", "en": "THE BOOK OF AQEEQA"}}, {"indexed_titles": {"en": "Chapter 29"}, "path": "/books/al-kafi:6:1:29", "titles": {"ar": "باب فِي ضَمَانِ الظِّئْرِ", "en": "Chapter 29 – Regarding the responsibilities of the wet-nurse"}}], "index": 1585, "local_index": 29, "part_type": "Chapter", "path": "/books/al-kafi:6:1:29", "titles": {"ar": "باب فِي ضَمَانِ الظِّئْرِ", "en": "Chapter 29 – Regarding the responsibilities of the wet-nurse"}, "verse_count": 2, "verse_start_index": 10462, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 10463, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:1:29:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ وَ حَمَّادٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ اسْتَأْجَرَ ظِئْراً فَدَفَعَ إِلَيْهَا وَلَدَهُ فَانْطَلَقَتِ الظِّئْرُ فَدَفَعَتْ وَلَدَهُ إِلَى ظِئْرٍ أُخْرَى فَغَابَتْ بِهِ حِيناً ثُمَّ إِنَّ الرَّجُلَ طَلَبَ وَلَدَهُ مِنَ الظِّئْرِ الَّتِي كَانَ أَعْطَاهَا إِيَّاهُ فَأَقَرَّتْ أَنَّهَا اسْتَأْجَرَتْهُ وَ أَقَرَّتْ بِقَبْضِهَا وَلَدَهُ وَ أَنَّهَا كَانَتْ دَفَعَتْهُ إِلَى ظِئْرٍ أُخْرَى فَقَالَ عَلَيْهَا الدِّيَةُ أَوْ تَأْتِيَ بِهِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Jameel Bin Darrraj, and Hammad, from Suleyman Bin Khalid, said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who employed a wet-nurse, so he handed over to her, his son. So the wet-nurse went and handed over his son to another wet-nurse. So she disappeared with him for a while. Then the man sought his son from the wet-nurse whom he had give his son to. So she confessed that she had contracted it out, and confessed of the capture of his son, and that she had handed him over to another wet-nurse. So he<sup>asws</sup> said: ‘Upon her is the wergild (blood money), or she comes up with him’."]}}, {"index": 10464, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:1:29:2", "text": ["ابْنُ مَحْبُوبٍ عَنْ جَمِيلِ بْنِ صَالِحٍ عَنْ سُلَيْمَانَ بْنِ خَالِدٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ اسْتَأْجَرَ ظِئْراً فَغَابَتْ بِوَلَدِهِ سِنِينَ ثُمَّ إِنَّهَا جَاءَتْ بِهِ فَأَنْكَرَتْهُ أُمُّهُ وَ زَعَمَ أَهْلُهَا أَنَّهُمْ لَا يَعْرِفُونَهُ قَالَ لَيْسَ عَلَيْهَا شَيْ‏ءٌ الظِّئْرُ مَأْمُونَةٌ ."], "translations": {"en.hubeali": ["Ibn Mahboub, from Jameel Bin Salih, from Suleyman Bin Khalid, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who employed a wet-nurse. So she disappeared with his son for years. Then she came over with him, but his mother denied him and her family claimed that they do not recognise him. So he<sup>asws</sup> said: ‘There is nothing upon her. The wet-nurse has to be trusted’."]}}]}, "index": "al-kafi:6:1:29", "kind": "verse_list"}