{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 31"
        },
        "path": "/books/al-kafi:6:1:31",
        "titles": {
          "ar": "باب مَنْ أَحَقُّ بِالْوَلَدِ إِذَا كَانَ صَغِيراً",
          "en": "Chapter 31 – The one who is more rightful with the child when it was small"
        }
      }
    ],
    "index": 1594,
    "local_index": 31,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:6:1:32",
        "titles": {
          "ar": "باب النُّشُوءِ",
          "en": "Chapter 32 – The growth (of the child)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 30"
        },
        "path": "/books/al-kafi:6:1:30",
        "titles": {
          "ar": "باب مَنْ يُكْرَهُ لَبَنُهُ وَ مَنْ لَا يُكْرَهُ",
          "en": "Chapter 30 – The one whose milk is disliked, and the one whose milk is not disliked"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:1:31",
    "titles": {
      "ar": "باب مَنْ أَحَقُّ بِالْوَلَدِ إِذَا كَانَ صَغِيراً",
      "en": "Chapter 31 – The one who is more rightful with the child when it was small"
    },
    "verse_count": 5,
    "verse_start_index": 10487,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/78)"
        ],
        "index": 10488,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/59",
              "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/62",
              "text": "مُعَلَّى بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/131",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "أَبَانٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1895",
              "text": "فَضْلٍ أَبِي الْعَبَّاسِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ الْوَشَّاءِ عَنْ أَبَانٍ عَنْ فَضْلٍ أَبِي الْعَبَّاسِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:31:1",
        "text": [
          " قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ أَحَقُّ بِوَلَدِهِ أَمِ الْمَرْأَةُ قَالَ لَا بَلِ الرَّجُلُ فَإِنْ قَالَتِ الْمَرْأَةُ لِزَوْجِهَا الَّذِي طَلَّقَهَا أَنَا أُرْضِعُ ابْنِي بِمِثْلِ مَا تَجِدُ مَنْ تُرْضِعُهُ فَهِيَ أَحَقُّ بِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali Al Washa, from Aban, from Fazl Abu Al Abbas who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘Is the man more deserving with his son or the woman?’ He<sup>asws</sup> said: ‘No, but the man. So if the woman says to her husband who had divorced her, ‘I will breast-feed my son with similar to what you would find the one who would breast-feed him, so she would be more rightful with it’."
          ],
          "en.sarwar": [
            "1. Al-Husayn from Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-ffassan ibn Ali al-Washsha’ from Aban from Fadl abu al-‘Abbas who has said the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, if a man has more right for the custody of a child or woman. He (the Imam) said, ‘No, the man has more right. If a divorced woman asks for breastfeeding her child for the same price as others, then she has more right for breastfeeding.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/79)"
        ],
        "index": 10489,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/339",
              "text": "مُحَمَّدِ بْنِ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/459",
              "text": "مُحَمَّدِ بْنِ الْفُضَيْلِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/592",
              "text": "أَبِي الصَّبَّاحِ الْكِنَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:31:2",
        "text": [
          " إِذَا طَلَّقَ الرَّجُلُ امْرَأَتَهُ وَ هِيَ حُبْلَى أَنْفَقَ عَلَيْهَا حَتَّى تَضَعَ حَمْلَهَا وَ إِذَا وَضَعَتْهُ أَعْطَاهَا أَجْرَهَا وَ لَا يُضَارَّهَا إِلَّا أَنْ يَجِدَ مَنْ هُوَ أَرْخَصُ أَجْراً مِنْهَا فَإِنْ هِيَ رَضِيَتْ بِذَلِكَ الْأَجْرِ فَهِيَ أَحَقُّ بِابْنِهَا حَتَّى تَفْطِمَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, form Muhammad Bin Al Fazeyl, from Abu Al Sabbah Al Kinany, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When the man divorces his wife, and she is pregnant, he has to spend upon her until she places her burden (give birth); and when she has placed it, he has to give her, her recompense (for breast feeding), and he should not harm her except if he finds one who is cheaper in recompense than her. So if she is pleased with that recompense, so she would be more rightful with her son, until she weans him’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma‘il has narrated from Muhammad ibn al-Fudayl from abu al-Sabbah al-Kinaniy who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has stated this Hadith. ‘When a man divorces his wife, who is pregnant, he must provide her maintenance until she gives birth. When she gives birth he must pay her wages and must not harm her unless he finds someone who does it for less; but if she agrees with the lesser wages then she has more right to breastfeeding her child until the child is weaned.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/80)"
        ],
        "index": 10490,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/222",
              "text": "عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/162",
              "text": "الْقَاسِمِ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/224",
              "text": "الْمِنْقَرِيِّ"
            },
            {
              "kind": "plain",
              "text": " عَمَّنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/173",
              "text": "ذَكَرَهُ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ مُحَمَّدٍ الْقَاسَانِيِّ عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ عَنِ الْمِنْقَرِيِّ عَمَّنْ ذَكَرَهُ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:31:3",
        "text": [
          " سُئِلَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يُطَلِّقُ امْرَأَتَهُ وَ بَيْنَهُمَا وَلَدٌ أَيُّهُمَا أَحَقُّ بِالْوَلَدِ قَالَ الْمَرْأَةُ أَحَقُّ بِالْوَلَدِ مَا لَمْ تَتَزَوَّجْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Ali Bin Muhammad Al Qasany, from Al Qasim Bin Muhammad, from Al Minqary, from the one who mentioned it, said, ",
            "‘Abu Abdullah<sup>asws</sup> was asked about the man who divorces his wife, and between the two of them is a child, which of the two is more rightful with the child?’ He<sup>asws</sup> said: ‘The woman is more rightful with the child so long as she does not get married (again)’."
          ],
          "en.sarwar": [
            "3. Ali ibn Ibrahim has narrated from Ali ibn Muhammad al-Qasaniy from al-Qasim ibn Muhammad from al-Minqariy from those whom he has mentioned who has said the following: “Once, abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the case of a man who divorces his wife. They have a child, which one of them has more right for the child? He (the Imam) said, ‘The woman has more right as long as she does not marry.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/80)"
        ],
        "index": 10491,
        "local_index": 4,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/546",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/310",
              "text": "الْحَسَنِ بْنِ عَلِيٍّ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/1066",
              "text": "الْعَبَّاسِ بْنِ عَامِرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/314",
              "text": "دَاوُدَ بْنِ الْحُصَيْنِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/19",
              "text": "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنِ الْعَبَّاسِ بْنِ عَامِرٍ عَنْ دَاوُدَ بْنِ الْحُصَيْنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:31:4",
        "relations": {
          "Mentions": [
            "/books/quran:2:233"
          ]
        },
        "text": [
          " وَ الْوالِداتُ يُرْضِعْنَ أَوْلادَهُنَّ قَالَ مَا دَامَ الْوَلَدُ فِي الرَّضَاعِ فَهُوَ بَيْنَ الْأَبَوَيْنِ بِالسَّوِيَّةِ فَإِذَا فُطِمَ فَالْأَبُ أَحَقُّ بِهِ مِنَ الْأُمِّ فَإِذَا مَاتَ الْأَبُ فَالْأُمُّ أَحَقُّ بِهِ مِنَ الْعَصَبَةِ ",
          "فَإِنْ وَجَدَ الْأَبُ مَنْ يُرْضِعُهُ بِأَرْبَعَةِ دَرَاهِمَ وَ قَالَتِ الْأُمُّ لَا أُرْضِعُهُ إِلَّا بِخَمْسَةِ دَرَاهِمَ فَإِنَّ لَهُ أَنْ يَنْزِعَهُ مِنْهَا إِلَّا أَنَّ ذَلِكَ خَيْرٌ لَهُ وَ أَرْفَقُ بِهِ أَنْ يُتْرَكَ مَعَ أُمِّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Al Hassan Bin Ali, from Al Abbas Bin Aamir, from Dawood Bin Al Husayn, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘<span class=\"ibTxt\"><a href=\"/#/books/quran:2#h233\">[2:233]</a> And the mothers should suckle their children</span>, for as long as the child is in the breast-feeding. So he would be between the two parents with the equality. So when it weans, then for the father is more right with him than the mother. So when the father dies, so the mother is more rightful with him that the relatives. ",
            "So if the father finds one who would breast-feed it for four Dirhams, and the mother says, ‘No, I will breast-feed it, except for five Dirhams, so it would be up to him if he snatches it from her, except if that is better for it, and she is more kind with it, if he were to leave it with its mother’."
          ],
          "en.sarwar": [
            "4. Abu Ali al-Ash‘ariy has narrated from al-FIassan ibn Ali from al-‘Abbas ibn ‘Amir from Dawud ibn al-Hasin who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘Mothers must breastfeed their children’ means that a child during breastfeeding period is between the two parents in equal manners. When the child is weaned then the father has more right about him than the mother. When the father dies then the mother has more right than the relatives. If the father finds a breastfeeding woman who asks four dirham, for example, and the mother says that she will not do for less than five dirham, he can take the child away from her unless she is more kind and better for the child.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مختلف فيه   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/80)"
        ],
        "index": 10492,
        "local_index": 5,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/40",
              "text": "ابْنِ مَحْبُوبٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/461",
              "text": "دَاوُدَ الرَّقِّيِّ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ دَاوُدَ الرَّقِّيِّ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:31:5",
        "text": [
          " سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ امْرَأَةٍ حُرَّةٍ نَكَحَتْ عَبْداً فَأَوْلَدَهَا أَوْلَاداً ثُمَّ إِنَّهُ طَلَّقَهَا فَلَمْ تُقِمْ مَعَ وُلْدِهَا وَ تَزَوَّجَتْ فَلَمَّا بَلَغَ الْعَبْدَ أَنَّهَا تَزَوَّجَتْ أَرَادَ أَنْ يَأْخُذَ وُلْدَهُ مِنْهَا وَ قَالَ أَنَا أَحَقُّ بِهِمْ مِنْكِ إِنْ تَزَوَّجْتِ فَقَالَ لَيْسَ لِلْعَبْدِ أَنْ يَأْخُذَ مِنْهَا وُلْدَهَا وَ إِنْ تَزَوَّجَتْ حَتَّى يُعْتَقَ هِيَ أَحَقُّ بِوُلْدِهَا مِنْهُ مَا دَامَ مَمْلُوكاً فَإِذَا أُعْتِقَ فَهُوَ أَحَقُّ بِهِمْ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Dawood Al Raqqy who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a free woman who married a slave, so children were born for her. Then he divorced her, so she did not stay with her children, and she re-married. So when it (the news) reached the slave that she had re-married, he wanted to take his children from her, and said, ‘I am more rightful with them than you, if you are –remarried’. So he<sup>asws</sup> said: ‘It is not for the slave that he takes her children from her, even if she is re-married, until he is free she would be more rightful with her children than him, for as long as he is an owned slave. So when he is freed, so he would be more rightful with them than her’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Dawud al-Raqqiy who has said the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a free woman who has married a slave who has given birth to several children. She is then divorced and then does not stay with her children but marries another man. The slave then finds out about her marriage. He wants to take his children from her saying that he has more right than the mother has since she has married. He (the Imam) said, ‘The slave has no right to take the children from her even if she has married until the slave becomes free; she has more right about her children than the slave as long as he is owned and when he becomes free then he has more right.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:1:31",
  "kind": "verse_list"
}