{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 6"}, "path": "/books/al-kafi:6", "titles": {"ar": "الجزء السادس‏", "en": "Volume Six"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:6:1", "titles": {"ar": "كِتَابُ الْعَقِيقَةِ", "en": "THE BOOK OF AQEEQA"}}, {"indexed_titles": {"en": "Chapter 38"}, "path": "/books/al-kafi:6:1:38", "titles": {"ar": "باب النَّوَادِرِ", "en": "Chapter 38 – The Miscellaneous"}}], "index": 1594, "local_index": 38, "part_type": "Chapter", "path": "/books/al-kafi:6:1:38", "titles": {"ar": "باب النَّوَادِرِ", "en": "Chapter 38 – The Miscellaneous"}, "verse_count": 8, "verse_start_index": 10512, "verses": [{"index": 10513, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">أ</span>َبُو عَلِيٍّ الْأَشْعَرِيُّ</span> عَنْ مُحَمَّدِ بْنِ حَسَّانَ عَنِ الْحُسَيْنِ بْنِ مُحَمَّدٍ النَّوْفَلِيِّ مِنْ وُلْدِ نَوْفَلِ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عِيسَى عَنْ عَبْدِ اللَّهِ الْعُمَرِيِّ عَنْ أَبِيهِ عَنْ جَدِّهِ قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) فِي الْمَرَضِ يُصِيبُ الصَّبِيَّ فَقَالَ كَفَّارَةٌ لِوَالِدَيْهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Hassan, from Al Husayn Bin Muhammad Al Nowfaly, from a son of Nowfal Bin Abdul Muttalib, from Muhammad Bin Ja’far, from Muhammad Bin Ali Bin Isa, from Abdullah Ao Umary, from his father, from is grandfather who said, \n‘Amir Al-Momineen<sup>asws</sup> said regarding the illness which hits the children, so he<sup>asws</sup> said: ‘It is an expiation for its parents’."}]}, {"index": 10514, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:2", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ وَهْبٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) يَعِيشُ الْوَلَدُ لِسِتَّةِ أَشْهُرٍ وَ لِسَبْعَةِ أَشْهُرٍ وَ لِتِسْعَةِ أَشْهُرٍ وَ لَا يَعِيشُ لِثَمَانِيَةِ أَشْهُرٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Abu Abdullah, from his fathe, from Wahab, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘He will live, the child of six months, and of seven months, and of nine months, but he will not live, (the child of) eight months’."}]}, {"index": 10515, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:3", "text": "عَلِيُّ بْنُ مُحَمَّدٍ عَنْ صَالِحِ بْنِ أَبِي حَمَّادٍ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَيَابَةَ عَمَّنْ حَدَّثَهُ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ غَايَةِ الْحَمْلِ بِالْوَلَدِ فِي بَطْنِ أُمِّهِ كَمْ هُوَ فَإِنَّ النَّاسَ يَقُولُونَ رُبَّمَا بَقِيَ فِي بَطْنِهَا سِنِينَ فَقَالَ كَذَبُوا أَقْصَى حَدِّ الْحَمْلِ تِسْعَةُ أَشْهُرٍ لَا يَزِيدُ لَحْظَةً وَ لَوْ زَادَ سَاعَةً لَقَتَلَ أُمَّهُ قَبْلَ أَنْ يَخْرُجَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Muhammad, from salih Bin Abu Hammad, from Yunus Bin Abdul Rahman, from Abdul Rahman Bin Sayaba, from the one who narrated it, \n(It has been narrated) from Abu Ja’far<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the maximum of the pregnancy with the child in the belly of its mother, how much can it be, for the people are saying, ‘Perhaps it remains in her belly for years’. So he<sup>asws</sup> said: ‘They are lying! The maximum limit of the pregnancy is nine months, not exceeding a moment; and if it were to exceed an hour, it would kill its mother before he comes out’."}]}, {"index": 10516, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:4", "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنِ الْحَجَّالِ عَنْ ثَعْلَبَةَ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) قَالَ الْقَابِلَةُ مَأْمُونَةٌ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Al Hajjal, from Sa’ajba, from Zurara, \n(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having said: ‘The mid-wife is a trusted one’."}]}, {"index": 10517, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ كُنْتُ جَالِساً عِنْدَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِذْ دَخَلَ يُونُسُ بْنُ يَعْقُوبَ فَرَأَيْتُهُ يَئِنُّ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا لِي أَرَاكَ تَئِنُّ قَالَ طِفْلٌ لِي تَأَذَّيْتُ بِهِ اللَّيْلَ أَجْمَعَ \nفَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) يَا يُونُسُ حَدَّثَنِي أَبِي مُحَمَّدُ بْنُ عَلِيٍّ عَنْ آبَائِهِ ( عليهم السلام ) عَنْ جَدِّي رَسُولِ اللَّهِ ( صلى الله عليه وآله ) أَنَّ جَبْرَئِيلَ نَزَلَ عَلَيْهِ وَ رَسُولُ اللَّهِ وَ عَلِيٌّ ( صلوات الله عليه ) يَئِنَّانِ فَقَالَ جَبْرَئِيلُ ( عليه السلام ) يَا حَبِيبَ اللَّهِ مَا لِي أَرَاكَ تَئِنُّ فَقَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) طِفْلَانِ لَنَا تَأَذَّيْنَا بِبُكَائِهِمَا \nفَقَالَ جَبْرَئِيلُ مَهْ يَا مُحَمَّدُ فَإِنَّهُ سَيُبْعَثُ لِهَؤُلَاءِ الْقَوْمِ شِيعَةٌ إِذَا بَكَى أَحَدُهُمْ فَبُكَاؤُهُ لَا إِلَهَ إِلَّا اللَّهُ إِلَى أَنْ يَأْتِيَ عَلَيْهِ سَبْعُ سِنِينَ فَإِذَا جَازَ السَّبْعَ فَبُكَاؤُهُ اسْتِغْفَارٌ لِوَالِدَيْهِ إِلَى أَنْ يَأْتِيَ عَلَى الْحَدِّ فَإِذَا جَازَ الْحَدَّ فَمَا أَتَى مِنْ حَسَنَةٍ فَلِوَالِدَيْهِ وَ مَا أَتَى مِنْ سَيِّئَةٍ فَلَا عَلَيْهِمَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Yaqoub Bin Yazeed, from Ibn Abu Umeyr, from Muhammad Bin Muslim who said, \n‘I was seated in the presence of Abu Abdullah<sup>asws</sup> when Yunus bin Yaqoub entered. So I saw him unhappy. So Abu Abdullah<sup>asws</sup> said to him: ‘Why do I<sup>asws</sup> see you unhappy?’ He said, ‘A child of mine made the whole night difficult for me’. \nSo Abu Abdullah<sup>asws</sup> said to him: ‘O Yunus! My<sup>asws</sup> father<sup>asws</sup> Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> narrated to me<sup>asws</sup>, from his<sup>asws</sup> forefathers<sup>asws</sup>, from my<sup>asws</sup> grandfather Rasool-Allah<sup>saww</sup> that Jibraeel<sup>as</sup> descended unto him<sup>saww</sup> and Rasool-Allah<sup>saww</sup> and Ali<sup>asws</sup> were crying. So Jibraeel<sup>as</sup> said: ‘O Beloved of Allah<sup>azwj</sup>! Why do I<sup>as</sup> see you<sup>saww</sup> crying?’ He<sup>saww</sup> said: ‘Two children of ours<sup>asws</sup> have made us<sup>asws</sup> cry due to both them<sup>asws</sup> are crying’. \nSo Jibraeel<sup>as</sup> said: ‘Muh, O Muhammad<sup>saww</sup>, for very soon a group of Shias would be Sent for these two<sup>asws</sup>, when one of them cries (as a baby), so his crying would (be construed as) ‘There is no god except for Allah<sup>azwj</sup>’, (until) there come upon him seven years. So when he exceeds seven years, so his crying would be a (seeking of) Forgiveness for his parents until he comes to the (applicability of the) legal Penalty (<span class=\"iTxt\">Hadd</span>). So when he exceeds it, so whatever he commits from the good deed, so it would be for his parents, and whatever he commits from the evil deeds, so it would not be against them both’."}]}, {"index": 10518, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:6", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ عَلِيِّ بْنِ إِبْرَاهِيمَ الْجَعْفَرِيِّ عَنْ حَمْدَانَ بْنِ إِسْحَاقَ قَالَ كَانَ لِيَ ابْنٌ وَ كَانَ تُصِيبُهُ الْحَصَاةُ فَقِيلَ لِي لَيْسَ لَهُ عِلَاجٌ إِلَّا أَنْ تَبُطَّهُ فَبَطَطْتُهُ فَمَاتَ فَقَالَتِ الشِّيعَةُ شَرِكْتَ فِي دَمِ ابْنِكَ \nقَالَ فَكَتَبْتُ إِلَى أَبِي الْحَسَنِ الْعَسْكَرِيِّ ( عليه السلام ) فَوَقَّعَ ( عليه السلام ) يَا أَحْمَدُ لَيْسَ عَلَيْكَ فِيمَا فَعَلْتَ شَيْ‏ءٌ إِنَّمَا الْتَمَسْتَ الدَّوَاءَ وَ كَانَ أَجَلُهُ فِيمَا فَعَلْتَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ali Bin Ibrahim Al Ja’fary, from Hamdan Bin Is’haq who said, \n‘There was a son for me, and he was hit by the gallstones. So it was said to me, ‘There is no cure for him except that you perform surgery. So I performed surgery, so he died’. So the Shias said, ‘You have participated in (sheddin) the blood of your son’. \nHe (the narrator) said, ‘So I wrote to Abu Al-Hassan Al-Askary<sup>asws</sup>. So he<sup>asws</sup> signed: ‘O Ahmad! It is not upon you with regards to what you have done, anything. But rather, you sought the medicine, it was for his sake with regards to what you did’."}]}, {"index": 10519, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:7", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ عَبْدِ اللَّهِ بْنِ جُنْدَبٍ عَنْ سُفْيَانَ بْنِ السِّمْطِ قَالَ قَالَ لِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا بَلَغَ الصَّبِيُّ أَرْبَعَةَ أَشْهُرٍ فَاحْجُمْهُ فِي كُلِّ شَهْرٍ فِي النُّقْرَةِ فَإِنَّهَا تُجَفِّفُ لُعَابَهُ وَ تُهْبِطُ الْحَرَارَةَ مِنْ رَأْسِهِ وَ جَسَدِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Al Hakam, from Abdullah Bin Jundab, from Sufyan Bin Al Samat who said, \n‘Abu Abdullah<sup>asws</sup> said to me: ‘When the child reaches four months, so perform cupping during every month in the fovea (back), for it would dry up his (excess) saliva), and lower his heat from his head, and his body’."}]}, {"index": 10520, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:6:1:38:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ أَحْمَدَ بْنِ أَشْيَمَ عَنْ بَعْضِ أَصْحَابِهِ قَالَ أَصَابَ رَجُلٌ غُلَامَيْنِ فِي بَطْنٍ فَهَنَّأَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) ثُمَّ قَالَ أَيُّهُمَا الْأَكْبَرُ فَقَالَ الَّذِي خَرَجَ أَوَّلًا فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) الَّذِي خَرَجَ آخِراً هُوَ أَكْبَرُ أَ مَا تَعْلَمُ أَنَّهَا حَمَلَتْ بِذَاكَ أَوَّلًا وَ إِنَّ هَذَا دَخَلَ عَلَى ذَاكَ فَلَمْ يُمْكِنْهُ أَنْ يَخْرُجَ حَتَّى خَرَجَ هَذَا فَالَّذِي يَخْرُجُ آخِراً هُوَ أَكْبَرُهُمَا .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Ahmad Bin Ahseym, from one of his companions who said, \n‘A man got two boys (twins) in one pregnancy. So Abu Abdullah<sup>asws</sup> congratulated him, then said: ‘Which of the two is the elder one?’ So he said, ‘The one who came out first’. So Abu Abdullah<sup>asws</sup> said: ‘The one who came out last is the elder. Do you not know that she was impregnated with that first, and this one entered upon that? Thus, it is not possible for him that he would come out, until this one (comes out). So the one who comes out last, he is the elder of the two’."}]}]}, "index": "al-kafi:6:1:38", "kind": "verse_list"}