{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 4"
        },
        "path": "/books/al-kafi:6:1:4",
        "titles": {
          "ar": "باب الدُّعَاءِ فِي طَلَبِ الْوَلَدِ",
          "en": "Chapter 4 – The supplication regarding seeking of the child"
        }
      }
    ],
    "index": 1567,
    "local_index": 4,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:1:4",
    "titles": {
      "ar": "باب الدُّعَاءِ فِي طَلَبِ الْوَلَدِ",
      "en": "Chapter 4 – The supplication regarding seeking of the child"
    },
    "verse_count": 12,
    "verse_start_index": 10335,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/15)"
        ],
        "index": 10336,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ صَالِحِ بْنِ السِّنْدِيِّ عَنْ جَعْفَرِ بْنِ بَشِيرٍ الْخَزَّازِ عَنْ عَلِيِّ بْنِ أَبِي حَمْزَةَ عَنْ أَبِي بَصِيرٍ قَالَ قَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا أَبْطَأَ عَلَى أَحَدِكُمُ الْوَلَدُ فَلْيَقُلِ اللَّهُمَّ لَا تَذَرْنِي فَرْداً وَ أَنْتَ خَيْرُ الْوَارِثِينَ وَحِيداً وَحْشاً فَيَقْصُرَ شُكْرِي عَنْ تَفَكُّرِي بَلْ هَبْ لِي عَاقِبَةَ صِدْقٍ ذُكُوراً وَ إِنَاثاً آنَسُ بِهِمْ مِنَ الْوَحْشَةِ وَ أَسْكُنُ إِلَيْهِمْ مِنَ الْوَحْدَةِ وَ أَشْكُرُكَ عِنْدَ تَمَامِ النِّعْمَةِ يَا وَهَّابُ يَا عَظِيمُ يَا مُعَظَّمُ ثُمَّ أَعْطِنِي فِي كُلِّ عَافِيَةٍ شُكْراً حَتَّى تُبَلِّغَنِي مِنْهَا رِضْوَانَكَ فِي صِدْقِ الْحَدِيثِ وَ أَدَاءِ الْأَمَانَةِ وَ وَفَاءٍ بِالْعَهْدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from Salih Bin Al Sindy, from Ja’far Bin Basheer Al Khazzaz, from Ali Bin Abu Hamza, from Abu Baseer who said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘Whenever there is a slackening of the birth upon one of you, so let him say, ‘O Allah<sup>azwj</sup>!<span class=\"ibTxt\"> [21:89] Do not leave me alone; and You are the Best of inheritors</span>; alone, scared, so my gratefulness would reduce from my thinking. But, Grant me a truthful posterity, males and females, by them (I can come out from) my loneliness, and I can be tranquil from being alone, and I thank You<sup>azwj</sup> for the completion of the Bounties. O Endower! O Magnificent! O Granter of greatness! Then Grant me gratefulness during every good health until there reaches to me You<sup>azwj</sup> Pleasure from it, in truthful discussion, and fulfillment of the entrustments, and loyalty with the Covenant (<span class=\"iTxt\">Al-Wilayah</span>)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from Salih ibn al-Sindiy, from Ja‘far ibn Bashir al-Khazzaz from Ah ibn abu Hamzah from abu Basir who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If the birth of a child for one of you is delayed, he should say this prayer, ‘O Lord, do not leave me all by myself- and You are the best heir- alone and frightened so that my thoughts about a child reduce my thanks (to You). Grant me truthful consequences (successors) of male (children) and female ones who comfort me in my apprehension and I can find tranquility with them in my loneliness and thank You upon completion of bounties, O Magnanimous, O Great and O giver of greatness. Thereafter grant me good health and the ability to thank You until You take me to the stage where You will be pleased with me in truthfulness of words, safe return of trust and keeping the promise.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/16)"
        ],
        "index": 10337,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ سَيْفِ بْنِ عَمِيرَةَ عَنْ أَبِي بَكْرٍ الْحَضْرَمِيِّ عَنِ الْحَارِثِ النَّصْرِيِّ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنِّي مِنْ أَهْلِ بَيْتٍ قَدِ انْقَرَضُوا وَ لَيْسَ لِي وَلَدٌ قَالَ ادْعُ وَ أَنْتَ سَاجِدٌ رَبِّ هَبْ لِي مِنْ لَدُنْكَ وَلِيّاً يَرِثُنِي رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ رَبِّ لَا تَذَرْنِي فَرْداً وَ أَنْتَ خَيْرُ الْوَارِثِينَ قَالَ فَفَعَلْتُ فَوُلِدَ لِي عَلِيٌّ وَ الْحُسَيْنُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Sayf Bin Umeyra, from Abu Bakr Al Hazramy, from Al haris Al Nasry who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘I am from a family that has become extinct and there is no child for me’. He<sup>asws</sup> said: ‘Supplicate when you are in Prostration, ‘Lord<sup>azwj</sup>! <span class=\"ibTxt\">[19:5] Grant me from Yourself an heir [19:6] Who would inherit me [3:38] Lord! Grant me from You good offspring; surely You are the Hearer of the supplication [21:89] Lord! Do not leave me alone; and You are the Best of inheritors</span>’. So I did it, and there were born unto me, Ali and Al-Husayn’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn af-Hakam from Sayf ibn ‘Amirah from abu Bakr al- Hadramiy from af-Harith af-Nasriy who has said the following: “I once said to abu ‘Abd Allah, ‘Alayhi al-Salam, that I belong to a family that is extinct and I do not have any children. He (the Imam) said, ‘Pray when you are in Sajdah (prostration), ‘[My Lord, grant me from Your dominion an heir who will inherit me]. O Lord, grant me fine offspring from Your dominion; You hear the prayers. O Lord, do not leave me alone and You are the best heir.’ He (the narrator) has said that I followed the instruction, then Ali and al-Husayn (my sons) were born.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/16)"
        ],
        "index": 10338,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ رَجُلٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَرَادَ أَنْ يُحْبَلَ لَهُ فَلْيُصَلِّ رَكْعَتَيْنِ بَعْدَ الْجُمُعَةِ يُطِيلُ فِيهِمَا الرُّكُوعَ وَ السُّجُودَ ثُمَّ يَقُولُ اللَّهُمَّ إِنِّي أَسْأَلُكَ بِمَا سَأَلَكَ بِهِ زَكَرِيَّا يَا رَبِّ لَا تَذَرْنِي فَرْداً وَ أَنْتَ خَيْرُ الْوَارِثِينَ اللَّهُمَّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ ",
          "اللَّهُمَّ بِاسْمِكَ اسْتَحْلَلْتُهَا وَ فِي أَمَانَتِكَ أَخَذْتُهَا فَإِنْ قَضَيْتَ فِي رَحِمِهَا وَلَداً فَاجْعَلْهُ غُلَاماً مُبَارَكاً زَكِيّاً وَ لَا تَجْعَلْ لِلشَّيْطَانِ فِيهِ شِرْكاً وَ لَا نَصِيباً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from a man, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘The one who intends that there be a pregnancy (of his wife) for him, so let him Pray two Cycles after the Friday (Prayers), with prolonged bowings and Prostrations in it. Then he should be saying, ‘O Allah<sup>azwj</sup>! I ask You<sup>azwj</sup> with what Zakariyya<sup>as</sup> had asked with. <span class=\"ibTxt\">[21:89] Lord! Do not leave me alone; and You are the Best of inheritors</span>. <span class=\"ibTxt\">[3:38] Lord! Grant me from You good offspring; surely You are the Hearer of the supplication</span>. ",
            "O Allah<sup>azwj</sup>! By Your<sup>azwj</sup> Name I have made her Permissible (unto me), and in Your<sup>azwj</sup>Entrustment that I take her. So if there is fulfilled for me a child in her womb, so Make it to be a boy, Blessed, Pure, and do not let Satan<sup>la</sup> neither have a participation in it, nor a share’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from a man from Muhammad ibn Muslim who has said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘One who wishes for pregnancy should perform two Rak’at Salat (prayer) after Friday Salat (prayer) with long Ruku’ (bowing down on one’s knees) and Sajdah (prostration): then say, “O Lord, I ask and appeal before You as Zakariya had done. O Lord, do not leave me alone by myself -You are the best heir. O Lord, grant me from Your dominion fine offspring; You hear the prayer. O Lord, by Your name I have made her lawful and in Your trust I have taken her. If You have determined a child in her womb make it a son, a blessed one, [a clean one] and do not allow Satan to have a share or portion in him.’”” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/16)"
        ],
        "index": 10339,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:4",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ بَعْضِ أَصْحَابِهِ قَالَ شَكَا الْأَبْرَشُ الْكَلْبِيُّ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ لَا يُولَدُ لَهُ فَقَالَ لَهُ عَلِّمْنِي شَيْئاً قَالَ اسْتَغْفِرِ اللَّهَ فِي كُلِّ يَوْمٍ أَوْ فِي كُلِّ لَيْلَةٍ مِائَةَ مَرَّةٍ فَإِنَّ اللَّهَ يَقُولُ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كانَ غَفَّاراً إِلَى قَوْلِهِ وَ يُمْدِدْكُمْ بِأَمْوالٍ وَ بَنِينَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from one of his companions who said, ",
            "‘Al-Abrash Al-Kalby complained to Abu Ja’far<sup>asws</sup> that there is no child for him. So he said to him<sup>asws</sup>, ‘Teach me something (to have a son)’. He<sup>asws</sup> said: ‘Seek Forgiveness of Allah<sup>azwj</sup> during every day, or during every night, one hundred times, for Allah<sup>azwj</sup> is Saying <span class=\"ibTxt\">[71:10] So I said, Ask forgiveness of your Lord, surely He is the most Forgiving</span> – up to His<sup>azwj</sup> Words <span class=\"ibTxt\">[71:12] And Help you with wealth and sons</span>’."
          ],
          "en.sarwar": [
            "4. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from certain persons of his people who has said the following: “Once al-Abrash al-Kalbiy complained before abu Ja‘far, ‘Alayhi al-Salam, and said that he did not have any child and asked him (the Imam) to teach him something. He (the Imam) said, say, ‘I ask forgiveness from Allah, my Lord and return to Him in repentance’ one hundred times every day and every night, because Allah says, ‘Ask forgiveness from your Lord; He is forgiving. ... He helps you by means of your wealth and sons.’” (71:10) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/17)"
        ],
        "index": 10340,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ السَّيَّارِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي نَجْرَانَ عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ عَنْ شَيْخٍ مَدَنِيٍّ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّهُ وَفَدَ إِلَى هِشَامِ بْنِ عَبْدِ الْمَلِكِ فَأَبْطَأَ عَلَيْهِ الْإِذْنُ حَتَّى اغْتَمَّ وَ كَانَ لَهُ حَاجِبٌ كَثِيرُ الدُّنْيَا وَ لَا يُولَدُ لَهُ فَدَنَا مِنْهُ أَبُو جَعْفَرٍ ( عليه السلام ) فَقَالَ لَهُ هَلْ لَكَ أَنْ تُوصِلَنِي إِلَى هِشَامٍ وَ أُعَلِّمَكَ دُعَاءً يُولَدُ لَكَ قَالَ نَعَمْ فَأَوْصَلَهُ إِلَى هِشَامٍ وَ قَضَى لَهُ جَمِيعَ حَوَائِجِهِ ",
          "قَالَ فَلَمَّا فَرَغَ قَالَ لَهُ الْحَاجِبُ جُعِلْتُ فِدَاكَ الدُّعَاءَ الَّذِي قُلْتَ لِي قَالَ لَهُ نَعَمْ قُلْ فِي كُلِّ يَوْمٍ إِذَا أَصْبَحْتَ وَ أَمْسَيْتَ سُبْحَانَ اللَّهِ سَبْعِينَ مَرَّةً وَ تَسْتَغْفِرُ عَشْرَ مَرَّاتٍ وَ تُسَبِّحُ تِسْعَ مَرَّاتٍ وَ تَخْتِمُ الْعَاشِرَةَ بِالِاسْتِغْفَارِ ثُمَّ تَقُولُ قَوْلَ اللَّهِ عَزَّ وَ جَلَّ اسْتَغْفِرُوا رَبَّكُمْ إِنَّهُ كانَ غَفَّاراً. يُرْسِلِ السَّماءَ عَلَيْكُمْ مِدْراراً. وَ يُمْدِدْكُمْ بِأَمْوالٍ وَ بَنِينَ وَ يَجْعَلْ لَكُمْ جَنَّاتٍ وَ يَجْعَلْ لَكُمْ أَنْهاراً ",
          "فَقَالَهَا الْحَاجِبُ فَرُزِقَ ذُرِّيَّةً كَثِيرَةً وَ كَانَ بَعْدَ ذَلِكَ يَصِلُ أَبَا جَعْفَرٍ وَ أَبَا عَبْدِ اللَّهِ ( عليهما السلام ) ",
          "فَقَالَ سُلَيْمَانُ فَقُلْتُهَا وَ قَدْ تَزَوَّجْتُ ابْنَةَ عَمٍّ لِي فَأَبْطَأَ عَلَيَّ الْوَلَدُ مِنْهَا وَ عَلَّمْتُهَا أَهْلِي فَرُزِقْتُ وَلَداً وَ زَعَمَتِ الْمَرْأَةُ أَنَّهَا مَتَى تَشَاءُ أَنْ تَحْمِلَ حَمَلَتْ إِذَا قَالَتْهَا وَ عَلَّمْتُهَا غَيْرَ وَاحِدٍ مِنَ الْهَاشِمِيِّينَ مِمَّنْ لَمْ يَكُنْ يُولَدُ لَهُمْ فَوُلِدَ لَهُمْ وُلْدٌ كَثِيرٌ وَ الْحَمْدُ لِلَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Ahmad Bin Muhammad Al Sayyari, from Abdul Rahman Bin Abu Najran, from Suleyman Bin Ja’far, from Sheykh madany, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having gone to visit Hisham Bin Abdul Malik. So the permission was delayed until it was upsetting, and there was a guard of his who had abundance of the world and he did not have children for him. So Abu Ja’far<sup>asws</sup>, approached him, so<sup>asws</sup> he said to him: ‘Is there anything with you which can make me<sup>asws</sup> arrive to Hisham, and I<sup>asws</sup> will teach you a supplication, there would be a birth for you’. He said, ‘Yes’. So he took him<sup>asws</sup> to Hisham, and he<sup>asws</sup> fulfilled all his needs.",
            "He (the narrator) said, ‘So when he<sup>asws</sup> was free, the guard said to him<sup>asws</sup>, ‘May I be sacrificed for you! The supplication which you spoke to me of?’ He<sup>asws</sup> said to him: ‘Yes. Say during every day when it is morning and evening, ‘سُبْحَانَ اللَّهِ’ ‘Glory be to Allah<sup>azwj</sup>’, seventy times, and you should seek Forgiveness ten times, and you should Glorify nine times, and end the tenth with the seeking of the Forgiveness. Then you should be saying the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\">[71:10] So I said, Ask forgiveness of your Lord, surely He is the most Forgiving [71:11] He will send down upon you the cloud, pouring down abundance of rain: [71:12] And Help you with wealth and sons, and Make for you gardens, and Make for you rivers</span>’. ",
            "So the guard said it, and was Granted abundant offspring. And after that, he maintained good relations with Abu Ja’far<sup>asws</sup> and Abu Abdullah<sup>asws</sup>. ",
            "So Suleyman (the narrator) said, ‘So I said it (as well), and I had married a cousin of mine, so the child was delayed upon me from her, and I taught it to my wife, so she gave birth to a child, and the wife (from then on) thought that whenever she so desired to get pregnant, she would do so, when she says it; and I taught it to someone else from the Hashimites, from the ones who did not happen to have children for them, so there were born unto them a lot of children; and the Praise is for Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Ahmad ibn Muhammad from al-Sayyariy from ‘Abd al-Rahman ibn abu Najran from Sulayman ibn Ja‘far from a Shaykh from al-Madinah from Zurarah who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Once I wanted to visit Hisham ibn ‘Abd al-Malik but permission for a meeting was delayed and I felt worried.’ He ‘Abd al-Malik had a guard who was wealthy but had no children. Abu Ja‘far, ‘Alayhi al-Salam, asked him, ‘If you can arrange a meeting with Hisham I will teach you a prayer and you will have a child.’ The guard agreed and arranged a meeting between him (the Imam) and Hisham who complied with all that he (the Imam) asked. When the meeting was over the guard said, T pray to Allah to keep my soul in service for your cause, the prayer that you had mentioned.’ He (the Imam) said, ’Everyday in the morning and evening, say seventy times, Tasbih (Allah is free of all defects).’ Then say, T ask forgiveness from Allah, my Lord and return to Him in repentance’ ten times then Tasbih (Allah is free of all defects) nine times and finish the tenth with, T ask forgiveness from Allah, my Lord and return to Him in repentance.’ Then say the words of Allah, most Majestic, most Glorious, ‘Ask forgiveness from your Lord; He is forgiving. He sends you abundant rain from the sky. He helps you by means of your wealth and sons. He makes for you gardens and canals.’ (71:12) The guard followed the instruction and he was granted a great many children. He thereafter kept good relations with abu Ja’far, ‘Alayhi al-Salam. Sulayman has said, ‘I also said those prayers and I had married the daughter of my uncle but there was a delay in the birth of a son for me from her. I taught her also the prayer; then a son was born to me and the woman believed that whenever she wanted she could become pregnant after saying the prayer. I taught to more than one person of banu Hashim who did not have children: then many children were born to them. All praise belongs to Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/17)"
        ],
        "index": 10341,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:6",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ مُحَمَّدِ بْنِ شُعَيْبٍ عَنِ النَّضْرِ بْنِ شُعَيْبٍ عَنْ سَعِيدِ بْنِ يَسَارٍ قَالَ قَالَ رَجُلٌ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) لَا يُولَدُ لِي فَقَالَ اسْتَغْفِرْ رَبَّكَ فِي السَّحَرِ مِائَةَ مَرَّةٍ فَإِنْ نَسِيتَهُ فَاقْضِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Yaqoub Bin Yazeed, from Muhammad Bin Shuayb, from Al Nazar Bin Shuayb, from Saeed Bin Yassar who said, ",
            "‘A man said to Abu Abdullah<sup>asws</sup>, ‘There are no children being born for me’. So he<sup>asws</sup> said: ‘اسْتَغْفِرْ رَبَّكَ’ ‘Seek Forgiveness of your Lord<sup>azwj</sup> during the morning, one hundred times. So if you were to forget it, fulfill it (upon remembering it)’."
          ],
          "en.sarwar": [
            "6. A number of our people have narrated from Sahl ibn Ziyad from Ya’qub ibn Yazid from Muhammad Shu’ayb from al-Nadr ibn Shu’ayb from Sa’id ibn Yasar who has said the following: “A man once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, ‘We wish to have a child but the birth of a child has not happened for us.’ He (the Imam) instructed him to say, ‘I ask forgiveness from Allah, my Lord and return to Him in repentance’ one hundred times just before it is dawn. If you forget; do its Qada’ (compensatory prayer for it ).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/18)"
        ],
        "index": 10342,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:7",
        "text": [
          "وَ عَنْهُ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَنَّهُ شَكَا إِلَيْهِ رَجُلٌ أَنَّهُ لَا يُولَدُ لَهُ فَقَالَ لَهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) إِذَا جَامَعْتَ فَقُلِ اللَّهُمَّ إِنَّكَ إِنْ رَزَقْتَنِي ذَكَراً سَمَّيْتُهُ مُحَمَّداً قَالَ فَفَعَلَ ذَلِكَ فَرُزِقَ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from one of our companions, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> that a man complained to him<sup>asws</sup> that there were no children being born for him. So Abu Abdullah<sup>asws</sup> said: ‘When you copulate, so say, ‘O Allah<sup>azwj</sup>! If You<sup>azwj</sup> were to Grant me a male, I shall name him Muhammad’. So he did that, and he was Granted (a son)’."
          ],
          "en.sarwar": [
            "7. It is narrated from the narrator of the previous Hadith from certain persons of our people who has said the following: “Once, a man complained before abu ‘Abd Allah, ‘Alayhi al-Salam, saying, ‘The birth of a child does not take place for us.’ He (the Imam) said, ‘When going to bed with your wife say, ‘O Lord, if You grant me a son I will name him Muhammad.’ He (the narrator) has said that he followed the instruction, then a son was born to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/18)"
        ],
        "index": 10343,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:8",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ إِسْمَاعِيلَ بْنِ عَبْدِ الْخَالِقِ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عُبَيْدَةَ قَالَ أَتَتْ عَلَيَّ سِتُّونَ سَنَةً لَا يُولَدُ لِي فَحَجَجْتُ فَدَخَلْتُ عَلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَشَكَوْتُ إِلَيْهِ ذَلِكَ فَقَالَ لِي أَ وَ لَمْ يُولَدْ لَكَ قُلْتُ لَا قَالَ إِذَا قَدِمْتَ الْعِرَاقَ فَتَزَوَّجِ امْرَأَةً وَ لَا عَلَيْكَ أَنْ تَكُونَ سَوْءَاءَ قَالَ قُلْتُ وَ مَا السَّوْءَاءُ قَالَ امْرَأَةٌ فِيهَا قُبْحٌ فَإِنَّهُنَّ أَكْثَرُ أَوْلَاداً وَ ادْعُ بِهَذَا الدُّعَاءِ فَإِنِّي أَرْجُو أَنْ يَرْزُقَكَ اللَّهُ ذُكُوراً وَ إِنَاثاً وَ الدُّعَاءُ اللَّهُمَّ لَا تَذَرْنِي فَرْداً وَحِيداً وَحْشاً فَيَقْصُرَ شُكْرِي عَنْ تَفَكُّرِي بَلْ هَبْ لِي أُنْساً وَ عَاقِبَةَ صِدْقٍ ذُكُوراً وَ إِنَاثاً أَسْكُنُ إِلَيْهِمْ مِنَ الْوَحْشَةِ وَ آنَسُ بِهِمْ مِنَ الْوَحْدَةِ وَ أَشْكُرُكَ عَلَى تَمَامِ النِّعْمَةِ يَا وَهَّابُ يَا عَظِيمُ يَا مُعْطِي أَعْطِنِي فِي كُلِّ عَاقِبَةٍ خَيْراً حَتَّى تُبَلِّغَنِي مُنْتَهَى رِضَاكَ عَنِّي فِي صِدْقِ الْحَدِيثِ وَ أَدَاءِ الْأَمَانَةِ وَ وَفَاءِ الْعَهْدِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ali Bin Al Hakam, from Ismail Bin Abdul Khaliq, from one of our companions, from Abu Ubeyda who said, ",
            "‘Sixty years had come upon me and there were no children for me. So I went over to Abu Abdullah<sup>asws</sup> and complained to him<sup>asws</sup> of that. So he<sup>asws</sup> said to me: ‘Or there has never been a birth for you?’ I said, ‘No’. He<sup>asws</sup> said: ‘When you proceed to Al-Iraq, so marry a woman, and don’t worry if she happens to be with injury’. I said, ‘And what injury?’ He<sup>asws</sup> said: ‘A woman wherein is some ugliness, for she would give abundant births; and supplicate with this supplication, so I<sup>asws</sup> hope that Allah<sup>azwj</sup> would Grant you males and females, and the supplication is, ‘O Allah!<span class=\"ibTxt\"> [21:89] Do not leave me alone; and You are the Best of inheritors</span>; alone, scared, so my gratefulness would reduce from my thinking. But, Grant me a truthful posterity, males and females, by them (I can come out from) my loneliness, and I can be tranquil from being alone, and I thank you for the completion of the Bounties. O Endower! O Magnificent! O Granter of greatness! Then Grant me gratefulness during every good health until there reaches to me Your<sup>azwj</sup> Pleasure from it, in truthful discussion, and fulfilment of the entrustments, and loyalty with the Covenant (<span class=\"iTxt\">Al-Wilayah</span>)’."
          ],
          "en.sarwar": [
            "8. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from ’Isma’il ibn ‘Abd al-Khaliq from certain persons of our people from abu ‘Ubaydah who has said the following: “I was sixty years old and had no children. I went to perform al-Hajj then visited abu ‘Abd Allah, ‘Alayhi al-Salam, and complained about not having any child. He (the Imam) asked, ‘Has any child ever been born to you?’ I replied, ‘No, it has not happened.’ He (the Imam) said, ‘When you go to Iraq marry a woman and it does not matter if she is not Sawa’. I then asked, ‘What is Sawa’?’ He (the Imam) said, ‘It is a woman who has certain degree of ugliness because such women give birth to more children and say this prayer. I hope Allah will grant you male and female children, ‘O Lord, do not leave me one, lonely and afraid, so that my thoughts reduce my thanking You. O Lord, (I appeal before You to) grant me comfort, truthful male successors and female ones in whom I can seek tranquility against fear, comfort against loneliness and thank You for completion of bounties. O Magnanimous, O Great , O the One who grants (favors), grant me with every successor goodness until You take me as far as You will be pleased with me in truthful words, safe return of trust and keeping the promise.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/18)"
        ],
        "index": 10344,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:9",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْعَبَّاسِ بْنِ مَعْرُوفٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَعَنْ مُحَمَّدِ بْنِ رَاشِدٍ قَالَ حَدَّثَنِي هِشَامُ بْنُ إِبْرَاهِيمَ أَنَّهُ شَكَا إِلَى أَبِي الْحَسَنِ ( عليه السلام ) سُقْمَهُ وَ أَنَّهُ لَا يُولَدُ لَهُ فَأَمَرَهُ أَنْ يَرْفَعَ صَوْتَهُ بِالْأَذَانِ فِي مَنْزِلِهِ ",
          "قَالَ فَفَعَلْتُ فَأَذْهَبَ اللَّهُ عَنِّي سُقْمِي وَ كَثُرَ وُلْدِي ",
          "قَالَ مُحَمَّدُ بْنُ رَاشِدٍ وَ كُنْتُ دَائِمَ الْعِلَّةِ مَا أَنْفَكُّ مِنْهَا فِي نَفْسِي وَ جَمَاعَةِ خَدَمِي وَ عِيَالِي حَتَّى إِنِّي كُنْتُ أَبْقَى وَحْدِي وَ مَا لِي أَحَدٌ يَخْدُمُنِي فَلَمَّا سَمِعْتُ ذَلِكَ مِنْ هِشَامٍ عَمِلْتُ بِهِ فَأَذْهَبَ اللَّهُ عَنِّي وَ عَنْ عِيَالِيَ الْعِلَلَ وَ الْحَمْدُ لِلَّهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Abbas Bin Marouf, from Ali Bin Mahziyar, from Muhammad Bin Rashid who said, ",
            "‘Hisham Bin Ibrahim narrated to me that he complained to Abu Al-Hassan<sup>asws</sup> of his illness and there were no children for him. So he<sup>asws</sup> ordered him to raise his voice with the Call to the Prayer (<span class=\"iTxt\">Azaan</span>) in his house.",
            "He said, ‘So I did it, and Allah<sup>azwj</sup> Caused my illness to go away from me, and I had abundant children’. ",
            "Muhammad Bin Rashid (the narrator) said, ‘I used to be ill all the time, being dejected from it with regards to myself, and (also) a group of my attendants, and my family members to the extent that I used to remain alone, and there would be no one to attend to me. So when I heard that from Hisham, I acted by it. So Allah<sup>azwj</sup> Caused the illness to go away from me, and from my family members. And the Praise is due to Allah<sup>azwj</sup>’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-‘ Abbas ibn Ma’ruf from Ali ibn Mahziyar from Muhammad ibn Rashid who has said the following: “Hisham ibn Ibrahim narrated to me that he complained before abu al-Hassan, ‘Alayhi al-Salam, about not having a child. He (the Imam) commanded him to raise his voice with Adhan in his house. He has said, ‘I followed the instruction: then Allah removed my shortcoming and my children became many.’ Muhammad ibn Rashid has said, ’I remained ill all the time as well as a group of my servants and family (wife), so I would remain alone at home without anyone to help. I heard it from Hisham, I then practiced it and Allah removed the illnesses from me and my family. All praise belongs to Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/19)"
        ],
        "index": 10345,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:10",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ الْعَاصِمِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ التَّيْمُلِيِّ عَنْ عَمْرِو بْنِ عُثْمَانَ عَنْ أَبِي جَمِيلَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَهُ رَجُلٌ مِنْ أَهْلِ خُرَاسَانَ بِالرَّبَذَةِ جُعِلْتُ فِدَاكَ لَمْ أُرْزَقْ وَلَداً فَقَالَ لَهُ إِذَا رَجَعْتَ إِلَى بِلَادِكَ وَ أَرَدْتَ أَنْ تَأْتِيَ أَهْلَكَ فَاقْرَأْ إِذَا أَرَدْتَ ذَلِكَ وَ ذَا النُّونِ إِذْ ذَهَبَ مُغاضِباً فَظَنَّ أَنْ لَنْ نَقْدِرَ عَلَيْهِ فَنادى فِي الظُّلُماتِ أَنْ لا إِلهَ إِلَّا أَنْتَ سُبْحانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ إِلَى ثَلَاثِ آيَاتٍ فَإِنَّكَ سَتُرْزَقُ وَلَداً إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Al Asimy, from Ali Bin Al Hassan Al Taymuli, from Amro Bin Usman, from Abu Jameela, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘A man from the people of Khurasan said to him<sup>asws</sup>, May I be sacrificed for you<sup>asws</sup>! I have not been graced with children’. So he<sup>asws</sup> said to him: ‘When you return to your city and intend to go to your wife, so recite whenever you intend that, ‘<span class=\"ibTxt\">[21:87] And the one with the whale (Yunus), when he went away in anger, so he thought that We had no Power over him, so he called out in the darkness: There is no god but You, Glory be to You; surely I am from the unjust ones </span>– up to three Verses, so you would be Graced with a child, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "10. Ahmad ibn Muhammad al-‘Asemiy has narrated from Ali ibn al-Hassan al-Taymuliy from ‘Amr ibn ‘Uthman from abu Jamilah who has said the following: “Once, a man from Khurasan in al-Rabadhah said to abu ‘Abd Allah, ‘Alayhi al-Salam, ‘I pray to Allah to keep my soul in service for your cause, I have not been granted any children.’ He (the Imam) said, ‘When you return to your country and then decide to go to bed with your wife then read, ‘When the companion of fish went away in anger he thought that We will not apply any measures against him. He then in the dark called, “I testify that no one other than You deserves worship. You are free of all defects. I have been of those who wrong themselves.” Read up to three verses, you will be granted a child by the will of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/19)"
        ],
        "index": 10346,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:11",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُوسَى بْنِ جَعْفَرٍ عَنْ عَمْرِو بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ عَمْرٍو قَالَ لَمْ يُولَدْ لِي شَيْ‏ءٌ قَطُّ وَ خَرَجْتُ إِلَى مَكَّةَ وَ مَا لِي وَلَدٌ فَلَقِيَنِي إِنْسَانٌ فَبَشَّرَنِي بِغُلَامٍ فَمَضَيْتُ وَ دَخَلْتُ عَلَى أَبِي الْحَسَنِ ( عليه السلام ) بِالْمَدِينَةِ فَلَمَّا صِرْتُ بَيْنَ يَدَيْهِ قَالَ لِي كَيْفَ أَنْتَ وَ كَيْفَ وَلَدُكَ فَقُلْتُ جُعِلْتُ فِدَاكَ خَرَجْتُ وَ مَا لِي وَلَدٌ فَلَقِيَنِي جَارٌ لِي فَقَالَ لِي قَدْ وُلِدَ لَكَ غُلَامٌ فَتَبَسَّمَ ثُمَّ قَالَ سَمَّيْتَهُ قُلْتُ لَا قَالَ سَمِّهِ عَلِيّاً فَإِنَّ أَبِي كَانَ إِذَا أَبْطَأَتْ عَلَيْهِ جَارِيَةٌ مِنْ جَوَارِيهِ قَالَ لَهَا يَا فُلَانَةُ انْوِي عَلِيّاً فَلَا تَلْبَثُ أَنْ تَحْمِلَ فَتَلِدَ غُلَاماً ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Musa Bin Ja’far, from Amro Bin Saeed, from Muhammad Bin Amro who said, ",
            "‘There were no births for me at all, and I went out to Makkah and there was no child for me. So a person met me and gave me the good news of a boy. So I passed by and went to Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup> at Al-Medina. So when I came to be in front of him<sup>asws</sup>, he<sup>asws</sup> said to me: ‘How are you, and how is your son?’ So I said, ‘May I be sacrificed for you<sup>asws</sup>! I went out and there was no child for me. So a neighbour of mine met me, so he said to me, ‘There has been born a boy for you’. So he<sup>asws</sup> smiled, then said, ‘Have you named him yet?’ I said, ‘No’. He<sup>asws</sup> said: ‘Name him Ali, for my<sup>asws</sup> father<sup>asws</sup>, whenever there was a delay by a slave girl from his<sup>asws</sup> slave girls over it, said to her: ‘O so and so! Make the intention (of naming him) Ali’. So it would not be long before she would become pregnant and give birth to a boy’."
          ],
          "en.sarwar": [
            "11. A number of our people have narrated from Sahl ibn Ziyad from Musa ibn Ja‘far from ‘Amr ibn Sa‘id from Muhammad ibn ‘Umar [‘Amr] who has said the following: “I never had a child . I went to Makkah and did not have any children. A man met me and gave good news of the birth of a boy to me. I then went on and visited Ali ibn al-Husayn, ‘Alayhi al-Salam. When I went before him (the Imam), he (the Imam) asked, ‘How are you and how is your son?’ I said, ‘I pray to Allah to keep my soul in service for your cause, I left home but I did not have a son. My neighbor met me and said, “A boy is born to you .’” He (the Imam) smiled and asked, ‘Have you given him a name?’ I replied, ‘No, I have not given him a name.’ He (the Imam) said, ‘Name him Ali; whenever a delay would take place in giving birth of any of my father’s girls he would ask her to keep her intention to name him Ali, then without much delay she would give birth to a boy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/19)"
        ],
        "index": 10347,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:4:12",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا أَرَدْتَ الْوَلَدَ فَقُلْ عِنْدَ الْجِمَاعِ اللَّهُمَّ ارْزُقْنِي وَلَداً وَ اجْعَلْهُ تَقِيّاً لَيْسَ فِي خَلْقِهِ زِيَادَةٌ وَ لَا نُقْصَانٌ وَ اجْعَلْ عَاقِبَتَهُ إِلَى خَيْرٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Aban Bin Usman, from Hareyz, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Whenever you want the child, so say during copulation, ‘O Allah<sup>azwj</sup>! Grant me a child and Make him to be pious, neither there being in his creation any excess nor a deficiency, and Make his posterity to be good’."
          ],
          "en.sarwar": [
            "12. Al-Husayn from Muhammad has narrated from Mu‘alla’ ibn Muhammad from al-Hassan ibn Ali from Aban ibn ‘Uthman from Hariz from Muhammad ibn Muslim who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘When you want to have a son then at the time of your going to bed with your wife say, “O Lord, grant me a son, make him pious, without any deficiency or extra in his physical condition and make his consequences in goodness.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:1:4",
  "kind": "verse_list"
}