{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:6:1:6",
        "titles": {
          "ar": "باب بَدْءِ خَلْقِ الْإِنْسَانِ وَ تَقَلُّبِهِ فِي بَطْنِ أُمِّهِ",
          "en": "Chapter 6 – Beginning of the creation of the human being, and his transfer into the womb of his mother"
        }
      }
    ],
    "index": 1569,
    "local_index": 6,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 7"
        },
        "path": "/books/al-kafi:6:1:7",
        "titles": {
          "ar": "باب أَكْثَرِ مَا تَلِدُ الْمَرْأَةُ",
          "en": "Chapter 7 – The most of what the woman can give birth to"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 5"
        },
        "path": "/books/al-kafi:6:1:5",
        "titles": {
          "ar": "باب مَنْ كَانَ لَهُ حَمْلٌ فَنَوَى أَنْ يُسَمِّيَهُ مُحَمَّداً أَوْ عَلِيّاً وُلِدَ لَهُ ذَكَرٌ وَ الدُّعَاءِ لِذَلِكَ",
          "en": "Chapter 5 – The one for whom is a pregnancy, so he makes the intention that he would name him Muhammad<sup>saww</sup> or Ali<sup>asws</sup>, there would be born for him a male, and the supplication for that"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:1:6",
    "titles": {
      "ar": "باب بَدْءِ خَلْقِ الْإِنْسَانِ وَ تَقَلُّبِهِ فِي بَطْنِ أُمِّهِ",
      "en": "Chapter 6 – Beginning of the creation of the human being, and his transfer into the womb of his mother"
    },
    "verse_count": 7,
    "verse_start_index": 10351,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/21)"
        ],
        "index": 10352,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:6:1",
        "refs": {
          "Mentions": [
            "/books/quran:22:5"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ النُّعْمَانِ عَنْ سَلَّامِ بْنِ الْمُسْتَنِيرِ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنْ قَوْلِ اللَّهِ عَزَّ وَ جَلَّ مُخَلَّقَةٍ وَ غَيْرِ مُخَلَّقَةٍ فَقَالَ الْمُخَلَّقَةُ هُمُ الذَّرُّ الَّذِينَ خَلَقَهُمُ اللَّهُ فِي صُلْبِ آدَمَ ( عليه السلام ) أَخَذَ عَلَيْهِمُ الْمِيثَاقَ ثُمَّ أَجْرَاهُمْ فِي أَصْلَابِ الرِّجَالِ وَ أَرْحَامِ النِّسَاءِ وَ هُمُ الَّذِينَ يَخْرُجُونَ إِلَى الدُّنْيَا حَتَّى يُسْأَلُوا عَنِ الْمِيثَاقِ ",
          "وَ أَمَّا قَوْلُهُ وَ غَيْرِ مُخَلَّقَةٍ فَهُمْ كُلُّ نَسَمَةٍ لَمْ يَخْلُقْهُمُ اللَّهُ فِي صُلْبِ آدَمَ ( عليه السلام ) حِينَ خَلَقَ الذَّرَّ وَ أَخَذَ عَلَيْهِمُ الْمِيثَاقَ وَ هُمُ النُّطَفُ مِنَ الْعَزْلِ وَ السِّقْطُ قَبْلَ أَنْ يُنْفَخَ فِيهِ الرُّوحُ وَ الْحَيَاةُ وَ الْبَقَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together from Al Hassan Bin Mahboub, from Muhammad Bin Al Noman, from Sallam Bin Al Mustaneer who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:22#h5\">[22:5]</a> formed and unformed</span>. So he<sup>asws</sup> said: ‘The formed, they are the particles which Allah<sup>azwj</sup> Created in the ribs of Adam<sup>as</sup>, Taking the Covenant against them. Then He<sup>azwj</sup> Make these flow in the ribs of the men and the wombs of the women, and they are the ones who are coming out into the world, until they would be Questioned about the Covenant. ",
            "And as for His<sup>azwj</sup> Words, <span class=\"ibTxt\">and unformed</span>, so they are persons whom Allah<sup>azwj</sup> did not create them in the ribs of Adam<sup>as</sup> when He<sup>azwj</sup> Created the particles and Took the Covenant against them, and they are the sperms from the discharge, and the miscarriages before the Spirit is Blown into it, and the life and the remaining’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father from all from al- Hassan ibn Mahbub from Muhammad ibn al-Nu’man from Salam ibn al-Mustanir who has said the following: “I once asked abu Ja’far, ‘Alayhi al-Salam, about the words of Allah, most Majestic, most Glorious, . . created and not created . . <a href=\"/#/books/quran:22#h5\">[22:5]</a> He (the Imam) said, ‘Created are those whom Allah created in the back of Adam, ‘Alayhi al-Salam. He made them to promise and make a covenant. Then He allowed them to move through the backs of men and wombs of women. They are the ones who come out in the world so that they are asked about the covenant. His words ‘not created’ refer to every strand or trace that Allah did not create in the back of Adam, ‘Alayhi al-Salam when He created the particles and made them to form the covenant. They were the seeds that were not allowed to take place in the womb or were aborted before the spirit was blown in them as well as life and continued life.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/22)"
        ],
        "index": 10353,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:6:2",
        "refs": {
          "Mentions": [
            "/books/quran:13:8"
          ]
        },
        "text": [
          "عَنْهُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَمَّنْ ذَكَرَهُ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي قَوْلِ اللَّهِ عَزَّ وَ جَلَّ يَعْلَمُ ما تَحْمِلُ كُلُّ أُنْثى وَ ما تَغِيضُ الْأَرْحامُ وَ ما تَزْدادُ قَالَ الْغَيْضُ كُلُّ حَمْلٍ دُونَ تِسْعَةِ أَشْهُرٍ وَ مَا تَزْدَادُ كُلُّ شَيْ‏ءٍ يَزْدَادُ عَلَى تِسْعَةِ أَشْهُرٍ فَكُلَّمَا رَأَتِ الْمَرْأَةُ الدَّمَ الْخَالِصَ فِي حَمْلِهَا فَإِنَّهَا تَزْدَادُ بِعَدَدِ الْأَيَّامِ الَّتِي رَأَتْ فِي حَمْلِهَا مِنَ الدَّمِ ."
        ],
        "translations": {
          "en.hubeali": [
            "From him, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hammad Bin Isa, from Hareyz, from the one who mentioned it, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the Words of Allah<sup>azwj</sup> Mighty and Majestic <span class=\"ibTxt\"><a href=\"/#/books/quran:13#h8\">[13:8]</a> He Knows what every female bears, and that of which the wombs fall short of completion and that in which they increase</span>. He<sup>asws</sup> said: ‘The ‘fall short’ is every pregnancy which is less than nine months, and what <span class=\"ibTxt\">they increase</span> is everything which increases upon nine months. So every pure blood which the woman sees during her pregnancy, so it has increased with a number of days which she has seen in her pregnancy from the blood’."
          ],
          "en.sarwar": [
            "2. It is narrated from the narrator of the previous Hadith from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Hammad ibn ‘Isa from Hariz from those whom he has mentioned who has said the following: “I once asked one of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, about the words of Allah, most Majestic, most Glorious, ‘He knows what every female bears and what the wombs decrease (spoil) and what they increase (dispose).’ <a href=\"/#/books/quran:13#h8\">[13:8]</a> He (the Imam) said, ‘Decrease’ is every pregnancy before nine months and ‘increase’ is what is more than nine months. Whenever a woman experiences pure blood discharge during her pregnancy a similar number of days are increased in the length of her pregnancy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/22)"
        ],
        "index": 10354,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:6:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ قَالَ قَالَ سَمِعْتُ أَبَا الْحَسَنِ الرِّضَا ( عليه السلام ) يَقُولُ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) إِنَّ النُّطْفَةَ تَكُونُ فِي الرَّحِمِ أَرْبَعِينَ يَوْماً ثُمَّ تَصِيرُ عَلَقَةً أَرْبَعِينَ يَوْماً ثُمَّ تَصِيرُ مُضْغَةً أَرْبَعِينَ يَوْماً فَإِذَا كَمَلَ أَرْبَعَةُ أَشْهُرٍ بَعَثَ اللَّهُ مَلَكَيْنِ خَلَّاقَيْنِ فَيَقُولَانِ يَا رَبِّ مَا تَخْلُقُ ذَكَراً أَوْ أُنْثَى فَيُؤْمَرَانِ فَيَقُولَانِ يَا رَبِّ شَقِيّاً أَوْ سَعِيداً فَيُؤْمَرَانِ فَيَقُولَانِ يَا رَبِّ مَا أَجَلُهُ وَ مَا رِزْقُهُ وَ كُلُّ شَيْ‏ءٍ مِنْ حَالِهِ وَ عَدَّدَ مِنْ ذَلِكَ أَشْيَاءَ وَ يَكْتُبَانِ الْمِيثَاقَ بَيْنَ عَيْنَيْهِ فَإِذَا أَكْمَلَ اللَّهُ لَهُ الْأَجَلَ بَعَثَ اللَّهُ مَلَكاً فَزَجَرَهُ زَجْرَةً فَيَخْرُجُ وَ قَدْ نَسِيَ الْمِيثَاقَ ",
          "فَقَالَ الْحَسَنُ بْنُ الْجَهْمِ فَقُلْتُ لَهُ أَ فَيَجُوزُ أَنْ يَدْعُوَ اللَّهَ فَيُحَوِّلَ الْأُنْثَى ذَكَراً وَ الذَّكَرَ أُنْثَى فَقَالَ إِنَّ اللَّهَ يَفْعَلُ مَا يَشَاءُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazzal, from Al Hassan Bin Al Jaham who said, ",
            "‘I heard Abu Al-Hassan Al-Reza<sup>asws</sup> saying, ‘Abu Ja’far<sup>asws</sup> said: ‘The sperm happens to be in the womb for forty days, then it becomes a clot for forty days, then it becomes a lump for forty days. So when four months are complete, Allah<sup>azwj</sup> Sends two creating Angels, so they are both saying: ‘O Lord<sup>azwj</sup>! What will You<sup>azwj</sup> Created, male or female’. So He<sup>azwj</sup> Commands them both, and they are both saying: ‘O Lord<sup>azwj</sup>! Miserable or happy?’ So He<sup>azwj</sup> Commands them both, and they are saying: ‘O Lord<sup>azwj</sup>! What is its term? And what is its sustenance?’, and everything from its state, and a number of things from that, and they both write these down as the covenant in between his eyes. So when Allah<sup>azwj</sup> Completes the term for him, Allah<sup>azwj</sup> Sends an Angel, so he rebukes him with a severe rebuke, and he forgets the Covenant’. ",
            "So Al-Hassan Bin Al-Jaham said, ‘So I said to him<sup>asws</sup>, ‘So is it allowed that he can supplicate to Allah<sup>azwj</sup>, so He<sup>azwj</sup> Changes the female to a male, and the male to a female?’ So he<sup>asws</sup> said: ‘Allah<sup>azwj</sup> does whatever He<sup>azwj</sup> so Desires to’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from al-Hassan ibn al-Jahm who has said the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘Sperm in the womb after forty days becomes a clot and after forty days thereafter it becomes an embryo. When four months are complete Allah sends two creating angels and they ask, “O Lord, what do You want to create? Do You want to create a male or a female.” They then receive the command. Thereafter they ask, “O Lord, do You want him to be virtuous or a wicked one?” They then receive the command. They ask, “O Lord, how much is the length of his life, how much is his sustenance, everything of his condition and the number of such things?” They write the covenant between his eyes. When the time of pregnancy is complete, Allah sends an angel who scolds him harshly. He comes out but has already forgotten the covenant.’ Al-Hassan ibn al-Jahm has said, that I then asked him (the Imam), ‘Will Allah because of prayer change female to a male and a male into a female?’ He (the Imam) said, ‘Allah can do whatever He wants.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/23)"
        ],
        "index": 10355,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:6:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِنَّ اللَّهَ عَزَّ وَ جَلَّ إِذَا أَرَادَ أَنْ يَخْلُقَ النُّطْفَةَ الَّتِي مِمَّا أَخَذَ عَلَيْهَا الْمِيثَاقَ فِي صُلْبِ آدَمَ أَوْ مَا يَبْدُو لَهُ فِيهِ وَ يَجْعَلَهَا فِي الرَّحِمِ حَرَّكَ الرَّجُلَ لِلْجِمَاعِ وَ أَوْحَى إِلَى الرَّحِمِ أَنِ افْتَحِي بَابَكِ حَتَّى يَلِجَ فِيكِ خَلْقِي وَ قَضَائِيَ النَّافِذُ وَ قَدَرِي ",
          "فَتَفْتَحُ الرَّحِمُ بَابَهَا فَتَصِلُ النُّطْفَةُ إِلَى الرَّحِمِ فَتَرَدَّدُ فِيهِ أَرْبَعِينَ يَوْماً ثُمَّ تَصِيرُ عَلَقَةً أَرْبَعِينَ يَوْماً ثُمَّ تَصِيرُ مُضْغَةً أَرْبَعِينَ يَوْماً ثُمَّ تَصِيرُ لَحْماً تَجْرِي فِيهِ عُرُوقٌ مُشْتَبِكَةٌ ثُمَّ يَبْعَثُ اللَّهُ مَلَكَيْنِ خَلَّاقَيْنِ يَخْلُقَانِ فِي الْأَرْحَامِ مَا يَشَاءُ اللَّهُ فَيَقْتَحِمَانِ فِي بَطْنِ الْمَرْأَةِ مِنْ فَمِ الْمَرْأَةِ فَيَصِلَانِ إِلَى الرَّحِمِ وَ فِيهَا الرُّوحُ الْقَدِيمَةُ الْمَنْقُولَةُ فِي أَصْلَابِ الرِّجَالِ وَ أَرْحَامِ النِّسَاءِ فَيَنْفُخَانِ فِيهَا رُوحَ الْحَيَاةِ وَ الْبَقَاءِ وَ يَشُقَّانِ لَهُ السَّمْعَ وَ الْبَصَرَ وَ جَمِيعَ الْجَوَارِحِ وَ جَمِيعَ مَا فِي الْبَطْنِ بِإِذْنِ اللَّهِ",
          "ثُمَّ يُوحِي اللَّهُ إِلَى الْمَلَكَيْنِ اكْتُبَا عَلَيْهِ قَضَائِي وَ قَدَرِي وَ نَافِذَ أَمْرِي وَ اشْتَرِطَا لِيَ الْبَدَاءَ فِيمَا تَكْتُبَانِ فَيَقُولَانِ يَا رَبِّ مَا نَكْتُبُ فَيُوحِي اللَّهُ إِلَيْهِمَا أَنِ ارْفَعَا رَءُوسَكُمَا إِلَى رَأْسِ أُمِّهِ فَيَرْفَعَانِ رُءُوسَهُمَا فَإِذَا اللَّوْحُ يَقْرَعُ جَبْهَةَ أُمِّهِ فَيَنْظُرَانِ فِيهِ فَيَجِدَانِ فِي اللَّوْحِ صُورَتَهُ وَ زِينَتَهُ وَ أَجَلَهُ وَ مِيثَاقَهُ شَقِيّاً أَوْ سَعِيداً وَ جَمِيعَ شَأْنِهِ",
          "قَالَ فَيُمْلِي أَحَدُهُمَا عَلَى صَاحِبِهِ فَيَكْتُبَانِ جَمِيعَ مَا فِي اللَّوْحِ وَ يَشْتَرِطَانِ الْبَدَاءَ فِيمَا يَكْتُبَانِ ثُمَّ يَخْتِمَانِ الْكِتَابَ وَ يَجْعَلَانِهِ بَيْنَ عَيْنَيْهِ ثُمَّ يُقِيمَانِهِ قَائِماً فِي بَطْنِ أُمِّهِ ",
          "قَالَ فَرُبَّمَا عَتَا فَانْقَلَبَ وَ لَا يَكُونُ ذَلِكَ إِلَّا فِي كُلِّ عَاتٍ أَوْ مَارِدٍ وَ إِذَا بَلَغَ أَوَانُ خُرُوجِ الْوَلَدِ تَامّاً أَوْ غَيْرَ تَامٍّ أَوْحَى اللَّهُ عَزَّ وَ جَلَّ إِلَى الرَّحِمِ أَنِ افْتَحِي بَابَكِ حَتَّى يَخْرُجَ خَلْقِي إِلَى أَرْضِي وَ يَنْفُذَ فِيهِ أَمْرِي فَقَدْ بَلَغَ أَوَانُ خُرُوجِهِ قَالَ ",
          "فَيَفْتَحُ الرَّحِمُ بَابَ الْوَلَدِ فَيَبْعَثُ اللَّهُ إِلَيْهِ مَلَكاً يُقَالُ لَهُ زَاجِرٌ فَيَزْجُرُهُ زَجْرَةً فَيَفْزَعُ مِنْهَا الْوَلَدُ فَيَنْقَلِبُ فَيَصِيرُ رِجْلَاهُ فَوْقَ رَأْسِهِ وَ رَأْسُهُ فِي أَسْفَلِ الْبَطْنِ لِيُسَهِّلَ اللَّهُ عَلَى الْمَرْأَةِ وَ عَلَى الْوَلَدِ الْخُرُوجَ ",
          "قَالَ فَإِذَا احْتُبِسَ زَجَرَهُ الْمَلَكُ زَجْرَةً أُخْرَى فَيَفْزَعُ مِنْهَا فَيَسْقُطُ الْوَلَدُ إِلَى الْأَرْضِ بَاكِياً فَزِعاً مِنَ الزَّجْرَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Ibn Raib, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Whenever Allah<sup>azwj</sup> Mighty and Majestic Intends to Create the seed from which He<sup>azwj</sup> would Take the Covenant against in the ribs of Adam<sup>as</sup>, or whatever He<sup>azwj</sup> would be Managing for him with regards to it, and Makes it to be in the womb, Stirs the man for the copulation, or Reveals unto the womb: “Open your door until My<sup>azwj</sup> Creation resides inside you and My<sup>azwj</sup> Ordainment and My<sup>azwj</sup> Power is implemented”. ",
            "So the womb opens up its door, so the seed sails into the womb. So it vibrates inside it for forty days, then becomes a clot for forty days; then it becomes a lump for forty days; then it becomes flesh with veins flowing inside it entangled. Then Allah<sup>azwj</sup> Sends two creating Angels who create in the wombs whatever Allah<sup>azwj</sup> so Desires. So they both storm into the belly of the woman from the mouth of the woman. So they both arrive to the womb, and in it is the spirit from old (from before), the one transferred in the ribs of the men and the wombs of the women. So they both blow into it a soul of life, and the remaining, and cleave open for him the hearing, and the sight, and the entirety of the body parts, and the entire of whatever is in the belly, by the Permission of Allah<sup>azwj</sup>.",
            "Then Allah<sup>azwj</sup> Reveals to the two Angels: “Write upon him My<sup>azwj</sup> Ordainment, and My<sup>azwj</sup> Pre-determination, and implement My<sup>azwj</sup> Command, and stipulate for Me<sup>azwj</sup> the change regarding what you two are writing”. So they both say: ‘O Lord<sup>azwj</sup>! What should we write?’ So Allah<sup>azwj</sup> Reveals unto them both: “Raise both your heads to the head of its mother”. So they both raise their heads, and there is a Tablet upon the forehead of its mother. So they both look into it, and they find (written) in the Tablet, its image, and its adornment, and its term, and its Covenant whether it is miserable or fortunate, and the entirety of its affairs’.",
            "He<sup>asws</sup> said: ‘So one of them dictates to his companion, so they both write down the entirety of whatever is in the Tablet, and the change is stipulated upon both of them with regards to what they write. Then they both seal the document and make it to be between his eyes. Then they both make it stand straight in the belly of its mother’. ",
            "He<sup>asws</sup> said: ‘So perhaps he is haughty (arrogant), so he turns over, and that does not happen except regarding every haughty or insolent one. When the time reaches, the child comes out complete, or other than complete. Allah<sup>azwj</sup> Mighty and Majestic Reveals unto the womb: “Open your door until My<sup>azwj</sup> creature comes out to My<sup>azwj</sup> earth, and My<sup>azwj</sup> Command gets implemented regarding him”. So the time has reached and the child comes out.",
            "So the womb opens its door of the birth. So Allah<sup>azwj</sup> Sends an Angel called Zajir (Rebuker) to him. So he rebukes him with such a rebuke that the child panics from it, so he overturns and his feet come to be above its head, and its head in the lower part of the belly, in order for Allah<sup>azwj</sup> to Make it easy upon the woman and upon the child, for the exiting’.",
            "He<sup>asws</sup> said: ‘So when the rebuke of the Angel is withheld, he rebukes it again, so it panics from it, and the child falls to the ground crying, having panicked from the rebuke’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father all from ibn Mahbub from ibn Ri’ab from Zurarah who has said the following: “Abu Ja’far, ‘Alayhi al-Salam, has said, ‘When Allah, most Majestic, most Glorious, wants to create the seed which has formed the covenant when taken from the back of Adam or what appears to Him, (due to al-Bada’ ) He places it in the womb and moves the man to go to bed with the woman (his wife). He inspires the womb to open its door so that His creature can enter in it and His authoritative determination and measure. The womb opens its door and the seed reaches the womb, then turns back and forth for forty days, then it becomes a clot, then an embryo in forty days, then a piece of flesh in which veins spread like a net. Then Allah sends two creative angels in the womb who make in the womb as Allah wills. They enter inside the woman through her mouth until they reach her womb. In it (the seed) is the old spirit transferred from the backs of men to the wombs of women, then they blow in it the spirit of life and continued life and carve for him ears, eyes, all of his parts and all the inside by the permission of Allah. Then Allah sends revelation to the two angels that says, ‘Write upon him My authoritative command of determination and measures and stipulate for me a change of plan (al- bada’) in what you write.’ They then ask, ‘What must we write, O Lord?’ Allah then reveals to them to raise their heads to the head of his mother.’ They then raise their heads and find a tablet knocking [informing] from the forehead of his mother. They look at it and find in it his shape, fashion, duration of his life, his covenant of being a virtuous or a wicked one and all of his characteristics.’ He (the Imam) then said, ‘One of them dictates, the other writes all that is in the tablet and stipulates the condition of change of plan (al-bada’). They seal the book and place it between his two eyes, then they make him stand up in the belly of his mother.’ He (the Imam) said, ‘He perhaps turns insolent and changes and this only happens with insolent and disobedient ones. When it is time for his coming out Allah, most Majestic, most Glorious, inspires the womb to open its door so that His creature can come out to His earth so that His command is applied to him; it is time for him to come out.’ He (the Imam) then said, ‘The womb then opens the door of the child and Allah sends an angel called a reprimanding one, who reprimands him and it makes him feel shocked. His head turns downward and his feet upward thus Allah makes it easy for the child to come out as well as for the woman.’ He (the Imam) then said, ‘When he stops the angel reproaches him again which gives him a shock again. He then falls on the ground crying and upset because of the reproach.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/26)"
        ],
        "index": 10356,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:6:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي حَمْزَةَ قَالَ سَأَلْتُ أَبَا جَعْفَرٍ ( عليه السلام ) عَنِ الْخَلْقِ قَالَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى لَمَّا خَلَقَ الْخَلْقَ مِنْ طِينٍ أَفَاضَ بِهَا كَإِفَاضَةِ الْقِدَاحِ فَأَخْرَجَ الْمُسْلِمَ فَجَعَلَهُ سَعِيداً وَ جَعَلَ الْكَافِرَ شَقِيّاً فَإِذَا وَقَعَتِ النُّطْفَةُ تَلَقَّتْهَا الْمَلَائِكَةُ فَصَوَّرُوهَا ثُمَّ قَالُوا يَا رَبِّ أَ ذَكَراً أَوْ أُنْثَى فَيَقُولُ الرَّبُّ جَلَّ جَلَالُهُ أَيَّ ذَلِكَ شَاءَ فَيَقُولَانِ تَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ",
          "ثُمَّ تُوضَعُ فِي بَطْنِهَا فَتَرَدَّدُ تِسْعَةَ أَيَّامٍ فِي كُلِّ عِرْقٍ وَ مَفْصِلٍ وَ مِنْهَا لِلرَّحِمِ ثَلَاثَةُ أَقْفَالٍ قُفْلٌ فِي أَعْلَاهَا مِمَّا يَلِي أَعْلَى الصُّرَّةِ مِنَ الْجَانِبِ الْأَيْمَنِ وَ الْقُفْلُ الْآخَرُ وَسَطَهَا وَ الْقُفْلُ الْآخَرُ أَسْفَلَ مِنَ الرَّحِمِ فَيُوضَعُ بَعْدَ تِسْعَةِ أَيَّامٍ فِي الْقُفْلِ الْأَعْلَى فَيَمْكُثُ فِيهِ ثَلَاثَةَ أَشْهُرٍ فَعِنْدَ ذَلِكَ يُصِيبُ الْمَرْأَةَ خُبْثُ النَّفْسِ وَ التَّهَوُّعُ",
          "ثُمَّ يَنْزِلُ إِلَى الْقُفْلِ الْأَوْسَطِ فَيَمْكُثُ فِيهِ ثَلَاثَةَ أَشْهُرٍ وَ صُرَّةُ الصَّبِيِّ فِيهَا مَجْمَعُ الْعُرُوقِ وَ عُرُوقُ الْمَرْأَةِ كُلُّهَا مِنْهَا يَدْخُلُ طَعَامُهُ وَ شَرَابُهُ مِنْ تِلْكَ الْعُرُوقِ ",
          "ثُمَّ يَنْزِلُ إِلَى الْقُفْلِ الْأَسْفَلِ فَيَمْكُثُ فِيهِ ثَلَاثَةَ أَشْهُرٍ فَذَلِكَ تِسْعَةُ أَشْهُرٍ ثُمَّ تُطْلَقُ الْمَرْأَةُ فَكُلَّمَا طُلِقَتْ انْقَطَعَ عِرْقٌ مِنْ صُرَّةِ الصَّبِيِّ فَأَصَابَهَا ذَلِكَ الْوَجَعُ وَ يَدُهُ عَلَى صُرَّتِهِ حَتَّى يَقَعَ إِلَى الْأَرْضِ وَ يَدُهُ مَبْسُوطَةٌ فَيَكُونُ رِزْقُهُ حِينَئِذٍ مِنْ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhamad Bin Yahya, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Muhammad Bin Al Fazeyl, from Abu Hamza who said, ",
            "‘I asked Abu Ja’far<sup>asws</sup> about the creation. He<sup>asws</sup> said: ‘When Allah<sup>azwj</sup> Blessed and High Created the creatures from clay, Effused by it like the effusion of the flint. So He<sup>azwj</sup> Extracted the Muslim and Made him as fortunate, and Make the Infidel as miserable. So when the seed falls (into the womb), the two Angels meet it. So they caricature it, then say, ‘O Lord<sup>azwj</sup>! Male or female?’ So the Lord<sup>azwj</sup> Majestic is His<sup>azwj</sup> Majesty is Saying whatever that He<sup>azwj</sup> so Desires to. So they are both saying, ‘Blessed is Allah<sup>azwj</sup> the best of the creators’. ",
            "Then they place it in her belly. So it vibrates for nine days in every vein and join, and from it are three lock for the womb – a lock in its upper part from what follows to the top of the navel, from the right hand side; and another lock in the middle of it; and another lock in the lower part of the womb. So, after nine days, they place him in the upper lock. So it remains in it for three months, during which the woman is hit by maliciousness, and the breathing (problems), and vomiting. ",
            "Then it descends to the middle lock. So it remains there for three months, during which (through) the navel of the child, its veins connect with the veins of the woman, all of these from which its food, and its drink enter, do so from these veins. ",
            "Then it descends to the lower lock, so it remains in it for three months. So these are the nine months. Then the woman undergoes pangs. So with each pain, a vein is cut off from the navel of the child. So that hits it with pain, and its hand is upon its navel until he falls to the ground, and his hand would be extended, so his sustenance from here on would be from its mouth’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Muhammad ibn al-Fudayl from abu Hamzah who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, about the creation. He (the Imam) said, ‘When Allah, most Blessed, most High, created the creation from clay He poured them as arrows are poured, took out the Muslim ones, made him fortunate and made the unbeliever wicked ones. When the seed falls angels receive it and give it its shape then they ask, ‘O Lord, do You want it to be a male or female? ’ The Lord, most Majestic, most Glorious, then says whatever He wants.’ The two then say, ‘Blessed is Allah the best Creator.’ It then is placed inside her and it moves back and forth for nine days in every vein and joint. Inside from her to the womb there are three locks. One lock is for the upper side parallel to the bellybutton from the right side, the other lock is from the midsection and another lock is lower in the womb. After nine days, it is placed in the upper lock where it remains for three months and at this time, the woman experiences disgust and nausea. Thereafter it comes down to the middle lock and remains there for three months. The bellybutton of the child connects to a group of veins and all of the veins of the woman from which food enters as well as drinks by the way of these groups of veins. Then the child descends down to the third lock where the child remains for another three months and this completes nine months. The woman then undergoes childlabor and with every pain a vein of the veins disconnect from the bellybutton of the child. When pain starts his hand rests on his bellybutton and he falls on the ground with his hands spread and thereafter his sustenance is by the way of his mouth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/27)"
        ],
        "index": 10357,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:6:6",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ أَوْ غَيْرِهِ قَالَ قُلْتُ لِأَبِي جَعْفَرٍ ( عليه السلام ) جُعِلْتُ فِدَاكَ الرَّجُلُ يَدْعُو لِلْحُبْلَى أَنْ يَجْعَلَ اللَّهُ مَا فِي بَطْنِهَا ذَكَراً سَوِيّاً قَالَ يَدْعُو مَا بَيْنَهُ وَ بَيْنَ أَرْبَعَةِ أَشْهُرٍ فَإِنَّهُ أَرْبَعِينَ لَيْلَةً نُطْفَةٌ وَ أَرْبَعِينَ لَيْلَةً عَلَقَةٌ وَ أَرْبَعِينَ لَيْلَةً مُضْغَةٌ فَذَلِكَ تَمَامُ أَرْبَعَةِ أَشْهُرٍ ثُمَّ يَبْعَثُ اللَّهُ مَلَكَيْنِ خَلَّاقَيْنِ فَيَقُولَانِ يَا رَبِّ مَا نَخْلُقُ ذَكَراً أَمْ أُنْثَى شَقِيّاً أَوْ سَعِيداً فَيُقَالُ ذَلِكَ فَيَقُولَانِ يَا رَبِّ مَا رِزْقُهُ وَ مَا أَجَلُهُ وَ مَا مُدَّتُهُ فَيُقَالُ ذَلِكَ وَ مِيثَاقُهُ بَيْنَ عَيْنَيْهِ يَنْظُرُ إِلَيْهِ وَ لَا يَزَالُ مُنْتَصِباً فِي بَطْنِ أُمِّهِ حَتَّى إِذَا دَنَا خُرُوجُهُ بَعَثَ اللَّهُ عَزَّ وَ جَلَّ إِلَيْهِ مَلَكاً فَزَجَرَهُ زَجْرَةً فَيَخْرُجُ وَ يَنْسَى الْمِيثَاقَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Al Husayn, from Muhammad Bin Ismail, or someone else who said, ",
            "‘I said to Abu Ja’far<sup>asws</sup>, ‘May I be sacrificed for you! The man supplicates for the pregnancy that Allah<sup>azwj</sup> should Make whatever is in her belly to be a male, well-proportioned’. He<sup>asws</sup> said: ‘He can supplicate in what is between it and four months, for it is a seed for forty nights, and a clot for forty nights, and a lump for forty nights. So that completes four months. Then Allah<sup>azwj</sup> Sends two creating Angels, so they are both saying: ‘O Lord<sup>azwj</sup>! What should we create, a male or a female, miserable or fortunate?’ So He<sup>azwj</sup> Says that. So they are both saying: ‘O Lord<sup>azwj</sup>! What is its sustenance, and what is its term, and what is its duration?’ So He<sup>azwj</sup> Says that, and its Covenant is between his eyes, and they look into it; and it does not cease to be vertical in the belly of its mother until when its exit approaches, so Allah<sup>azwj</sup> Mighty and Majestic Sends an Angel. So he rebukes it with a rebuke, so it comes out, and forgets the Covenant’."
          ],
          "en.sarwar": [
            "6. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn al-Husayn from Muhammad ibn ’Isma‘il or others who has said the following: “I once asked abu Ja‘far, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, can a pregnant woman pray to Allah to make the child inside her a well formed boy?’ He (the Imam) said, ‘She can do so from conception up to the fourth month. Up to forty nights it is sperm, for another forty nights it is a clot and for another forty nights it is an embryo, thereafter Allah sends two creative angles who ask, “O Lord, what must we create, a male or female, fortunate or unfortunate?” Their question is then answered. They then ask, “O Lord, what is his sustenance, when is the time of his death and what is the length of his life?” It all then is told to them and his covenant is between his eyes to which he looks. He still is inside his mother until the time of his coming out draws near. Allah, most Majestic, most Glorious, sends an angel who drives him out with reproach that sends him into shock and he forgets the covenant?” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/27)"
        ],
        "index": 10358,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:6:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ بْنِ أَعْيَنَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ ( عليه السلام ) يَقُولُ إِذَا وَقَعَتِ النُّطْفَةُ فِي الرَّحِمِ اسْتَقَرَّتْ فِيهَا أَرْبَعِينَ يَوْماً وَ تَكُونُ عَلَقَةً أَرْبَعِينَ يَوْماً وَ تَكُونُ مُضْغَةً أَرْبَعِينَ يَوْماً ثُمَّ يَبْعَثُ اللَّهُ مَلَكَيْنِ خَلَّاقَيْنِ فَيُقَالُ لَهُمَا اخْلُقَا كَمَا يُرِيدُ اللَّهُ ذَكَراً أَوْ أُنْثَى صَوِّرَاهُ وَ اكْتُبَا أَجَلَهُ وَ رِزْقَهُ وَ مَنِيَّتَهُ وَ شَقِيّاً أَوْ سَعِيداً وَ اكْتُبَا لِلَّهِ الْمِيثَاقَ الَّذِي أَخَذَهُ عَلَيْهِ فِي الذَّرِّ بَيْنَ عَيْنَيْهِ فَإِذَا دَنَا خُرُوجُهُ مِنْ بَطْنِ أُمِّهِ بَعَثَ اللَّهُ إِلَيْهِ مَلَكاً يُقَالُ لَهُ زَاجِرٌ فَيَزْجُرُهُ فَيَفْزَعُ فَزَعاً فَيَنْسَى الْمِيثَاقَ وَ يَقَعُ إِلَى الْأَرْضِ يَبْكِي مِنْ زَجْرَةِ الْمَلَكِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father, from Ibn Mahboub, from Ibn Raib, from Zurara Bin Ayn who said, ",
            "‘I heard Abu Ja’far<sup>asws</sup> saying: ‘When the seed falls into the womb, it vibrates in it for forty days, it settles in it for forty days, and becomes a cloth for forty days, and becomes a lump for forty days. Then Allah<sup>azwj</sup> Sends two creating Angels, so He<sup>azwj</sup> Says to both of them to create whatever Allah<sup>azwj</sup> Intends, male or female. So they caricature it, and write down its term, and its sustenance, and its death, and whether it is to be miserable or fortunate, and they both write the Covenant for Allah<sup>azwj</sup> which He<sup>azwj</sup> had Taken from it in the (realm of the) particles, to be between its eyes. So when it is near for its exit from the belly of its mother, Allah<sup>azwj</sup> Sends an Angel called Zajira (Rebuker) to it. So he rebukes it with a rebuke, so it panics and forgets the Covenant, and falls to the ground crying from the rebuking of the Angel’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Ali ibn Ibrahim has narrated from his father from ibn Mahbub from ibn Ri’ab from Zurarah ibn ’ A‘yan who has said the following: “I once heard abu Ja‘far, ‘Alayhi al-Salam, saying, ‘When the seed falls in the womb it settles there for forty days, remains as a clot for forty days and as an embryo for another forty days. Allah then sends two creative angels with instruction to create him, as Allah wants it to be. It can be a male or a female. They shape him and write down the duration of his life, the time of his death, that he is a fortunate or unfortunate. The two must write down between his eyes the covenant of Allah, which He has taken from him in the condition of being particles. When the time for his coming out from the belly of his mother draws near; Allah sends an angel called admonisher who admonishes him that sends him into shock. He forgets the covenant and falls on the ground weeping because of the admonition of the angel?” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:1:6",
  "kind": "verse_list"
}