{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 6"
        },
        "path": "/books/al-kafi:6",
        "titles": {
          "ar": "الجزء السادس‏",
          "en": "Volume Six"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:6:1",
        "titles": {
          "ar": "كِتَابُ الْعَقِيقَةِ",
          "en": "THE BOOK OF AQEEQA"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:6:1:9",
        "titles": {
          "ar": "باب التَّهْنِئَةِ بِالْوَلَدِ",
          "en": "Chapter 9 – The congratulations with the birth"
        }
      }
    ],
    "index": 1572,
    "local_index": 9,
    "part_type": "Chapter",
    "path": "/books/al-kafi:6:1:9",
    "titles": {
      "ar": "باب التَّهْنِئَةِ بِالْوَلَدِ",
      "en": "Chapter 9 – The congratulations with the birth"
    },
    "verse_count": 3,
    "verse_start_index": 10361,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (21/30)"
        ],
        "index": 10362,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:9:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ خَالِدٍ عَنْ أَبِيهِ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ الْحُسَيْنِ عَنْ مُرَازِمٍ عَنْ أَخِيهِ قَالَ قَالَ رَجُلٌ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) وُلِدَ لِي غُلَامٌ فَقَالَ رَزَقَكَ اللَّهُ شُكْرَ الْوَاهِبِ وَ بَارَكَ لَكَ فِي الْمَوْهُوبِ وَ بَلَغَ أَشُدَّهُ وَ رَزَقَكَ اللَّهُ بِرَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Khalid, from his father, from Muhammad Bin Sinan, from Al Husayn, from Morazim, from his brother who said, ",
            "‘A man said to Abu Abdullah<sup>asws</sup>, ‘A boy has been born for me’. So he<sup>asws</sup> said: ‘May Allah<sup>azwj</sup> Grant you with thanking the Endower, and Bless for you in the endowment, and Make him reach the adulthood, and may Allah<sup>azwj</sup> Grant you (to observe) his righteousness’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad from ibn Khalid from his father from Muhammad ibn Sinan from al-Husayn from Murazim from his brother who has said the following: “A man once said to abu ‘ Abd Allah, ‘Alayhi al-Salam, ‘A boy is born to me. 5 He (the Imam) said, ‘May Allah enable you to thank the Benefactor, bless you with the gift and make him to grow up to manhood! May Allah grant you the chance to enjoy his virtuous deeds!’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/30)"
        ],
        "index": 10363,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:9:2",
        "text": [
          "عَلِيُّ بْنُ مُحَمَّدِ بْنِ بُنْدَارَ عَنْ إِبْرَاهِيمَ بْنِ إِسْحَاقَ الْأَحْمَرِ عَنْ عَبْدِ اللَّهِ بْنِ حَمَّادٍ عَنْ أَبِي مَرْيَمَ الْأَنْصَارِيِّ عَنْ أَبِي بَرْزَةَ الْأَسْلَمِيِّ قَالَ وُلِدَ لِلْحَسَنِ بْنِ عَلِيٍّ ( عليه السلام ) مَوْلُودٌ فَأَتَتْهُ قُرَيْشٌ فَقَالُوا يَهْنِئُكَ الْفَارِسُ فَقَالَ وَ مَا هَذَا مِنَ الْكَلَامِ قُولُوا شَكَرْتَ الْوَاهِبَ وَ بُورِكَ لَكَ فِي الْمَوْهُوبِ وَ بَلَغَ اللَّهُ بِهِ أَشُدَّهُ وَ رَزَقَكَ بِرَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Muhammad Bin Bundar, from Ibrahim Bin Is’haq Al Ahmar, from Abdullah Bin Hammad, from Abu Maryam Al Ansary, from Abu Barzat Al Aslamy who said, ",
            "‘A child was born for Ali<sup>asws</sup> Bin Al-Husayn<sup>asws</sup>, so the Qureysh came over to him<sup>asws</sup> and said, ‘Congratulations to you<sup>asws</sup> for the (birth of a) horse-rider’. So he<sup>asws</sup> said: ‘And what is this from the speech? You should be saying, ‘Thank the Endower, Blessings be to you<sup>asws</sup> regarding the endowed, and may Allah<sup>azwj</sup> Make him reach the adulthood, and Grant you<sup>asws</sup> (to observe) his righteousness’."
          ],
          "en.sarwar": [
            "2. Ali ibn Muhammad ibn Bandar has narrated from Ibrahim ibn Ishaq al-Ahmar from ‘Abd Allah ibn Hammad from abu Maryam al- Ansariy from abu Barzah al-Aslamiy who has said the following: “A child was born to al-Husayn ibn Ali, ‘Alayhi al-Salam, and Quraysh came to congratulate him (the Imam) and said, ‘Congratulations to you for the birth of the rider (the knight).’ He (the Imam) said, ‘What kind of expression is this! Say, “May Allah enable you to thank the Benefactor for the blessed gift, may Allah make him to grow up to manhood and may Allah give you the chance to enjoy his good deeds!”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (1/30)"
        ],
        "index": 10364,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:6:1:9:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ بَكْرِ بْنِ صَالِحٍ عَمَّنْ ذَكَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ هَنَّأَ رَجُلٌ رَجُلًا أَصَابَ ابْناً فَقَالَ يَهْنِئُكَ الْفَارِسُ فَقَالَ لَهُ الْحَسَنُ ( عليه السلام ) مَا عِلْمُكَ يَكُونُ فَارِساً أَوْ رَاجِلًا قَالَ جُعِلْتُ فِدَاكَ فَمَا أَقُولُ قَالَ تَقُولُ شَكَرْتَ الْوَاهِبَ وَ بُورِكَ لَكَ فِي الْمَوْهُوبِ وَ بَلَغَ أَشُدَّهُ وَ رَزَقَكَ بِرَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Bakr Bin Salih, from the one who mentioned it, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘A man congratulated a man who had a son, so he said, ‘Congratulations to you of the (birth of a) horse-rider. So Al-Hassan<sup>asws</sup> said to him: ‘What makes you know that he would be a horse-rider, or a walker?’ He said, ‘May I be sacrificed for you<sup>asws</sup>! So what should I be saying?’ He<sup>asws</sup> said: ‘You should be saying, ‘Thanks be to the Endower, and Blessings be to you regarding the endowment, and may he reach adulthood, and you be graced with (to see) his righteousness’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from Bakr ibn Salih from those whom he has mentioned who has said the following: “Once a man congratulated another man saying, ‘Congratulation for the birth of the rider (the knight).’ Al-Hassan, ‘Alayhi al-Salam, said, ‘How would you know if he will be a rider or walking on foot?’ He asked, ‘I pray to Allah to keep my soul in service for your cause, what I should say?’ He (the Imam) said, ‘Say, “May Allah enable you to thank the Benefactor. May the gift be a blessing for you and may Allah make him to grow up to manhood! May Allah give you the chance to enjoy his good deeds.’”” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:6:1:9",
  "kind": "verse_list"
}