{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:7:1", "titles": {"ar": "كتاب  الْوَصَايَا ", "en": "THE BOOK OF BEQUESTS"}}, {"indexed_titles": {"en": "Chapter 1"}, "path": "/books/al-kafi:7:1:1", "titles": {"ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب الْوَصِيَّةِ وَ</span> مَا أُمِرَ بِهَا", "en": "Chapter 1 – The bequest and what has been ordered with it"}}], "index": 1979, "local_index": 1, "part_type": "Chapter", "path": "/books/al-kafi:7:1:1", "titles": {"ar": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ب</span>اب الْوَصِيَّةِ وَ</span> مَا أُمِرَ بِهَا", "en": "Chapter 1 – The bequest and what has been ordered with it"}, "verse_count": 5, "verse_start_index": 12949, "verses": [{"index": 12950, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:1:1:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ح</span>َدَّثَنَا عَلِيُّ</span> بْنُ إِبْرَاهِيمَ عَنْ عَلِيِّ بْنِ إِسْحَاقَ عَنِ الْحَسَنِ بْنِ حَازِمٍ الْكَلْبِيِّ ابْنِ أُخْتِ هِشَامِ بْنِ سَالِمٍ عَنْ سُلَيْمَانَ بْنِ جَعْفَرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) مَنْ لَمْ يُحْسِنْ وَصِيَّتَهُ عِنْدَ الْمَوْتِ كَانَ نَقْصاً فِي مُرُوءَتِهِ وَ عَقْلِهِ قِيلَ يَا رَسُولَ اللَّهِ وَ كَيْفَ يُوصِي الْمَيِّتُ\nقَالَ إِذَا حَضَرَتْهُ وَفَاتُهُ وَ اجْتَمَعَ النَّاسُ إِلَيْهِ قَالَ اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَ الْأَرْضِ عَالِمَ الْغَيْبِ وَ الشَّهَادَةِ الرَّحْمَنَ الرَّحِيمَ اللَّهُمَّ إِنِّي أَعْهَدُ إِلَيْكَ فِي دَارِ الدُّنْيَا أَنِّي أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَ أَنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ وَ أَنَّ الْجَنَّةَ حَقٌّ وَ أَنَّ النَّارَ حَقٌّ وَ أَنَّ الْبَعْثَ حَقٌّ وَ أَنَّ الْحِسَابَ حَقٌّ وَ الْقَدَرَ وَ الْمِيزَانَ حَقٌّ وَ أَنَّ الدِّينَ كَمَا وَصَفْتَ وَ أَنَّ الْإِسْلَامَ كَمَا شَرَعْتَ وَ أَنَّ الْقَوْلَ كَمَا حَدَّثْتَ وَ أَنَّ الْقُرْآنَ كَمَا أَنْزَلْتَ وَ أَنَّكَ أَنْتَ اللَّهُ الْحَقُّ الْمُبِينُ جَزَى اللَّهُ مُحَمَّداً ( صلى الله عليه وآله ) خَيْرَ الْجَزَاءِ وَ حَيَّا اللَّهُ مُحَمَّداً وَ آلَ مُحَمَّدٍ بِالسَّلَامِ\nاللَّهُمَّ يَا عُدَّتِي عِنْدَ كُرْبَتِي وَ يَا صَاحِبِي عِنْدَ شِدَّتِي وَ يَا وَلِيَّ نِعْمَتِي إِلَهِي وَ إِلَهَ آبَائِي لَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ أَبَداً فَإِنَّكَ إِنْ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ أَقْرُبْ مِنَ الشَّرِّ وَ أَبْعُدْ مِنَ الْخَيْرِ فَآنِسْ فِي الْقَبْرِ وَحْشَتِي وَ اجْعَلْ لِي عَهْداً يَوْمَ أَلْقَاكَ مَنْشُوراً \nثُمَّ يُوصِي بِحَاجَتِهِ وَ تَصْدِيقُ هَذِهِ الْوَصِيَّةِ فِي الْقُرْآنِ فِي السُّورَةِ الَّتِي يَذْكُرُ فِيهَا مَرْيَمَ فِي قَوْلِهِ عَزَّ وَ جَلَّ لا يَمْلِكُونَ الشَّفاعَةَ إِلَّا مَنِ اتَّخَذَ عِنْدَ الرَّحْمنِ عَهْداً فَهَذَا عَهْدُ الْمَيِّتِ\nوَ الْوَصِيَّةُ حَقٌّ عَلَى كُلِّ مُسْلِمٍ أَنْ يَحْفَظَ هَذِهِ الْوَصِيَّةَ وَ يُعَلِّمَهَا وَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) عَلَّمَنِيهَا رَسُولُ اللَّهِ ( صلى الله عليه وآله ) وَ قَالَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) عَلَّمَنِيهَا جَبْرَئِيلُ ( عليه السلام ) .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim narrated to us, from Ali Bin Is’haq, from Al Hassan Bin Hazim Al Kalby son of a sister of Hisham Bin Salim, from Suleyman Bin Ja’far, \nAbu Abdullah<sup style=\"font-weight: normal\">asws</sup> says that Rasool-Allah<sup style=\"font-weight: normal\">saww</sup> said: ‘The one who does not upgrade his bequest (will/inheritance) in the presence of the death, there was a deficiency in his personality and his mind’. It was said, ‘O Rasool-Allah<sup style=\"font-weight: normal\">saww</sup>! And how should the dying ones bequeath?’ \nHe<sup style=\"font-weight: normal\">saww</sup> said: ‘Whenever his death presents itself to him, he gathers the people to him, says, ‘O Allah<sup style=\"font-weight: normal\">azwj</sup>! Originator of the skies and the earth, Knower of the unseen and the seen, the Beneficent, the Merciful. O Allah<sup style=\"font-weight: normal\">azwj</sup>! I hereby oath to You<sup style=\"font-weight: normal\">azwj</sup> in the house of the world that I testify that there is no god except for You<sup style=\"font-weight: normal\">azwj</sup> alone, there is no associate for You<sup style=\"font-weight: normal\">azwj</sup>; and that Muhammad<sup style=\"font-weight: normal\">saww</sup> is Your<sup style=\"font-weight: normal\">azwj</sup> servant and Your<sup style=\"font-weight: normal\">azwj</sup> Rasool<sup style=\"font-weight: normal\">saww</sup>, and that the Paradise is truth, and the Fire is truth, and that Resurrection is truth, and the Reckoning is truth, and the Pre-destination, and the Scale are truth, and that the Religion is as described, and that Al-Islam is as it began, and that the Words are as narrated, and that the Quran is as Revealed, and You<sup style=\"font-weight: normal\">azwj</sup> are Allah<sup style=\"font-weight: normal\">azwj</sup> the Manifest; Recompense Muhammad<sup style=\"font-weight: normal\">saww</sup> with the best of Recompenses, and may Allah<sup style=\"font-weight: normal\">azwj</sup> Greet Muhammad<sup style=\"font-weight: normal\">saww</sup> and the Progeny<sup style=\"font-weight: normal\">asws</sup> of Muhammad<sup style=\"font-weight: normal\">saww</sup> with the Greetings (Al-Salaam). \nO Allah<sup>azwj</sup>! O my Defence during my affliction, and O my Companion during my difficulties, and O Guardian of my Bounties, my God and the God of my fathers, do not leave me to fend for myself even for the blink of an eye, ever, for if You<sup>azwj</sup> were to leave me to fend for myself for the blink of an eye, I would be closer to the evil and remote from the goodness. So, Put my loneliness at ease in my grave, and Make a Pledge for me for the Day I meet You<sup>azwj</sup>, Resurrected’. \nThen he bequeaths with his needs, and ratifies this bequest in the Quran in the Chapter in which Maryam<sup>as</sup> is Mentioned in the Words of the Mighty and Majestic <span class=\"ibTxt\">[19:87] They shall not control intercession, except he who took a Covenant with the Beneficent</span>. So this is the pledge of the dying one’. \nAnd the bequest is a right upon every Muslim that he preserves this bequest and learns it. And Amir Al-Momineen<sup>asws</sup> said: ‘Rasool-Allah<sup>saww</sup> taught me<sup>asws</sup>’, and Rasool-Allah<sup>saww</sup> said: ‘Jibraeel<sup>as</sup> taught me<sup>saww</sup>’."}]}, {"index": 12951, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:1:1:2", "text": "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْوَلِيدِ بْنِ صَبِيحٍ قَالَ صَحِبَنِي مَوْلًى لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) يُقَالُ لَهُ أَعْيَنُ فَاشْتَكَى أَيَّاماً ثُمَّ بَرَأَ ثُمَّ مَاتَ فَأَخَذْتُ مَتَاعَهُ وَ مَا كَانَ لَهُ فَأَتَيْتُ بِهِ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) وَ أَخْبَرْتُهُ أَنَّهُ اشْتَكَى أَيَّاماً ثُمَّ بَرَأَ ثُمَّ مَاتَ قَالَ تِلْكَ رَاحَةُ الْمَوْتِ أَمَا إِنَّهُ لَيْسَ مِنْ أَحَدٍ يَمُوتُ حَتَّى يَرُدَّ اللَّهُ عَزَّ وَ جَلَّ مِنْ سَمْعِهِ وَ بَصَرِهِ وَ عَقْلِهِ لِلْوَصِيَّةِ أَخَذَ أَوْ تَرَكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from Al Hassan Bin Ali, from Hamaad Bin Usman, from Al Waleed Bin Sabeeh who said, \n‘A slave of Abu Abdullah<sup>asws</sup> called Ayn accompanied me. So he complained (of health problems) for some days, then he was cured from it, then died. So I took his belongings and came with these to Abu Abdullah<sup>asws</sup>, and informed him<sup>asws</sup> that he had complained for a few days, then was cured, then died’. He<sup>asws</sup> said: ‘That is the comfort of the death. But, there is no one who died until Allah<sup>azwj</sup> Mighty and Majestic Restores his hearing, and his eyesight, and his mind for the bequest, (either) he takes it or leaves it’."}]}, {"index": 12952, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:1:1:3", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَهُ رَجُلٌ إِنِّي خَرَجْتُ إِلَى مَكَّةَ فَصَحِبَنِي رَجُلٌ وَ كَانَ زَمِيلِي فَلَمَّا أَنْ كَانَ فِي بَعْضِ الطَّرِيقِ مَرِضَ وَ ثَقُلَ ثِقْلًا شَدِيداً فَكُنْتُ أَقُومُ عَلَيْهِ ثُمَّ أَفَاقَ حَتَّى لَمْ يَكُنْ عِنْدِي بِهِ بَأْسٌ فَلَمَّا أَنْ كَانَ الْيَوْمُ الَّذِي مَاتَ فِيهِ أَفَاقَ فَمَاتَ فِي ذَلِكَ الْيَوْمِ فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) مَا مِنْ مَيِّتٍ تَحْضُرُهُ الْوَفَاةُ إِلَّا رَدَّ اللَّهُ عَزَّ وَ جَلَّ عَلَيْهِ مِنْ سَمْعِهِ وَ بَصَرِهِ وَ عَقْلِهِ لِلْوَصِيَّةِ أَخَذَ الْوَصِيَّةَ أَوْ تَرَكَ وَ هِيَ الرَّاحَةُ الَّتِي يُقَالُ لَهَا رَاحَةُ الْمَوْتِ فَهِيَ حَقٌّ عَلَى كُلِّ مُسْلِمٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hamaad Bin Usman, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, ‘A man said to him<sup>asws</sup>, ‘I went out to Makkah, so a man accompanied me, and he was my colleague. So when we were in one of the roads, he fell sick and slackened with intense slackness. I used to take care of him. Then he woke up to the extent that there was no problem with him in my presence. So when it was the day in which he died, he was awake, and he died during that day’. So Abu Abdullah<sup>asws</sup> said: ‘There is no dying one and the death presents itself except that Allah<sup>azwj</sup> Mighty and Majestic Restores to him, his hearing, and his eyesight, and his mind for the bequest. He either takes to the bequeathing or neglects it, and it is the comfort which is called ‘the comfort of death’. So it is a right upon every Muslim (to leave a bequest)’."}]}, {"index": 12953, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:1:1:4", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ الْكِنَانِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ الْوَصِيَّةِ فَقَالَ هِيَ حَقٌّ عَلَى كُلِّ مُسْلِمٍ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzayl, from Abu Al Sabbah al Kinany, \n(The narrator says), ‘I asked Abu Abdullah<sup>asws</sup> about the bequest, so he<sup>asws</sup> said: ‘It is a right upon every Muslim’."}]}, {"index": 12954, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:1:1:5", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) الْوَصِيَّةُ حَقٌّ وَ قَدْ أَوْصَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) فَيَنْبَغِي لِلْمُسْلِمِ أَنْ يُوصِيَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim who said, \n‘Abu Abdullah<sup>asws</sup> said: ‘The bequest is truth, and Rasool-Allah<sup>saww</sup> had bequeathed, so it is befitting for the Muslim that he bequeaths’."}]}]}, "index": "al-kafi:7:1:1", "kind": "verse_list"}