{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:7:1:10",
        "titles": {
          "ar": "باب إِنْفَاذِ الْوَصِيَّةِ عَلَى جِهَتِهَا",
          "en": "Chapter 10 – The enforcement of the bequest upon its commandments"
        }
      }
    ],
    "index": 1997,
    "local_index": 10,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:7:1:11",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 11 – Another Chapter from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 9"
        },
        "path": "/books/al-kafi:7:1:9",
        "titles": {
          "ar": "باب مَنْ أَوْصَى بِوَصِيَّةٍ فَمَاتَ الْمُوصَى لَهُ قَبْلَ الْمُوصِي أَوْ مَاتَ قَبْلَ أَنْ يَقْبِضَهَا",
          "en": "Chapter 9 – One bequeaths with a bequest, for the beneficiary of it dies before the testator, or he dies before taking possession"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:10",
    "titles": {
      "ar": "باب إِنْفَاذِ الْوَصِيَّةِ عَلَى جِهَتِهَا",
      "en": "Chapter 10 – The enforcement of the bequest upon its commandments"
    },
    "verse_count": 5,
    "verse_start_index": 13009,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/24)"
        ],
        "index": 13010,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:10:1",
        "relations": {
          "Mentions": [
            "/books/quran:2:181"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ أَوْصَى بِمَالِهِ فِي سَبِيلِ اللَّهِ فَقَالَ أَعْطِهِ لِمَنْ أَوْصَى بِهِ لَهُ وَ إِنْ كَانَ يَهُودِيّاً أَوْ نَصْرَانِيّاً إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ فَمَنْ بَدَّلَهُ بَعْدَ ما سَمِعَهُ فَإِنَّما إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Hamaad Bin Isa, from Hareyz, from Muhammad Bin Muslim who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who bequeathed with his Wealth in the Way of Allah<sup>azwj</sup>. So he<sup>asws</sup> said: ‘Give it to the one who has bequeathed with it for him, even if he was a Jew or a Christian. Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h181\">[2:181]</a> So the one who alters it after he has heard it, the sin of it then is only upon the one who alters it</span>’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from Hammad ibn ‘Isa from Hariz from Muhammad ibn Muslim who has narrated the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man who has made a will to spend his assets in the way of Allah. He (the Imam) said, ‘You must give it to the designated beneficiary even if he is a Christian or a Jew; Allah, most Blessed, most High, says, “Whoever intentionally changes the will of a deceased person, he has committed a sin. Allah is All-hearing and All-knowing.” <a href=\"/#/books/quran:2#h181\">[2:181]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/25)"
        ],
        "index": 13011,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:10:2",
        "relations": {
          "Mentions": [
            "/books/quran:2:181"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ أَوْصَى بِمَالِهِ فِي سَبِيلِ اللَّهِ قَالَ أَعْطِ لِمَنْ أَوْصَى لَهُ بِهِ وَ إِنْ كَانَ يَهُودِيّاً أَوْ نَصْرَانِيّاً إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ فَمَنْ بَدَّلَهُ بَعْدَ ما سَمِعَهُ فَإِنَّما إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>), regarding a man who bequeathed his wealth in the Way of Allah<sup>azwj</sup>’. He<sup>asws</sup> said: ‘Give it to the one who has been bequeathed by it from him, even if he was a Jew or a Christian. Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h181\">[2:181]</a> So the one who alters it after he has heard it, the sin of it then is only upon the one who alters it</span>’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Ali ibn al-Hakam from m al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has narrated the following: “This is about the case of a man who has made a will to spend his asset in the way of Allah. One of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘You must give it to the designated beneficiary even if he is a Christian or a Jew; Allah, most Blessed, most High, says, “Whoever intentionally changes the will of a deceased person, he has committed a sin. Allah is All- hearing and All-knowing.” <a href=\"/#/books/quran:2#h181\">[2:181]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/25)"
        ],
        "index": 13012,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:10:3",
        "relations": {
          "Mentions": [
            "/books/quran:2:181"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ كَتَبَ أَبُو جَعْفَرٍ ( عليه السلام ) إِلَى جَعْفَرٍ وَ مُوسَى وَ فِيمَا أَمَرْتُكُمَا مِنَ الْإِشْهَادِ بِكَذَا وَ كَذَا نَجَاةٌ لَكُمَا فِي آخِرَتِكُمَا وَ إِنْفَاذٌ لِمَا أَوْصَى بِهِ أَبَوَاكُمَا وَ بِرٌّ مِنْكُمَا لَهُمَا وَ احْذَرَا أَنْ لَا تَكُونَا بَدَّلْتُمَا وَصِيَّتَهُمَا وَ لَا غَيَّرْتُمَاهَا عَنْ حَالِهَا لِأَنَّهُمَا قَدْ خَرَجَا مِنْ ذَلِكَ رَضِيَ اللَّهُ عَنْهُمَا وَ صَارَ ذَلِكَ فِي رِقَابِكُمَا وَ قَدْ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى فِي كِتَابِهِ فِي الْوَصِيَّةِ فَمَنْ بَدَّلَهُ بَعْدَ ما سَمِعَهُ فَإِنَّما إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Ali Bin Mahziyar who said, ",
            "‘Abu Ja’far<sup>asws</sup> wrote to Ja’far<sup>asws</sup> and Musa<sup>asws</sup>: ‘And with regards to what I<sup>asws</sup> am ordering both of you<sup>asws</sup>, from the (appointment of) witnessed with such and such, is a safety for you<sup>asws</sup> in your<sup>asws</sup> Hereafter, and the enforcement of what I<sup>asws</sup>, your<sup>asws</sup> father, am bequeathing with, and your<sup>asws</sup> righteousness from you<sup>asws</sup> to both of them<sup>asws</sup> (parents), and cautioning that you<sup>asws</sup> do not replace their<sup>asws</sup> bequest, nor change it from its state, because they<sup>asws</sup> both would have exited from that, may Allah<sup>azwj</sup> be Pleased from them<sup>asws</sup>, and that has come to be upon your<sup>asws</sup> necks. And Allah<sup>azwj</sup> Blessed and High has Said in His<sup>azwj</sup> Book with regards to the bequest <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h181\">[2:181]</a> So the one who alters it after he has heard it, the sin of it then is only upon the one who alters it; surely Allah is Hearing, Knowing</span>’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad from Ali ibn Mahziyar from who has narrated the following: “Abu Ja‘far, Alayhi al-Salam, wrote to Ja‘far and Musa, this instruction. ‘In the matter of my commanding you to appoint witnesses to so and so issues; it is because it is for your safety and protection in the next world in matters of executing the will, as it requires, that your parents have made to you and your being kind to your parents. You must remain prudent. You must not change their will and alter it from its original condition because they are no more. May Allah be happy with them. It, however, has remained on your shoulder. Allah, most Blessed, most High, has said in His book, “Whoever intentionally changes the will of a deceased person, he has committed a sin. Allah is All-hearing and All-knowing.” <a href=\"/#/books/quran:2#h181\">[2:181]</a>’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/25)"
        ],
        "index": 13013,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:10:4",
        "relations": {
          "Mentions": [
            "/books/quran:2:181"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ الْوَلِيدِ عَنْ يُونُسَ بْنِ يَعْقُوبَ أَنَّ رَجُلًا كَانَ بِهَمَذَانَ ذَكَرَ أَنَّ أَبَاهُ مَاتَ وَ كَانَ لَا يَعْرِفُ هَذَا الْأَمْرَ فَأَوْصَى بِوَصِيَّةٍ عِنْدَ الْمَوْتِ وَ أَوْصَى أَنْ يُعْطَى شَيْ‏ءٌ فِي سَبِيلِ اللَّهِ فَسُئِلَ عَنْهُ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) كَيْفَ يُفْعَلُ بِهِ فَأَخْبَرْنَاهُ أَنَّهُ كَانَ لَا يَعْرِفُ هَذَا الْأَمْرَ فَقَالَ لَوْ أَنَّ رَجُلًا أَوْصَى إِلَيَّ أَنْ أَضَعَ فِي يَهُودِيٍّ أَوْ نَصْرَانِيٍّ لَوَضَعْتُهُ فِيهِمَا إِنَّ اللَّهَ عَزَّ وَ جَلَّ يَقُولُ فَمَنْ بَدَّلَهُ بَعْدَ ما سَمِعَهُ فَإِنَّما إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ فَانْظُرُوا إِلَى مَنْ يَخْرُجُ إِلَى هَذَا الْوَجْهِ يَعْنِي [بَعْضَ] الثُّغُورِ فَابْعَثُوا بِهِ إِلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, from Muhammad Bin Al Waleed, from Yunus Bin Yaqoub that, ",
            "‘A man was at Hamdaan mentioned that his father died and he did not recognise this matter (Al-Wilayah), so he bequeathed with a bequest during the death, and bequeathed that something be given in the Way of Allah<sup>azwj</sup> (Jihad). So he asked Abu Abdullah<sup>asws</sup> how he should deal with it. So he informed him<sup>asws</sup> he did not recognise this matter (Al Wilayah)’. So he<sup>asws</sup> said: ‘Even if a man had bequeathed to me that I<sup>asws</sup> should place it among the Jews or the Christians, I<sup>asws</sup> would have placed among these two. Allah<sup>azwj</sup> Mighty and Majestic is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h181\">[2:181]</a> So the one who alters it after he has heard it, the sin of it then is only upon the one who alters it</span>. Therefore, look at the one who has gone out to these direction, meaning one of the borders, so send it to him’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad from Muhammad ibn al-Walid from Yunus ibn Ya’qub who has narrated the following: “A man of Hamadan has said that his father died but he did not know this fact (the Divine Authority of A’immah). He made a will when he was about to die to give something in the way of Allah. He (the man from Hamadan) asked abu ‘Abd Allah, Alayhi al-Salam, about it and that he did not know this fact (the Divine Authority of A’immah). He (the Imam) said, ‘If the man had appointed me to execute his will to give to a Jews or Christians, I would have given it to them because Allah, most Majestic, most Glorious, says, “Whoever intentionally changes the will of a deceased person, he has committed a sin. Allah is All-hearing and All-knowing.” <a href=\"/#/books/quran:2#h181\">[2:181]</a> You must see who serves as guards and defenders of the borders; and give it to them.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/26)"
        ],
        "index": 13014,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:10:5",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ مُحَمَّدِ بْنِ سُلَيْمَانَ عَنِ الْحُسَيْنِ بْنِ عُمَرَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) إِنَّ رَجُلًا أَوْصَى إِلَيَّ بِشَيْ‏ءٍ فِي السَّبِيلِ فَقَالَ لِيَ اصْرِفْهُ فِي الْحَجِّ قَالَ قُلْتُ لَهُ أَوْصَى إِلَيَّ فِي السَّبِيلِ قَالَ اصْرِفْهُ فِي الْحَجِّ فَإِنِّي لَا أَعْلَمُ شَيْئاً مِنْ سَبِيلِهِ أَفْضَلَ مِنَ الْحَجِّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammmad Bin Ahmad, from Muhammad Bin Isa, from Muhammad Bin Suleyman, from Al Husayn Bin Umar who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘A man (in Wilayah) bequeathed something in the Way (Jihad)’. So he<sup>asws</sup> said to me: ‘Spend it regarding the Hajj’. I said to him<sup>asws</sup>, ‘He bequeathed to me (to be in) the Way (Jihad)’. He<sup>asws</sup> said: ‘Spend it regarding the Hajj, for I<sup>asws</sup> do not know of anything from His<sup>azwj</sup> Way being superior than the Hajj’."
          ],
          "en.sarwar": [
            "5. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ‘Isa from Muhammad ibn Sulayman from al- Husayn ibn ‘Umar who has narrated the following: “I once asked abu ‘Abd Allah, Alayhi al-Salam, about the case of a man who has made a will to spend in the way of Allah. He (the Imam) said to me to spend it for al-Haj j . I said that he has said to spend it in the way of Allah. He (the Imam) said, ‘Spend for al-Hajj because I do not see anything in His way better than al-Hajj.”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:10",
  "kind": "verse_list"
}