{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:7:1:11",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 11 – Another Chapter from it"
        }
      }
    ],
    "index": 1998,
    "local_index": 11,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:7:1:12",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 12 – Another Chapter from it"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 10"
        },
        "path": "/books/al-kafi:7:1:10",
        "titles": {
          "ar": "باب إِنْفَاذِ الْوَصِيَّةِ عَلَى جِهَتِهَا",
          "en": "Chapter 10 – The enforcement of the bequest upon its commandments"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:11",
    "titles": {
      "ar": "باب آخَرُ مِنْهُ",
      "en": "Chapter 11 – Another Chapter from it"
    },
    "verse_count": 2,
    "verse_start_index": 13014,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/27)"
        ],
        "index": 13015,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:11:1",
        "refs": {
          "Quran": [
            "/books/quran:2:181"
          ]
        },
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنْ حَجَّاجٍ الْخَشَّابِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنِ امْرَأَةٍ أَوْصَتْ إِلَيَّ بِمَالٍ أَنْ يُجْعَلَ فِي سَبِيلِ اللَّهِ فَقِيلَ لَهَا نَحُجُّ بِهِ فَقَالَتِ اجْعَلْهُ فِي سَبِيلِ اللَّهِ فَقَالُوا لَهَا فَنُعْطِيهِ آلَ مُحَمَّدٍ ( عليهم السلام ) قَالَتِ اجْعَلْهُ فِي سَبِيلِ اللَّهِ ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) اجْعَلْهُ فِي سَبِيلِ اللَّهِ كَمَا أَمَرَتْ قُلْتُ مُرْنِي كَيْفَ أَجْعَلُهُ قَالَ اجْعَلْهُ كَمَا أَمَرَتْكَ إِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ فَمَنْ بَدَّلَهُ بَعْدَ ما سَمِعَهُ فَإِنَّما إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ أَ رَأَيْتَكَ لَوْ أَمَرَتْكَ أَنْ تُعْطِيَهُ يَهُودِيّاً كُنْتَ تُعْطِيهِ نَصْرَانِيّاً ",
          "قَالَ فَمَكَثْتُ بَعْدَ ذَلِكَ ثَلَاثَ سِنِينَ ثُمَّ دَخَلْتُ عَلَيْهِ فَقُلْتُ لَهُ مِثْلَ الَّذِي قُلْتُ أَوَّلَ مَرَّةٍ فَسَكَتَ هُنَيْئَةً ثُمَّ قَالَ هَاتِهَا قُلْتُ مَنْ أُعْطِيهَا قَالَ عِيسَى شَلَقَانَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Ali Bin Al Hakam, from Hajaaj Al Khashab, ",
            "(The narrator says): ‘I asked Abu Abdullah<sup>asws</sup> about a woman who bequeathed to me with wealth that I should make it to be in the Way of Allah<sup>azwj</sup>. So it was said to her, ‘We can perform Hajj with it?’ So she said, ‘Make it to be in the Way of Allah<sup>azwj</sup>’. So they said to her, ‘Shall we give it to the Progeny<sup>asws</sup> of Muhammad<sup>saww</sup>?’ She said, ‘Make it to be in the Way of Allah<sup>azwj</sup>’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘Make it to be in the Way of Allah<sup>azwj</sup> just as she had ordered’. I said, ‘Order me how I should make it to be’. He<sup>asws</sup> said: ‘Make it to be just as she had ordered you. Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h181\">[2:181]</a> So the one who alters it after he has heard it, the sin of it then is only upon the one who alters it; surely Allah is Hearing, Knowing</span>. Do you see that if she had ordered you to give it to a Jew, would you have given it to a Christian?’",
            "He (the narrator) said, ‘So I remained after that, for three years, then I came over to him<sup>asws</sup>, so I said to him<sup>asws</sup> similar to what I had said the first time. So he<sup>asws</sup> was silent for a while, then said: ‘Give it’. I said, ‘Whom what I give it to?’ He<sup>asws</sup> said: ‘Isa Shalqan’."
          ],
          "en.sarwar": [
            "1. A number of our people have narrated from Ahmad ibn Muhammad ibn ‘Isa from Ali ibn al-Hakam from al-Hajjaj ibn al-Khashshab who has narrated the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a woman who made a will to spend in the way of Allah. She was asked if it could be spent for al-Hajj. She said, ’Spend it in the way of Allah.’ They asked, ‘Can we give to the family of Muhammad, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause ?’ She said, ‘Spend it in the way of Allah.’ Abu ‘Abd Allah, Alayhi al-Salam, then said, ‘Spend in the way of Allah as you are required.’ I then said, ‘Command me how to spend it.’ He (the Imam) said, ‘Spend it as she has commanded you. Allah, most Blessed, most High, has said, “Whoever intentionally changes the will of a deceased person, he has committed a sin. Allah is All-hearing and All-knowing.” <a href=\"/#/books/quran:2#h181\">[2:181]</a> You must consider if she had asked you to give it to a Jew, would you give it to a Christian?’ He (the narrator) has said. ‘I waited thereafter for three years; then I visited him (the Imam) and asked as I had asked him before. He (the Imam) remained quiet for a while, then said, ‘Send it.’ I then asked, ‘To who must I send it?’ He (the Imam) said, ‘Give it to ‘Isa Shalqan.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/27)"
        ],
        "index": 13016,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:11:2",
        "text": [
          "مُحَمَّدُ بْنُ جَعْفَرٍ الرَّزَّازُ عَنْ مُحَمَّدِ بْنِ عِيسَى وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنِ الْحَسَنِ بْنِ رَاشِدٍ قَالَ سَأَلْتُ الْعَسْكَرِيَّ ( عليه السلام ) بِالْمَدِينَةِ عَنْ رَجُلٍ أَوْصَى بِمَالٍ فِي سَبِيلِ اللَّهِ فَقَالَ سَبِيلُ اللَّهِ شِيعَتُنَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ja’far Al Razaaz, from Muhammad Bin Isa and Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Muhammad Bin Isa Bin Ubeyd, from Al Hassan Bin Rashid who said, ",
            "‘I asked (Imam) Al-Askary<sup>asws</sup> at Al-Medina about a man who had bequeathed wealth to be in the Way of Allah<sup>azwj</sup>. So he<sup>asws</sup> said: ‘The Way of Allah<sup>azwj</sup>, is (a reference to) our<sup>asws</sup> Shias’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Ja‘far al-Raziy has narrated from Muhammad ibn ‘Isa and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa ibn ‘Ubayd from al-Hassan ibn Rashid who has narrated the following: “I once asked al-‘Askariy, Alayhi al-Salam, in al-Madinah about the case of a man who has made a will to spend in the way of Allah. He (the Imam) said, ‘In the way of Allah is our Shi ’ah (followers).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:11",
  "kind": "verse_list"
}