{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 12"
        },
        "path": "/books/al-kafi:7:1:12",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 12 – Another Chapter from it"
        }
      }
    ],
    "index": 1999,
    "local_index": 12,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 13"
        },
        "path": "/books/al-kafi:7:1:13",
        "titles": {
          "ar": "باب مَنْ أَوْصَى بِعِتْقٍ أَوْ صَدَقَةٍ أَوْ حَجٍّ",
          "en": "Chapter 13 – One who bequeaths with the libration of a slave, or charity, or Hajj"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 11"
        },
        "path": "/books/al-kafi:7:1:11",
        "titles": {
          "ar": "باب آخَرُ مِنْهُ",
          "en": "Chapter 11 – Another Chapter from it"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:12",
    "titles": {
      "ar": "باب آخَرُ مِنْهُ",
      "en": "Chapter 12 – Another Chapter from it"
    },
    "verse_count": 2,
    "verse_start_index": 13016,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/27)"
        ],
        "index": 13017,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:12:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ أَبِي طَالِبٍ عَبْدِ اللَّهِ بْنِ الصَّلْتِ قَالَ كَتَبَ الْخَلِيلُ بْنُ هَاشِمٍ إِلَى ذِي الرِّئَاسَتَيْنِ وَ هُوَ وَالِي نَيْسَابُورَ أَنَّ رَجُلًا مِنَ الْمَجُوسِ مَاتَ وَ أَوْصَى لِلْفُقَرَاءِ بِشَيْ‏ءٍ مِنْ مَالِهِ فَأَخَذَهُ قَاضِي نَيْسَابُورَ فَجَعَلَهُ فِي فُقَرَاءِ الْمُسْلِمِينَ فَكَتَبَ الْخَلِيلُ إِلَى ذِي الرِّئَاسَتَيْنِ بِذَلِكَ فَسَأَلَ الْمَأْمُونَ عَنْ ذَلِكَ فَقَالَ لَيْسَ عِنْدِي فِي ذَلِكَ شَيْ‏ءٌ فَسَأَلَ أَبَا الْحَسَنِ ( عليه السلام ) فَقَالَ أَبُو الْحَسَنِ ( عليه السلام ) إِنَّ الْمَجُوسِيَّ لَمْ يُوصِ لِفُقَرَاءِ الْمُسْلِمِينَ وَ لَكِنْ يَنْبَغِي أَنْ يُؤْخَذَ مِقْدَارُ ذَلِكَ الْمَالِ مِنْ مَالِ الصَّدَقَةِ فَيُرَدَّ عَلَى فُقَرَاءِ الْمَجُوسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abu Talib Abdullah Bin Al Salt who said, ",
            "‘Al-Khaleel Bin Hashim wrote to Zil Riyasatayn (One with two governerships), and he was the governor at Neysabour, that a man from the Magians had died and bequeathed to the poor with something from his wealth. So the judge of Neysabour took possession and made it to be among the poor Muslims. So Al-Khaleel wrote to Zil Riyasatayn and said. So he asked Al-Mamoun about that. So he said, ‘There is nothing with me with regards to that, anything’. So he asked Abu Al-Hassan<sup>asws</sup>. So Abu Al-Hassan<sup>asws</sup> said: ‘The Magians do not bequeath of the poor Muslims, but it is befitting that you take the measured amount of that wealth from the charity monies (from the public treasury), so it should be distributed upon the poor Magians’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from abu Talib ‘ Abd Allah ibn al-Salt who has narrated the following: “Once, Khalil ibn Hashim wrote to Dhi al-Riyasatayn who was the governor of Nisabur and asked that a Zoroastrian man has died and has made a will about a certain amount from his assets for the poor. The judge of Nisabur took the amount and gave it to the poor Muslims. Dhu al-Riyasatayn asked Ma’mun about it. Ma’mun who did not have any answer for it asked abu al-Hassan, ‘Alayhi al-Salam, about it and abu al-Hassan, ‘Alayhi al-Salam, said, ‘A Zoroastrian man does not make a will for the poor Muslims. It is proper to take that amount from the treasury of charity and return it to the poor Zoroastrians.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/28)"
        ],
        "index": 13018,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:12:2",
        "relations": {
          "Mentions": [
            "/books/quran:2:181"
          ]
        },
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ الرَّيَّانِ بْنِ شَبِيبٍ قَالَ أَوْصَتْ مَارِدَةُ لِقَوْمٍ نَصَارَى فَرَّاشِينَ بِوَصِيَّةٍ فَقَالَ أَصْحَابُنَا اقْسِمْ هَذَا فِي فُقَرَاءِ الْمُؤْمِنِينَ مِنْ أَصْحَابِكَ فَسَأَلْتُ الرِّضَا ( عليه السلام ) فَقُلْتُ إِنَّ أُخْتِي أَوْصَتْ بِوَصِيَّةٍ لِقَوْمٍ نَصَارَى وَ أَرَدْتُ أَنْ أَصْرِفَ ذَلِكَ إِلَى قَوْمٍ مِنْ أَصْحَابِنَا مُسْلِمِينَ فَقَالَ أَمْضِ الْوَصِيَّةَ عَلَى مَا أَوْصَتْ بِهِ قَالَ اللَّهُ تَبَارَكَ وَ تَعَالَى فَإِنَّما إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Rayyan Bin Shuayb who said, ",
            "‘Maradat bequeathed to a group of Christian workers, with a bequest. But I intended to, ‘Distribute this among the poor Muslims from your companions’. So I asked Al-Reza<sup>asws</sup>, ‘So I said, ‘My sister bequeathed with a bequest for a group of Christians, and I intended to spend that upon a group of our Muslim companions’. So he<sup>asws</sup> said: ‘Enforce the bequest upon what she had bequeathed with. Allah<sup>azwj</sup> Blessed and High Says <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h181\">[2:181]</a> the sin of it then is only upon the one who alters it</span>’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father from al-Rayyan ibn Shabib who has narrated the following: “Maridah made a will for the Christians who worked as maintenance people. Our people said to spend it on the poor believers of your people. I then asked al-Rida’, ‘Alayhi al-Salam, that my sister has made a will for Christian persons and I wanted to spend it for our Muslim people. He (the Imam) said, ‘You must execute the will as you are required. Allah, most Blessed, most High, has said, “Whoever intentionally changes the will of a deceased person, he has committed a sin. Allah is All-hearing and All-knowing.” <a href=\"/#/books/quran:2#h181\">[2:181]</a>”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:12",
  "kind": "verse_list"
}