{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 15"
        },
        "path": "/books/al-kafi:7:1:15",
        "titles": {
          "ar": "باب أَنَّ الْوَصِيَّ إِذَا كَانَتِ الْوَصِيَّةُ فِي حَقٍّ فَغَيَّرَهَا فَهُوَ ضَامِنٌ",
          "en": "Chapter 15 – If the executor, when the bequest was right, so he changes it, so he is responsible"
        }
      }
    ],
    "index": 2002,
    "local_index": 15,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 16"
        },
        "path": "/books/al-kafi:7:1:16",
        "titles": {
          "ar": "باب أَنَّ الْمُدَبَّرَ مِنَ الثُّلُثِ",
          "en": "Chapter 16 – The Mudabbar (one whose emancipation is conditional upon the death of the testator) is from the third"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 14"
        },
        "path": "/books/al-kafi:7:1:14",
        "titles": {
          "ar": "باب أَنَّ مَنْ حَافَ فِي الْوَصِيَّةِ فَلِلْوَصِيِّ أَنْ يَرُدَّهَا إِلَى الْحَقِّ",
          "en": "Chapter 14 – If one is unjust in the bequest, so it is for the executor that he returns it to the right"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:15",
    "titles": {
      "ar": "باب أَنَّ الْوَصِيَّ إِذَا كَانَتِ الْوَصِيَّةُ فِي حَقٍّ فَغَيَّرَهَا فَهُوَ ضَامِنٌ",
      "en": "Chapter 15 – If the executor, when the bequest was right, so he changes it, so he is responsible"
    },
    "verse_count": 3,
    "verse_start_index": 13038,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/35)"
        ],
        "index": 13039,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:15:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ حُمَيْدُ بْنُ زِيَادٍ عَنْ عُبَيْدِ اللَّهِ بْنِ أَحْمَدَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ زَيْدٍ النَّرْسِيِّ عَنْ عَلِيِّ بْنِ فَرْقَدٍ صَاحِبِ السَّابِرِيِّ قَالَ أَوْصَى إِلَيَّ رَجُلٌ بِتَرِكَتِهِ وَ أَمَرَنِي أَنْ أَحُجَّ بِهَا عَنْهُ فَنَظَرْتُ فِي ذَلِكَ فَإِذَا شَيْ‏ءٌ يَسِيرٌ لَا يَكْفِي لِلْحَجِّ فَسَأَلْتُ أَبَا حَنِيفَةَ وَ فُقَهَاءَ أَهْلِ الْكُوفَةِ فَقَالُوا تَصَدَّقْ بِهَا عَنْهُ ",
          "فَلَمَّا حَجَجْتُ لَقِيتُ عَبْدَ اللَّهِ بْنَ الْحَسَنِ فِي الطَّوَافِ فَسَأَلْتُهُ وَ قُلْتُ لَهُ إِنَّ رَجُلًا مِنْ مَوَالِيكُمْ مِنْ أَهْلِ الْكُوفَةِ مَاتَ وَ أَوْصَى بِتَرِكَتِهِ إِلَيَّ وَ أَمَرَنِي أَنْ أَحُجَّ بِهَا عَنْهُ فَنَظَرْتُ فِي ذَلِكَ فَلَمْ يَكْفِ لِلْحَجِّ فَسَأَلْتُ مَنْ قِبَلَنَا مِنَ الْفُقَهَاءِ فَقَالُوا تَصَدَّقْ بِهَا فَتَصَدَّقْتُ بِهَا فَمَا تَقُولُ فَقَالَ لِي هَذَا جَعْفَرُ بْنُ مُحَمَّدٍ فِي الْحِجْرِ فَأْتِهِ وَ سَلْهُ ",
          "قَالَ فَدَخَلْتُ الْحِجْرَ فَإِذَا أَبُو عَبْدِ اللَّهِ ( عليه السلام ) تَحْتَ الْمِيزَابِ مُقْبِلٌ بِوَجْهِهِ عَلَى الْبَيْتِ يَدْعُو ثُمَّ الْتَفَتَ إِلَيَّ فَرَآنِي فَقَالَ مَا حَاجَتُكَ قُلْتُ جُعِلْتُ فِدَاكَ إِنِّي رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ مِنْ مَوَالِيكُمْ قَالَ فَدَعْ ذَا عَنْكَ حَاجَتُكَ قُلْتُ رَجُلٌ مَاتَ وَ أَوْصَى بِتَرِكَتِهِ أَنْ أَحُجَّ بِهَا عَنْهُ فَنَظَرْتُ فِي ذَلِكَ فَلَمْ يَكْفِ لِلْحَجِّ فَسَأَلْتُ مَنْ عِنْدَنَا مِنَ الْفُقَهَاءِ فَقَالُوا تَصَدَّقْ بِهَا فَقَالَ مَا صَنَعْتَ قُلْتُ تَصَدَّقْتُ بِهَا فَقَالَ ضَمِنْتَ إِلَّا أَنْ يَكُونَ لَا يَبْلُغُ أَنْ يُحَجَّ بِهِ مِنْ مَكَّةَ فَإِنْ كَانَ لَا يَبْلُغُ أَنْ يُحَجَّ بِهِ مِنْ مَكَّةَ فَلَيْسَ عَلَيْكَ ضَمَانٌ وَ إِنْ كَانَ يَبْلُغُ بِهِ مِنْ مَكَّةَ فَأَنْتَ ضَامِنٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Hameed Bin Ziyad, from Ubeydullah Bin Ahmad, both together from Ibn Abu Umeyr, from Zayd Al Narsy, from Ali Bin Farqad, from Saahib Al Sabiry who said, ",
            "‘A man bequeathed to me with what he left and ordered me that I should perform Hajj with it on his behalf. So I looked into that, so it was something small, not sufficient for the Hajj. So I asked Abu Haneefa and the jurists of the people of Al-Kufa. So they said, ‘Give charity with it on his behalf.",
            "So when I went for Hajj, I met Abdullah Bin Al-Hassan during the circumambulation. So I asked him and said to him that a man your friends from the people of Al-Kufa died and bequeathed to me with what he left to me, and ordered me that I should go to Hajj with it on his behalf. So I looked into that, but it was not sufficient for the Hajj. So I asked the jurists from our area, so they said, ‘Give charity with it’. So I gave charity with it. So what are you saying?’ So he said to me, ‘This here is Ja’far Bin Muhammad<sup>asws</sup> at the (Black) Stone, so go over to him<sup>asws</sup> and ask him<sup>asws</sup>’. ",
            "He (the narrator) said, ‘So I went over to the (Black) Stone, so there was Abu Abdullah<sup>asws</sup> beneath the groove, facing with his<sup>asws</sup> face towards the House (Kabah), supplicating. Then he<sup>asws</sup> turned towards me, so he<sup>asws</sup> saw me, so he<sup>asws</sup> said: ‘What is your need?’ I said, ‘May I be sacrificed for you<sup>asws</sup>! I am a man from Al-Kufa, from the ones in your<sup>asws</sup> Wilayah’. He<sup>asws</sup> said: ‘Leave that. What is your need?’ I said, ‘A man died and bequeathed to me with his legacy that I should go to Hajj with it on his behalf. So, I looked into that, but it was no sufficient for the Hajj. So I asked the ones who are in our presence, from the jurists, so they said, ‘Give in charity with it’. So he<sup>asws</sup> said: ‘What did you do?’ I said, ‘I gave in charity with it’. So he<sup>asws</sup> said: ‘You are responsible, except if it happened not to be sufficient to perform Hajj with it from Makkah. So if it did not reach that (sufficiency) that you could have performed Hajj with it from Makkah, so there is no responsibility upon you, and if it was so that it reached (the sufficiency) to perform Hajj with it from Makkah, so you are responsible’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Humayd ibn Ziyad has narrated from bud Allah ibn Ahmad all from ibn abu ‘Umayr from Zayd al-Narsiy from Ali ibn Farqad Sahib al-Sabiriy who has narrated the following: “A man made a will and asked me to pay for al-Hajj from his legacy, but when I examined his legacy it was not sufficient. I then asked abu Hanifah and the jurists of al-Kufah. They said that I must give as charity on his behalf. When I performed al-Hajj, I met ‘Abd Allah ibn al-Hassan during tawaf. I asked him, saying, ‘A man of your followers of the people of al-Kufah has died and has made a will in which he has asked me to perform al-Hajj for him from his legacy, but when I examined his legacy, it is not sufficient for al-Hajj and I asked the jurist in our area. They said that I must pay charity for him and I did so. What do you say about it?’ He said, ‘This is Ja‘far ibn Muhammad in al-Hijr. Go and ask him.’ I went in al-Hijr and found abu ‘Abd Allah, ‘Alayhi al-Salam, under al-Mizab facing the house and praying. He (the Imam) turned to me, saw me and asked, ‘What do you need?’ I then said, ‘I pray to Allah to keep my soul in service for your cause, I am a man from al-Kufah of your friends.’ He (the Imam) said, ‘Leave it. What do you need?’ I then said, ‘A man has died and has made a will that al- Hajj must be performed from his legacy. I examined it and it is not sufficient for al-Hajj. I then asked the jurists about it in our area. They said that I must pay charity on his behalf.’ He (the Imam) said, ‘What did you do with it?’ I replied, ‘I gave it in charity.’ He (the Imam) said, ‘You are responsible, unless it was not sufficient even for performing al-Hajj from Makkah, but if it was sufficient for performing al-Hajj from Makkah, then you are responsible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/36)"
        ],
        "index": 13040,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:15:2",
        "refs": {
          "Mentions": [
            "/books/quran:2:181"
          ]
        },
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ سِنَانٍ عَنِ ابْنِ مُسْكَانَ عَنْ أَبِي سَعِيدٍ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> قَالَ سُئِلَ عَنْ رَجُلٍ أَوْصَى بِحَجَّةٍ فَجَعَلَهَا وَصِيُّهُ فِي نَسَمَةٍ فَقَالَ يَغْرَمُهَا وَصِيُّهُ وَ يَجْعَلُهَا فِي حَجَّةٍ كَمَا أَوْصَى بِهِ فَإِنَّ اللَّهَ تَبَارَكَ وَ تَعَالَى يَقُولُ فَمَنْ بَدَّلَهُ بَعْدَ ما سَمِعَهُ فَإِنَّما إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Sinan, from Ibn Muskan, from Abu Saeed, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, ‘He<sup>asws</sup> was asked about a man who bequeathed for the Hajj, so his executor made it to be regarding (freeing) a person. So he<sup>asws</sup> said: ‘His executor should be penalized, and he would have to make it to be regarding a Hajj just as he had been bequeathed with, for Allah<sup>azwj</sup> Blessed and High is Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h181\">[2:181]</a> So the one who alters it after he has heard it, the sin of it then is only upon the one who alters it</span>’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn Sinan from ibn Muskan from abu Sa‘id who has narrated the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about the case of a man who made a will for al- Hajj but the executor of his will spent it to set free an enslaved soul. He (the Imam) said, ‘The executor of the will is responsible to pay for his al-Hajj as the will required. Allah, most Blessed, most High, has said, ‘Whoever intentionally changes the will of a deceased person, he has committed a sin. Allah is All-hearing and All-knowing.’ <a href=\"/#/books/quran:2#h181\">[2:181]</a>” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/36)"
        ],
        "index": 13041,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:15:3",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ مُحَمَّدِ بْنِ مَارِدٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ أَوْصَى إِلَى رَجُلٍ وَ أَمَرَهُ أَنْ يُعْتِقَ عَنْهُ نَسَمَةً بِسِتِّمِائَةِ دِرْهَمٍ مِنْ ثُلُثِهِ فَانْطَلَقَ الْوَصِيُّ فَأَعْطَى السِّتَّمِائَةِ دِرْهَمٍ رَجُلًا يَحُجُّ بِهَا عَنْهُ قَالَ فَقَالَ أَرَى أَنْ يَغْرَمَ الْوَصِيُّ مِنْ مَالِهِ سِتَّمِائَةِ دِرْهَمٍ وَ يَجْعَلَ السِّتَّمِائَةِ دِرْهَمٍ فِيمَا أَوْصَى بِهِ الْمَيِّتُ مِنْ نَسَمَةٍ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Muhammad Bin Marad who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who bequeathed to a man and ordered him that he should emancipate a person on his behalf with six hundred Dirham from his third. So the executor went and gave six hundred Dirhams to a man to perform Hajj with it on his (testator’s) behalf. So he<sup>asws</sup> said: ‘I<sup>asws</sup> see that the executor be penalised six hundred Dirhams from his own wealth with regards to what the deceased had bequeathed him with, from (freeing) a person’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Muhammad ibn Marid who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who made a will to set free a slave for six hundred dirham but the executor of his will gave six hundred dirham to perform al-Hajj for the deceased. He (the Imam) said, ‘As I see the executor of the will must pay six hundred dirham from his own assets to set free a slave for the deceased.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:15",
  "kind": "verse_list"
}