{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:7:1", "titles": {"ar": "كتاب  الْوَصَايَا ", "en": "THE BOOK OF BEQUESTS"}}, {"indexed_titles": {"en": "Chapter 18"}, "path": "/books/al-kafi:7:1:18", "titles": {"ar": "باب مَنْ أَوْصَى وَ عَلَيْهِ دَيْنٌ", "en": "Chapter 18 – One who bequeaths and upon his is a debt"}}], "index": 1996, "local_index": 18, "part_type": "Chapter", "path": "/books/al-kafi:7:1:18", "titles": {"ar": "باب مَنْ أَوْصَى وَ عَلَيْهِ دَيْنٌ", "en": "Chapter 18 – One who bequeaths and upon his is a debt"}, "verse_count": 7, "verse_start_index": 13037, "verse_translations": [{"id": "en.hubeali", "lang": "en", "name": "HubeAli.com"}], "verses": [{"index": 13038, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:1:18:1", "text": ["<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( صلوات الله عليه ) إِنَّ الدَّيْنَ قَبْلَ الْوَصِيَّةِ ثُمَّ الْوَصِيَّةَ عَلَى إِثْرِ الدَّيْنِ ثُمَّ الْمِيرَاثَ بَعْدَ الْوَصِيَّةِ فَإِنَّ أَوَّلَ الْقَضَاءِ كِتَابُ اللَّهِ عَزَّ وَ جَلَّ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father, and a number of our companions, from Sahl Bin Ziyad, both together from Ibn Abu Najran, from Aasim Bin Hameed, from Muhammad Bin Qays, ", "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The debt is before the bequest, then the bequest is upon the footsteps of the debt, then the inheritance after the bequest, for the foremost of the judges is the Book of Allah<sup>azwj</sup> Mighty and Majestic’."]}}, {"index": 13039, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:1:18:2", "text": ["الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ رَجُلٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ أَوْصَى إِلَى رَجُلٍ وَ عَلَيْهِ دَيْنٌ فَقَالَ يَقْضِي الرَّجُلُ مَا عَلَيْهِ مِنْ دَيْنِهِ وَ يَقْسِمُ مَا بَقِيَ بَيْنَ الْوَرَثَةِ قُلْتُ فَسُرِقَ مَا كَانَ أَوْصَى بِهِ مِنَ الدَّيْنِ مِمَّنْ يُؤْخَذُ الدَّيْنُ أَ مِنَ الْوَرَثَةِ قَالَ لَا يُؤْخَذُ مِنَ الْوَرَثَةِ وَ لَكِنَّ الْوَصِيَّ ضَامِنٌ لَهَا ."], "translations": {"en.hubeali": ["Al Husayn Bin Muhammad, from Moala Bin Muhammad, from one of his companions, from Aban Bin Usman, from a man who said, ", "‘I asked Abu Abdullah<sup>asws</sup> about a man who bequeathed to a man and upon him was a debt. So he<sup>asws</sup> said: ‘The man should pay-off whatever was upon him from his debts, and distribute what remains in between the inheritors’. I said, ‘(Supposing) whatever he had bequeathed with from the debts gets stolen, so from which of the inheritors would it be taken from for the debt?’ He<sup>asws</sup> said: ‘It will not be taken from the inheritors, but the executor is responsible for it’."]}}, {"index": 13040, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:1:18:3", "text": ["عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زَكَرِيَّا بْنِ يَحْيَى الشَّعِيرِيِّ عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ قَالَ كُنَّا عَلَى بَابِ أَبِي جَعْفَرٍ <span class=\"bTxt\">( عليه السلام )</span> وَ نَحْنُ جَمَاعَةٌ نَنْتَظِرُ أَنْ يَخْرُجَ إِذْ جَاءَتِ امْرَأَةٌ فَقَالَتْ أَيُّكُمْ أَبُو جَعْفَرٍ فَقَالَ لَهَا الْقَوْمُ مَا تُرِيدِينَ مِنْهُ قَالَتْ أُرِيدُ أَنْ أَسْأَلَهُ عَنْ مَسْأَلَةٍ فَقَالُوا لَهَا هَذَا فَقِيهُ أَهْلِ الْعِرَاقِ فَسَلِيهِ ", "فَقَالَتْ إِنَّ زَوْجِي مَاتَ وَ تَرَكَ أَلْفَ دِرْهَمٍ وَ كَانَ لِي عَلَيْهِ مِنْ صَدَاقِي خَمْسُمِائَةِ دِرْهَمٍ فَأَخَذْتُ صَدَاقِي وَ أَخَذْتُ مِيرَاثِي ثُمَّ جَاءَ رَجُلٌ فَادَّعَى عَلَيْهِ أَلْفَ دِرْهَمٍ فَشَهِدْتُ لَهُ قَالَ الْحَكَمُ ", "فَبَيْنَا أَنَا أَحْسُبُ إِذْ خَرَجَ أَبُو جَعْفَرٍ <span class=\"bTxt\">( عليه السلام ) </span>فَقَالَ مَا هَذَا الَّذِي أَرَاكَ تُحَرِّكُ بِهِ أَصَابِعَكَ يَا حَكَمُ فَقُلْتُ إِنَّ هَذِهِ الْمَرْأَةَ ذَكَرَتْ أَنَّ زَوْجَهَا مَاتَ وَ تَرَكَ أَلْفَ دِرْهَمٍ وَ كَانَ لَهَا عَلَيْهِ مِنْ صَدَاقِهَا خَمْسُمِائَةِ دِرْهَمٍ فَأَخَذَتْ صَدَاقَهَا وَ أَخَذَتْ مِيرَاثَهَا ثُمَّ جَاءَ رَجُلٌ فَادَّعَى عَلَيْهِ أَلْفَ دِرْهَمٍ فَشَهِدَتْ لَهُ ", "فَقَالَ الْحَكَمُ فَوَ اللَّهِ مَا أَتْمَمْتُ الْكَلَامَ حَتَّى قَالَ أَقَرَّتْ بِثُلُثِ مَا فِي يَدَيْهَا وَ لَا مِيرَاثَ لَهَا قَالَ الْحَكَمُ فَمَا رَأَيْتُ وَ اللَّهِ أَفْهَمَ مِنْ أَبِي جَعْفَرٍ <span class=\"bTxt\">( عليه السلام )</span> قَطُّ ."], "translations": {"en.hubeali": ["Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from al Fazal Bin Shazaan, both together from Ibn Abu Umeyr, from Jameel Bin Darraj, from Zakariyya Bin Yahya Al Shuairy, from Al Hakam Bin Uteyba who said, ", "‘We were at the door of Abu Ja’far<sup>asws</sup> and we were a group awaiting for him<sup>asws</sup> to come out, when a woman came over, so she said, ‘Which one of you is Abu Ja’far<sup>asws</sup>?’ So the group said to her, ‘What do you want from him<sup>asws</sup>?’ She said, ‘I want to ask him<sup>asws</sup> about a certain problem’. So they said, ‘This is a jurist of the people of Al Iraq, so ask him’. ", "So she said, ‘My husband died and left a thousand Dirhams, and there was for me, upon him, my dowry of five hundred Dirhams. So I took my dowry, and took my inheritance, then a man came over, so he laid a claim upon him for a thousand Dirhams. So I testified in his favour’. ", "So while we were counting when Abu Ja’far<sup>asws</sup> came out, so he<sup>asws</sup> said: ‘What is this which I<sup>asws</sup> see you moving your fingers for, O Hakam?’ So I said, ‘This woman mentioned that her husband died and left a thousand Dirham, and there was for her upon him, from her dowry of five hundred Dirhams. So she took her dowry and took her inheritance. Then a man came over, so he laid a claim upon him of a thousand Dirhams. So she testified for him’. ", "So Al-Hakam said, ‘By Allah<sup>azwj</sup>! I had not even completed my speech until he<sup>asws</sup> said: ‘She has accepted with a third of what was in her hands, and there is no inheritance for her’. Al-Hakam said, ‘So I had not seen, by Allah<sup>azwj</sup>, anyone of more understanding than Abu Ja’far<sup>asws</sup>, at all’."]}}, {"index": 13041, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:1:18:4", "text": ["قَالَ ابْنُ أَبِي عُمَيْرٍ وَ تَفْسِيرُ ذَلِكَ أَنَّهُ لَا مِيرَاثَ لَهَا حَتَّى تَقْضِيَ الدَّيْنَ وَ إِنَّمَا تَرَكَ أَلْفَ دِرْهَمٍ وَ عَلَيْهِ مِنَ الدَّيْنِ أَلْفٌ وَ خَمْسُمِائَةِ دِرْهَمٍ لَهَا وَ لِلرَّجُلِ فَلَهَا ثُلُثُ الْأَلْفِ وَ لِلرَّجُلِ ثُلُثَاهَا .", "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي رَجُلٍ بَاعَ مَتَاعاً مِنْ رَجُلٍ فَقَبَضَ الْمُشْتَرِي الْمَتَاعَ وَ لَمْ يَدْفَعِ الثَّمَنَ ثُمَّ مَاتَ الْمُشْتَرِي وَ الْمَتَاعُ قَائِمٌ بِعَيْنِهِ قَالَ إِذَا كَانَ الْمَتَاعُ قَائِماً بِعَيْنِهِ رُدَّ إِلَى صَاحِبِ الْمَتَاعِ وَ قَالَ لَيْسَ لِلْغُرَمَاءِ أَنْ يُخَاصِمُوهُ ."], "translations": {"en.hubeali": ["Ibn Abu Umeyr said, ‘And the interpretation of that is that there is no inheritance for her until the debt is paid off. But rather, he left a thousand Dirhams, and upon him was a debt of a thousand Dirhams and five hundred Dirhams for her and for the man. So her’s is a third of a thousand, and for the man is two thirds’.", "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, from one of our companions, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding a man who sold something to a man. So the buyer took possession of the goods and did not hand over the price. Then the buyer died and the goods existed exactly as they were’. He<sup>asws</sup> said: ‘When the goods were exactly as they were, they would be returned to the owner of the goods’. And he<sup>asws</sup> said: ‘It is not for the creditors that they dispute it’."]}}, {"index": 13042, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:1:18:5", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> فِي الرَّجُلِ يَمُوتُ وَ عَلَيْهِ دَيْنٌ فَيَضْمَنُهُ ضَامِنٌ لِلْغُرَمَاءِ قَالَ إِذَا رَضِيَ الْغُرَمَاءُ فَقَدْ بَرِئَتْ ذِمَّةُ الْمَيِّتِ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Abdullah Bin Sinan, ", "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who died and upon him was a debt, so a guarantor took the responsibility to the creditors. He<sup>asws</sup> said: ‘If the creditors are happy, so it has freed the deceased from the responsibility’."]}}, {"index": 13043, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:1:18:6", "text": ["أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ يَحْيَى الْأَزْرَقِ عَنْ أَبِي الْحَسَنِ <span class=\"bTxt\">( عليه السلام )</span> فِي الرَّجُلِ قُتِلَ وَ عَلَيْهِ دَيْنٌ وَ لَمْ يَتْرُكْ مَالًا فَأَخَذَ أَهْلُهُ الدِّيَةَ مِنْ قَاتِلِهِ عَلَيْهِمْ يَقْضُونَ دَيْنَهُ قَالَ نَعَمْ قُلْتُ وَ هُوَ لَمْ يَتْرُكْ شَيْئاً قَالَ إِنَّمَا أَخَذُوا الدِّيَةَ فَعَلَيْهِمْ أَنْ يَقْضُوا دَيْنَهُ ."], "translations": {"en.hubeali": ["Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya Al Azraq, ", "(It has been narrated) from Abu Al-Hassan<sup>asws</sup> regarding the man who was killed and upon him was debt, and he did not leave wealth. So his family took the wergild (blood money) from his killer. Should they be paying-off his debt?’ He<sup>asws</sup> said: ‘Yes, and he did not leave anything. But rather, they have taken the wergild and so it is upon them to pay-off the debt’."]}}, {"index": 13044, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:7:1:18:7", "text": ["مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ <span class=\"bTxt\">( عليه السلام ) </span>عَنْ رَجُلٍ مَاتَ وَ لَهُ عَلَيَّ دَيْنٌ وَ خَلَّفَ وُلْداً رِجَالًا وَ نِسَاءً وَ صِبْيَاناً فَجَاءَ رَجُلٌ مِنْهُمْ فَقَالَ أَنْتَ فِي حِلٍّ مِمَّا لِأَبِي عَلَيْكَ مِنْ حِصَّتِي وَ أَنْتَ فِي حِلٍّ مِمَّا لِإِخْوَتِي وَ أَخَوَاتِي وَ أَنَا ضَامِنٌ لِرِضَاهُمْ عَنْكَ قَالَ تَكُونُ فِي سَعَةٍ مِنْ ذَلِكَ وَ حِلٍّ قُلْتُ فَإِنْ لَمْ يُعْطِهِمْ قَالَ كَانَ ذَلِكَ فِي عُنُقِهِ ", "قُلْتُ فَإِنْ رَجَعَ الْوَرَثَةُ عَلَيَّ فَقَالُوا أَعْطِنَا حَقَّنَا فَقَالَ لَهُمْ ذَلِكَ فِي الْحُكْمِ الظَّاهِرِ فَأَمَّا بَيْنَكَ وَ بَيْنَ اللَّهِ عَزَّ وَ جَلَّ فَأَنْتَ مِنْهَا فِي حِلٍّ إِذَا كَانَ الرَّجُلُ الَّذِي أَحَلَّ لَكَ يَضْمَنُ لَكَ عَنْهُمْ رِضَاهُمْ فَيَحْتَمِلُ الضَّامِنُ لَكَ ", "قُلْتُ فَمَا تَقُولُ فِي الصَّبِيِّ لِأُمِّهِ أَنْ تُحَلِّلَ قَالَ نَعَمْ إِذَا كَانَ لَهَا مَا تُرْضِيهِ أَوْ تُعْطِيهِ قُلْتُ فَإِنْ لَمْ يَكُنْ لَهَا قَالَ فَلَا قُلْتُ فَقَدْ سَمِعْتُكَ تَقُولُ إِنَّهُ يَجُوزُ تَحْلِيلُهَا فَقَالَ إِنَّمَا أَعْنِي بِذَلِكَ إِذَا كَانَ لَهَا مَالٌ قُلْتُ فَالْأَبُ يَجُوزُ تَحْلِيلُهُ عَلَى ابْنِهِ فَقَالَ لَهُ مَا كَانَ لَنَا مَعَ أَبِي الْحَسَنِ <span class=\"bTxt\">( عليه السلام )</span> أَمْرٌ يَفْعَلُ فِي ذَلِكَ مَا شَاءَ قُلْتُ فَإِنَّ الرَّجُلَ ضَمِنَ لِي عَنْ ذَلِكَ الصَّبِيِّ وَ أَنَا مِنْ حِصَّتِهِ فِي حِلٍّ فَإِنْ مَاتَ الرَّجُلُ قَبْلَ أَنْ يَبْلُغَ الصَّبِيُّ فَلَا شَيْ‏ءَ عَلَيْهِ قَالَ الْأَمْرُ جَائِزٌ عَلَى مَا شَرَطَ لَكَ ."], "translations": {"en.hubeali": ["Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazal, from Al Hassan Bin Al Jaham who said, ", "‘I asked Abu Al-Hassan<sup>asws</sup> about a man who died and for him upon me was debt, and he left behind parents, men and women, and young children. So a man from among them came over and said, ‘You are free from what my father had upon you, from my share, and you are (also) free from what is for my brothers and my sisters, and I am responsible for their pleasure about you’. He<sup>asws</sup> said: ‘You are at ease from that and free’. I said, ‘But if he does not give them?’ He<sup>asws</sup> said: ‘That would be upon his neck’. ", "I said, ‘So if the inheritors return to me so they say, ‘Give us our right’?’ So he<sup>asws</sup> said: ‘That is for them in the apparent judgement. So, as for what is between you and Allah<sup>azwj</sup> Mighty and Majestic, so you are free from it, since the man who freed you took the responsibility for you about their pleasure. Thus, the guarantor would be carrying for you’. ", "I said, ‘So what are you<sup>asws</sup> saying with regards to the child and its mother if she frees (on his behalf)?’ He<sup>asws</sup> said: ‘Yes, if she had what it would take to make him agree, or give him’. I said, ‘But what if she does not happen to have anything?’ He<sup>asws</sup> said: ‘Then, it is no’. I said, ‘But I heard you<sup>asws</sup> saying that her freeing is allowed?’ So he<sup>asws</sup> said: ‘But rather, I<sup>asws</sup> meant that if she had wealth for herself’. ", "I said, ‘So can a father take such responsibility for his son?’ So he<sup>asws</sup> said: ‘For him is what was for us<sup>asws</sup> with Abu Al-Hassan<sup>asws</sup>, a matter he<sup>asws</sup> did with regards to that whatever he<sup>asws</sup> so desired to’. ", "I said, ‘The man guaranteed to me about that child, and I am free from his share. So if the man were to die before the child becomes an adult, so there is nothing upon him’. He<sup>asws</sup> said: ‘The matter is allowed upon whatever he stipulated for you’."]}}]}, "index": "al-kafi:7:1:18", "kind": "verse_list"}