{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 19"
        },
        "path": "/books/al-kafi:7:1:19",
        "titles": {
          "ar": "باب مَنْ أَعْتَقَ وَ عَلَيْهِ دَيْنٌ",
          "en": "Chapter 19 – The one who emancipates (a slave) and upon him is debt"
        }
      }
    ],
    "index": 2006,
    "local_index": 19,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:7:1:20",
        "titles": {
          "ar": "باب الْوَصِيَّةِ لِلْمُكَاتَبِ",
          "en": "Chapter 20 – The bequests for the contracted (slaves)"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 18"
        },
        "path": "/books/al-kafi:7:1:18",
        "titles": {
          "ar": "باب مَنْ أَوْصَى وَ عَلَيْهِ دَيْنٌ",
          "en": "Chapter 18 – One who bequeaths and upon his is a debt"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:19",
    "titles": {
      "ar": "باب مَنْ أَعْتَقَ وَ عَلَيْهِ دَيْنٌ",
      "en": "Chapter 19 – The one who emancipates (a slave) and upon him is debt"
    },
    "verse_count": 3,
    "verse_start_index": 13055,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/42)"
        ],
        "index": 13056,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/36",
              "text": "أَبِيهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/122",
              "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/123",
              "text": "الْفَضْلِ بْنِ شَاذَانَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/576",
              "text": "أَبُو عَلِيٍّ الْأَشْعَرِيُّ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/17",
              "text": "مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/749",
              "text": "صَفْوَانَ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/97",
              "text": "ابْنِ أَبِي عُمَيْرٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/213",
              "text": "عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ وَ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:19:1",
        "text": [
          " سَأَلَنِي أَبُو عَبْدِ اللَّهِ ( عليه السلام ) هَلْ يَخْتَلِفُ ابْنُ أَبِي لَيْلَى وَ ابْنُ شُبْرُمَةَ فَقُلْتُ بَلَغَنِي أَنَّهُ مَاتَ مَوْلًى لِعِيسَى بْنِ مُوسَى وَ تَرَكَ عَلَيْهِ دَيْناً كَثِيراً وَ تَرَكَ مَمَالِيكَ يُحِيطُ دَيْنُهُ بِأَثْمَانِهِمْ فَأَعْتَقَهُمْ عِنْدَ الْمَوْتِ فَسَأَلَهُمَا عِيسَى بْنُ مُوسَى عَنْ ذَلِكَ فَقَالَ ابْنُ شُبْرُمَةَ أَرَى أَنْ يَسْتَسْعِيَهُمْ فِي قِيمَتِهِمْ فَيَدْفَعَهَا إِلَى الْغُرَمَاءِ فَإِنَّهُ قَدْ أَعْتَقَهُمْ عِنْدَ مَوْتِهِ وَ قَالَ ابْنُ أَبِي لَيْلَى أَرَى أَنْ أَبِيعَهُمْ وَ أَدْفَعَ أَثْمَانَهُمْ إِلَى الْغُرَمَاءِ فَإِنَّهُ لَيْسَ لَهُ أَنْ يُعْتِقَهُمْ عِنْدَ مَوْتِهِ وَ عَلَيْهِ دَيْنٌ يُحِيطُ بِهِمْ وَ هَذَا أَهْلُ الْحِجَازِ الْيَوْمَ يُعْتِقُ الرَّجُلُ عَبْدَهُ وَ عَلَيْهِ دَيْنٌ كَثِيرٌ فَلَا يُجِيزُونَ عِتْقَهُ إِذَا كَانَ عَلَيْهِ دَيْنٌ كَثِيرٌ فَرَفَعَ ابْنُ شُبْرُمَةَ يَدَهُ إِلَى السَّمَاءِ فَقَالَ سُبْحَانَ اللَّهِ يَا ابْنَ أَبِي لَيْلَى مَتَى قُلْتَ بِهَذَا الْقَوْلِ وَ اللَّهِ مَا قُلْتَهُ إِلَّا طَلَبَ خِلَافِي ",
          "فَقَالَ أَبُو عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> فَعَنْ رَأْيِ أَيِّهِمَا صَدَرَ قَالَ قُلْتُ بَلَغَنِي أَنَّهُ أَخَذَ بِرَأْيِ ابْنِ أَبِي لَيْلَى وَ كَانَ لَهُ فِي ذَلِكَ هَوًى فَبَاعَهُمْ وَ قَضَى دَيْنَهُ قَالَ فَمَعَ أَيِّهِمَا مَنْ قِبَلَكُمْ قُلْتُ لَهُ مَعَ ابْنِ شُبْرُمَةَ وَ قَدْ رَجَعَ ابْنُ أَبِي لَيْلَى إِلَى رَأْيِ ابْنِ شُبْرُمَةَ بَعْدَ ذَلِكَ فَقَالَ أَمَا وَ اللَّهِ إِنَّ الْحَقَّ لَفِي الَّذِي قَالَ ابْنُ أَبِي لَيْلَى وَ إِنْ كَانَ قَدْ رَجَعَ عَنْهُ",
          "فَقُلْتُ لَهُ هَذَا يَنْكَسِرُ عِنْدَهُمْ فِي الْقِيَاسِ فَقَالَ هَاتِ قَايِسْنِي فَقُلْتُ أَنَا أُقَايِسُكَ فَقَالَ لَتَقُولَنَّ بِأَشَدِّ مَا يَدْخُلُ فِيهِ مِنَ الْقِيَاسِ فَقُلْتُ لَهُ رَجُلٌ تَرَكَ عَبْداً لَمْ يَتْرُكْ مَالًا غَيْرَهُ وَ قِيمَةُ الْعَبْدِ سِتُّمِائَةِ دِرْهَمٍ وَ دَيْنُهُ خَمْسُمِائَةِ دِرْهَمٍ فَأَعْتَقَهُ عِنْدَ الْمَوْتِ كَيْفَ يُصْنَعُ قَالَ يُبَاعُ الْعَبْدُ فَيَأْخُذُ الْغُرَمَاءُ خَمْسَمِائَةِ دِرْهَمٍ وَ يَأْخُذُ الْوَرَثَةُ مِائَةَ دِرْهَمٍ",
          "َقُلْتُ أَ لَيْسَ قَدْ بَقِيَ مِنْ قِيمَةِ الْعَبْدِ مِائَةُ دِرْهَمٍ عَنْ دَيْنِهِ فَقَالَ بَلَى قُلْتُ أَ لَيْسَ لِلرَّجُلِ ثُلُثُهُ يَصْنَعُ بِهِ مَا يَشَاءُ قَالَ بَلَى قُلْتُ أَ لَيْسَ قَدْ أَوْصَى لِلْعَبْدِ بِالثُّلُثِ مِنَ الْمِائَةِ حِينَ أَعْتَقَهُ فَقَالَ إِنَّ الْعَبْدَ لَا وَصِيَّةَ لَهُ إِنَّمَا مَالُهُ لِمَوَالِيهِ فَقُلْتُ لَهُ فَإِذَا كَانَتْ قِيمَةُ الْعَبْدِ سِتَّمِائَةِ دِرْهَمٍ وَ دَيْنُهُ أَرْبَعَمِائَةِ دِرْهَمٍ قَالَ كَذَلِكَ يُبَاعُ الْعَبْدُ فَيَأْخُذُ الْغُرَمَاءُ أَرْبَعَمِائَةِ دِرْهَمٍ وَ يَأْخُذُ الْوَرَثَةُ مِائَتَيْنِ فَلَا يَكُونُ لِلْعَبْدِ شَيْ‏ءٌ",
          "فقُلْتُ لَهُ فَإِنَّ قِيمَةَ الْعَبْدِ سِتُّمِائَةِ دِرْهَمٍ وَ دَيْنَهُ ثَلَاثُمِائَةِ دِرْهَمٍ فَضَحِكَ وَ قَالَ مِنْ هَاهُنَا أُتِيَ أَصْحَابُكَ فَجَعَلُوا الْأَشْيَاءَ شَيْئاً وَاحِداً وَ لَمْ يَعْلَمُوا السُّنَّةَ إِذَا اسْتَوَى مَالُ الْغُرَمَاءِ وَ مَالُ الْوَرَثَةِ أَوْ كَانَ مَالُ الْوَرَثَةِ أَكْثَرَ مِنْ مَالِ الْغُرَمَاءِ لَمْ يُتَّهَمِ الرَّجُلُ عَلَى وَصِيَّتِهِ وَ أُجِيزَتْ وَصِيَّتُهُ عَلَى وَجْهِهَا فَالْآنَ يُوقَفُ هَذَا فَيَكُونُ نِصْفُهُ لِلْغُرَمَاءِ وَ يَكُونُ ثُلُثُهُ لِلْوَرَثَةِ وَ يَكُونُ لَهُ السُّدُسُ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father and Muhammad Bin Ismail, from Al Fazal Bin Shazaan and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan and Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajjaj who said, ",
            "‘Abu Abdullah<sup>asws</sup> asked me: ‘Did Ibn Abu Layli and Ibn Shabrama differ?’ So I said, ‘It reached me that the master of Isa Bin Musa died and left a lot of debts upon him, and left slaves whose value encompassed his debt. So he freed them during the death. Isa Bin Musa asked both of them about that, so Ibn Shabrama said, ‘I view that they should be made to work with regards to their own prices, and these should be handed over to the creditors, for he had freed them during his death’. And Ibn Abu Layli said, ‘I view that they should be sold and their prices should be handed over to the creditors, for it was not for him to emancipate them during his death, and upon him was debt which encompassed with them, and today the people of Al-Hijaz, if the man emancipates his slave and upon him is a lot of debt, so his emancipation is not allowed if there was a lot of debt upon him’. So Ibn Shabrama raised his hands towards the sky and said, ‘Glory be to Allah<sup>azwj</sup>, O Ibn Abu Layli! When did I say these words? By Allah<sup>azwj</sup>! I have not said it, except that you are seeking to go against me’. ",
            "So Abu Abdullah<sup>asws</sup> said: ‘So which of the two opinions was implemented?’ I said, ‘It reached me that he took with the opinion of Ibn Abu Layli, and for him there was a desire in that. So he sold them and paid off his debts’. He<sup>asws</sup> said: ‘So which of the two opinions are you accepting with?’ I said to him<sup>asws</sup>, ‘With Ibn Shabrama, and Ibn Abu Layli had returned to the opinion of Ibn Shabrama after that’. So he<sup>asws</sup> said: ‘By Allah<sup>azwj</sup>! The truth is in that which Ibn Abu Layli said, even though he retracted from it (afterwards)’. ",
            "So I said to him<sup>asws</sup>, ‘This breaks what is with them regarding the analogy’. So he<sup>asws</sup> said: ‘Come, analogise for me<sup>asws</sup>’. I said, ‘I analogise for you<sup>asws</sup>?’ So he<sup>asws</sup> said: ‘In order for you to be saying what is stronger what is included in it from the analogy’. So I said to him<sup>asws</sup>, ‘A man left a slave and did not leave wealth other than him, and the value of the slave is six hundred Dirhams, and his debt is of five hundred Dirhams. So he emancipates him during the death, how should one deal with it?’ He<sup>asws</sup> said: ‘Sell the slave, so the creditors would have five hundred Dirhams, and the inheritors would take a hundred Dirhams’. ",
            "So I said, ‘Is it not that what has remained from the value of the slave is one hundred Dirhams, from his debt?’ So he<sup>asws</sup> said: ‘Yes’. I said, ‘Is not a third for the man to do with whatever he so desires to?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘Is it not that he bequeathed to the slave with a third from the one hundred when he emancipated him?’ So he<sup>asws</sup> said: ‘The slave, there is no bequest for him. But rather, his wealth is for his guardians (heirs)’. So I said to him<sup>asws</sup>, ‘So if the value of the slave was six hundred Dirhams, and his debt was of four hundred Dirhams?’ He<sup>asws</sup> said: ‘Similar to that, the slave is sold, so the creditors would take four hundred Dirhams, and the inheritors would take two hundred. So there would not be anything for the slave’. ",
            "So I said to him<sup>asws</sup>, ‘So if the value of the servant is six hundred Dirhams, and his debt is three hundred Dirhams?’ So he<sup>asws</sup> smiled and said: ‘From over here your companions derived, so they made (all) the things as one thing, and did not act in accordance to the Sunnah, when they equalised the wealth of the creditors with the wealth of the inheritors, or if the wealth of the inheritors is more than the wealth of the creditors, the man would not be accused over his bequest, and his bequest would be allowed upon its aspect. So now this pauses, so half of it would be for the creditors, and a third for the inheritors, and a sixth for him (deceased)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father and Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from and Abu Ali al- Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan and ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, once asked me, ‘Is there a difference between ibn abu Layla’ and ibn Shubramah?’ I replied, ‘It has come to my knowledge that a Maxvla of ‘Isa ibn Musa died with a great deal of debts on him. He possessed a number of slaves whom he set free at the time of his death. Had the slaves been sold, such a sale could pay all of his debts. ‘Isa ibn Musa asked them (ibn abu Layla’ and ibn Shubramah) about this case. Ibn Shubramah said, “In my opinion they must be made to work to pay their own price because they were freed at the time of his death.” Ibn abu Layla’ said, “In my opinion I sell them to pay the creditors because he did not have the right to free them at the time of his death with debts on him; the value of slaves could have covered his debts. These are people of al-Hijaz today. A man indebted greatly is not allowed to free his slaves at the time of his death.” Ibn Shubramah then raised his hands to the sky and said, “Allah is free of all defects, O ibn abu Layla’ when did you ever say so? You only say so in my opposition.’” Abu ‘Abd Allah, ‘Alayhi al-Salam, then asked, ‘Whose opinion was taken as the rule?’ He (the narrator) has said that I said, ‘It has come to my knowledge that it was the opinion of ibn abu Layla’. He liked it. He sold them and paid his debts.’ He (the Imam) asked, ‘With which one’s opinion do you side?’ I said, ‘It is with ibn Shubramah and ibn abu Layla’ later changed and accepted that of ibn Shubramah.’ He (the Imam) said, ‘By Allah, truth is with what ibn abu Layla’ said, even though he changed it later.’ I (the narrator) then said, ‘This becomes invalid according to their al-Qiyas (analogy).’ He (the Imam) said, ‘Allow us to examine their analogy. Give us an example.’ I then said, ‘I debate you according to analogy.’ He (the Imam) said, ‘You must present the strongest example of analogy.’ I then said, ‘There is a man who dies and leaves a slave and no other assets. The value of the slave is six hundred dirham and his debt is five hundred dirham. He sets him free at the time of his death. How is the case settled?’ He (the Imam) said, ‘The slave must be sold. The creditors take five hundred and the heirs take the one hundred dirham.’ I said, ‘Is it not the case that one hundred is left extra over the debts?’ He (the Imam) said, ‘Yes, that is the case.’ ‘Is it not the case that one-third of it belongs to the deceased with which he can do whatever he wants?’ He (the Imam) said, ‘Yes, that is the case.’ I then said, ‘Is it not the case that at least one-third of the remaining one hundred belongs to the slave when he set him free?’ He (the Imam) said, ‘There is no will for the slave. The slave’s assets belong to his guardians (heirs).’ I then said, ‘What happens if the value of the slave is six hundred and the debt is four hundred dirham?’ He (the Imam) said, ‘The slave is sold. The creditors take four hundred and the heirs take the two hundred and there is nothing for the slave.’ I then said, ‘The price of the slave is six hundred and the debt is three hundred.’ He (the Imam) smiled and said, ‘This is where your companions are proved incorrect. They have made all things as one thing without the knowledge of the Sunnah. When the debt and legacy are equal or the legacy is more than debts, the testator is not accused about his will and it is accepted as it is. Now it stops. One-half is for creditors, one-third for heirs and one-sixth is for him (the deceased).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/44)"
        ],
        "index": 13057,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/37",
              "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4057",
              "text": "أَبِيهِ [عَنِ ابْنِ أَبِي عُمَيْرٍ]"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/124",
              "text": "جَمِيلِ بْنِ دَرَّاجٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/196",
              "text": "زُرَارَةَ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5438",
              "text": "أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ أَعْتَقَ مَمْلُوكَهُ عِنْدَ مَوْتِهِ"
            },
            {
              "kind": "plain",
              "text": " وَ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5436",
              "text": "عَلَيْهِ دَيْنٌ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ [عَنِ ابْنِ أَبِي عُمَيْرٍ] عَنْ جَمِيلِ بْنِ دَرَّاجٍ عَنْ زُرَارَةَ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي رَجُلٍ أَعْتَقَ مَمْلُوكَهُ عِنْدَ مَوْتِهِ وَ عَلَيْهِ دَيْنٌ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:19:2",
        "text": [
          " إِنْ كَانَ قِيمَتُهُ مِثْلَ الَّذِي عَلَيْهِ وَ مِثْلَهُ جَازَ عِتْقُهُ وَ إِلَّا لَمْ يَجُزْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel Bin Darraj, from Zurara, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding a man who emancipated his slave during his death, and upon his was debt. He<sup>asws</sup> said: ‘If his value was similar to what was upon him, and like it, his emancipation is allowed, otherwise it is not allowed’."
          ],
          "en.sarwar": [
            "2. Ali ibn Ibrahim has narrated from his father [from ibn abu ‘Umayr] from Jamil ibn Darraj from Zurarah who has narrated the following: “About the case of a man who frees his slave at the time of his death with debt on him, one of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘If the value of the debt and slave are equal, freeing is permissible, otherwise, it is not permissible.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/45)"
        ],
        "index": 13058,
        "local_index": 3,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/21",
              "text": "أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/22",
              "text": "ابْنِ فَضَّالٍ"
            },
            {
              "kind": "plain",
              "text": " عَنِ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/23",
              "text": "الْحَسَنِ بْنِ الْجَهْمِ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ ابْنِ فَضَّالٍ عَنِ الْحَسَنِ بْنِ الْجَهْمِ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:19:3",
        "text": [
          " سَمِعْتُ أَبَا الْحَسَنِ ( عليه السلام ) يَقُولُ فِي رَجُلٍ أَعْتَقَ مَمْلُوكاً لَهُ وَ قَدْ حَضَرَهُ الْمَوْتُ وَ أَشْهَدَ لَهُ بِذَلِكَ وَ قِيمَتُهُ سِتُّمِائَةِ دِرْهَمٍ وَ عَلَيْهِ دَيْنٌ ثَلَاثُمِائَةِ دِرْهَمٍ وَ لَمْ يَتْرُكْ شَيْئاً غَيْرَهُ قَالَ يُعْتَقُ مِنْهُ سُدُسُهُ لِأَنَّهُ إِنَّمَا لَهُ مِنْهُ ثَلَاثُمِائَةِ دِرْهَمٍ وَ يُقْضَى مِنْهُ ثَلَاثُمِائَةِ دِرْهَمٍ فَلَهُ مِنَ الثَّلَاثِمِائَةٍ ثُلُثُهَا وَ هُوَ السُّدُسُ مِنَ الْجَمِيعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa, from Ibn Fazal, from Al Hassan Bin Al Jaham who said, ",
            "‘I heard Abu Al-Hassan<sup>asws</sup> saying regarding a man who emancipated a slave of his, and death had presented itself, and that was witnessed for him, and his value was of six hundred Dirhams, and upon him was a debt of three hundred Dirhams, and he did not leave anything apart from it’. He<sup>asws</sup> said: ‘He would be one-sixth free from it. But rather, from it for him were three hundred Dirhams, and three hundred Dirhams were paid off from it, therefore, for him from the three hundred is a third, and it is a sixth from the total’."
          ],
          "en.sarwar": [
            "3. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa from ibn Faddal from al-Husayn Aban al-Jahm who has narrated the following: “This is about the case of a man who frees his slave at the time of his death in front of witnesses. The price of the slave is six hundred dirham, his debt is three hundred dirham and he has no other legacy. I once heard abu al-Hassan, ‘Alayhi al-Salam, say, ‘One-sixth of him is free because he owns from him three hundred and the other three hundred is for the debt. Thus out of three hundred one-third is his which is one-sixth of the total.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:19",
  "kind": "verse_list"
}