{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 20"
        },
        "path": "/books/al-kafi:7:1:20",
        "titles": {
          "ar": "باب الْوَصِيَّةِ لِلْمُكَاتَبِ",
          "en": "Chapter 20 – The bequests for the contracted (slaves)"
        }
      }
    ],
    "index": 2007,
    "local_index": 20,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:20",
    "titles": {
      "ar": "باب الْوَصِيَّةِ لِلْمُكَاتَبِ",
      "en": "Chapter 20 – The bequests for the contracted (slaves)"
    },
    "verse_count": 1,
    "verse_start_index": 13058,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/45)"
        ],
        "index": 13059,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:20:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي مُكَاتَبٍ كَانَتْ تَحْتَهُ امْرَأَةٌ حُرَّةٌ فَأَوْصَتْ لَهُ عِنْدَ مَوْتِهَا بِوَصِيَّةٍ فَقَالَ أَهْلُ الْمِيرَاثِ لَا نُجِيزُ وَصِيَّتَهَا لَهُ إِنَّهُ مُكَاتَبٌ لَمْ يُعْتَقْ وَ لَا يَرِثُ فَقَضَى بِأَنَّهُ يَرِثُ بِحِسَابِ مَا أُعْتِقَ مِنْهُ وَ يَجُوزُ لَهُ مِنَ الْوَصِيَّةِ بِحِسَابِ مَا أُعْتِقَ مِنْهُ ",
          "وَ قَضَى ( عليه السلام ) فِي مُكَاتَبٍ أُوصِيَ لَهُ بِوَصِيَّةٍ وَ قَدْ قَضَى نِصْفَ مَا عَلَيْهِ فَأَجَازَ نِصْفَ الْوَصِيَّةِ ",
          "وَ قَضَى ( عليه السلام ) فِي مُكَاتَبٍ قَضَى رُبُعَ مَا عَلَيْهِ فَأُوصِيَ لَهُ بِوَصِيَّةٍ فَأَجَازَ رُبُعَ الْوَصِيَّةِ ",
          "وَ قَالَ ( عليه السلام ) فِي رَجُلٍ حُرٍّ أَوْصَى لِمُكَاتَبَةٍ وَ قَدْ قَضَتْ سُدُسَ مَا كَانَ عَلَيْهَا فَأَجَازَ لَهَا بِحِسَابِ مَا أُعْتِقَ مِنْهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Najran, from Aasim Bin Hameed, from Muhammad Bin Qays, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a contracted one under who was a free woman. So she bequeathed to him, during her death, with a bequest. So the inheritors said, ‘We do not allow her bequest to him. He is a contracted one and has not been liberated, and he does not inherit. So he<sup>asws</sup> judged that he would inherit by the accounting of what he is liberated from it, and it would be allowed for him from the bequest with the accounting of what he had been freed from it (the contract)’.",
            "And he<sup>asws</sup> judged regard a contracted to who had been bequeathed with a bequest, and he had fulfilled half of what was upon him. So half the bequest would be allowed.",
            "And he<sup>asws</sup> judged regarding a contracted one who had fulfilled a quarter of what was upon him, so he was bequeathed to with a bequest, so he was allowed a quarter of the bequest.",
            "And he<sup>asws</sup> said regarding a free man who had bequeathed to a contracted woman, and he had fulfilled a sixth of what was upon him, so he allowed for her by the accounting of what she was free from it (the contract)’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu Najran from ‘Asem ibn Humayd from Muhammad ibn Qays who has narrated the following: “This is about the case of a contracted slave who is married to a free woman who in her will assigns something for him and the heirs disagree with her will, saying that he is not free but is only contracted and he cannot inherit. Abu Ja’far, ‘Alayhi al-Salam, issued a judgment that he inherits proportionate to the degree of his freedom according to the contract. He (the Imam), ‘Alayhi al-Salam, judged in the case of a contracted slave for whom a will was made and the slave had paid one-half according to the contract. The judgment granted him one-half of the will. He (the Imam), ‘Alayhi al-Salam, judged one-fourth of the amount of will in favor of the slave who had paid one-fourth of the amount required according to the contract. About the case of a free man who had made a will for a contracted slave-girl who had paid one-sixth of what was required according to the contract, He (the Imam), ‘Alayhi al- Salam, judged in her favor proportionate to what was made free from her. "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:20",
  "kind": "verse_list"
}