{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 23"
        },
        "path": "/books/al-kafi:7:1:23",
        "titles": {
          "ar": "باب مَا يَجُوزُ مِنَ الْوَقْفِ وَ الصَّدَقَةِ وَ النُّحْلِ وَ الْهِبَةِ وَ السُّكْنَى وَ الْعُمْرَى وَ الرُّقْبَى وَ مَا لَا يَجُوزُ مِنْ ذَلِكَ عَلَى الْوَلَدِ وَ غَيْرِهِ",
          "en": "Chapter 23 – What is allowed from the endowment, and the charity, and the grant, and the gift, and the (provision) of habitation, and the lifetime (service) and the bondman, and what is allowed from that upon the child and others"
        }
      }
    ],
    "index": 2010,
    "local_index": 23,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 24"
        },
        "path": "/books/al-kafi:7:1:24",
        "titles": {
          "ar": "باب مَنْ أَوْصَى بِجُزْءٍ مِنْ مَالِهِ",
          "en": "Chapter 24 – One who bequeaths with a ‘part’ from his wealth"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 22"
        },
        "path": "/books/al-kafi:7:1:22",
        "titles": {
          "ar": "باب الْوَصِيَّةِ لِأُمَّهَاتِ الْأَوْلَادِ",
          "en": "Chapter 22 – The bequest for the mothers and the children"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:23",
    "titles": {
      "ar": "باب مَا يَجُوزُ مِنَ الْوَقْفِ وَ الصَّدَقَةِ وَ النُّحْلِ وَ الْهِبَةِ وَ السُّكْنَى وَ الْعُمْرَى وَ الرُّقْبَى وَ مَا لَا يَجُوزُ مِنْ ذَلِكَ عَلَى الْوَلَدِ وَ غَيْرِهِ",
      "en": "Chapter 23 – What is allowed from the endowment, and the charity, and the grant, and the gift, and the (provision) of habitation, and the lifetime (service) and the bondman, and what is allowed from that upon the child and others"
    },
    "verse_count": 41,
    "verse_start_index": 13067,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/49)"
        ],
        "index": 13068,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> قَالَ لَا صَدَقَةَ وَ لَا عِتْقَ إِلَّا مَا أُرِيدَ بِهِ وَجْهُ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hammad Bin Usman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘There is neither charity nor emancipation except what is intended by it is the Face of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hammad ibn ‘Uthaman who has narrated the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ’Giving charity or setting free a slave is not valid unless it is for the sake of Allah, most Majestic, most Glorious.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/49)"
        ],
        "index": 13069,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:2",
        "text": [
          "وَ عَنْهُ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامٍ وَ حَمَّادٍ وَ ابْنِ أُذَيْنَةَ وَ ابْنِ بُكَيْرٍ وَ غَيْرِهِمْ كُلِّهِمْ قَالُوا قَالَ أَبُو عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام ) </span>لَا صَدَقَةَ وَ لَا عِتْقَ إِلَّا مَا أُرِيدَ بِهِ وَجْهُ اللَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "And from him, from his father, from Ibn Abu Umeyr, from Hisham, and Hamaad, and Ibn Azina, and Ibn Bakeyr, and others, all of them said, ",
            "‘Abu Abdullah<sup>asws</sup> said: ‘There is neither charity nor emancipation except what is intended by it is the Face of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "2. It is narrated from the narrator of the previous Hadith from his father from ibn abu ‘Umayr from Hisham and Hammad and ibn ’Udhaynah and ibn Bukayr and others all of whom have said the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ’Giving charity or setting free a slave is not valid unless it is for the sake of Allah, most Majestic, most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/49)"
        ],
        "index": 13070,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:3",
        "refs": {
          "Quran": [
            "/books/quran:4:4",
            "/books/quran:2:229"
          ]
        },
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ زُرَارَةَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنَّمَا الصَّدَقَةُ مُحْدَثَةٌ إِنَّمَا كَانَ النَّاسُ عَلَى عَهْدِ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) يَنْحَلُونَ وَ يَهَبُونَ وَ لَا يَنْبَغِي لِمَنْ أَعْطَى لِلَّهِ عَزَّ وَ جَلَّ شَيْئاً أَنْ يَرْجِعَ فِيهِ ",
          "قَالَ وَ مَا لَمْ يُعْطَ لِلَّهِ وَ فِي اللَّهِ فَإِنَّهُ يُرْجَعُ فِيهِ نِحْلَةً كَانَتْ أَوْ هِبَةً حِيزَتْ أَوْ لَمْ تُحَزْ وَ لَا يَرْجِعُ الرَّجُلُ فِيمَا يَهَبُ لِامْرَأَتِهِ وَ لَا الْمَرْأَةُ فِيمَا تَهَبُ لِزَوْجِهَا حِيزَ أَوْ لَمْ يُحَزْ أَ لَيْسَ اللَّهُ تَبَارَكَ وَ تَعَالَى يَقُولُ وَ لَا تَأْخُذُوا مِمَّا آتَيْتُمُوهُنَّ شَيْئاً وَ قَالَ فَإِنْ طِبْنَ لَكُمْ عَنْ شَيْ‏ءٍ مِنْهُ نَفْساً فَكُلُوهُ هَنِيئاً مَرِيئاً وَ هَذَا يَدْخُلُ فِي الصَّدَاقِ وَ الْهِبَةِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Zurara, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘but rather, the charity is newly occurred. But rather, the people in the era of Rasool-Allah<sup>saww</sup> were granting and gifting, and it is not befitting for the one who gives anything for the Sake of Allah<sup>azwj</sup> Mighty and Majestic that he retracts (pulls back) with regards to it. ",
            "He<sup>asws</sup> said: ‘And what is not given for the Sake of Allah<sup>azwj</sup> and regarding Allah<sup>azwj</sup>, so there is retraction with regards to it, be it a donation or a gift, acquired or not acquired. And the man cannot retract with regards to what he gifts to his wife, nor the woman regarding what she gifted to her husband, acquired or not acquired. Is Allah<sup>azwj</sup> Blessed and High not Saying <span class=\"ibTxt\"><a href=\"/#/books/quran:2#h229\">[2:229]</a> and it is not lawful for you to take any part of what you have given them</span>; and Said <span class=\"ibTxt\"><a href=\"/#/books/quran:4#h4\">[4:4]</a> but if they of themselves be pleased to give up to you a portion of it, then eat it with enjoyment and with wholesome result</span>. And this is inclusive with regards to the dowry and the gifts’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from al-Hassan ibn Mahbub from Ali ibn Ri’ab from Zurarah who has narrated the following: “Abu ’Abd Allah, ‘Alayhi al-Salam, has said, ‘Charity has emerged newly. In the time of the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, people would give gifts and presents. It is not proper for one who has given something to Allah, most Majestic, most Glorious, to take it back.’ He (the Imam) has said, ‘A gift or present, which is not given for the sake of Allah can be taken back, regardless of whether the recipient has taken possession or not. If a man gives a gift to his wife, he must not take it back; also if a wife gives something to her husband, regardless of whether he has taken possession or not. Allah, most Blessed, most High, has said, “Do not take anything that you have given to them (your wives).” <a href=\"/#/books/quran:2#h229\">[2:229]</a> Allah has said, “If they give you out of their pleasure then you can use it in good health.” <a href=\"/#/books/quran:4#h4\">[4:4]</a> This applies to mahr (dower) and gifts.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/50)"
        ],
        "index": 13071,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:4",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنْ عُبَيْدِ بْنِ زُرَارَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ<span class=\"bTxt\"> ( عليه السلام )</span> عَنِ الرَّجُلِ يَتَصَدَّقُ بِالصَّدَقَةِ أَ لَهُ أَنْ يَرْجِعَ فِي صَدَقَتِهِ فَقَالَ إِنَّ الصَّدَقَةَ مُحْدَثَةٌ إِنَّمَا كَانَ النُّحْلُ وَ الْهِبَةُ وَ لِمَنْ وَهَبَ أَوْ نَحَلَ أَنْ يَرْجِعَ فِي هِبَتِهِ حِيزَ أَوْ لَمْ يُحَزْ وَ لَا يَنْبَغِي لِمَنْ أَعْطَى [لِلَّهِ] شَيْئاً أَنْ يَرْجِعَ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazal, from Ibn Bakeyr, from Ubeyd Bin Zurara who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who gave in charity with the charity. Is it for him that he retracts with regards to his charity?’ So he<sup>asws</sup> said: ‘The charity is a newly occurring thing. But rather, the donations and the gifts were for the one who gifted or donated and he could retract regarding his gift, acquired or not acquired, and it is not befitting for the one who gives anything for the Sake of Allah<sup>azwj</sup> that he retracts with regards to it’."
          ],
          "en.sarwar": [
            "4. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal Ahmad ibn al-Hassan ibn Bukayr Ahmad ibn al- Hassan ‘Ubayd ibn Zurarah who has narrated the following: “I once asked abu ’Abd Allah, ‘Alayhi al-Salam, about the case of a man who gives charity; if he can take it back. He (the Imam) said, ‘Charity is new. There were gifts and grants. One who provides a gift or a grant is able to take back the grant or gift, regardless of whether the recipient has taken it in his possession or not; but it is not proper to take back what one gives to Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/50)"
        ],
        "index": 13072,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:5",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَتَصَدَّقُ عَلَى وُلْدِهِ بِصَدَقَةٍ وَ هُمْ صِغَارٌ أَ لَهُ أَنْ يَرْجِعَ فِيهَا قَالَ لَا الصَّدَقَةُ لِلَّهِ عَزَّ وَ جَلَّ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel who said, ",
            "‘I said to Abu Abdullah<sup>asws</sup>, ‘The man who gives charity to his children with a charity, and they are small. Is it for him that he retracts with regards to it?’ He<sup>asws</sup> said: ‘No! The charity is for the Sake of Allah<sup>azwj</sup> Mighty and Majestic’."
          ],
          "en.sarwar": [
            "5. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who gives charity (which is not obligatory) to his small children; if he can take it back. He (the Imam) said, ‘No, because charity is for Allah, most Majestic, most Glorious.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/51)"
        ],
        "index": 13073,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ أَبِي الْمَغْرَاءِ عَنْ أَبِي بَصِيرٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> عَنْ صَدَقَةِ مَا لَمْ تُقْسَمْ وَ لَمْ تُقْبَضْ فَقَالَ جَائِزَةٌ إِنَّمَا أَرَادَ النَّاسُ النُّحْلَ فَأَخْطَئُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abu Al Magra, from Abu Baseer who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about charity what has not been distributed and not been seized (taken possession of). So he<sup>asws</sup> said: ‘It (retraction) is allowed. But rather, the people intended the grant, but they erred’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from abu al-Mighra’ from abu Basir who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about charity which is not distributed or possessed by the recipient. He (the Imam) said, ‘It is permissible (for the donor to use it); people had the intention to gift it but they made a mistake (in calling it a charity).”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/51)"
        ],
        "index": 13074,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:7",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَكَمِ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ<span class=\"bTxt\"> ( عليه السلام )</span> أَنَّهُ قَالَ فِي الرَّجُلِ يَتَصَدَّقُ عَلَى وُلْدٍ قَدْ أَدْرَكُوا إِذَا لَمْ يَقْبِضُوا حَتَّى يَمُوتَ فَهُوَ مِيرَاثٌ فَإِنْ تَصَدَّقَ عَلَى مَنْ لَمْ يُدْرِكْ مِنْ وُلْدِهِ فَهُوَ جَائِزٌ لِأَنَّ وَالِدَهُ هُوَ الَّذِي يَلِي أَمْرَهُ وَ ",
          "قَالَ لَا يَرْجِعُ فِي الصَّدَقَةِ إِذَا ابْتَغَى بِهَا وَجْهَ اللَّهِ عَزَّ وَ جَلَّ ",
          "وَ قَالَ الْهِبَةُ وَ النِّحْلَةُ يَرْجِعُ فِيهَا إِنْ شَاءَ حِيزَتْ أَوْ لَمْ تُحَزْ إِلَّا لِذِي رَحِمٍ فَإِنَّهُ لَا يَرْجِعُ فِيهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, form Ali Bin Al Hakam, from Al A’ala Bin Razeyn, from Muhammad Bin Muslim, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said regarding the man who gave in charity to his children who had reached awareness (puberty), but they did not take possession until he died: ‘So it is inheritance, for the charity is upon the one who has not reached awareness (puberty) from his children, then it would be allowed, because the father, he is the one who is taking care of his matters’. ",
            "He<sup>asws</sup> said: ‘There is no retraction with regards to the charity, when it is the Face of Allah<sup>azwj</sup> Mighty and Majestic which is sought by it’. ",
            "And he<sup>asws</sup> said: ‘The gift, and the grant, there is retraction with regards to it, whether something has been acquired or not acquired, except for the womb relationships, for there is no retraction in it’."
          ],
          "en.sarwar": [
            "7. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Ali ibn al-Hakam from al-‘Ala’ ibn Razin from Muhammad ibn Muslim who has narrated the following: “This is about the case of a man who gives charity to his grown up (mature) children. They do not take possession until he dies. Abu Ja’far, ‘Alayhi al-Salam, has said, ‘It remains as part of the legacy; but if he gives it as charity to his small children, then it (giving such charity) is permissible; their father is the one who is their guardian (in matters of taking possession for them). 5 He (the Imam) said, ‘The charity given for the sake of Allah, most Majestic, most Glorious, cannot be taken back.’ He (the Imam) said, ‘Gifts and grants can be taken back if one wants to do so, regardless, possession by the recipient has taken place or not, unless the recipient is a relative, in which case it cannot be taken back.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/52)"
        ],
        "index": 13075,
        "local_index": 8,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:8",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِنْ تَصَدَّقْتَ بِصَدَقَةٍ لَمْ تَرْجِعْ إِلَيْكَ وَ لَمْ تَشْتَرِهَا إِلَّا أَنْ تُورَثَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Abdullah Bin Al Mugheira, from Mansour Bin Hazim, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘When you are given in charity with a charity, it does not return back to you, and you do not buy it except if you were to inherit it’."
          ],
          "en.sarwar": [
            "8. Ali ibn Ibrahim has narrated from his father from ‘ Abd Allah ibn al-Mughirah from Mansur ibn Hazim who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If you give charity, then do not take it back or buy it back unless it comes back to you in the form of an inherited legacy.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/52)"
        ],
        "index": 13076,
        "local_index": 9,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:9",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَجَّاجِ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> فِي الرَّجُلِ يَجْعَلُ لِوُلْدِهِ شَيْئاً وَ هُمْ صِغَارٌ ثُمَّ يَبْدُو لَهُ أَنْ يَجْعَلَ مَعَهُمْ غَيْرَهُمْ مِنْ وُلْدِهِ قَالَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazal Bin Shazaan, from Ibn Abu Umeyr, from Abdul Rahman Bin Al Hajaaj, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who made something to be for his children and they were small. Then it seemed to him that he should name, along with them, others from his children (as sharers). He<sup>asws</sup> said: ‘No problem’."
          ],
          "en.sarwar": [
            "9. Muhammad ibn ’Isma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from ‘Abd al-Rahman ibn al-Hajjaj who has narrated the following: “About the case of a man who gives something to his small children then he decides to make his other children share it with them, abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘It is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/53)"
        ],
        "index": 13077,
        "local_index": 10,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:10",
        "text": [
          "وَ بِإِسْنَادِهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ قَالَ سَأَلْتُ أَبَا الْحَسَنِ <span class=\"bTxt\">( عليه السلام )</span> عَنِ الرَّجُلِ يَتَصَدَّقُ عَلَى وُلْدِهِ وَ هُمْ صِغَارٌ بِالْجَارِيَةِ ثُمَّ تُعْجِبُهُ الْجَارِيَةُ وَ هُمْ صِغَارٌ فِي عِيَالِهِ أَ تَرَى أَنْ يُصِيبَهَا أَوْ يُقَوِّمَهَا قِيمَةَ عَدْلٍ فَيُشْهِدَ بِثَمَنِهَا عَلَيْهِ أَمْ يَدَعَ ذَلِكَ كُلَّهُ فَلَا يَعْرِضَ لِشَيْ‏ءٍ مِنْهُ قَالَ يُقَوِّمُهَا قِيمَةَ عَدْلٍ وَ يَحْتَسِبُ بِثَمَنِهَا لَهُمْ عَلَى نَفْسِهِ وَ يَمَسُّهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "And by his chain, from Ibn Abu Umeyr, from Abdul Rahman who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about the man who gave charity with the slave girl to his children and they were small in his family. Do you<sup>asws</sup> see that if he were to be infatuated (smitten) by her, or evaluate her price justly, so he gets witnesses to testify to her price, or leaves that, all of it, so he does not show anything from it?’ He<sup>asws</sup> said: ‘He can evaluate her price justly, and reckon her price to be for them (children) upon himself, and he can touch her’."
          ],
          "en.sarwar": [
            "10. Through the same chain of narrators as that of the previous Hadith the following is narrated from ibn abu ‘Umayr from ‘Abd al- Rahman who has narrated the following: “This is about the case of a man who gives a slave-girl as charity to his small children. He then begins to like the slave-girl but the children are small as his dependents, if he can touch the slave-girl, or appraise her for a fair price, then make witnesses to bear testimony to his owing such price to his children, or he must stay away altogether. Abu al-Hassan, ‘Alayhi al-Salam, has said, ‘He can appraise her for a fair price and count it up on himself; then he can touch the slave-girl.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/53)"
        ],
        "index": 13078,
        "local_index": 11,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:11",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ جَمِيلٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) وَ حَمَّادِ بْنِ عُثْمَانَ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا كَانَتِ الْهِبَةُ قَائِمَةً بِعَيْنِهَا فَلَهُ أَنْ يَرْجِعَ وَ إِلَّا فَلَيْسَ لَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "<span style=\"font-size: small\">Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Jameel, </span>from Abu Abdullah<sup>asws</sup>; <span style=\"font-size: small\">and Hamaad Bin Usman, from Al Halby, </span>",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> having said: ‘If the gift remains exactly as it used to be, so it is for him to retract, otherwise it is not for him (to do so)’."
          ],
          "en.sarwar": [
            "11. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Jamil from abu ‘Abd Allah, ‘Alayhi al-Salam, and Hammad ibn ‘Uthaman from al-Halabiy who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If the gift still exists as it was given, it can be taken back, otherwise, one cannot do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/53)"
        ],
        "index": 13079,
        "local_index": 12,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:12",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنِ الْعَلَاءِ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) أَنَّهُ سُئِلَ عَنْ رَجُلٍ كَانَتْ لَهُ جَارِيَةٌ فَآذَتْهُ امْرَأَتُهُ فِيهَا فَقَالَ هِيَ عَلَيْكِ صَدَقَةٌ فَقَالَ إِنْ كَانَ قَالَ ذَلِكَ لِلَّهِ عَزَّ وَ جَلَّ فَلْيُمْضِهَا وَ إِنْ كَانَ لَمْ يَقُلْ فَلَهُ أَنْ يَرْجِعَ إِنْ شَاءَ فِيهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Al A’ala, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) having been asked about a man who had a slave girl for himself, but his wife hurt him with regards to her. So he said: ‘She is a charity upon you’. So he<sup>asws</sup> said: ‘If he has said, ‘For the Sake of Allah<sup>azwj</sup> Mighty and Majestic, so let him fulfil it; and if had not say, so it is for him that he can retract if he so desires with regards to her’."
          ],
          "en.sarwar": [
            "12. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan from al-‘Ala’ from Muhammad ibn Muslim who has narrated the following: “This is about the case of a man who has a slave-girl and his wife gives him trouble about her. Thus, he says, ‘She is charity for you.’ One of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al- Salam, has said, ‘If he has done so for the sake of Allah, most Majestic, most Glorious, he must comply with what he has said, but if he did not say it for the sake of Allah, he can reverse his decision.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول كالصحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/54)"
        ],
        "index": 13080,
        "local_index": 13,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:13",
        "text": [
          "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> عَنِ الرَّجُلِ يَكُونُ لَهُ عَلَى الرَّجُلِ الدَّرَاهِمُ فَيَهَبُهَا لَهُ أَ لَهُ أَنْ يَرْجِعَ فِيهَا قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ismail, from Al Fazal Bin Shazaan, from Ibn Abu Umeyr, from Muawiya Bin Amaar who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man for whom were a certain amount of Dirhams upon the man (as debt), so he gifted these to him. Is it for him that he can retract with regards to it?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "13. Muhammad ibn Tsma‘il has narrated from al-Fadl ibn Shadhan from ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has narrated the following: “I once asked abu ‘ Abd Allah, ‘Alayhi al-Salam, about the case of a man to whom another man owes a certain amount of dirham and he gives it as a gift to him (the indebted); if he can change his mind and take it back. He (the Imam) said, ‘No, he cannot do so.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/54)"
        ],
        "index": 13081,
        "local_index": 14,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:14",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> عَنْ رَجُلٍ تَصَدَّقَ بِصَدَقَةٍ عَلَى حَمِيمٍ أَ يَصْلُحُ لَهُ أَنْ يَرْجِعَ فِيهَا قَالَ لَا وَ لَكِنْ إِنِ احْتَاجَ فَلْيَأْخُذْ مِنْ حَمِيمِهِ مِنْ غَيْرِ مَا تَصَدَّقَ بِهِ عَلَيْهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who gave charity with a charity to a friend. Is it correct for him that he retracts with regards to it?’ He<sup>asws</sup> said: ‘No, but if he is needy, so let him take from his friend, from other than what he had given in charity to him’."
          ],
          "en.sarwar": [
            "14. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from ‘Uthman ibn ‘Isa from Sama‘ah who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who gives a certain amount of charity to his friend; if he can change his mind and take it back from him. He (the Imam) said, ‘No, he cannot do so but if he needs he can take from other assets of his friend which is other than what he had given as charity to him.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/54)"
        ],
        "index": 13082,
        "local_index": 15,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:15",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبَانِ بْنِ عُثْمَانَ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَحَدِهِمَا ( عليهما السلام ) فِي الرَّجُلِ يَتَصَدَّقُ بِالصَّدَقَةِ أَ يَحِلُّ لَهُ أَنْ يَرِثَهَا قَالَ نَعَمْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from one of our companions, from Aban Bin Usman, from Muhammad Bin Muslim, ",
            "(It has been narrated) from one of the two (5<sup>th</sup> or 6<sup>th</sup> Imam<sup>asws</sup>) regarding the man who gave in charity with some charity. Is it Permissible for him that he inherits it (back)?’ He<sup>asws</sup> said: ‘Yes’."
          ],
          "en.sarwar": [
            "15. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from certain persons of our people from Aban ibn ‘Uthman from Muhammad ibn Muslim who has narrated the following: “About the case of a man who gives something in charity if he can inherit it, one of the two Imam, (abu Ja‘far or abu ‘Abd Allah), ‘Alayhim al-Salam, has said, ‘Yes, he can do so.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/54)"
        ],
        "index": 13083,
        "local_index": 16,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:16",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ عُثْمَانَ بْنِ عِيسَى عَنْ سَمَاعَةَ قَالَ سَأَلْتُهُ عَنْ رَجُلٍ أَعْطَى أُمَّهُ عَطِيَّةً فَمَاتَتْ وَ كَانَتْ قَدْ قَبَضَتِ الَّذِي أَعْطَاهَا وَ بَانَتْ بِهِ قَالَ هُوَ وَ الْوَرَثَةُ فِيهَا سَوَاءٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from Usman Bin Isa, from Sama’at who said, ",
            "‘I asked him<sup>asws</sup> about a man who gave his mother a gift. So she died and she had taken possession of that which he had given her and was irrevocably freed from it. He<sup>asws</sup> said: ‘Him and the other inheritors are equal with regards to it’."
          ],
          "en.sarwar": [
            "16. A number of our people have narrated from Ahmad ibn abu as from ‘Uthman ibn ‘Isa from Sama‘ah who has narrated the following: “I once asked him (the Imam), ‘Alayhi al-Salam, about the case of a man who gives a gift to his mother and she dies. She had taken the gift away from him in her possession. He (the Imam) said, ‘He and the other heirs are the same in dealing with that item.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/55)"
        ],
        "index": 13084,
        "local_index": 17,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:17",
        "text": [
          "أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ مُحَمَّدِ بْنِ مَسْعُودٍ الطَّائِيِّ قَالَ قُلْتُ لِأَبِي الْحَسَنِ <span class=\"bTxt\">( عليه السلام )</span> إِنَّ أُمِّي تَصَدَّقَتْ عَلَيَّ بِدَارٍ لَهَا أَوْ قَالَ بِنَصِيبٍ لَهَا فِي دَارٍ فَقَالَتْ لِيَ اسْتَوْثِقْ لِنَفْسِكَ فَكَتَبْتُ عَلَيْهَا أَنِّي اشْتَرَيْتُ وَ أَنَّهَا قَدْ بَاعَتْنِي وَ قَبَضَتِ الثَّمَنَ فَلَمَّا مَاتَتْ قَالَ الْوَرَثَةُ احْلِفْ أَنَّكَ اشْتَرَيْتَ وَ نَقَدْتَ الثَّمَنَ فَإِنْ حَلَفْتُ لَهُمْ أَخَذْتُهُ وَ إِنْ لَمْ أَحْلِفْ لَهُمْ لَمْ يُعْطُونِي شَيْئاً قَالَ فَقَالَ فَاحْلِفْ لَهُمْ وَ خُذْ مَا جَعَلَتْهُ لَكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Muhammad Bin Muslim, from Muhammad Bin Masoud Al Taiy who said, ",
            "‘I said to Abu Al-Hassan<sup>asws</sup> that ‘My mother gave charity to me with a house of hers’, or I said, ‘With her share in a house’. So she said to me, ‘Secure it for yourself’. So I wrote to her that I have bought it, and that she had sold it to me and taken possession of the price’. So when she died, the inheritors said, ‘Swear an oath that you had bought it and paid the cash price’. So if I were to swear an oath to them, I would take it, and if I were not to swear to them, they would not give me anything’. He<sup>asws</sup> said: ‘So swear an oath to them and take what she had made it to be for you’."
          ],
          "en.sarwar": [
            "17. Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar from Safwan ibn Yahya from Muhammad ibn Muslim from Mas‘ud (a certain musical instrument) al-Ta‘iy who has narrated the following: “I once said to abu al-Hassan, ‘Alayhi al-Salam, that my mother gave me the house that belonged to her - or he said her share in a house - and told me to register it in my name. I then wrote that I have bought it from her. She has sold it to me and has received the payment. When she died, the heirs asked me to take an oath that I have bought it and made the payment. If I take an oath, I can take it but if I do not take an oath, they will not give it to me. He (the Imam) said, ‘You can take an oath and take what you have assigned to yourself.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/55)"
        ],
        "index": 13085,
        "local_index": 18,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:18",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ عَلِيِّ بْنِ فَضَّالٍ عَنِ ابْنِ بُكَيْرٍ عَنِ الْحَكَمِ بْنِ أَبِي عَقِيلَةَ قَالَ تَصَدَّقَ أَبِي عَلَيَّ بِدَارٍ وَ قَبَضْتُهَا ثُمَّ وُلِدَ لَهُ بَعْدَ ذَلِكَ أَوْلَادٌ فَأَرَادَ أَنْ يَأْخُذَهَا مِنِّي وَ يَتَصَدَّقَ بِهَا عَلَيْهِمْ فَسَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ ذَلِكَ وَ أَخْبَرْتُهُ بِالْقِصَّةِ فَقَالَ لَا تُعْطِهَا إِيَّاهُ قُلْتُ فَإِنَّهُ إِذاً يُخَاصِمُنِي قَالَ فَخَاصِمْهُ وَ لَا تَرْفَعْ صَوْتَكَ عَلَى صَوْتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Al Hassan Bin Ali Bin Fazal, from Ibn Bakeyr, from Al Hakam Bin Abu Aqeela who said, ",
            "‘My father gave me a house in charity and I took possession of it. Then after that, children were born unto him, so he wanted to take it back from me, and give in charity with it to them (instead). So I asked Abu Abdullah<sup>asws</sup> about that and informed him<sup>asws</sup> with the story. So he<sup>asws</sup> said: ‘Do not give it to him’. I said, ‘Then he would dispute with me’. He<sup>asws</sup> said: ‘So dispute with him, but do not raise your voice above his’."
          ],
          "en.sarwar": [
            "18. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from al-Hassan ibn Ali ibn Faddal from ibn Bukayr from al-Hakam ibn abu ‘Aqilah who has narrated the following: “My father gave a house as charity to me and I took possession thereof but thereafter other children were born to him and he wanted to take the house back from me to give it to them. I explained the story to abu ‘Abd Allah, ‘Alayhi al-Salam, who said, ‘Do not give it to him.’ I then said, ‘He will dispute it with me.’ He (the Imam) said, ‘You can become a defendant but do not raise your voice over his voice.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/55)"
        ],
        "index": 13086,
        "local_index": 19,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:19",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ إِذَا عُوِّضَ صَاحِبُ الْهِبَةِ فَلَيْسَ لَهُ أَنْ يَرْجِعَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Abdullah Bin Sinan, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘If the giver of the gift has offset it (against something else), so it is not for him that he can retract (from the original gift)’."
          ],
          "en.sarwar": [
            "19. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Abd Allah ibn Sinan who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If a gift-giver receives something in exchange, he then cannot take back what he has given as gift.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> كالموثق  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/55)"
        ],
        "index": 13087,
        "local_index": 20,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:20",
        "text": [
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ غَيْرِ وَاحِدٍ عَنْ أَبَانٍ عَنْ أَبِي مَرْيَمَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ إِذَا تَصَدَّقَ الرَّجُلُ بِصَدَقَةٍ قَبَضَهَا صَاحِبُهَا أَوْ لَمْ يَقْبِضْهَا عُلِمَتْ أَوْ لَمْ تُعْلَمْ فَهِيَ جَائِزَةٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Hameed Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from someone else, from Aban, from Abu Maryam, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> having said: ‘When the man gives charity, whether the recipient takes possession of it or does not take possession of it, knows about it or does not know, so it is Permissible’."
          ],
          "en.sarwar": [
            "20. Humayd ibn Ziyad has narrated from al-Hassan ibn Muhammad ibn Sama‘ah, from more than one person from Aban from abu Maryam who has narrated the foffowing: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘If one gives a charity it is permissible, regardless of whether the recipient takes possession or not, knows about it or does not know about it.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مرسل ل يقصر عن الموثق والحسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/56)"
        ],
        "index": 13088,
        "local_index": 21,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:21",
        "text": [
          "أَبَانٌ عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ حُمْرَانَ قَالَ سَأَلْتُهُ عَنِ السُّكْنَى وَ الْعُمْرَى فَقَالَ إِنَّ النَّاسَ فِيهِ عِنْدَ شُرُوطِهِمْ إِنْ كَانَ شَرَطَهُ حَيَاتَهُ سَكَنَ حَيَاتَهُ وَ إِنْ كَانَ لِعَقِبِهِ فَهُوَ لِعَقِبِهِ كَمَا شَرَطَ حَتَّى يَفْنَوْا ثُمَّ يُرَدُّ إِلَى صَاحِبِ الدَّارِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Aban, from Abdul Rahman Bin Abu Abdullah, from Hamran who said, ",
            "‘I asked him<sup>asws</sup> about the (provision) of the habitation and the lifetime (gifting). So he<sup>asws</sup> said: ‘The people in this (matter) and under their stipulations. If the stipulation was for his lifetime, so they should dwell in it for his lifetime, and if it was for his offspring, so it is for his offspring, just as the condition stipulated, until he dies. Then it reverts back to the owner of the house’."
          ],
          "en.sarwar": [
            "21. Aban has narrated from ‘ Abd af-Rahman ibn abu ‘ Abd Aliah from Humran who has narrated the foifowing: “I once asked him (the Imam), ‘Alayhi al-Salam, about al-Sukna ’ and al^Umra’ (permission to use a house for a certain period of time). He (the Imam) said, ‘People must stand by their conditions. If his condition is permission to use the house for his life time, it then is for his life time. If it is for the life time of those whom he leaves behind, then it is for their life time after which they must return it to the owner of the house.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/56)"
        ],
        "index": 13089,
        "local_index": 22,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:22",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ الْفُضَيْلِ عَنْ أَبِي الصَّبَّاحِ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام ) </span>قَالَ سُئِلَ عَنِ السُّكْنَى وَ الْعُمْرَى فَقَالَ إِنْ كَانَ جَعَلَ السُّكْنَى فِي حَيَاتِهِ فَهُوَ كَمَا شَرَطَ وَ إِنْ كَانَ جَعَلَهَا لَهُ وَ لِعَقِبِهِ مِنْ بَعْدِهِ حَتَّى يَفْنَى عَقِبُهُ فَلَيْسَ لَهُمْ أَنْ يَبِيعُوا وَ لَا يُورِثُوا ثُمَّ تَرْجِعُ الدَّارُ إِلَى صَاحِبِهَا الْأَوَّلِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Ismail, from Muhammad Bin Al Fuzeyl, from Abu Al Sabbah, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘He<sup>asws</sup> was asked about the habitation and the lifetime (gifting), so he<sup>asws</sup> said: ‘If he makes the habitation during his lifetime, so it is as he has stipulated it, and if makes it for him and for his offspring from after him until his offspring die, so it is not for them that they sell it, nor for it to be inherited.  Then the house would revert back to its first owner’."
          ],
          "en.sarwar": [
            "22. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Muhammad ibn ’Isma’il from Muhammad ibn ai-Fudayi from abu af-Sabbah ai-Kinaniy who has narrated the following: “Once abu ‘Abd Allah, ‘Alayhi al-Salam, was asked about al-Sukna ’ and al-‘Umra’ (permission to use a house for a certain period of time). He (the Imam) said, ‘If permission to use the house is given for his lifetime, then it must remain as the condition requires, if it is for his and the lifetime of those whom he leaves behind until they die, then they cannot sell it or inherit it, but they must return the house to its first owner.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/57)"
        ],
        "index": 13090,
        "local_index": 23,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:23",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ صَفْوَانَ عَنْ يَعْقُوبَ بْنِ شُعَيْبٍ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام )</span> قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يَكُونُ لَهُ الْخَادِمُ تَخْدُمُهُ فَيَقُولُ هِيَ لِفُلَانٍ تَخْدُمُهُ مَا عَاشَ فَإِذَا مَاتَ فَهِيَ حُرَّةٌ فَتَأْبِقُ الْأَمَةُ قَبْلَ أَنْ يَمُوتَ الرَّجُلُ بِخَمْسِ سِنِينَ أَوْ سِتَّةٍ ثُمَّ يَجِدُهَا وَرَثَتُهُ أَ لَهُمْ أَنْ يَسْتَخْدِمُوهَا قَدْرَ مَا أَبَقَتْ قَالَ إِذَا مَاتَ الرَّجُلُ فَقَدْ عَتَقَتْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Safwan, from Yaqoub Bin Shuayb, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who happens to have a (female) servant for him to serve him, so he says, ‘She is for so and so to serve him for as long as he lives. So when he dies, so she is free. So the maid absconds five or six years before the man dies. Then his inheritors find her. Is it for them they can make her serve in accordance with what she absconded?’ He<sup>asws</sup> said: ‘When the man died, so she was free’."
          ],
          "en.sarwar": [
            "23. Muhammad ibn Yahya has narrated from Muhammad ibn al-Husayn from Safwan from Ya’qub ibn Shu’ayb who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who has a servant who serves him and he says, ‘She will serve so and so as long as he lives, and when he dies she will be free. The servant runs away five or six years before he dies; then his heirs find her; if they can make her to serve them for the remaining time. He (the Imam) said, ‘When the man dies she becomes free.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/57)"
        ],
        "index": 13091,
        "local_index": 24,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:24",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ فَضَّالٍ عَنْ أَحْمَدَ بْنِ عُمَرَ الْحَلَبِيِّ عَنْ أَبِيهِ عَنْ أَبِي عَبْدِ اللَّهِ <span class=\"bTxt\">( عليه السلام ) </span>قَالَ سَأَلْتُهُ عَنْ دَارٍ لَمْ تُقْسَمْ فَتَصَدَّقَ بَعْضُ أَهْلِ الدَّارِ بِنَصِيبِهِ مِنَ الدَّارِ قَالَ يَجُوزُ قُلْتُ أَ رَأَيْتَ إِنْ كَانَتْ هِبَةً قَالَ يَجُوزُ ",
          "قَالَ وَ سَأَلْتُهُ عَنْ رَجُلٍ أَسْكَنَ رَجُلًا دَارَهُ حَيَاتَهُ قَالَ يَجُوزُ لَهُ وَ لَيْسَ لَهُ أَنْ يُخْرِجَهُ قُلْتُ فَلَهُ وَ لِعَقِبِهِ قَالَ يَجُوزُ ",
          "وَ سَأَلْتُهُ عَنْ رَجُلٍ أَسْكَنَ رَجُلًا وَ لَمْ يُوَقِّتْ لَهُ شَيْئاً قَالَ يُخْرِجُهُ صَاحِبُ الدَّارِ إِذَا شَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Fazal, from Ahmad Bin Umar Al Halby, from his father, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a house which was not distributed, so one of the people of the house gave in charity with his share from the house. He<sup>asws</sup> said: ‘He is allowed’. I said, ‘What is your<sup>asws</sup> view if he had gifted it?’ He<sup>asws</sup> said: ‘He is allowed’. ",
            "He (the narrator) said, ‘And I asked him<sup>asws</sup> about a man who settled a man in his house for his lifetime. He<sup>asws</sup> said: ‘He is allowed, and it is not for him that he should throw him out’. I said, ‘So it is for him and his offspring’. He<sup>asws</sup> said: ‘He is allowed’. ",
            "And I asked him<sup>asws</sup> about a man who settles a man but does not stipulate anything from the time period for him. He<sup>asws</sup> said: ‘The owner of the house can vacate him if he so desires to’."
          ],
          "en.sarwar": [
            "24. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Faddal from Ahmad ibn ‘Umar al-Halabiy from his father who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about a house which is not yet distributed and a certain one of the people of the house gives his share as charity. He (the Imam) said, ‘It is permissible.’ I then asked, ‘What happens if it is a grant?’ He (the Imam) said, ‘It is permissible.’ I then asked him (the Imam) about a man who allows another man to use his house for his lifetime. He (the Imam) said, ‘It is permissible but he cannot evict him.’ I then asked, ‘Can it be for him and those whom he leaves behind?’ He (the Imam) said, ‘It is permissible.’ I then asked about the case in which one gives permission to another person to use a house without the mention of time duration. He (the Imam) said, ‘He can ask him to leave if he wants him to vacate the house.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/57)"
        ],
        "index": 13092,
        "local_index": 25,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:25",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ حَمَّادٍ عَنِ الْحَلَبِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُسْكِنُ الرَّجُلَ دَارَهُ وَ لِعَقِبِهِ مِنْ بَعْدِهِ قَالَ يَجُوزُ وَ لَيْسَ لَهُمْ أَنْ يَبِيعُوا وَ لَا يُورِثُوا قُلْتُ فَرَجُلٌ أَسْكَنَ دَارَهُ رَجُلًا حَيَاتَهُ قَالَ يَجُوزُ ذَلِكَ قُلْتُ فَرَجُلٌ أَسْكَنَ رَجُلًا دَارَهُ وَ لَمْ يُوَقِّتْ قَالَ جَائِزٌ وَ يُخْرِجُهُ إِذَا شَاءَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hamaad, from Al Halby, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who settles the man in his house, and for it to be for his offspring from after him. He<sup>asws</sup> said: ‘He is allowed, and it is not for them that they should sell it, nor for it to be inherited’. I said, ‘So a man settles a man in his house for his lifetime?’ He<sup>asws</sup> said: ‘He is allowed that’. I said, ‘So a man settles a man in his house and does not stipulate a time period?’ He<sup>asws</sup> said: ‘Allowed, and he can vacate him whenever he so desires to’."
          ],
          "en.sarwar": [
            "25. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Flammad from al-Halabiy who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who allows another man to use a house and those whom he will leave behind. He (the Imam) said, ‘It is permissible but they cannot sell or inherit it.’ I asked if a man could allow another man to use a house for his lifetime. He (the Imam) said, ‘It is permissible.’ I then asked what happens if a man allows another man to use a house without the mention of time. He (the Imam) said, ‘It is permissible but he can ask him to vacate if he wants.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> موثق   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/58)"
        ],
        "index": 13093,
        "local_index": 26,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:26",
        "text": [
          "أَحْمَدُ بْنُ مُحَمَّدٍ الْعَاصِمِيُّ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ مُحَمَّدِ بْنِ حُمْرَانَ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الرَّجُلِ يَتَصَدَّقُ بِالصَّدَقَةِ الْمُشْتَرَكَةِ قَالَ جَائِزٌ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ahmad Bin Muhammad Al Asimy, from Ali Bin Al Hassan, from Ali Bin Asbaat, from Muhammad Bin Humran, from Zurara, ",
            "(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding the man who gives charity with something which is a jointly owned. He<sup>asws</sup> said: ‘Allowed’."
          ],
          "en.sarwar": [
            "26. Ahmad ibn Muhammad has narrated from al-‘Asemiy from Ali ibn al-Hassan from Ali ibn Asbat from Muhammad ibn Humran from Zurarah who has narrated the following: “About the case of a man who gives in charity what is owned in partnership, abu Ja’far, ‘Alayhi al- Salam, has said, ‘It is permissible.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/58)"
        ],
        "index": 13094,
        "local_index": 27,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:27",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ عُمَرَ بْنِ أُذَيْنَةَ قَالَ كُنْتُ شَاهِدَ ابْنِ أَبِي لَيْلَى فَقَضَى فِي رَجُلٍ جَعَلَ لِبَعْضِ قَرَابَتِهِ غَلَّةَ دَارِهِ وَ لَمْ يُوَقِّتْ وَقْتاً فَمَاتَ الرَّجُلُ فَحَضَرَ وَرَثَتُهُ ابْنَ أَبِي لَيْلَى وَ حَضَرَ قَرَابَتُهُ الَّذِي جُعِلَ لَهُ الدَّارُ فَقَالَ ابْنُ أَبِي لَيْلَى أَرَى أَنْ أَدَعَهَا عَلَى مَا تَرَكَهَا صَاحِبُهَا ",
          "فَقَالَ لَهُ مُحَمَّدُ بْنُ مُسْلِمٍ الثَّقَفِيُّ أَمَا إِنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ ( عليه السلام ) قَدْ قَضَى فِي هَذَا الْمَسْجِدِ بِخِلَافِ مَا قَضَيْتَ فَقَالَ وَ مَا عِلْمُكَ قَالَ سَمِعْتُ أَبَا جَعْفَرٍ مُحَمَّدَ بْنَ عَلِيٍّ ( عليه السلام ) يَقُولُ قَضَى أَمِيرُ الْمُؤْمِنِينَ عَلِيُّ بْنُ أَبِي طَالِبٍ ( عليه السلام ) بِرَدِّ الْحَبِيسِ وَ إِنْفَاذِ الْمَوَارِيثِ فَقَالَ ابْنُ أَبِي لَيْلَى هَذَا عِنْدَكَ فِي كِتَابٍ قَالَ نَعَمْ قَالَ فَأَرْسِلْ وَ ائْتِنِي بِهِ قَالَ لَهُ مُحَمَّدُ بْنُ مُسْلِمٍ عَلَى أَنْ لَا تَنْظُرَ فِي الْكِتَابِ إِلَّا فِي ذَلِكَ الْحَدِيثِ ",
          "قَالَ لَكَ ذَاكَ قَالَ فَأَرَاهُ الْحَدِيثَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي الْكِتَابِ فَرَدَّ قَضِيَّتَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Umar Bin Azina who said, ",
            "‘I witnessed Ibn Abu Layli judge with regards to a man who made the yield of his house to be for one of his relatives and did not stipulate any time period. So the man died, and his inheritors presented themselves to Ibn Abu Layli, and the relative to whom the (yield of the) house was made to be in favour of was (also) present. So Ibn Abu Layli said, ‘I view that it should be left as its owner had left it to be’. ",
            "So Muhammad Bin Muslim Al-Saqafy said to him, ‘But Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> had judged in this very Masjid opposite to what you have judged!’ So he said, ‘And what taught you (that)?’ He said, ‘I heard Abu Ja’far Muhammad<sup>asws</sup> Bin Ali<sup>asws</sup> saying: ‘Amir Al-Momineen Ali<sup>asws</sup> Bin Abu Talib<sup>asws</sup> judged for the reverting of the withheld (assets) and the enforcement of the inheritance’. So Ibn Abu Layli said, ‘This is with you in a book?’ He said, ‘Yes’. He said, ‘So send for it and have it brought to me’. Muhammad Bin Muslim said to him, ‘Upon the condition that you will not look into the book except in that particular Hadeed’. He said, ‘That is up to you’. ",
            "He (the narrator) said, ‘So he showed him the Hadeeth from Abu Ja’far<sup>asws</sup> in the book, so he retracted his judgement’."
          ],
          "en.sarwar": [
            "27. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from ‘Umar ibn ’Udhaynah who has narrated the following: “I was witness that ibn abu Layla’ judged in the case of a man who had designated the income of a house for his relative without the mention of time limit. The man died and his heirs came to ibn abu Layla’ and his relative for whom the house was designated. Ibn abu Layla’ said, ‘I see that it must be left as its owner has left.’ Muhammad ibn Muslim al-Thaqafiy then said, ‘Ali ibn Abu Talib, ‘Alayhim al-Salam, judged in the same Masjid opposite to what you have judged.’ He asked, ‘How do you know that?’ He replied, ‘I once heard abu Ja‘far, ‘Alayhi al-Salam, saying, “’Amir al-Mu’minin judged to return what is kept on hold and to execute the rules of inheritance.’” Ibn abu Layla’ then asked, ‘Is this written in a book with you?’ He replied, ‘Yes, it is in a book.’ He said, ‘Send to bring it.’ Muhammad ibn Muslim said, ‘I will do so upon the condition that you will not read anything else in the book besides this Hadith.’ He said, ‘That is up to you.’ He (the narrator) has said that he showed him the Hadith from abu Ja‘far, ‘Alayhi al-Salam, in the book and he took his judgment back.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/58)"
        ],
        "index": 13095,
        "local_index": 28,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:28",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ أَبِي عَبْدِ اللَّهِ عَنْ أَبِيهِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُغِيرَةِ عَنْ عَبْدِ الرَّحْمَنِ الْخَثْعَمِيِّ قَالَ كُنْتُ أَخْتَلِفُ إِلَى ابْنِ أَبِي لَيْلَى فِي مَوَارِيثَ لَنَا لِيَقْسِمَهَا وَ كَانَ فِيهَا حَبِيسٌ وَ كَانَ يُدَافِعُنِي فَلَمَّا طَالَ شَكَوْتُهُ إِلَى أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فَقَالَ أَ وَ مَا عَلِمَ أَنَّ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) أَمَرَ بِرَدِّ الْحَبِيسِ وَ إِنْفَاذِ الْمَوَارِيثِ ",
          "قَالَ فَأَتَيْتُهُ فَفَعَلَ كَمَا كَانَ يَفْعَلُ فَقُلْتُ لَهُ إِنِّي شَكَوْتُكَ إِلَى جَعْفَرِ بْنِ مُحَمَّدٍ ( عليه السلام ) فَقَالَ لِي كَيْتَ وَ كَيْتَ قَالَ فَحَلَّفَنِي ابْنُ أَبِي لَيْلَى أَنَّهُ قَالَ ذَلِكَ لَكَ فَحَلَفْتُ لَهُ فَقَضَى لِي بِذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Abu Abdullah, from his father, from Abdullah Bin Al Mugheira, from Abdul Rahman Al Khash’amy who said, ",
            "‘I differed with Ibn Abu Layli with regards to inheritance for us in order to distribute it, and there was in it a withheld asset, and it had been handed over to me. So when the matter prolonged, I complained to Abu Abdullah<sup>asws</sup>. So he<sup>asws</sup> said: ‘Or does he not know that Rasool-Allah<sup>saww</sup> ordered with the return of a withheld asset and enforcement of the inheritance?’ ",
            "He (the narrator) said, ‘So I went over to him, and he did just as he had done. So I said to him, ‘I complained to Ja’far<sup>asws</sup> Bin Muhammad<sup>asws</sup>, so he<sup>asws</sup> said to me such and such’. He said, ‘So Ibn Abu Layli made me swear an oath that he<sup>asws</sup> had indeed said that’. So I swore an oath to him, so he judged for me with that’."
          ],
          "en.sarwar": [
            "28. A number of our people have narrated from Ahmad ibn abu ‘Abd Allah from his father from ‘Abd Allah ibn al-Mughirah from ‘Abd al-Rahman al-Khath‘amiy who has narrated the following: “About an issue of a legacy for distribution I once faced differences with ibn abu Layla’. In that legacy, there was an item on hold and he opposed me. When it prolonged I complained before abu ‘Abd Allah, ‘Alayhi al-Salam, and he said, ‘Did he not know that the Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, commanded to return items on hold and execute the rules of inheritance?’ I went to him and he did as before. I said, ‘I have complained before Ja‘far ibn Muhammad, ‘Alayhim al-Salam, and he said so and so on the issue.’ Ibn abu Layla asked me to take oath that he (the Imam) has said so. I took the oath; then he judged accordingly.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/59)"
        ],
        "index": 13096,
        "local_index": 29,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:29",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ أَحْمَدَ بْنِ مُحَمَّدٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنْ عَلِيِّ بْنِ رِئَابٍ عَنْ جَعْفَرِ بْنِ حَيَّانَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنْ رَجُلٍ وَقَفَ غَلَّةً لَهُ عَلَى قَرَابَةٍ مِنْ أَبِيهِ وَ قَرَابَةٍ مِنْ أُمِّهِ وَ أَوْصَى لِرَجُلٍ وَ لِعَقِبِهِ مِنْ تِلْكَ الْغَلَّةِ لَيْسَ بَيْنَهُ وَ بَيْنَهُ قَرَابَةٌ بِثَلَاثِمِائَةِ دِرْهَمٍ فِي كُلِّ سَنَةٍ وَ يُقْسَمُ الْبَاقِي عَلَى قَرَابَتِهِ مِنْ أَبِيهِ وَ قَرَابَتِهِ مِنْ أُمِّهِ قَالَ جَائِزٌ لِلَّذِي أُوصِيَ لَهُ بِذَلِكَ",
          "قُلْتُ أَ رَأَيْتَ إِنْ لَمْ يَخْرُجْ مِنْ غَلَّةِ الْأَرْضِ الَّتِي وَقَفَهَا إِلَّا خَمْسُمِائَةِ دِرْهَمٍ فَقَالَ أَ لَيْسَ فِي وَصِيَّتِهِ أَنْ يُعْطَى الَّذِي أُوصِيَ لَهُ مِنَ الْغَلَّةِ ثَلَاثَمِائَةِ دِرْهَمٍ وَ يُقْسَمَ الْبَاقِي عَلَى قَرَابَتِهِ مِنْ أُمِّهِ وَ قَرَابَتِهِ مِنْ أَبِيهِ قُلْتُ نَعَمْ قَالَ لَيْسَ لِقَرَابَتِهِ أَنْ يَأْخُذُوا مِنَ الْغَلَّةِ شَيْئاً حَتَّى يُوَفَّى الْمُوصَى لَهُ بِثَلَاثِمِائَةِ دِرْهَمٍ ثُمَّ لَهُمْ مَا يَبْقَى بَعْدَ ذَلِكَ ",
          "قُلْتُ أَ رَأَيْتَ إِنْ مَاتَ الَّذِي أُوصِيَ لَهُ قَالَ إِنْ مَاتَ كَانَتِ الثَّلَاثُمِائَةِ دِرْهَمٍ لِوَرَثَتِهِ يَتَوَارَثُونَهَا مَا بَقِيَ أَحَدٌ فَإِذَا انْقَطَعَ وَرَثَتُهُ وَ لَمْ يَبْقَ مِنْهُمْ أَحَدٌ كَانَتِ الثَّلَاثُمِائَةِ دِرْهَمٍ لِقَرَابَةِ الْمَيِّتِ تُرَدُّ إِلَى مَا يَخْرُجُ مِنَ الْوَقْفِ ثُمَّ يُقْسَمُ بَيْنَهُمْ يَتَوَارَثُونَ ذَلِكَ مَا بَقُوا وَ بَقِيَتِ الْغَلَّةُ ",
          "قُلْتُ فَلِلْوَرَثَةِ مِنْ قَرَابَةِ الْمَيِّتِ أَنْ يَبِيعُوا الْأَرْضَ إِذَا احْتَاجُوا وَ لَمْ يَكْفِهِمْ مَا يَخْرُجُ مِنَ الْغَلَّةِ قَالَ نَعَمْ إِذَا رَضُوا كُلُّهُمْ وَ كَانَ الْبَيْعُ خَيْراً لَهُمْ بَاعُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad and Ahmad Bin Muhammad, and Ali Bin Ibrahim, from his father both together, from Al Hassan Bin Mahboub, from Ali Bin Raib, from Ja’far Bin Hayyan who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about a man who dedicated a yield of his upon a relative of his father and a relative of his mother, and bequeathed to a man and his offspring from that yield, not between him and him any relationship, with three hundred Dirhams, during every year, and distributed the remained over his relatives of his father, and relatives of his mother. He<sup>asws</sup> said: ‘Allowed, that which he bequeathed to him with that’. ",
            "I said, ‘What is your<sup>asws</sup> view if there does not come out a yield from the earth which has been dedicated except for five hundred Dirhams?’ So he<sup>asws</sup> said: ‘Is it not in his bequest that the ones he had bequeathed to should be given three hundred Dirhams from the yield, and the remainder to be distributed upon his relatives of his mother, and relatives of his father?’ I said, ‘Yes’. He<sup>asws</sup> said: ‘There is not for his relatives that they should take from the yield anything, until the beneficiaries he had bequeathed to have been given three hundred Dirhams, then for them would be what remains after that’.",
            "I said, ‘What is your view if the beneficiary were to die?’ He<sup>asws</sup> said: ‘The three hundred Dirhams would be for their inheritors for as long as one of them remains. So when his inheritors are cut off and there does not remain anyone from among them, the three hundred Dirhams would be for the relatives of the deceased to be returned to what came out from the dedicated land, then it would be distributed between them and they would be inheriting that what remains, and the rest of the yield’. ",
            "I said, ‘So for the inheritors from the relatives of the deceased is that they can sell the land when they need, and it does not suffice for them what comes out from the yield’. He<sup>asws</sup> said: ‘Yes, when all of them are happy and that the selling was better for them, they sell’."
          ],
          "en.sarwar": [
            "29. A number of our people have narrated from Sahl ibn Ziyad and Ahmad ibn Muhammad from and Ali ibn Ibrahim has narrated from his father all from al-Hassan ibn Mahbub from Ali ibn Ri’ab from Ja‘far ibn Hayyan who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who endowed an asset that belonged to him for his relatives from his father’s side as well as for those from his mother’s side. He assigned from the same asset three hundred dirham every year in his will for a man and his heirs with whom he had no relationship and that the rest must be distributed between the two relatives from the side of each of his parents. He (the Imam) said, ‘It is permissible for the ones in whose favor the will is made.’ I then asked, ‘What happens if the income is not more than five hundred?’ He (the Imam) said, ‘Is it not the case that three hundred must be given and the remaining is distributed between the two relatives?’ I replied, ‘Yes, that is the case.’ He (the Imam) said, ‘The relatives cannot take anything from the income until the three hundred is paid and thereafter they can distribute between themselves whatever is left.’ I then asked, ‘What happens if the one in whose favor the will is for three hundred dies?’ He (the Imam) said, ‘If he dies the three hundred goes to his heirs if there are any heirs left, otherwise, the three hundred goes to the relatives of the deceased which will be taken from the endowment and will be distributed among them as they exist as well as the income.’ I then asked, ‘Can the relatives of the deceased sell the land when they need it if the income thereof is not enough?’ He (the Imam) said, ‘Yes, they can do so if they all agree and the sale is in their benefit.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/60)"
        ],
        "index": 13097,
        "local_index": 30,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:30",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى وَ عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ جَمِيعاً عَنْ عَلِيِّ بْنِ مَهْزِيَارَ قَالَ كَتَبْتُ إِلَى أَبِي جَعْفَرٍ ( عليه السلام ) أَنَّ فُلَاناً ابْتَاعَ ضَيْعَةً فَوَقَفَهَا وَ جَعَلَ لَكَ فِي الْوَقْفِ الْخُمُسَ وَ يَسْأَلُ عَنْ رَأْيِكَ فِي بَيْعِ حِصَّتِكَ مِنَ الْأَرْضِ أَوْ يُقَوِّمُهَا عَلَى نَفْسِهِ بِمَا اشْتَرَاهَا بِهِ أَوْ يَدَعُهَا مَوْقُوفَةً ",
          "فَكَتَبَ ( عليه السلام ) إِلَيَّ أَعْلِمْ فُلَاناً أَنِّي آمُرُهُ بِبَيْعِ حَقِّي مِنَ الضَّيْعَةِ وَ إِيصَالِ ثَمَنِ ذَلِكَ إِلَيَّ وَ إِنَّ ذَلِكَ رَأْيِي إِنْ شَاءَ اللَّهُ أَوْ يُقَوِّمُهَا عَلَى نَفْسِهِ إِنْ كَانَ ذَلِكَ أَوْفَقَ لَهُ ",
          "وَ كَتَبْتُ إِلَيْهِ أَنَّ الرَّجُلَ ذَكَرَ أَنَّ بَيْنَ مَنْ وَقَفَ بَقِيَّةَ هَذِهِ الضَّيْعَةِ عَلَيْهِمُ اخْتِلَافاً شَدِيداً وَ أَنَّهُ لَيْسَ يَأْمَنُ أَنْ يَتَفَاقَمَ ذَلِكَ بَيْنَهُمْ بَعْدَهُ فَإِنْ كَانَ تَرَى أَنْ يَبِيعَ هَذَا الْوَقْفَ وَ يَدْفَعَ إِلَى كُلِّ إِنْسَانٍ مِنْهُمْ مَا كَانَ وُقِفَ لَهُ مِنْ ذَلِكَ أَمَرْتَهُ فَكَتَبَ بِخَطِّهِ إِلَيَّ وَ أَعْلِمْهُ أَنَّ رَأْيِي لَهُ إِنْ كَانَ قَدْ عَلِمَ الِاخْتِلَافَ مَا بَيْنَ أَصْحَابِ الْوَقْفِ أَنْ يَبِيعَ الْوَقْفَ أَمْثَلُ فَإِنَّهُ رُبَّمَا جَاءَ فِي الِاخْتِلَافِ مَا فِيهِ تَلَفُ الْأَمْوَالِ وَ النُّفُوسِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad Bin Isa and a number of our companions, from Sahl Bin Ziyad, both together from Ali Bin Mahziyar who said, ",
            "‘I wrote to Abu Ja’far<sup>asws</sup> that so and so bought a place, so he dedicated it, and made for you<sup>asws</sup> in the dedication, a fifth, and he asks about your view with regards to selling your<sup>asws</sup> share from the land, or evaluate it upon himself with what he had bought it for, or leave it as dedicated’. ",
            "So he<sup>asws</sup> wrote to me: ‘Let him know that I<sup>asws</sup> order him to sell my<sup>asws</sup> right from the place, and deliver the price of that to me<sup>asws</sup>. And that is my<sup>asws</sup> view, Allah<sup>azwj</sup> Willing, or he can evaluate it upon himself if that is more satisfactory for him’. ",
            "And I wrote to him<sup>asws</sup> that the man mentioned that in between the one whom he had dedicated this place over them, there is intense differing, and he is not secure that they would reconcile that between them after him. ",
            "So it was your<sup>asws</sup> view that he should sell this dedicated land and hand over to every person from them what was dedicated to him from that, order it’. So he<sup>asws</sup> wrote by his<sup>asws</sup> own handwriting to me: ‘Let him know that my<sup>asws</sup> view for him is that if he knew of the differing what is between the owners of the dedication, that selling the dedicated land would be more favourable, as perhaps there comes in the differing what is therein, damage to the wealth and the souls’."
          ],
          "en.sarwar": [
            "30. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa and A number of our people have narrated from Sahl ibn Ziyad all from Ali ibn Mahziyar from who has narrated the following: “I once wrote to abu Ja‘far ‘Alayhi al-Salam, that so and so has bought a certain asset. He has made it an endowment of which one-fifth is designated for you. He seeks your opinion about selling your share of the land, or appraising and counting its price on himself for which he has bought or keep it as an endowment. He (the Imam), ‘Alayhi al-Salam, wrote the answer that said, ‘Inform so and so that I command him to sell my share and send the proceeds to me, which is my opinion, by the will of Allah; or appraise it on his own account, if that is more suitable for him.’ I wrote to him (the Imam) that so and so has mentioned that among other beneficiaries of this endowment there are serious difference which may even increase further afterwards; if he (the Imam) considers it proper to sell the endowment and give everyone of the beneficiaries his share if he (the Imam) so commands. He (the Imam) then wrote in his own handwriting to me, ‘Inform him about my opinion that if he thinks the selling of the endowment is better because of the differences of the beneficiaries he can do so; differences can sometimes lead to destruction of properties and lives.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/61)"
        ],
        "index": 13098,
        "local_index": 31,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:31",
        "text": [
          "عَلِيُّ بْنُ مَهْزِيَارَ قَالَ قُلْتُ رَوَى بَعْضُ مَوَالِيكَ عَنْ آبَائِكَ ( عليهم السلام ) أَنَّ كُلَّ وَقْفٍ إِلَى وَقْتٍ مَعْلُومٍ فَهُوَ وَاجِبٌ عَلَى الْوَرَثَةِ وَ كُلَّ وَقْفٍ إِلَى غَيْرِ وَقْتٍ مَعْلُومٍ جَهْلٌ مَجْهُولٌ بَاطِلٌ مَرْدُودٌ عَلَى الْوَرَثَةِ وَ أَنْتَ أَعْلَمُ بِقَوْلِ آبَائِكَ فَكَتَبَ ( عليه السلام ) هُوَ عِنْدِي كَذَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Mahziyar said, ",
            "(To Imam Al-Baqir<sup>asws</sup>), ‘One of those in your<sup>asws</sup> Wilayah reported from your<sup>asws</sup> forefathers<sup>asws</sup> that every dedication of a known time period, so it is Obligatory upon the inheritors, and every dedication for an unknown time period, is an ignorance, unknown, invalid, to be returned to the inheritors, and you<sup>asws</sup> are more knowing of the speech of your<sup>asws</sup> forefathers<sup>asws</sup>’. So he<sup>asws</sup> wrote: ‘It is with me<sup>asws</sup>, as such’."
          ],
          "en.sarwar": [
            "31. Ali ibn Mahziyar has said: “I asked him (the Imam), ‘Alayhi al-Salam, that certain ones of your Mawali (friends or slaves) have narrated from your ancestors the following. ‘All endowments for a known period of time are binding upon the heirs, and all endowments for an unknown period of time are unknown, confusing and invalid that must be returned to the heirs. You know best the words of your ancestors.’ He (the Imam), ‘Alayhi al-Salam, wrote the answer that said, ‘It, with me, is as such.’” (Apparently he (the Imam) left it unexplained.) "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح على الظاهر    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/62)"
        ],
        "index": 13099,
        "local_index": 32,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:32",
        "text": [
          "وَ كَتَبَ إِبْرَاهِيمُ بْنُ مُحَمَّدٍ الْهَمَذَانِيُّ إِلَيْهِ ( عليه السلام ) مَيِّتٌ أَوْصَى بِأَنْ يُجْرَى عَلَى رَجُلٍ مَا بَقِيَ مِنْ ثُلُثِهِ وَ لَمْ يَأْمُرْ بِإِنْفَاذِ ثُلُثِهِ هَلْ لِلْوَصِيِّ أَنْ يُوقِفَ ثُلُثَ الْمَيِّتِ بِسَبَبِ الْإِجْرَاءِ فَكَتَبَ ( عليه السلام ) يُنْفِذُ ثُلُثَهُ وَ لَا يُوقِفُ ."
        ],
        "translations": {
          "en.hubeali": [
            "And Ibrahim Bin Muhammad Al-Hamdany wrote to him<sup>asws</sup>, ‘A deceased bequeathed that there should flow (income) upon a man what remains from his third, and did not order with the enforcement of his third. It is for the executor that he dedicates a third of the deceased (legacy) for the cause of the flowing (of the income)?’ So he<sup>asws</sup> wrote: ‘Enforce his third and do not suspend’."
          ],
          "en.sarwar": [
            "32. ‘Abd al-Rahman ibn Muhammad al-Hamadaniy wrote to him (the Imam), ‘Alayhi al-Salam, the following: “‘A deceased person has made a will which says that to so and so man an amount must be given continuously of what is left of the one-third of his legacy but has not said to complete the one-third. Is it necessary for the executor of the will to make the one-third an endowment to continue executing the will?’ He (the Imam), ‘Alayhi al-Salam, wrote, ‘The one-third must be spent and it must not be made an endowment.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/62)"
        ],
        "index": 13100,
        "local_index": 33,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:33",
        "text": [
          "مُحَمَّدُ بْنُ جَعْفَرٍ الرَّزَّازُ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ سُلَيْمَانَ قَالَ كَتَبْتُ إِلَيْهِ يَعْنِي أَبَا الْحَسَنِ ( عليه السلام ) جُعِلْتُ فِدَاكَ لَيْسَ لِي وَلَدٌ وَ لِي ضِيَاعٌ وَرِثْتُهَا مِنْ أَبِي وَ بَعْضُهَا اسْتَفَدْتُهَا وَ لَا آمَنُ الْحَدَثَانَ فَإِنْ لَمْ يَكُنْ لِي وَلَدٌ وَ حَدَثَ بِي حَدَثٌ فَمَا تَرَى جُعِلْتُ فِدَاكَ لِي أَنْ أُوقِفَ بَعْضَهَا عَلَى فُقَرَاءِ إِخْوَانِي وَ الْمُسْتَضْعَفِينَ أَوْ أَبِيعَهَا وَ أَتَصَدَّقَ بِثَمَنِهَا فِي حَيَاتِي عَلَيْهِمْ فَإِنِّي أَتَخَوَّفُ أَنْ لَا يَنْفُذَ الْوَقْفُ بَعْدَ مَوْتِي فَإِنْ أَوْقَفْتُهَا فِي حَيَاتِي فَلِي أَنْ آكُلَ مِنْهَا أَيَّامَ حَيَاتِي أَمْ لَا ",
          "فَكَتَبَ ( عليه السلام ) فَهِمْتُ كِتَابَكَ فِي أَمْرِ ضِيَاعِكَ وَ لَيْسَ لَكَ أَنْ تَأْكُلَ مِنْهَا مِنَ الصَّدَقَةِ فَإِنْ أَنْتَ أَكَلْتَ مِنْهَا لَمْ يَنْفُذْ إِنْ كَانَ لَكَ وَرَثَةٌ فَبِعْ وَ تَصَدَّقْ بِبَعْضِ ثَمَنِهَا فِي حَيَاتِكَ وَ إِنْ تَصَدَّقْتَ أَمْسَكْتَ لِنَفْسِكَ مَا يَقُوتُكَ مِثْلَ مَا صَنَعَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ja’fa Al Razaz, from Muhammad Bin Isa, from Ali Bin Suleyman who said, ",
            "‘I wrote to him<sup>asws</sup>, meaning Abu Al-Hassan<sup>asws</sup>, ‘May I be sacrificed for you<sup>asws</sup>! There is no child for me, and for me is a place which I inherited from my father, and some which I profited, and I am not secure from the adversities. Since there is no child for me, and an adversity occurs with me, so what is your<sup>asws</sup> view, may I be sacrificed for you<sup>asws</sup>, shall I dedicate some of it upon the poor brethren of mine and the weak ones, or shall I sell it and give in charity to them with its price during my lifetime, as I fear that the dedication would not be enforced after my death. So if I were to dedicate it during my lifetime, so it would be for me that I would be eating from it during the days of my life, or not?’ ",
            "So he<sup>asws</sup> wrote: ‘I<sup>asws</sup> understood your letter in the matter of your place, and it is not for you that you eat from it from the charity, for if you were to eat from it, the inheritance of yours would not be enforced, therefore sell and give in charity with some of its price during your lifetime, and if you were to give in charity, withhold some of it for yourself what is your livelihood, similar to what Amir Al-Momineen<sup>asws</sup> did’."
          ],
          "en.sarwar": [
            "33. Muhammad ibn Ja‘far al-Raziy has narrated from Muhammad ibn ‘Isa from Ali ibn Sulayman who has narrated the following: “I once wrote to him (the Imam), abu al-Hassan, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, I do not have any children and I have assets that I inherited from my father and myself earned a certain amount, but I do not feel safe from something happening. If something happens to me and I have no children, what do you think I must do, I pray to Allah to keep my soul in service for your cause? Can I make a certain amount of it an endowment for the needy, of the oppressed brothers (in belief) or sell it and spend upon them in my lifetime? I fear that endowment may not be managed properly after I die and if I make an endowment for my own survival will I be able to eat thereof?’ He (the Imam), ‘Alayhi al-Salam, wrote, ‘I understood your letter in the matter of your assets. You cannot eat from charity (endowment), if so the law of endowment is not followed just as if you had heirs. You can sell and give as charity a certain amount of the proceeds in your lifetime. If you give as charity you can keep for yourself for your sustenance just as ’Amir al-Mu’minin had done.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/63)"
        ],
        "index": 13101,
        "local_index": 34,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:34",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى قَالَ كَتَبَ بَعْضُ أَصْحَابِنَا إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) فِي الْوَقْفِ وَ مَا رُوِيَ فِيهَا فَوَقَّعَ ( عليه السلام ) الْوُقُوفُ عَلَى حَسَبِ مَا يَقِفُهَا أَهْلُهَا إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya said, ",
            "‘Some of our companions wrote to Abu Muhammad<sup>asws</sup> regarding the dedication and what is reported with regards to it. (He<sup>asws</sup>) said: ‘The dedication depends upon the what (stipulation) its owner has dedicated with, Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "34. Muhammad ibn Yahya has narrated the following: “Certain persons of our people had written to abu Muhammad, ‘Alayhi al-Salam, about endowment and what is narrated about it. He (the Imam), ‘Alayhi al-Salam, signed the answer that said, ‘An endowment is according to what people making the endowment do (condition they set), by the will of Allah.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/63)"
        ],
        "index": 13102,
        "local_index": 35,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:35",
        "text": [
          "مُحَمَّدُ بْنُ جَعْفَرٍ الرَّزَّازُ عَنْ مُحَمَّدِ بْنِ عِيسَى عَنْ أَبِي عَلِيِّ بْنِ رَاشِدٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) قُلْتُ جُعِلْتُ فِدَاكَ اشْتَرَيْتُ أَرْضاً إِلَى جَنْبِ ضَيْعَتِي بِأَلْفَيْ دِرْهَمٍ فَلَمَّا وَفَّيْتُ الْمَالَ خُبِّرْتُ أَنَّ الْأَرْضَ وَقْفٌ فَقَالَ لَا يَجُوزُ شِرَاءُ الْوَقْفِ وَ لَا تُدْخِلِ الْغَلَّةَ فِي مَالِكَ ادْفَعْهَا إِلَى مَنْ أُوقِفَتْ عَلَيْهِ قُلْتُ لَا أَعْرِفُ لَهَا رَبّاً قَالَ تَصَدَّقْ بِغَلَّتِهَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Ja’far Al Razaz, from Muhammad Bin Isa, from his father Ali Bin Rashid who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup>, I said, ‘May I be sacrificed for you<sup>asws</sup>! I bought a land by the side of my place for two thousand Dirhams. So when I paid the money, I was informed that the land was dedicated (Waqf)’. So he<sup>asws</sup> said: ‘It is not allowed to buy the dedicated (property), and do not included the yield in your wealth. Hand it over to the one who dedicated it’. I said, ‘I do not know its lord (owner)’. He<sup>asws</sup> said: ‘Give its yield in charity’."
          ],
          "en.sarwar": [
            "35. Muhammad ibn Ja‘far al-Raziy has narrated from Muhammad ibn ‘Isa from abu Ali ibn Rashid who has narrated the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, saying, ‘I pray to Allah to keep my soul in service for your cause, I have bought a land near by my assets for two thousand dirham. When I made payment, I was informed that the land is an endowment.’ He (the Imam) said, ‘Buying an endowment is not permissible. You must not include its income in your assets. Give it back to its beneficiaries.’ I then said, ‘I do not know the beneficiaries.’ He (the Imam) said, ‘Give its income in charity.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/64)"
        ],
        "index": 13103,
        "local_index": 36,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:36",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ أَبِي الْحَسَنِ <span class=\"bTxt\">( عليه السلام )</span> قَالَ سَأَلْتُهُ عَنِ الرَّجُلِ يُوقِفُ الضَّيْعَةَ ثُمَّ يَبْدُو لَهُ أَنْ يُحْدِثَ فِي ذَلِكَ شَيْئاً فَقَالَ إِنْ كَانَ أَوْقَفَهَا لِوُلْدِهِ وَ لِغَيْرِهِمْ ثُمَّ جَعَلَ لَهَا قَيِّماً لَمْ يَكُنْ لَهُ أَنْ يَرْجِعَ فِيهَا وَ إِنْ كَانُوا صِغَاراً وَ قَدْ شَرَطَ وَلَايَتَهَا لَهُمْ حَتَّى يَبْلُغُوا فَيَحُوزَهَا لَهُمْ لَمْ يَكُنْ لَهُ أَنْ يَرْجِعَ فِيهَا وَ إِنْ كَانُوا كِبَاراً لَمْ يُسَلِّمْهَا إِلَيْهِمْ وَ لَمْ يُخَاصِمُوا حَتَّى يَحُوزُوهَا عَنْهُ فَلَهُ أَنْ يَرْجِعَ فِيهَا لِأَنَّهُمْ لَا يَحُوزُونَهَا عَنْهُ وَ قَدْ بَلَغُوا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad and Abu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, both together from Safwan Bin Yahya, ",
            "(It has been narrated) from Abu Al-Hassan<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about the man who dedicated the place, then it seemed to him something with regards to that’. So he<sup>asws</sup> said: ‘If he had dedicated it to his children and for others, then made a caretaker for it, it is not for him that he should retract with regards to it, if they were young, and he had stipulated a guardian for them until they reach maturity, for he has taken possession for them, it is not for him that he can retract with regards to it, if they were mature, not submitting to them, and not disputing until they take possession from him, so it is for him that he retracts with regards to it, because they had not taken possession from him and have reached maturity’."
          ],
          "en.sarwar": [
            "36. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad and Abu Ali al-Ash‘ariy has narrated from Muhammad ibn ‘Abd al-Jabbar all from Safwan ibn Yahya who has narrated the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who makes a piece of his property an endowment, then decides to change it. He (the Imam) said, ‘If he has made it an endowment for his children and others and then appoints a supervisor for it, he cannot change it. If they are small and he has set a condition that the supervision will rest with them until they mature and so he has taken possession for them in this case also he cannot change it. If they are mature but he has not given it to them and they do not dispute with him until they take possession from him, then he can change it because they have not taken possession from him while they are mature.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/64)"
        ],
        "index": 13104,
        "local_index": 37,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:37",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ مُوسَى بْنِ جَعْفَرٍ عَنْ عَلِيِّ بْنِ مُحَمَّدِ بْنِ سُلَيْمَانَ النَّوْفَلِيِّ قَالَ كَتَبْتُ إِلَى أَبِي جَعْفَرٍ الثَّانِي ( عليه السلام ) أَسْأَلُ عَنْ أَرْضٍ أَوْقَفَهَا جَدِّي عَلَى الْمُحْتَاجِينَ مِنْ وُلْدِ فُلَانِ بْنِ فُلَانٍ وَ هُمْ كَثِيرٌ مُتَفَرِّقُونَ فِي الْبِلَادِ فَأَجَابَ ( عليه السلام ) ذَكَرْتَ الْأَرْضَ الَّتِي أَوْقَفَهَا جَدُّكَ عَلَى فُقَرَاءِ وُلْدِ فُلَانِ بْنِ فُلَانٍ وَ هِيَ لِمَنْ حَضَرَ الْبَلَدَ الَّذِي فِيهِ الْوَقْفُ وَ لَيْسَ لَكَ أَنْ تُتْبِعَ مَنْ كَانَ غَائِباً ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Muhammad Bin Ahmad, from Ahmad, from Musa Bin Ja’far, from Ali Bin Muhammad Bin Suleyman Al Nowfaly who said, ",
            "‘I wrote to Abu Ja’far<sup>asws</sup> the second, asking about a land which was dedicated by my grandfather upon the needy from the sons of so and son, and they were a lot of them, dispersed in the cities’. So he<sup>asws</sup> answered: ‘You mentioned the land which your grandfather had dedicated to the poor from the sons of so and so, and it is for the ones who are present in the city in which the dedicated (place) is, and it is not for you that you track down the ones who are absent’."
          ],
          "en.sarwar": [
            "37. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from Musa ibn Ja‘far from Ali ibn Muhammad ibn Sulayman al- Nawfaliy who has narrated the following: “I once wrote to abu Ja‘far, al-Thaniy, ‘Alayhi al-Salam, and asked about a land that my grandfather had made an endowment for the needy children of so and so who are of a large number in different places. He (the Imam), ‘Alayhi al-Salam, said, ‘You have mentioned the land that your grandfather had made an endowment for the needy children of so and so. It is for those of them who are in the area (town) in which the endowment exists and you do not have to search for everyone who is absent.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن  </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/65)"
        ],
        "index": 13105,
        "local_index": 38,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:38",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنِ الْحُسَيْنِ بْنِ نُعَيْمٍ عَنْ أَبِي الْحَسَنِ مُوسَى ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ جَعَلَ دَاراً سُكْنَى لِرَجُلٍ إِبَّانَ حَيَاتِهِ أَوْ جَعَلَهَا لَهُ وَ لِعَقِبِهِ مِنْ بَعْدِهِ قَالَ هِيَ لَهُ وَ لِعَقِبِهِ مِنْ بَعْدِهِ كَمَا شَرَطَ قُلْتُ فَإِنِ احْتَاجَ يَبِيعُهَا قَالَ نَعَمْ قُلْتُ فَيَنْقُضُ بَيْعُهُ الدَّارَ السُّكْنَى قَالَ لَا يَنْقُضُ الْبَيْعُ السُّكْنَى كَذَلِكَ سَمِعْتُ أَبِي ( عليه السلام ) يَقُولُ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَا يَنْقُضُ الْبَيْعُ الْإِجَارَةَ وَ لَا السُّكْنَى وَ لَكِنْ يَبِيعُهُ عَلَى أَنَّ الَّذِي يَشْتَرِيهِ لَا يَمْلِكُ مَا اشْتَرَى حَتَّى يَنْقَضِيَ السُّكْنَى عَلَى مَا شَرَطَ وَ الْإِجَارَةُ قُلْتُ فَإِنْ رَدَّ عَلَى الْمُسْتَأْجِرِ مَالَهُ وَ جَمِيعَ مَا لَزِمَهُ مِنَ النَّفَقَةِ وَ الْعِمَارَةِ فِيمَا اسْتَأْجَرَهُ قَالَ عَلَى طِيبَةِ النَّفْسِ وَ يَرْضَى الْمُسْتَأْجِرُ بِذَلِكَ لَا بَأْسَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Al Husayn Bin Naeem, ",
            "(It has been narrated) from Abu Al-Hassan Musa<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who made a house for a man to settle in during his lifetime, or made it for him and his offspring from after him. He said, ‘it is for him, and for his offspring from after him just as stipulated’. I said, ‘So if he is needy, can he sell it?’ He<sup>asws</sup> said: ‘Yes’. I said, ‘So does his sale revoke the rented house?’. He<sup>asws</sup> said: ‘The sale does not revoke the rented house, such is how I<sup>asws</sup> heard my<sup>asws</sup> father<sup>asws</sup> saying. Abu Ja’far<sup>asws</sup> said: ‘The sale does not revoke the flow (of rent) nor the settling (tenancy), but it would be sold upon the condition that the one who buys it would not own what he buys until the tenancy is revoked upon what condition and what recompense (rent)’. I said, ‘So if wealth is returned to the tenant, and the entirety of what he had spent, and the building which has been rented?’ He<sup>asws</sup> said: ‘Upon the goodness of the self, and the tenant is happy, there is no problem’."
          ],
          "en.sarwar": [
            "38. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from al-Husayn ibn al-Nu’aym who has narrated the following: “I once asked abu al-Hassan, Musa, ‘Alayhi al-Salam, about the case of a man who has given a house to a man to live in for his lifetime, or it is for him and those whom he leaves behind, as the condition may be. I then said, ‘If needed can he then sell it?’ He (the Imam) said, ‘Yes, he can do so.’ I then asked, ‘Does such a sale cancel its being given to the man for his living a lifetime?’ He (the Imam) said, ‘The sale does not cancel its being given to one for living therein a lifetime. That is how I heard my father, ‘Alayhi al-Salam, say that abu Ja‘far, ‘Alayhi al-Salam, has said, “Selling does not cancel tenancy and rentals or being given to live a lifetime therein according to the condition and rent.’” I then asked, ’What happens if the tenant asks for his expenses, building and maintenance for what he has rented?’ He (the Imam) said, ‘If it is with mutual agreements then it is not harmful.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> مجهول   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/65)"
        ],
        "index": 13106,
        "local_index": 39,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:39",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ خَالِدِ بْنِ رَافِعٍ الْبَجَلِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ سَأَلْتُهُ عَنْ رَجُلٍ جَعَلَ لِرَجُلٍ سُكْنَى دَارٍ لَهُ حَيَاتَهُ يَعْنِي صَاحِبَ الدَّارِفَلَمَّا مَاتَ صَاحِبُ الدَّارِ أَرَادَ وَرَثَتُهُ أَنْ يُخْرِجُوهُ أَ لَهُمْ ذَلِكَ قَالَ فَقَالَ أَرَى أَنْ تُقَوَّمَ الدَّارُ بِقِيمَةٍ عَادِلَةٍ وَ يُنْظَرَ إِلَى ثُلُثِ الْمَيِّتِ فَإِنْ كَانَ فِي ثُلُثِهِ مَا يُحِيطُ بِثَمَنِ الدَّارِ فَلَيْسَ لِلْوَرَثَةِ أَنْ يُخْرِجُوهُ وَ إِنْ كَانَ الثُّلُثُ لَا يُحِيطُ بِثَمَنِ الدَّارِ فَلَهُمْ أَنْ يُخْرِجُوهُ ",
          "قِيلَ لَهُ أَ رَأَيْتَ إِنْ مَاتَ الرَّجُلُ الَّذِي جُعِلَ لَهُ السُّكْنَى بَعْدَ مَوْتِ صَاحِبِ الدَّارِ يَكُونُ السُّكْنَى لِعَقِبِ الَّذِي جُعِلَ لَهُ السُّكْنَى قَالَ لَا ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Ibn Mahboub, from Khalid Bin Rafi’e Al Bajaly, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, said, ‘I asked him<sup>asws</sup> about a man who made to a man his house to settle in during his lifetime, meaning (lifetime) of the owner of the house. So when the owner of the house died, his inheritors wanted to vacate him. Is that (allowed) for them?’ He<sup>asws</sup> said: ‘I<sup>asws</sup> view that the house would be evaluated with a just price, and look into a third of the deceased. So if in his third is what encompasses the price of the house, so it is not for the inheritors that they vacate him. And if it was such that the third does not encompass the price of the house, so it is for them that they vacate him’. ",
            "It was said to him, ‘What is your<sup>asws</sup> view if the man to whom the dwelling was made permissible (the tenant) were to die after the owner of the house (had passed away), If those whom he (the owner of the house) has left behind can live in theat house?’ He<sup>asws</sup> said: ‘No’."
          ],
          "en.sarwar": [
            "39. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad from ibn Mahbub from Khalid ibn Rafi’ al-Bajaliy who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who has given a house to a man to live for the lifetime of the occupant of the house. When the owner dies, the heirs ask the occupant to leave the house; if they can do so. He (the Imam) said, ‘I see that the house must be appraised for a fair price as well as the one-third of the legacy of the deceased. If the one-third covers the price of the house, the heirs cannot ask the occupant to leave the house; but if the one-third of the legacy did not cover the price of the house, then they can ask him to leave.’ It then was asked from him (the Imam), ‘What happens if the man who had permission to live in the house for his lifetime dies after the death of the owner of the house; if those whom he has left behind can live in that house. He (the Imam) said, ‘No, they cannot live in that house.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/66)"
        ],
        "index": 13107,
        "local_index": 40,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:40",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ عَنْ بَعْضِ أَصْحَابِهِ عَنْ أَبَانٍ عَنْ عَجْلَانَ أَبِي صَالِحٍ قَالَ أَمْلَأُ عَلَيَّ أَبُو عَبْدِ اللَّهِ ( عليه السلام ) بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ هَذَا مَا تَصَدَّقَ اللَّهَ بِهِ فُلَانُ بْنُ فُلَانٍ وَ هُوَ حَيٌّ سَوِيٌّ بِدَارِهِ الَّتِي فِي بَنِي فُلَانٍ بِحُدُودِهَا صَدَقَةً لَا تُبَاعُ وَ لَا تُوهَبُ وَ لَا تُورَثُ حَتَّى يَرِثَهَا وَارِثُ السَّمَاوَاتِ وَ الْأَرْضِ وَ إِنَّهُ قَدْ أَسْكَنَ صَدَقَتَهُ هَذِهِ فُلَاناً وَ عَقِبَهُ فَإِذَا انْقَرَضُوا فَهِيَ عَلَى ذِي الْحَاجَةِ مِنَ الْمُسْلِمِينَ .",
          "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنْ أَحْمَدَ بْنِ عُدَيْسٍ عَنْ أَبَانٍ عَنْ عَبْدِ الرَّحْمَنِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, from one of his companions, from Aban, from Ajlan Abu Salih who said, ",
            "‘Abu Abdullah<sup>asws</sup> dictated to me: ‘In the Name of Allah<sup>azwj</sup> the Beneficent, the Merciful! This is what is given in charity for the Sake of Allah<sup>azwj</sup> by so and so son of so and so, and he is alive, unimpaired, with his house which is in the clan of so and so, by its limits, a charity. It shall neither be sold, not gifted, nor inherited until the inheritor of the skies and the earth inherits it, and that he is settling in this charity, so and so and his offspring. So when they become extinct, so it is to the ones with the need from the Muslims’. ",
            "Humeyd Bin iyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ahmad Bin Udeys, from Aban, from Abdul Rahman, ",
            "(It has been narrated) from Abu Abdullah<sup>asws</sup>, similar to it’."
          ],
          "en.sarwar": [
            "40. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad from certain persons of his people from Aban from ‘Ajalan abu Salih who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, dictated to me the following: "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/67)"
        ],
        "index": 13108,
        "local_index": 41,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:23:41",
        "text": [
          "أَبَانٌ عَنْ أَبِي الْجَارُودِ قَالَ قَالَ أَبُو جَعْفَرٍ ( عليه السلام ) لَا يَشْتَرِي الرَّجُلُ مَا تَصَدَّقَ بِهِ وَ إِنْ تَصَدَّقَ بِمَسْكَنٍ عَلَى ذِي قَرَابَتِهِ فَإِنْ شَاءَ سَكَنَ مَعَهُمْ وَ إِنْ تَصَدَّقَ بِخَادِمٍ عَلَى ذِي قَرَابَتِهِ خَدَمَتْهُ إِنْ شَاءَ اللَّهُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Aban, from Abu Al Jaroud who said, ",
            "‘Abu Ja’far<sup>asws</sup> said: ‘The man cannot buy what he has given in charity with, and if he has given a house in charity to the relatives, so if he so desires, he can dwell with them, and if he has given a servant in charity to the relatives, he can serve him (as well), Allah<sup>azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "41. Aban has narrated from abu al-Jarud who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, has said, ‘A man cannot buy what he has given as charity. If he gives as charity a house to a relative then if he likes he can live with them. If he gives in charity a servant to a relative he can serve him by the will of Allah.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:23",
  "kind": "verse_list"
}