{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:7:1", "titles": {"ar": "كتاب  الْوَصَايَا ", "en": "THE BOOK OF BEQUESTS"}}, {"indexed_titles": {"en": "Chapter 32"}, "path": "/books/al-kafi:7:1:32", "titles": {"ar": "باب مَنْ أَوْصَى لِقَرَابَاتِهِ وَ مَوَالِيهِ كَيْفَ يُقْسَمُ بَيْنَهُمْ", "en": "Chapter 32 – The man who bequeaths to his relatives and his friends, how it should be distributed between them"}}], "index": 2010, "local_index": 32, "part_type": "Chapter", "path": "/books/al-kafi:7:1:32", "titles": {"ar": "باب مَنْ أَوْصَى لِقَرَابَاتِهِ وَ مَوَالِيهِ كَيْفَ يُقْسَمُ بَيْنَهُمْ", "en": "Chapter 32 – The man who bequeaths to his relatives and his friends, how it should be distributed between them"}, "verse_count": 3, "verse_start_index": 13120, "verses": [{"index": 13121, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:1:32:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ سَهْلِ بْنِ زِيَادٍ قَالَ كَتَبْتُ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) رَجُلٌ كَانَ لَهُ ابْنَانِ فَمَاتَ أَحَدُهُمَا وَ لَهُ وُلْدٌ ذُكُورٌ وَ إِنَاثٌ فَأَوْصَى لَهُمْ جَدُّهُمْ بِسَهْمِ أَبِيهِمْ فَهَذَا السَّهْمُ الذَّكَرُ وَ الْأُنْثَى فِيهِ سَوَاءٌ أَمْ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ فَوَقَّعَ ( عليه السلام ) يُنْفِذُونَ وَصِيَّةَ جَدِّهِمْ كَمَا أَمَرَ إِنْ شَاءَ اللَّهُ \nقَالَ وَ كَتَبْتُ إِلَيْهِ رَجُلٌ لَهُ وُلْدٌ ذُكُورٌ وَ إِنَاثٌ فَأَقَرَّ لَهُمْ بِضَيْعَةٍ أَنَّهَا لِوُلْدِهِ وَ لَمْ يَذْكُرْ أَنَّهَا بَيْنَهُمْ عَلَى سِهَامِ اللَّهِ عَزَّ وَ جَلَّ وَ فَرَائِضِهِ الذَّكَرُ وَ الْأُنْثَى فِيهِ سَوَاءٌ فَوَقَّعَ ( عليه السلام ) يُنْفِذُونَ فِيهَا وَصِيَّةَ أَبِيهِمْ عَلَى مَا سَمَّى فَإِنْ لَمْ يَكُنْ سَمَّى شَيْئاً رَدُّوهَا إِلَى كِتَابِ اللَّهِ عَزَّ وَ جَلَّ وَ سُنَّةِ نَبِيِّهِ ( صلى الله عليه وآله ) إِنْ شَاءَ اللَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad who said, \n‘I wrote to Abu Muhammad<sup>asws</sup>, ‘A man had two sons for him, so one of them died having (left behind) a boy and a girl. So their grandfather bequeathed to them with the portion of their father. So in this portion, the male and the female are equal in it, or for the male would be similar to two females?’ So he<sup>asws</sup> signed: ‘The bequest of their grandfather would be enforced just as he had ordered, Allah<sup>azwj</sup> Willing’. \nHe (the narrator) said, ‘And I wrote to him<sup>asws</sup>, ‘A man who had children, male and female, so he agreed for then with a place that it is for his children, and did not mention that it is (to be divided) between them with the share (Prescribed by) Allah<sup>azwj</sup> Mighty and Majestic, and His<sup>azwj</sup> Obligation. The male and the female are equal in it?’ So he<sup>asws</sup> signed: ‘The bequest of their father would be enforced upon what he has named. So if he had not mentioned anything, so refer it to the Book of Allah<sup>azwj</sup> Mighty and Majestic, and the Sunnah of His<sup>azwj</sup> Prophet<sup>saww</sup>, Allah<sup>azwj</sup> Willing’."}]}, {"index": 13122, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:1:32:2", "text": "مُحَمَّدُ بْنُ يَحْيَى قَالَ كَتَبَ مُحَمَّدُ بْنُ الْحَسَنِ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) رَجُلٌ أَوْصَى بِثُلُثِ مَالِهِ لِمَوَالِيهِ وَ لِمَوْلَيَاتِهِ الذَّكَرُ وَ الْأُنْثَى فِيهِ سَوَاءٌ أَوْ لِلذَّكَرِ مِثْلُ حَظِّ الْأُنْثَيَيْنِ مِنَ الْوَصِيَّةِ فَوَقَّعَ ( عليه السلام ) جَائِزٌ لِلْمَيِّتِ مَا أَوْصَى بِهِ عَلَى مَا أَوْصَى بِهِ إِنْ شَاءَ اللَّهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahy said, \n‘Muhammad Bin Al-Hassan wrote to Abu Muhammad<sup>asws</sup>, ‘A man bequeathed with a third of his wealth to his male friends and his female friends. Are the males and the females equal in it, or is there to be for the males similar portion of two females from the bequest?’  So he<sup>asws</sup> signed: ‘It I allowed for the deceased what he had bequeathed with, upon what he had bequeathed with, Allah<sup>azwj</sup> Willing’."}]}, {"index": 13123, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:1:32:3", "text": "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنِ ابْنِ رِئَابٍ عَنْ زُرَارَةَ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) فِي رَجُلٍ أَوْصَى بِثُلُثِ مَالِهِ فِي أَعْمَامِهِ وَ أَخْوَالِهِ فَقَالَ لِأَعْمَامِهِ الثُّلُثَانِ وَ لِأَخْوَالِهِ الثُّلُثُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, both together from Ibn Mahboub, from Ibn Raib, from Zurara, \n(It has been narrated) from Abu Ja’far<sup>asws</sup> regarding a man who bequeathed with a third of his wealth among his paternal uncles and his maternal uncles. So he<sup>asws</sup> said: ‘For the paternal uncles is two thirds, and for the maternal uncles is a third’."}]}]}, "index": "al-kafi:7:1:32", "kind": "verse_list"}