{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 33"
        },
        "path": "/books/al-kafi:7:1:33",
        "titles": {
          "ar": "باب مَنْ أَوْصَى إِلَى مُدْرِكٍ وَ أَشْرَكَ مَعَهُ الصَّغِيرَ",
          "en": "Chapter 33 – The one who bequeaths to an adult and associates the young one with him"
        }
      }
    ],
    "index": 2020,
    "local_index": 33,
    "nav": {
      "next": {
        "indexed_titles": {
          "en": "Chapter 34"
        },
        "path": "/books/al-kafi:7:1:34",
        "titles": {
          "ar": "باب مَنْ أَوْصَى إِلَى اثْنَيْنِ فَيَنْفَرِدُ كُلُّ وَاحِدٍ مِنْهُمَا بِبَعْضِ التَّرِكَةِ",
          "en": "Chapter 34 – The one who bequeaths to two (as executors), so each one deals with a different part of the legacy"
        }
      },
      "prev": {
        "indexed_titles": {
          "en": "Chapter 32"
        },
        "path": "/books/al-kafi:7:1:32",
        "titles": {
          "ar": "باب مَنْ أَوْصَى لِقَرَابَاتِهِ وَ مَوَالِيهِ كَيْفَ يُقْسَمُ بَيْنَهُمْ",
          "en": "Chapter 32 – The man who bequeaths to his relatives and his friends, how it should be distributed between them"
        }
      },
      "up": {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      }
    },
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:33",
    "titles": {
      "ar": "باب مَنْ أَوْصَى إِلَى مُدْرِكٍ وَ أَشْرَكَ مَعَهُ الصَّغِيرَ",
      "en": "Chapter 33 – The one who bequeaths to an adult and associates the young one with him"
    },
    "verse_count": 2,
    "verse_start_index": 13134,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/77)"
        ],
        "index": 13135,
        "local_index": 1,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/20",
              "text": "مُحَمَّدُ بْنُ يَحْيَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/4",
              "text": "أَحْمَدَ بْنِ مُحَمَّدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/198",
              "text": "مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/5465",
              "text": "أَخِيهِ جَعْفَرِ بْنِ عِيسَى"
            },
            {
              "kind": "plain",
              "text": " عَنْ "
            },
            {
              "kind": "narrator",
              "path": "/people/narrators/941",
              "text": "عَلِيِّ بْنِ يَقْطِينٍ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ أَخِيهِ جَعْفَرِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:33:1",
        "text": [
          " سَأَلْتُ أَبَا الْحَسَنِ ( عليه السلام ) عَنْ رَجُلٍ أَوْصَى إِلَى امْرَأَةٍ فَأَشْرَكَ فِي الْوَصِيَّةِ مَعَهَا صَبِيّاً فَقَالَ يَجُوزُ ذَلِكَ وَ تُمْضِي الْمَرْأَةُ الْوَصِيَّةَ وَ لَا يُنْتَظَرُ بُلُوغُ الصَّبِيِّ فَإِذَا بَلَغَ الصَّبِيُّ فَلَيْسَ لَهُ أَنْ لَا يَرْضَى إِلَّا مَا كَانَ مِنْ تَبْدِيلٍ أَوْ تَغْيِيرٍ فَإِنَّ لَهُ أَنْ يَرُدَّهُ إِلَى مَا أَوْصَى بِهِ الْمَيِّتُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa Bin Ubeyd, from his brother Ja’far Bin Isa, from Ali Bin Yaqteen who said, ",
            "‘I asked Abu Al-Hassan<sup>asws</sup> about a man who bequeathed to a woman, so he associated in the bequest a child along with her. So he<sup>asws</sup> said: ‘That is allowed, and the woman would enforce the bequest and will not wait for the adulthood of the child. So when the child reaches adulthood, so it would not be for him he is not happy, except what was from the alteration or changing (of the bequest), so then there would be for him that he can return it to what the deceased had bequeathed to him (beforehand)’."
          ],
          "en.sarwar": [
            "1. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad ibn ‘Isa ibn ‘Ubayd from his brother, Ja‘far ibn ‘Isa from Ali ibn Yaqtin who has narrated the following: “I once asked abu al-Hassan, ‘Alayhi al-Salam, about the case of a man who makes a bequest for a woman to share it with a child. He (the Imam) said, ‘It is permissible. The woman can execute the will and she does not have to wait until the child becomes mature. The child upon maturity cannot disagree unless the will is changed or altered, in which case the child can turn it back to comply with the will.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/78)"
        ],
        "index": 13136,
        "local_index": 2,
        "narrator_chain": {
          "parts": [
            {
              "kind": "narrator",
              "path": "/people/narrators/262",
              "text": "مُحَمَّدٌ"
            },
            {
              "kind": "plain",
              "text": " قَالَ"
            }
          ],
          "text": "مُحَمَّدٌ قَالَ"
        },
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:33:2",
        "text": [
          " كَتَبَ مُحَمَّدُ بْنُ الْحَسَنِ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) رَجُلٌ أَوْصَى إِلَى وُلْدِهِ وَ فِيهِمْ كِبَارٌ قَدْ أَدْرَكُوا وَ فِيهِمْ صِغَارٌ أَ يَجُوزُ لِلْكِبَارِ أَنْ يُنْفِذُوا وَصِيَّتَهُ وَ يَقْضُوا دَيْنَهُ لِمَنْ صَحَّ عَلَى الْمَيِّتِ بِشُهُودٍ عُدُولٍ قَبْلَ أَنْ يُدْرِكَ الْأَوْصِيَاءُ الصِّغَارُ فَوَقَّعَ ( عليه السلام ) نَعَمْ عَلَى الْأَكَابِرِ مِنَ الْوِلْدَانِ أَنْ يَقْضُوا دَيْنَ أَبِيهِمْ وَ لَا يَحْبِسُوهُ بِذَلِكَ ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad said, ",
            "‘Muhammad Bin Al-Hassan wrote to Abu Muhammad<sup>asws</sup>, ‘A man bequeathed to his children, and among them were adults who had attained puberty, and among them were young ones. Is it allowed for the adults that they can enforce his bequest, and pay-off his debts for the one who is correct upon the deceased with just witnesses before the young ones mature?’ So he<sup>asws</sup> signed: ‘Yes. It is upon the adults from the children that they pay-off debts, and not let him be imprisoned by that (debts)’."
          ],
          "en.sarwar": [
            "2. Muhammad has said the following: “Once Muhammad ibn al-Hassan wrote to abu Muhammad, ‘Alayhi al-Salam, about the case of a man who made a bequest for his children consisting of adults and minor ones, if it is lawful for the adults to execute the will, pay off his debts to the rightful creditors according to just witnesses before the minors become adults. He (the Imam) signed the answer that said, ‘The adult children must pay the debts of their father and they must not allow him to remain imprisoned thereby (the debts).”’ "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:33",
  "kind": "verse_list"
}