{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:7:1", "titles": {"ar": "كتاب  الْوَصَايَا ", "en": "THE BOOK OF BEQUESTS"}}, {"indexed_titles": {"en": "Chapter 33"}, "path": "/books/al-kafi:7:1:33", "titles": {"ar": "باب مَنْ أَوْصَى إِلَى مُدْرِكٍ وَ أَشْرَكَ مَعَهُ الصَّغِيرَ", "en": "Chapter 33 – The one who bequeaths to an adult and associates the young one with him"}}], "index": 2011, "local_index": 33, "part_type": "Chapter", "path": "/books/al-kafi:7:1:33", "titles": {"ar": "باب مَنْ أَوْصَى إِلَى مُدْرِكٍ وَ أَشْرَكَ مَعَهُ الصَّغِيرَ", "en": "Chapter 33 – The one who bequeaths to an adult and associates the young one with him"}, "verse_count": 2, "verse_start_index": 13123, "verses": [{"index": 13124, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:1:33:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">م</span>ُحَمَّدُ بْنُ يَحْيَى</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنْ مُحَمَّدِ بْنِ عِيسَى بْنِ عُبَيْدٍ عَنْ أَخِيهِ جَعْفَرِ بْنِ عِيسَى عَنْ عَلِيِّ بْنِ يَقْطِينٍ قَالَ سَأَلْتُ أَبَا الْحَسَنِ <span class=\"bTxt\">( عليه السلام )</span> عَنْ رَجُلٍ أَوْصَى إِلَى امْرَأَةٍ فَأَشْرَكَ فِي الْوَصِيَّةِ مَعَهَا صَبِيّاً فَقَالَ يَجُوزُ ذَلِكَ وَ تُمْضِي الْمَرْأَةُ الْوَصِيَّةَ وَ لَا يُنْتَظَرُ بُلُوغُ الصَّبِيِّ فَإِذَا بَلَغَ الصَّبِيُّ فَلَيْسَ لَهُ أَنْ لَا يَرْضَى إِلَّا مَا كَانَ مِنْ تَبْدِيلٍ أَوْ تَغْيِيرٍ فَإِنَّ لَهُ أَنْ يَرُدَّهُ إِلَى مَا أَوْصَى بِهِ الْمَيِّتُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Ahmad Bin Muhammad, from Muhammad Bin Isa Bin Ubeyd, from his brother Ja’far Bin Isa, from Ali Bin Yaqteen who said, \n‘I asked Abu Al-Hassan<sup>asws</sup> about a man who bequeathed to a woman, so he associated in the bequest a child along with her. So he<sup>asws</sup> said: ‘That is allowed, and the woman would enforce the bequest and will not wait for the adulthood of the child. So when the child reaches adulthood, so it would not be for him he is not happy, except what was from the alteration or changing (of the bequest), so then there would be for him that he can return it to what the deceased had bequeathed to him (beforehand)’."}]}, {"index": 13125, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:1:33:2", "text": "مُحَمَّدٌ قَالَ كَتَبَ مُحَمَّدُ بْنُ الْحَسَنِ إِلَى أَبِي مُحَمَّدٍ ( عليه السلام ) رَجُلٌ أَوْصَى إِلَى وُلْدِهِ وَ فِيهِمْ كِبَارٌ قَدْ أَدْرَكُوا وَ فِيهِمْ صِغَارٌ أَ يَجُوزُ لِلْكِبَارِ أَنْ يُنْفِذُوا وَصِيَّتَهُ وَ يَقْضُوا دَيْنَهُ لِمَنْ صَحَّ عَلَى الْمَيِّتِ بِشُهُودٍ عُدُولٍ قَبْلَ أَنْ يُدْرِكَ الْأَوْصِيَاءُ الصِّغَارُ فَوَقَّعَ ( عليه السلام ) نَعَمْ عَلَى الْأَكَابِرِ مِنَ الْوِلْدَانِ أَنْ يَقْضُوا دَيْنَ أَبِيهِمْ وَ لَا يَحْبِسُوهُ بِذَلِكَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad said, \n‘Muhammad Bin Al-Hassan wrote to Abu Muhammad<sup>asws</sup>, ‘A man bequeathed to his children, and among them were adults who had attained puberty, and among them were young ones. Is it allowed for the adults that they can enforce his bequest, and pay-off his debts for the one who is correct upon the deceased with just witnesses before the young ones mature?’ So he<sup>asws</sup> signed: ‘Yes. It is upon the adults from the children that they pay-off debts, and not let him be imprisoned by that (debts)’."}]}]}, "index": "al-kafi:7:1:33", "kind": "verse_list"}