{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:7:1", "titles": {"ar": "كتاب  الْوَصَايَا ", "en": "THE BOOK OF BEQUESTS"}}, {"indexed_titles": {"en": "Chapter 4"}, "path": "/books/al-kafi:7:1:4", "titles": {"ar": "باب أَنَّ صَاحِبَ الْمَالِ أَحَقُّ بِمَالِهِ مَا دَامَ حَيّاً", "en": "Chapter 4 – The owner of the wealth is more rightful with (the distribution of) his wealth for as long as he is alive"}}], "index": 1982, "local_index": 4, "part_type": "Chapter", "path": "/books/al-kafi:7:1:4", "titles": {"ar": "باب أَنَّ صَاحِبَ الْمَالِ أَحَقُّ بِمَالِهِ مَا دَامَ حَيّاً", "en": "Chapter 4 – The owner of the wealth is more rightful with (the distribution of) his wealth for as long as he is alive"}, "verse_count": 10, "verse_start_index": 12967, "verses": [{"index": 12968, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>ِدَّةٌ مِنْ أَصْحَابِنَا</span> عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى عَنِ الْحَسَنِ بْنِ عَلِيٍّ عَنْ ثَعْلَبَةَ بْنِ مَيْمُونٍ عَنْ أَبِي الْحَسَنِ السَّابَاطِيِّ عَنْ عَمَّارِ بْنِ مُوسَى أَنَّهُ سَمِعَ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) يَقُولُ صَاحِبُ الْمَالِ أَحَقُّ بِمَالِهِ مَا دَامَ فِيهِ شَيْ‏ءٌ مِنَ الرُّوحِ يَضَعُهُ حَيْثُ شَاءَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "A number of our companions, from Ahmad Bin Muhammad Bin Isa, from Al Hassan Bin Ali, from Sa’alba Bin Maymoun, from Abu Al Hassan Al Sabaty, from Ammar Bin Musa, who heard\nAbu Abdullah<sup>asws</sup> said: ‘The owner of the wealth is more rightful with (the distribution of) his wealth so long as there is something within him from the soul. He can place it wherever he so wishes to’."}]}, {"index": 12969, "local_index": 2, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:2", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ عَلِيِّ بْنِ أَسْبَاطٍ عَنْ ثَعْلَبَةَ عَنْ أَبِي الْحَسَنِ عُمَرَ بْنِ شَدَّادٍ الْأَزْدِيِّ وَ السَّرِيِّ جَمِيعاً عَنْ عَمَّارِ بْنِ مُوسَى عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الرَّجُلُ أَحَقُّ بِمَالِهِ مَا دَامَ فِيهِ الرُّوحُ إِنْ أَوْصَى بِهِ كُلِّهِ فَهُوَ جَائِزٌ لَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Al Hassan, from Ali Bin Asbaat, from Sa’alba, from Abu Al Hassan Umar Bin Shaddad Al Azdy and Sarayya, both together, from Ammar Bin Musa, \nAbu Abdullah<sup>asws</sup> has said: ‘The man is more rightful with (the distribution of) his wealth for as long as there is the soul within him. If he were to bequeath with the whole of it, so it is allowed for him’."}]}, {"index": 12970, "local_index": 3, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:3", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ إِبْرَاهِيمَ بْنِ أَبِي بَكْرِ بْنِ أَبِي السَّمَّالِ الْأَسَدِيِّ عَمَّنْ أَخْبَرَهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمَيِّتُ أَوْلَى بِمَالِهِ مَا دَامَ فِيهِ الرُّوحُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Al Hassan, from Ibrahim Bin Abu Bakr Bin Abu Al Sammal Al Asady, from the one who informed him, \nAbu Abdullah<sup>asws</sup> has said: ‘The dying one is higher with (the distribution of his wealth) for as long as there is the soul within him’."}]}, {"index": 12971, "local_index": 4, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:4", "text": "أَحْمَدُ بْنُ مُحَمَّدٍ عَنْ عَلِيِّ بْنِ الْحَسَنِ عَنْ أَخِيهِ أَحْمَدَ بْنِ الْحَسَنِ عَنْ عَمْرِو بْنِ سَعِيدٍ قَالَ أَوْصَى أَخُو رُومِيِّ بْنِ عُمَرَ أَنَّ جَمِيعَ مَالِهِ لِأَبِي جَعْفَرٍ ( عليه السلام ) قَالَ عَمْرٌو فَأَخْبَرَنِي رُومِيٌّ أَنَّهُ وَضَعَ الْوَصِيَّةَ بَيْنَ يَدَيْ أَبِي جَعْفَرٍ ( عليه السلام ) فَقَالَ هَذَا مَا أَوْصَى لَكَ بِهِ أَخِي وَ جَعَلْتُ أَقْرَأُ عَلَيْهِ فَيَقُولُ لِي قِفْ وَ يَقُولُ احْمِلْ كَذَا وَ وَهَبْتُ لَكَ كَذَا حَتَّى أَتَيْتُ عَلَى الْوَصِيَّةِ فَنَظَرْتُ فَإِذَا إِنَّمَا أَخَذَ الثُّلُثَ قَالَ فَقُلْتُ لَهُ أَمَرْتَنِي أَنْ أَحْمِلَ إِلَيْكَ الثُّلُثَ وَ وَهَبْتَ لِيَ الثُّلُثَيْنِ فَقَالَ نَعَمْ قُلْتُ أَبِيعُهُ وَ أَحْمِلُهُ إِلَيْكَ قَالَ لَا عَلَى الْمَيْسُورِ عَلَيْكَ لَا تَبِعْ شَيْئاً .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ahmad Bin Muhammad, from Ali Bin Al Hassan, from his brother Ahmad Bin Al Hassan, from Amro Bin Saeed who said, \n‘The brother of Rowmy Bin Umar bequeathed that the entire wealth of his to be for Abu Ja’far<sup>asws</sup>.  Amro Said, ‘So Rowmy informed his brother that he has placed the will in front of Abu Ja’far<sup>asws</sup>, so he said, ‘This is what has been bequeathed to you<sup>asws</sup> by my brother’, and I went on to read to him<sup>asws</sup>. So he<sup>asws</sup> said to me: ‘Hold on!’ And he<sup>asws</sup> said: ‘Carry such and such, and I<sup>asws</sup> have gifted such and such for you’, until I came to the will. So I looked and it was so, that he<sup>asws</sup> had taken a third. So I said to him<sup>asws</sup>, ‘Are you<sup>asws</sup> ordering me that I should carry a third to you, and you<sup>asws</sup> have gifted to me with the two thirds?’ So he<sup>asws</sup> said: ‘Yes’. I said, ‘Shall I sell it and carry it to you<sup>asws</sup>?’ He<sup>asws</sup> said: ‘No, if it is feasible upon you, do not sell anything’."}]}, {"index": 12972, "local_index": 5, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:5", "text": "مُحَمَّدُ بْنُ يَحْيَى وَ غَيْرُهُ عَنْ مُحَمَّدِ بْنِ أَحْمَدَ عَنْ يَعْقُوبَ بْنِ يَزِيدَ عَنْ يَحْيَى بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ سَمَاعَةَ قَالَ قُلْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) الرَّجُلُ يَكُونُ لَهُ الْوَلَدُ أَ يَسَعُهُ أَنْ يَجْعَلَ مَالَهُ لِقَرَابَتِهِ قَالَ هُوَ مَالُهُ يَصْنَعُ بِهِ مَا شَاءَ إِلَى أَنْ يَأْتِيَهُ الْمَوْتُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya and someone else, from Muhammad Bin Ahmad, from Yaqoub Bin Yazeed, from Yahya Bin Al Mubarak, from Abdullah Bin Jabala, from Sama’at who said, \n‘I said to Abu Abdullah<sup>asws</sup>, ‘The man, there happens to be a son for him, does he have the leeway that he makes his wealth for his near relatives?’ He<sup>asws</sup> said: ‘It is his wealth. He can place it wherever he so wishes to, until the death comes to him’."}]}, {"index": 12973, "local_index": 6, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:6", "text": "مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ وَ أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ جَمِيعاً عَنْ صَفْوَانَ عَنْ مُرَازِمٍ عَنْ بَعْضِ أَصْحَابِنَا عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الرَّجُلِ يُعْطِي الشَّيْ‏ءَ مِنْ مَالِهِ فِي مَرَضِهِ فَقَالَ إِذَا أَبَانَ فِيهِ فَهُوَ جَائِزٌ وَ إِنْ أَوْصَى بِهِ فَهُوَ مِنَ الثُّلُثِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Ismail, from Al Fazal Bin Shazaan and Abu Ali Al Ash’ary, from Muhammad Bin Abdul Jabbar both together, from Safwan, from Marazim, from one of our companions, \n(It has been narrated) from Abu Abdullah<sup>asws</sup> regarding the man who gave something from his wealth during his illness. So he<sup>asws</sup> said: ‘If he has kept it aside, so it is allowed (to use it), and if he has bequeathed with it, so it is from the third (to be given out)’."}]}, {"index": 12974, "local_index": 7, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:7", "text": "حُمَيْدُ بْنُ زِيَادٍ عَنِ الْحَسَنِ بْنِ مُحَمَّدِ بْنِ سَمَاعَةَ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُرَازِمٍ عَنْ عَمَّارٍ السَّابَاطِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْمَيِّتُ أَحَقُّ بِمَالِهِ مَا دَامَ فِيهِ الرُّوحُ يُبِينُ بِهِ قَالَ نَعَمْ فَإِنْ أَوْصَى بِهِ فَإِنْ تَعَدَّى فَلَيْسَ لَهُ إِلَّا الثُّلُثُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Hameed Bin Ziyad, from Al Hassan Bin Muhammad Bin Sama’at, from Ibn Abu Umeyr, from Marazam, from Ammar Al Sabaty, \nAbu Abdullah<sup>asws</sup>, said: ‘The dying one is more deserving with the (distribution) of his wealth for as long as the soul is within him, keeping it aside?’ He<sup>asws</sup> said: ‘Yes, so if he were to bequeath by it, so he would be exceeding. There is not for him except for the third (to distribute)’."}]}, {"index": 12975, "local_index": 8, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:8", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الرَّجُلُ لَهُ الْوَلَدُ أَ يَسَعُهُ أَنْ يَجْعَلَ مَالَهُ لِقَرَابَتِهِ فَقَالَ هُوَ مَالُهُ يَصْنَعُ بِهِ مَا شَاءَ إِلَى أَنْ يَأْتِيَهُ الْمَوْتُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdullah Bin Al Mubarak, from Abdullah Bin Jabala, from Sama’at, from Abu Baseer, \n(The narrator says) ‘I said to Abu Abdullah<sup>asws</sup>, ‘The man has the son for him, does he have the leeway to make his wealth to be for his relatives?’ So he<sup>asws</sup> said: ‘It is his wealth. He can place it wherever he so wishes to until the death comes upon him’."}]}, {"index": 12976, "local_index": 9, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:9", "text": "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنْ عُثْمَانَ بْنِ سَعِيدٍ عَنْ أَبِي الْمَحَامِلِ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ الْإِنْسَانُ أَحَقُّ بِمَالِهِ مَا دَامَ الرُّوحُ فِي بَدَنِهِ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Usman Bin Saeed, from Abu Al Mahamil, \nAbu Abdullah<sup>asws</sup> has said: ‘The human being is more rightful with (the distribution of) his wealth for as long as the soul is in his body’."}]}, {"index": 12977, "local_index": 10, "part_type": "Hadith", "path": "/books/al-kafi:7:1:4:10", "text": "مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ الْحُسَيْنِ عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ عَنْ عَبْدِ اللَّهِ بْنِ جَبَلَةَ عَنْ سَمَاعَةَ عَنْ أَبِي بَصِيرٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قُلْتُ لَهُ الرَّجُلُ لَهُ الْوَلَدُ أَ يَسَعُهُ أَنْ يَجْعَلَ مَالَهُ لِقَرَابَتِهِ فَقَالَ هُوَ مَالُهُ يَصْنَعُ بِهِ مَا شَاءَ إِلَى أَنْ يَأْتِيَهُ الْمَوْتُ إِنَّ لِصَاحِبِ الْمَالِ أَنْ يَعْمَلَ بِمَالِهِ مَا شَاءَ مَا دَامَ حَيّاً إِنْ شَاءَ وَهَبَهُ وَ إِنْ شَاءَ تَصَدَّقَ بِهِ وَ إِنْ شَاءَ تَرَكَهُ إِلَى أَنْ يَأْتِيَهُ الْمَوْتُ فَإِنْ أَوْصَى بِهِ فَلَيْسَ لَهُ إِلَّا الثُّلُثُ إِلَّا أَنَّ الْفَضْلَ فِي أَنْ لَا يُضَيِّعَ مَنْ يَعُولُهُ وَ لَا يُضِرَّ بِوَرَثَتِهِ .\nوَ قَدْ رُوِيَ أَنَّ النَّبِيَّ ( صلى الله عليه وآله ) قَالَ لِرَجُلٍ مِنَ الْأَنْصَارِ أَعْتَقَ مَمَالِيكَ لَهُ لَمْ يَكُنْ لَهُ غَيْرُهُمْ فَعَابَهُ النَّبِيُّ ( صلى الله عليه وآله ) وَ قَالَ تَرَكَ صِبْيَةً صِغَاراً يَتَكَفَّفُونَ النَّاسَ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Muhammad Bin Yahya, from Muhammad Bin Al Husayn, from Abdullah Bin Al Mubarak, from Abdullah Bin Jabala, from Sama’at, from Abu Baseer, \n(The narrator says): ‘I said to Abu Abdullah<sup>asws</sup>, ‘The man has the son for him. Does he have the leeway that he makes his wealth to be for his relatives?’ So he<sup>asws</sup> said: ‘It is his wealth. He places whatever he so desires to, until the death comes upon him. It is for the owner of the wealth that he does with his wealth whatever he so desires to so long as he is alive. If he so desires, gifts it, and if he so desires, he gives it in charity with it, and if he so desires he leaves it, until the death comes to him. But, if he were to bequeath with it, so there is not for him except for the third (to be given away as charity), except that the preference in that is the he should not waste it from the ones who are dependent upon him, nor harm his inheritors.\nAnd it has been reported that the Prophet<sup>saww</sup> said for a man from the Helpers who had liberated his slaves, not having for himself other than them, so the Prophet<sup>saww</sup> faulted him and said: ‘He left young children (of his) to beg from the people’."}]}]}, "index": "al-kafi:7:1:4", "kind": "verse_list"}