{
  "data": {
    "crumbs": [
      {
        "indexed_titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        },
        "path": "/books/al-kafi",
        "titles": {
          "ar": "الكافي",
          "en": "Al-Kafi"
        }
      },
      {
        "indexed_titles": {
          "en": "Volume 7"
        },
        "path": "/books/al-kafi:7",
        "titles": {
          "ar": "الجزء السابع‏",
          "en": "Volume Seven"
        }
      },
      {
        "indexed_titles": {
          "en": "Book 1"
        },
        "path": "/books/al-kafi:7:1",
        "titles": {
          "ar": "كتاب  الْوَصَايَا ",
          "en": "THE BOOK OF BEQUESTS"
        }
      },
      {
        "indexed_titles": {
          "en": "Chapter 6"
        },
        "path": "/books/al-kafi:7:1:6",
        "titles": {
          "ar": "باب مَا لِلْإِنْسَانِ أَنْ يُوصِيَ بِهِ بَعْدَ مَوْتِهِ وَ مَا يُسْتَحَبُّ لَهُ مِنْ ذَلِكَ",
          "en": "Chapter 6 – What is for the human being that he bequeaths after his death, and what is recommended from that"
        }
      }
    ],
    "index": 1993,
    "local_index": 6,
    "part_type": "Chapter",
    "path": "/books/al-kafi:7:1:6",
    "titles": {
      "ar": "باب مَا لِلْإِنْسَانِ أَنْ يُوصِيَ بِهِ بَعْدَ مَوْتِهِ وَ مَا يُسْتَحَبُّ لَهُ مِنْ ذَلِكَ",
      "en": "Chapter 6 – What is for the human being that he bequeaths after his death, and what is recommended from that"
    },
    "verse_count": 7,
    "verse_start_index": 12994,
    "verse_translations": [
      {
        "id": "en.hubeali",
        "lang": "en",
        "name": "HubeAli.com"
      },
      {
        "id": "en.sarwar",
        "lang": "en",
        "name": "Shaykh Muhammad Sarwar (from Thaqalayn.net)"
      }
    ],
    "verses": [
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/19)"
        ],
        "index": 12995,
        "local_index": 1,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:6:1",
        "text": [
          "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ وَ مُحَمَّدُ بْنُ إِسْمَاعِيلَ عَنِ الْفَضْلِ بْنِ شَاذَانَ جَمِيعاً عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ مُعَاوِيَةَ بْنِ عَمَّارٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ كَانَ الْبَرَاءُ بْنُ مَعْرُورٍ الْأَنْصَارِيُّ بِالْمَدِينَةِ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِمَكَّةَ وَ إِنَّهُ حَضَرَهُ الْمَوْتُ وَ كَانَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) بِمَكَّةَ وَ أَصْحَابُهُ وَ الْمُسْلِمُونَ يُصَلُّونَ إِلَى بَيْتِ الْمَقْدِسِ وَ أَوْصَى الْبَرَاءُ إِذَا دُفِنَ أَنْ يُجْعَلَ وَجْهُهُ إِلَى تِلْقَاءِ النَّبِيِّ ( صلى الله عليه وآله ) إِلَى الْقِبْلَةِ وَ أَوْصَى بِثُلُثِ مَالِهِ فَجَرَتْ بِهِ السُّنَّةُ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim from his father, and Muhammad Bin Ismail, from Al Fazal Bin Shazaan both together, from Ibn Abu Umeyr, from Muawiya Bin Ammar, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘Al-Bara’a Bin Marouf the Helper was at Al-Medina, and Rasool-Allah<sup>saww</sup> was at Makkah, and death presented itself to him, and Rasool-Allah<sup>saww</sup> was at Makkah, and his<sup>saww</sup> companions, and the Muslims were Praying towards Bayt Al-Maqdis, and Al-Bara’a bequeathed that he should be buried and his face to be made to be facing towards the direction of the Prophet<sup>saww</sup>, and bequeathed with a third of his wealth. Thus, the Sunnah flowed by it’."
          ],
          "en.sarwar": [
            "1. Ali ibn Ibrahim has narrated from his father from and Muhammad ibn ’Isma’il has narrated from al-Fadl ibn Shadhan from all ibn abu ‘Umayr from Mu‘awiyah ibn ‘Ammar who has narrated the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said that al-Bara’ ibn Ma’rur al-Ansariy lived in al-Madinah. The Messenger of Allah, O Allah, grant compensation to Muhammad and his family worthy of their services to Your cause, lived in Makkah, and with his companions performed Salat (prayer) facing the direction of Bayt al-Maqdis. Al-Bara’ made a will that said, ‘His face in grave must be kept toward the direction to which the Holy Prophet performs Salat (prayer) and about one-third of his legacy and thus the Sunnah was established.”’ "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/19)"
        ],
        "index": 12996,
        "local_index": 2,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:6:2",
        "text": [
          "مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ قَالَ كَتَبَ أَحْمَدُ بْنُ إِسْحَاقَ إِلَى أَبِي الْحَسَنِ ( عليه السلام ) أَنَّ دُرَّةَ بِنْتَ مُقَاتِلٍ تُوُفِّيَتْ وَ تَرَكَتْ ضَيْعَةً أَشْقَاصاً فِي مَوَاضِعَ وَ أَوْصَتْ لِسَيِّدِهَا مِنْ أَشْقَاصِهَا بِمَا يَبْلُغُ أَكْثَرَ مِنَ الثُّلُثِ وَ نَحْنُ أَوْصِيَاؤُهَا وَ أَحْبَبْنَا أَنْ نُنْهِيَ إِلَى سَيِّدِنَا فَإِنْ هُوَ أَمَرَ بِإِمْضَاءِ الْوَصِيَّةِ عَلَى وَجْهِهَا أَمْضَيْنَاهَا وَ إِنْ أَمَرَ بِغَيْرِ ذَلِكَ انْتَهَيْنَا إِلَى أَمْرِهِ فِي جَمِيعِ مَا يَأْمُرُ بِهِ إِنْ شَاءَ اللَّهُ ",
          "قَالَ فَكَتَبَ ( عليه السلام ) بِخَطِّهِ لَيْسَ يَجِبُ لَهَا مِنْ تَرِكَتِهَا إِلَّا الثُّلُثُ وَ إِنْ تَفَضَّلْتُمْ وَ كُنْتُمُ الْوَرَثَةَ كَانَ جَائِزاً لَكُمْ إِنْ شَاءَ اللَّهُ."
        ],
        "translations": {
          "en.hubeali": [
            "Muhammad Bin Yahya, from Ahmad Bin Muhammad who said, ",
            "‘Ahmad Bin Is’haq wrote to Abu Al-Hassan<sup>asws</sup> that Durrah, daughter of Maqatil had died, and she left assets and pieces of land in various places, and bequeathed to her master, from her assets which reached to be more than a third, and we are her executors, and we would love that we finalise it to our Master<sup>asws</sup>, for if he<sup>asws</sup> were to sign off the bequest upon its face (as it is), we will sign it off, and if he<sup>asws</sup> commands with other than that, we will end up to his<sup>asws</sup> command in the entirety of what he<sup>asws</sup> commands with, Allah<sup>azwj</sup> Willing’. ",
            "He (the narrator) said, ‘So he<sup style=\"font-weight: normal\">asws</sup> wrote in his<sup style=\"font-weight: normal\">asws</sup> own handwriting: ‘It is not Obligatory for her from what she left except for the third, and if you have preferences, and you are the inheritors, it is permissible for you, Allah<sup style=\"font-weight: normal\">azwj</sup> Willing’."
          ],
          "en.sarwar": [
            "2. Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad has said that Ahmad ibn Ishaq wrote to abu al-Hassan, ‘Alayhi al- Salam saying: “Durrah, daughter of Muqatil has died. She has left assets and pieces of land in several places. She had made a will for her master of the pieces of land, which was more than one-third of her legacy. We are the executors of her will and like to ask our master if he commands to approve that will as it is, so we can also approve; and if he commands other things we follow his command in all that he commands by the will of Allah. He (the narrator) has said that he (the Imam), ‘Alayhi al-Salam, wrote in his own handwriting that said, ‘More than one-third is not obligatory on her legacy. If you have preferences and you are of the heirs it then is permissible for you by the will of Allah.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/20)"
        ],
        "index": 12997,
        "local_index": 3,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:6:3",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحُسَيْنِ بْنِ سَعِيدٍ عَنْ حَمَّادِ بْنِ عِيسَى عَنْ شُعَيْبِ بْنِ يَعْقُوبَ قَالَ سَأَلْتُ أَبَا عَبْدِ اللَّهِ ( عليه السلام ) عَنِ الرَّجُلِ يَمُوتُ مَا لَهُ مِنْ مَالِهِ فَقَالَ لَهُ ثُلُثُ مَالِهِ وَ لِلْمَرْأَةِ أَيْضاً<span class=\"bTxt\">.</span>"
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Ahmad Bin Muhammad, from Al Husayn Bin Saeed, from Hamaad Bin Isa, from Shuayb Bin Yaqoub who said, ",
            "‘I asked Abu Abdullah<sup>asws</sup> about the man who died and what would be for him from his wealth. So he<sup>asws</sup> said: ‘For him is a third of his wealth, and for the woman as well’."
          ],
          "en.sarwar": [
            "3. A number of our people have narrated from Ahmad ibn Muhammad from al-Husayn ibn Sa‘id from Hammad ibn ‘Isa from Shu’ayb from Ya’qub who has narrated the following: “I once asked abu ‘Abd Allah, ‘Alayhi al-Salam, about the case of a man who dies and about what is for him from his legacy. He (the Imam) said, ‘One third of his legacy is for him and this applies to a woman also.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن كالصحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (3/20)"
        ],
        "index": 12998,
        "local_index": 4,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:6:4",
        "text": [
          "عِدَّةٌ مِنْ أَصْحَابِنَا عَنْ سَهْلِ بْنِ زِيَادٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنِ ابْنِ أَبِي نَجْرَانَ عَنْ عَاصِمِ بْنِ حُمَيْدٍ عَنْ مُحَمَّدِ بْنِ قَيْسٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ كَانَ أَمِيرُ الْمُؤْمِنِينَ صَلَوَاتُ اللَّهِ عَلَيْهِ يَقُولُ لَأَنْ أُوصِيَ بِخُمُسِ مَالِي أَحَبُّ إِلَيَّ مِنْ أَنْ أُوصِيَ بِالرُّبُعِ وَ لَأَنْ أُوصِيَ بِالرُّبُعِ أَحَبُّ إِلَيَّ مِنْ أَنْ أُوصِيَ بِالثُّلُثِ وَ مَنْ أَوْصَى بِالثُّلُثِ فَلَمْ يَتَّرِكْ فَقَدْ بَالَغَ ",
          "قَالَ وَ قَضَى أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) فِي رَجُلٍ تُوُفِّيَ وَ أَوْصَى بِمَالِهِ كُلِّهِ أَوْ أَكْثَرِهِ فَقَالَ إِنَّ الْوَصِيَّةَ تُرَدُّ إِلَى الْمَعْرُوفِ غَيْرِ الْمُنْكَرِ فَمَنْ ظَلَمَ نَفْسَهُ وَ أَتَى فِي وَصِيَّتِهِ الْمُنْكَرَ وَ الْحَيْفَ فَإِنَّهَا تُرَدُّ إِلَى الْمَعْرُوفِ وَ يُتْرَكُ لِأَهْلِ الْمِيرَاثِ مِيرَاثُهُمْ ",
          "وَ قَالَ مَنْ أَوْصَى بِثُلُثِ مَالِهِ فَلَمْ يَتَّرِكْ وَ قَدْ بَلَغَ الْمَدَى ",
          "ثُمَّ قَالَ لَأَنْ أُوصِيَ بِخُمُسِ مَالِي أَحَبُّ إِلَيَّ مِنْ أَنْ أُوصِيَ بِالرُّبُعِ ."
        ],
        "translations": {
          "en.hubeali": [
            "A number of our companions, from Sahl Bin Ziyad, and Ali Bin Ibrahim, from his father, both together from Ibn Abu Umeyr, from Aasim Bin Hameed, from Muhammad Bin Qays, ",
            "Abu Ja’far<sup>asws</sup> says that Amir Al-Momineen<sup>asws</sup> was saying: ‘If I<sup>asws</sup> were to bequeath with a fifth of my<sup>asws</sup> wealth, it would be more beloved to me<sup>asws</sup> than if I<sup>asws</sup> were to bequeath with a quarter of it; and if I<sup>asws</sup> were to bequeath with a quarter, it would be more beloved to me<sup>asws</sup> than if I<sup>asws</sup> were to bequeath with a third; and if one were to bequeath with a third, so he has not left out anything, so he has reached (the upper limit)’. ",
            "He<sup>asws</sup> said: ‘And Amir Al-Momineen<sup>asws</sup> judged with regards to a man who died and bequeathed with his wealth, all of it or most of it. So he<sup>asws</sup> said: ‘The bequest is to be returned to from unacceptable level to what is acceptable, other than what will harm (heir) (undefined). So the one who is unjust to himself, and made a will which is harmful and the injustice, so it should be returned to the specified once (one fifth), and there should be left for the people of the inheritance, their inheritances’. ",
            "And he<sup>asws</sup> said: ‘The one who bequeaths with a third of his wealth, so he does not leave out anything, so he has reached the (upper) limit’. ",
            "Then he<sup>asws</sup> said: ‘If I<sup>asws</sup> were to bequeath with a fifth of my<sup>asws</sup> wealth, it would be more beloved to me<sup>asws</sup> than if I<sup>asws</sup> were to bequeath with the fourth’."
          ],
          "en.sarwar": [
            "4. A number of our people have narrated from Sahl ibn Ziyad and Ali ibn Ibrahim has narrated from his father all from ibn abu Najran from ‘Asem ibn Humayd from Muhammad ibn Qays who has narrated the following: “Abu Ja‘far, ‘Alayhi al-Salam, in this statement refers to the words of ’Amir al-Mu’minin. He (the Imam) said, ‘If I make a will about one-fifth of my legacy it is better than making a will about one- fourth of my legacy, and if I make a will about one-fourth of my legacy it is better than a will about one-third of my legacy. One who makes a will about one-third of his legacy and leaves nothing, he has exaggerated.’ “He (the Imam), ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin issued a judgment in the case of a man who had made a will about all of his legacy or most of it. He (the Imam) said, ‘The will is turned from unacceptable status into what is acceptable. If one does injustice to himself and comes up with an unacceptable will and an unjust one, it then is turned to an acceptable one to leave the legacy for the heirs.’ ’Amir al-Mu’minin has said, ‘If one makes a will about one-third of his legacy which does not leave anything for the heirs, he has reached the ultimate condition.’ He (the Imam) then said, ‘If one makes a will about one-fifth of his legacy it is more likable to me than a will about one-fourth.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> صحيح   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/21)"
        ],
        "index": 12999,
        "local_index": 5,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:6:5",
        "text": [
          "الْحُسَيْنُ بْنُ مُحَمَّدٍ عَنْ مُعَلَّى بْنِ مُحَمَّدٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ جَمِيعاً عَنِ الْوَشَّاءِ عَنْ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَوْصَى بِالثُّلُثِ فَقَدْ أَضَرَّ بِالْوَرَثَةِ وَ الْوَصِيَّةُ بِالْخُمُسِ وَ الرُّبُعِ أَفْضَلُ مِنَ الْوَصِيَّةِ بِالثُّلُثِ وَ مَنْ أَوْصَى بِالثُّلُثِ فَلَمْ يَتَّرِكْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Al Husayn Bin Muhammad, from Moala Bin Muhammad, and Muhammad Bin Yahya, from Ahmad Bin Muhammad, both together, from Al Washa, from Hamaad Bin Usman, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘The one who bequeaths with a third, so he has harmed the inheritors, and the bequeathing with a fifth and the fourth is better than the bequeathing with the third; and the one who bequeaths with a third, so he has not left out anything’."
          ],
          "en.sarwar": [
            "5. Al-Husayn ibn Muhammad has narrated from Mu‘alla’ ibn Muhammad and Muhammad ibn Yahya has narrated from Ahmad ibn Muhammad all from al-Washsha’ from Hammad ibn ‘Uthaman who has narrated the following: “Abu ‘ Abd Allah, ‘Alayhi al-Salam, has said, ‘If one makes a will about one-third of his legacy he has harmed the heirs. Making a will about one-fifth or one-fourth of the legacy is better than making a will about one-third. If one makes a will about one-third he has not left anything (for the heirs).’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> حسن   </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/21)"
        ],
        "index": 13000,
        "local_index": 6,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:6:6",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ ابْنِ أَبِي عُمَيْرٍ عَنْ هِشَامِ بْنِ سَالِمٍ وَ حَفْصِ بْنِ الْبَخْتَرِيِّ وَ حَمَّادِ بْنِ عُثْمَانَ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ مَنْ أَوْصَى بِالثُّلُثِ فَلَمْ يَتَّرِكْ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Ibn Abu Umeyr, from Hisham Bin Saalim and Hafs Bin Al Bakhtary, and Hamaad Bin Usman, ",
            "Abu Abdullah<sup>asws</sup> has said: ‘The one who bequeath with a third, so he has not left out anything (for the inheritors)’."
          ],
          "en.sarwar": [
            "6. Ali ibn Ibrahim has narrated from his father from ibn abu ‘Umayr from Hisham ibn Salim and Hafs ibn al-Bakhtariy and Hammad ibn ‘Uthaman who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said, ‘If one makes a will about one-third has not left any legacy.’” "
          ]
        }
      },
      {
        "gradings": [
          "Allamah Baqir al-Majlisi: <span> ضعيف على المشهور    </span> - Mir‘at al ‘Uqul Fi Sharh Akhbar Al al Rasul (23/21)"
        ],
        "index": 13001,
        "local_index": 7,
        "part_type": "Hadith",
        "path": "/books/al-kafi:7:1:6:7",
        "text": [
          "عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ عَنِ النَّوْفَلِيِّ عَنِ السَّكُونِيِّ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ أَمِيرُ الْمُؤْمِنِينَ ( عليه السلام ) مَنْ أَوْصَى بِثُلُثِ مَالِهِ ثُمَّ قُتِلَ خَطَأً فَإِنَّ ثُلُثَ دِيَتِهِ دَاخِلٌ فِي وَصِيَّتِهِ ."
        ],
        "translations": {
          "en.hubeali": [
            "Ali Bin Ibrahim, from his father, from Al Nowfaly, from Al Sakkuny, ",
            "Abu Abdullah<sup>asws</sup> having said: ‘Amir Al-Momineen<sup>asws</sup> said: ‘The one who bequeaths with a third of his wealth, then kills by mistake, so the third included his blood money (compensation) in his bequest’."
          ],
          "en.sarwar": [
            "7. Ali ibn Ibrahim has narrated from his father from al-Nawfaliy from al-Sakuniy who has narrated the following: “Abu ‘Abd Allah, ‘Alayhi al-Salam, has said that ’Amir al-Mu’minin has said, ‘If one makes a will about one-third of his legacy, then is killed by mistake, one-third of the wergild for him becomes part of that which he has willed.’” "
          ]
        }
      }
    ]
  },
  "index": "al-kafi:7:1:6",
  "kind": "verse_list"
}