{"data": {"crumbs": [{"indexed_titles": {"ar": "الكافي", "en": "Al-Kafi"}, "path": "/books/al-kafi", "titles": {"ar": "الكافي", "en": "Al-Kafi"}}, {"indexed_titles": {"en": "Volume 7"}, "path": "/books/al-kafi:7", "titles": {"ar": "الجزء السابع‏", "en": "Volume Seven"}}, {"indexed_titles": {"en": "Book 1"}, "path": "/books/al-kafi:7:1", "titles": {"ar": "كتاب  الْوَصَايَا ", "en": "THE BOOK OF BEQUESTS"}}, {"indexed_titles": {"en": "Chapter 7"}, "path": "/books/al-kafi:7:1:7", "titles": {"ar": "باب", "en": "Chapter 7 – A chapter"}}], "index": 1985, "local_index": 7, "part_type": "Chapter", "path": "/books/al-kafi:7:1:7", "titles": {"ar": "باب", "en": "Chapter 7 – A chapter"}, "verse_count": 1, "verse_start_index": 12990, "verses": [{"index": 12991, "local_index": 1, "part_type": "Hadith", "path": "/books/al-kafi:7:1:7:1", "text": "<span class=\"first-chapter-phrase\"><span class=\"first-in-chapter\">ع</span>َلِيُّ بْنُ إِبْرَاهِيمَ</span> عَنْ أَبِيهِ عَنْ حَمَّادٍ عَنْ حَرِيزٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ فِي رَجُلٍ أَوْصَى بِوَصِيَّةٍ وَ وَرَثَتُهُ شُهُودٌ فَأَجَازُوا ذَلِكَ فَلَمَّا مَاتَ الرَّجُلُ نَقَضُوا الْوَصِيَّةَ هَلْ لَهُمْ أَنْ يَرُدُّوا مَا أَقَرُّوا بِهِ قَالَ لَيْسَ لَهُمْ ذَلِكَ الْوَصِيَّةُ جَائِزَةٌ عَلَيْهِمْ إِذَا أَقَرُّوا بِهَا فِي حَيَاتِهِ .\nأَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ عَبْدِ الْجَبَّارِ عَنْ صَفْوَانَ بْنِ يَحْيَى عَنْ مَنْصُورِ بْنِ حَازِمٍ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) مِثْلَهُ .", "translations": [{"lang": "en", "name": "hubeali", "text": "Ali Bin Ibrahim, from his father, from Hamaad, from Hareyz, from Muhammad Bin Muslim, \nAbu Abdullah<sup>asws</sup> having said regarding a man who bequeathed with a bequest, and his inheritors were witnesses, so they endorsed it. But when the man dies, they invalidated the bequest. Is it for them that they can repudiate what they had agreed with (beforehand)?’ He<sup>asws</sup> said: ‘That is not for them. The bequest is enforceable upon them if they had accepted by it during his (deceased) lifetime’. \nAbu Ali Al Ashary, from Muhammad Bin Abdul Jabbar, from Safwan Bin Yahya, from Mansour Bin Hazim, \n(It has been narrated) from Abu Abdullah<sup>asws</sup>, similar to it’."}]}]}, "index": "al-kafi:7:1:7", "kind": "verse_list"}